{
  "doi": "10.1145/3491102.3502090",
  "title": "AirRes Mask: A Precise and Robust Virtual Reality Breathing Interface Utilizing Breathing Resistance as Output Modality",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Increased levels of interactivity and multi-sensory stimulation have been shown to enhance the immersion of Virtual Reality experiences. We present the AirRes mask that enables users to utilize their breathing for precise natural interactions with the virtual environment without suffering from limitations of the sensing equipment such as motion artifacts. Furthermore, the AirRes mask provides breathing resistance as novel output modality that can be adjusted in real-time by the application. In a user study, we demonstrate the mask’s precision measurements for interaction as well as its ability to use breathing resistance to communicate contextual information such as adverse environmental conditions that affect the user’s virtual avatar. Our results show that the AirRes mask enhances virtual experiences and has the potential to create more immersive scenarios for applications by enforcing the perception of danger or improving situational awareness in training simulations, or for psychotherapy by providing additional physical stimuli.",
  "tags": [
    "Environment",
    "Breathing Interface",
    "Resistance",
    "Natural Interaction",
    "Virtual Reality",
    "Avatar"
  ],
  "authors": [
    {
      "name": "Markus Tatzgern",
      "institution": "Salzburg University of Applied Sciences, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435607558",
      "orcid": "0000-0002-3900-4944"
    },
    {
      "name": "Michael Domhardt",
      "institution": "MultiMediaTechnology, Salzburg University of Applied Sciences, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659196202",
      "orcid": "missing"
    },
    {
      "name": "Martin Wolf",
      "institution": "Salzburg University of Applied Sciences, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236788",
      "orcid": "missing"
    },
    {
      "name": "Michael Cenger",
      "institution": "Salzburg University of Applied Sciences, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234618",
      "orcid": "missing"
    },
    {
      "name": "Gerlinde Emsenhuber",
      "institution": "Salzburg University of Applied Sciences, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659196607",
      "orcid": "0000-0001-7776-586X"
    },
    {
      "name": "Radomir Dinic",
      "institution": "Salzburg University of Applied Sciences, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659197293",
      "orcid": "missing"
    },
    {
      "name": "Nathalie Gerner",
      "institution": "Paracelsus Medical University, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660232938",
      "orcid": "missing"
    },
    {
      "name": "Arnulf Hartl",
      "institution": "Paracelsus Medical University, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238508",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sun Joo Ahn, Joshua Bostick, Elise Ogle, Kristine L Nowak, Kara T McGillicuddy, and Jeremy N Bailenson. 2016. Experiencing nature: Embodying animals in immersive virtual environments increases inclusion of nature in self and involvement with nature. Journal of Computer-Mediated Communication 21, 6 (2016), 399–419. https://doi.org/10.1111/jcc4.12173",
      "doi": "10.1111/jcc4.12173"
    },
    {
      "text": "Dmitry Alexandrovsky, Susanne Putze, Michael Bonfert, Sebastian Höffner, Pitt Michelmann, Dirk Wenig, Rainer Malaka, and Jan David Smeddinck. 2020. Examining Design Choices of Questionnaires in VR User Studies. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–21. https://doi.org/10.1145/3313831.3376260",
      "doi": "10.1145/3313831.3376260"
    },
    {
      "text": "Ferran Argelaguet, Ludovic Hoyet, Michaël Trico, and Anatole Lécuyer. 2016. The role of interaction in virtual embodiment: Effects of the virtual hand representation. Proceedings - IEEE Virtual Reality 2016-July (2016), 3–10. https://doi.org/10.1109/VR.2016.7504682",
      "doi": ""
    },
    {
      "text": "Jorge Arroyo-Palacios and Mel Slater. 2016. Dancing with Physio: A Mobile Game with Physiologically Aware Virtual Humans. IEEE Transactions on Affective Computing 7, 4 (2016), 326–336. https://doi.org/10.1109/TAFFC.2015.2472013",
      "doi": "10.1109/TAFFC.2015.2472013"
    },
    {
      "text": "Peter M. Bingham, Jason H.T. Bates, John Thompson-Figueroa, and Thomas Lahiri. 2010. A breath biofeedback computer game for children with cystic fibrosis. Clinical Pediatrics 49, 4 (2010), 337–342. https://doi.org/10.1177/0009922809348022",
      "doi": ""
    },
    {
      "text": "Stephen P Blackie, Mary Sue Fairbarn, Noel G McElvaney, Pearce G Wilcox, Nancy J Morrison, and Richard L Pardy. 1991. Normal values and ranges for ventilation and breathing pattern at maximal exercise. Chest 100, 1 (1991), 136–142. https://doi.org/10.1378/chest.100.1.136",
      "doi": ""
    },
    {
      "text": "Johannes Blum, Christoph Rockstroh, and Anja S. Göritz. 2020. Development and Pilot Test of a Virtual Reality Respiratory Biofeedback Approach. Applied Psychophysiology Biofeedback 45, 3 (2020), 153–163. https://doi.org/10.1007/s10484-020-09468-x",
      "doi": ""
    },
    {
      "text": "Gunnar Borg. 1998. Borg’s perceived exertion and pain scales. Human kinetics.",
      "doi": ""
    },
    {
      "text": "Cristina Botella, Javier Fernández-Álvarez, Verónica Guillén, Azucena García-Palacios, and Rosa Baños. 2017. Recent Progress in Virtual Reality Exposure Therapy for Phobias: A Systematic Review. Current Psychiatry Reports 2017 19:7 19, 7 (may 2017), 1–13. https://doi.org/10.1007/S11920-017-0788-4",
      "doi": ""
    },
    {
      "text": "Fabio Buttussi and Luca Chittaro. 2018. Effects of Different Types of Virtual Reality Display on Presence and Learning in a Safety Training Scenario. IEEE Transactions on Visualization and Computer Graphics 24, 2(2018), 1063–1076. https://doi.org/10.1109/TVCG.2017.2653117",
      "doi": ""
    },
    {
      "text": "Wei-Hung Chen. 2015. Blowatch: Blowable and Hands-Free Interaction for Smartwatches. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems(Seoul, Republic of Korea) (CHI EA ’15). Association for Computing Machinery, New York, NY, USA, 103–108. https://doi.org/10.1145/2702613.2726961",
      "doi": "10.1145/2702613.2726961"
    },
    {
      "text": "Luca Chittaro and Fabio Buttussi. 2015. Assessing knowledge retention of an immersive serious game vs. A traditional education method in aviation safety. IEEE Transactions on Visualization and Computer Graphics 21, 4(2015), 529–538. https://doi.org/10.1109/TVCG.2015.2391853",
      "doi": "10.1109/TVCG.2015.2391853"
    },
    {
      "text": "James J. Cummings and Jeremy N. Bailenson. 2016. How Immersive Is Enough? A Meta-Analysis of the Effect of Immersive Technology on User Presence. Media Psychology 19, 2 (2016), 272–309. https://doi.org/10.1080/15213269.2015.1015740",
      "doi": ""
    },
    {
      "text": "Esko O. Dijk and Alina Weffers. 2010. Breathe with the Ocean: a System for Relaxation using Audio, Haptic and Visual Stimuli. In Proceedings of the Eurographics Special Symposium: Haptic and Audio-Visual Stimuli: Enhancing Experiences and Interaction. 47—-60.",
      "doi": ""
    },
    {
      "text": "Huong Q. Dinh, Neff Walker, Larry F. Hodges, Chang Song, and Akira Kobayashi. 1999. Evaluating the importance of multi-sensory input on memory and the sense of presence in virtual environments. In Proceedings - Virtual Reality Annual International Symposium. IEEE, 222–228. https://doi.org/10.1109/vr.1999.756955",
      "doi": ""
    },
    {
      "text": "Jérémy Frey, May Grabli, Ronit Slyper, and Jessica R. Cauchard. 2018. Breeze: Sharing Biofeedback through Wearable Technologies. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174219",
      "doi": "10.1145/3173574.3174219"
    },
    {
      "text": "Catherine O. Fritz, Peter E. Morris, and Jennifer J. Richler. 2012. Effect size estimates: Current use, calculations, and interpretation. Journal of Experimental Psychology: General 141, 1 (2012), 2–18. https://doi.org/10.1037/a0024338",
      "doi": ""
    },
    {
      "text": "Gabriel Giraldo, Myriam Servières, and Guillaume Moreau. 2020. Perception of Multisensory Wind Representation in Virtual Reality. In 2020 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 45–53. https://doi.org/10.1109/ISMAR50242.2020.00024",
      "doi": ""
    },
    {
      "text": "Mar Gonzalez-Franco and Tabitha C. Peck. 2018. Avatar embodiment. Towards a standardized questionnaire. Frontiers Robotics AI 5, JUN (2018), 1–9. https://doi.org/10.3389/frobt.2018.00074",
      "doi": ""
    },
    {
      "text": "Jorge Granados, Trevor L Gillum, Weston Castillo, Kevin M Christmas, and Matthew R Kuennen. 2016. “Functional” respiratory muscle training during endurance exercise causes modest hypoxemia but overall is well tolerated. The Journal of Strength & Conditioning Research 30, 3 (2016), 755–762.",
      "doi": ""
    },
    {
      "text": "Ian Gregg and AJ Nunn. 1973. Peak expiratory flow in normal subjects. Br Med J 3, 5874 (1973), 282–284.",
      "doi": ""
    },
    {
      "text": "Raphaela Groten and Mel Slater. 2021. The Sense of Embodiment in Virtual Reality. Presence 21, 4 (2021), 373–387.",
      "doi": ""
    },
    {
      "text": "Jitendra K. Gupta, Chao Hsin Lin, and Qingyan Chen. 2010. Characterizing exhaled airflow from breathing and talking. Indoor Air 20, 1 (2010), 31–39. https://doi.org/10.1111/j.1600-0668.2009.00623.x",
      "doi": ""
    },
    {
      "text": "Yuki Hashimoto, Masahiko Inami, and Hiroyuki Kajimoto. 2008. Straw-Like User Interface (II): A New Method of Presenting Auditory Sensations for a More Natural Experience. In Haptics: Perception, Devices and Scenarios, Manuel Ferre (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 484–493. https://doi.org/10.1007/978-3-540-69057-3_62",
      "doi": ""
    },
    {
      "text": "Carrie Heeter. 1992. Being There: The Subjective Experience of Presence. Presence: Teleoperators and Virtual Environments 1, 2(1992), 262–271. https://doi.org/10.1162/pres.1992.1.2.262",
      "doi": "10.5555/196564.196589"
    },
    {
      "text": "Kristina Höök, Martin P. Jonsson, Anna Ståhl, and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16. Association for Computing Machinery, New York, NY, USA, 3131–3142. https://doi.org/10.1145/2858036.2858583",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Matthias Hoppe, Pascal Knierim, Thomas Kosch, Markus Funk, Lauren Futami, Stefan Schneegass, Niels Henze, Albrecht Schmidt, and Tonja Machulla. 2018. VRHapticDrones: Providing haptics in virtual reality through quadcopters. In ACM International Conference Proceeding Series. Association for Computing Machinery, New York, NY, USA, 7–18. https://doi.org/10.1145/3282894.3282898",
      "doi": "10.1145/3282894.3282898"
    },
    {
      "text": "Masahiro Inazawa, Xianyin Hu, and Yuki Ban. 2019. Biofeedback Interactive VR System Using Biological Information Measurement HMD. In SIGGRAPH Asia 2019 Emerging Technologies (Brisbane, QLD, Australia) (SA ’19). Association for Computing Machinery, New York, NY, USA, 5–6. https://doi.org/10.1145/3355049.3360523",
      "doi": ""
    },
    {
      "text": "Dhruv Jain, Sra Misha, Jingru Guo, Rodrigo Marques, Raymond Wu, Justin Chiu, and Chris Schmandt. 2016. Immersive terrestrial SCUBA diving using virtual reality. Conference on Human Factors in Computing Systems - Proceedings 07-12-May- (2016), 1563–1569. https://doi.org/10.1145/2851581.2892503",
      "doi": "10.1145/2851581.2892503"
    },
    {
      "text": "David Antonio Gomez Jauregui, Ferran Argelaguet, Anne Helene Olivier, Maud Marchal, Franck Multon, and Anatole Lecuyer. 2014. Toward ’Pseudo-haptic avatars’: Modifying the visual animation of self-avatar can simulate the perception of weight lifting. IEEE Transactions on Visualization and Computer Graphics 20, 4(2014), 654–661. https://doi.org/10.1109/TVCG.2014.45",
      "doi": "10.1109/TVCG.2014.45"
    },
    {
      "text": "Annkatrin Jung, Miquel Alfaras, Pavel Karpashevich, William Primett, and Kristina Höök. 2021. Exploring Awareness of Breathing through Deep Touch Pressure. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 263, 15 pages. https://doi.org/10.1145/3411764.3445533",
      "doi": "10.1145/3411764.3445533"
    },
    {
      "text": "Konstantina Kilteni, Ilias Bergstrom, and Mel Slater. 2013. Drumming in Immersive Virtual Reality : The Body Shapes the Way We Play. Transactions on Visualisation and Computer Graphics 19, 4 (2013), 597–605. https://doi.org/10.1109/VR.2013.6549442",
      "doi": "10.5555/2478535.2478597"
    },
    {
      "text": "Luv Kohli, Mary C Whitton, and Frederick P Brooks. 2012. Redirected touching: The effect of warping space on task performance. In 2012 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 105–112. https://doi.org/10.1109/3DUI.2012.6184193",
      "doi": ""
    },
    {
      "text": "Martijn J.L. Kors, Gabriele Ferri, Erik D. van der Spek, Cas Ketel, and Ben A.M. Schouten. 2016. A Breathtaking Journey. On the Design of an Empathy-Arousing Mixed-Reality Game. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play - CHI PLAY ’16. Association for Computing Machinery, New York, NY, USA, 91–104. https://doi.org/10.1145/2967934.2968110",
      "doi": "10.1145/2967934.2968110"
    },
    {
      "text": "Andrey Krekhov, Sebastian Cmentowski, Katharina Emmerich, and Jens Krüger. 2019. Beyond Human: Animals as an Escape from Stereotype Avatars in Virtual Reality Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Barcelona, Spain) (CHI PLAY ’19). ACM, New York, NY, USA, 439–451. https://doi.org/10.1145/3311350.3347172",
      "doi": "10.1145/3311350.3347172"
    },
    {
      "text": "Kai Kuikkaniemi, Toni Laitinen, Marko Turpeinen, Timo Saari, Ilkka Kosunen, and Niklas Ravaja. 2010. The influence of implicit and explicit biofeedback in first-person shooter games. In Conference on Human Factors in Computing Systems - Proceedings, Vol. 2. Association for Computing Machinery, New York, NY, USA, 859–868. https://doi.org/10.1145/1753326.1753453",
      "doi": "10.1145/1753326.1753453"
    },
    {
      "text": "Takahiro Kusabuka and Takuya Indo. 2020. IBUKI: Gesture Input Method Based on Breathing. In UIST 2020 - Adjunct Publication of the 33rd Annual ACM Symposium on User Interface Software and Technology, Vol. 1. Association for Computing Machinery, New York, NY, USA, 102–104. https://doi.org/10.1145/3379350.3416134",
      "doi": ""
    },
    {
      "text": "Lara Maister, Mel Slater, Maria V Sanchez-Vives, and Manos Tsakiris. 2015. Changing bodies changes minds: owning another body affects social cognition. Trends in cognitive sciences 19, 1 (2015), 6–12. https://doi.org/10.1016/j.tics.2014.11.001",
      "doi": ""
    },
    {
      "text": "Joe Marshall, Duncan Rowland, Stefan Rennick Egglestone, Steve Benford, Brendan Walker, and Derek McAuley. 2011. Breath Control of Amusement Rides. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). ACM, New York, NY, USA, 73–82. https://doi.org/10.1145/1978942.1978955",
      "doi": "10.1145/1978942.1978955"
    },
    {
      "text": "Daniel Martin, Sandra Malpica, Diego Gutierrez, Belen Masia, and Ana Serrano. 2021. Multimodality in VR: A survey. Comput. Surveys 1, 1 (2021), 1–35. arxiv:2101.07906http://arxiv.org/abs/2101.07906",
      "doi": ""
    },
    {
      "text": "Antonella Maselli and Mel Slater. 2013. The building blocks of the full body ownership illusion. Frontiers in Human Neuroscience 7, March (2013), 1–15. https://doi.org/10.3389/fnhum.2013.00083",
      "doi": ""
    },
    {
      "text": "Stuart Moran, Nils Jäger, Holger Schnädelbach, and Kevin Glover. 2016. ExoPranayama: a biofeedback-driven actuated environment for supporting yoga breathing practices. Personal and Ubiquitous Computing 20, 2 (2016), 261–275. https://doi.org/10.1007/s00779-016-0910-3",
      "doi": "10.1007/s00779-016-0910-3"
    },
    {
      "text": "Neema Moraveji, Olson Ben, Truc Nguyen, Mahmoud Saadat, Yaser Khalighi, Roy Pea, and Jeffrey Heer. 2011. Peripheral paced respiration: Influencing user physiology during information work. In UIST’11 - Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology. Association for Computing Machinery, New York, NY, USA, 423–427. https://doi.org/10.1145/2047196.2047250",
      "doi": "10.1145/2047196.2047250"
    },
    {
      "text": "Lennart E. Nacke, Michael Kalyn, Calvin Lough, and Regan L. Mandryk. 2011. Biofeedback game design: Using direct and indirect physiological control to enhance game interaction. In Conference on Human Factors in Computing Systems - Proceedings. Association for Computing Machinery, New York, NY, USA, 103–112. https://doi.org/10.1145/1978942.1978958",
      "doi": "10.1145/1978942.1978958"
    },
    {
      "text": "Fred G. Paas. 1992. Training strategies for attaining transfer of problem solving skills in statistics : a cognitive-load approach. Journal of Educational Psychology 84, 4 (1992), 429–434. https://doi.org/10.1037/0022-0663.84.4.429",
      "doi": ""
    },
    {
      "text": "Shwetak N. Patel and Gregory D. Abowd. 2007. Blui: Low-cost localized blowable user interfaces. In UIST: Proceedings of the Annual ACM Symposium on User Interface Softaware and Technology. Association for Computing Machinery, New York, NY, USA, 217–220. https://doi.org/10.1145/1294211.1294250",
      "doi": ""
    },
    {
      "text": "Rakesh Patibanda, Florian ’Floyd’ Mueller, Matevz Leskovsek, and Jonathan Duckworth. 2017. Life Tree: Understanding the Design of Breathing Exercise Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Amsterdam, The Netherlands) (CHI PLAY ’17). Association for Computing Machinery, New York, NY, USA, 19–31. https://doi.org/10.1145/3116595.3116621",
      "doi": "10.1145/3116595.3116621"
    },
    {
      "text": "Tabitha C. Peck and Mar Gonzalez-Franco. 2021. Avatar Embodiment. A Standardized Questionnaire. Frontiers in Virtual Reality 1, February (2021), 1–12. https://doi.org/10.3389/frvir.2020.575943",
      "doi": ""
    },
    {
      "text": "Polona Pozeg, Giulia Galli, and Olaf Blanke. 2015. Those are your legs: The effect of visuo-spatial viewpoint on visuo-tactile integration and body ownership. Frontiers in Psychology 6, NOV (2015), 1–14. https://doi.org/10.3389/fpsyg.2015.01749",
      "doi": ""
    },
    {
      "text": "Mirjana Prpa, Ekaterina R. Stepanova, Thecla Schiphorst, Bernhard E. Riecke, and Philippe Pasquier. 2020. Inhaling and Exhaling: How Technologies Can Perceptually Extend Our Breath Awareness. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376183",
      "doi": "10.1145/3313831.3376183"
    },
    {
      "text": "Susanne Putze, Dmitry Alexandrovsky, Felix Putze, Sebastian Höffner, Jan David Smeddinck, and Rainer Malaka. 2020. Breaking The Experience: Effects of Questionnaires in VR User Studies. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376144",
      "doi": "10.1145/3313831.3376144"
    },
    {
      "text": "Yongqiang Qin, Chris Vincent, Nadia Bianchi-Berthouze, and Yuanchun Shi. 2014. AirFlow: Designing immersive breathing training games for COPD. In Conference on Human Factors in Computing Systems - Extended Abstract. Association for Computing Machinery, New York, NY, USA, 2419–2424. https://doi.org/10.1145/2559206.2581309",
      "doi": "10.1145/2559206.2581309"
    },
    {
      "text": "Nimesha Ranasinghe, Pravar Jain, Shienny Karwita, David Tolley, and Ellen Yi-Luen Do. 2017. Ambiotherm: Enhancing Sense of Presence in Virtual Reality by Simulating Real-World Environmental Conditions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI ’17. ACM Press, New York, New York, USA, 1731–1742. https://doi.org/10.1145/3025453.3025723",
      "doi": "10.1145/3025453.3025723"
    },
    {
      "text": "Nimesha Ranasinghe, Pravar Jain, Nguyen Thi Ngoc Tram, Koon Chuan Raymond Koh, David Tolley, Shienny Karwita, Lin Lien-Ya, Yan Liangkun, Kala Shamaiah, Chow Eason Wai Tung, Ching Chiuan Yen, and Ellen Yi-Luen Do. 2018. Season Traveller: Multisensory Narration for Enhancing the Virtual Reality Experience. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174151",
      "doi": "10.1145/3173574.3174151"
    },
    {
      "text": "Gabriel Reyes, Dingtian Zhang, Sarthak Ghosh, Pratik Shah, Jason Wu, Aman Parnami, Bailey Bercik, Thad Starner, Gregory D. Abowd, and W. Keith Edwards. 2016. Whoosh: Non-Voice Acoustics for Low-Cost, Hands-Free, and Rapid Input on Smartwatches. In Proceedings of the 2016 ACM International Symposium on Wearable Computers (Heidelberg, Germany) (ISWC ’16). Association for Computing Machinery, New York, NY, USA, 120–127. https://doi.org/10.1145/2971763.2971765",
      "doi": "10.1145/2971763.2971765"
    },
    {
      "text": "Albert Rizzo, Greg Reger, Greg Gahm, JoAnn Difede, and Barbara O. Rothbaum. 2009. Virtual Reality Exposure Therapy for Combat-Related PTSD. Humana Press, Totowa, NJ, 375–399. https://doi.org/10.1007/978-1-60327-329-9_18",
      "doi": ""
    },
    {
      "text": "Raquel Robinson, Katelyn Wiley, Amir Rezaeivahdati, Madison Klarkowski, and Regan L. Mandryk. 2020. ”Let’s Get Physiological, Physiological!”: A Systematic Review of Affective Gaming. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Virtual Event, Canada) (CHI PLAY ’20). Association for Computing Machinery, New York, NY, USA, 132–147. https://doi.org/10.1145/3410404.3414227",
      "doi": "10.1145/3410404.3414227"
    },
    {
      "text": "Christoph Rockstroh, Johannes Blum, and Anja S. Göritz. 2021. A mobile VR-based respiratory biofeedback game to foster diaphragmatic breathing. Virtual Reality 25, 2 (2021), 539–552. https://doi.org/10.1007/s10055-020-00471-5",
      "doi": "10.1007/s10055-020-00471-5"
    },
    {
      "text": "Joan Sol Roo, Renaud Gervais, Jeremy Frey, and Martin Hachet. 2017. Inner Garden: Connecting Inner States to a Mixed Reality Sandbox for Mindfulness. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1459–1470. https://doi.org/10.1145/3025453.3025743",
      "doi": "10.1145/3025453.3025743"
    },
    {
      "text": "Majed Samad, Elia Gatti, Anne Hermes, Hrvoje Benko, and Cesare Parise. 2019. Pseudo-Haptic Weight: Changing the Perceived Weight of Virtual Objects By Manipulating Control-Display Ratio. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300550",
      "doi": "10.1145/3290605.3300550"
    },
    {
      "text": "Erika Sawada, Shinya Ida, Tatsuhito Awaji, Keisuke Morishita, Tomohisa Aruga, Ryuta Takeichi, Tomoko Fujii, Hidetoshi Kimura, Toshinari Nakamura, Masahiro Furukawa, Noriyoshi Shimizu, Takuji Tokiwa, Hideaki Nii, Maki Sugimoto, and Masahiko Inami. 2007. BYU-BYU-View: A Wind Communication Interface. In ACM SIGGRAPH 2007 Emerging Technologies (San Diego, California) (SIGGRAPH ’07). Association for Computing Machinery, New York, NY, USA, 1–es. https://doi.org/10.1145/1278280.1278282",
      "doi": ""
    },
    {
      "text": "Holger Schnädelbach, Kevin Glover, and Ainojie Alexander Irune. 2010. ExoBuilding: Breathing Life into Architecture. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (Reykjavik, Iceland) (NordiCHI ’10). Association for Computing Machinery, New York, NY, USA, 442–451. https://doi.org/10.1145/1868914.1868965",
      "doi": "10.1145/1868914.1868965"
    },
    {
      "text": "Holger Schnädelbach, Ainojie Irune, David Kirk, Kevin Glover, and Patrick Brundell. 2012. ExoBuilding: Physiologically driven adaptive architecture. ACM Transactions on Computer-Human Interaction 19, 4(2012), 22 pages. https://doi.org/10.1145/2395131.2395132",
      "doi": "10.1145/2395131.2395132"
    },
    {
      "text": "Thomas Schubert, Frank Friedmann, and Holger Regenbrecht. 2001. The Experience of Presence: Factor Analytic Insights. Presence 10, 3 (2001), 266–281. https://doi.org/10.1162/105474601300343603",
      "doi": "10.1162/105474601300343603"
    },
    {
      "text": "Valentin Schwind, Pascal Knierim, Nico Haas, and Niels Henze. 2019. Using Presence Questionnaires in Virtual Reality. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300590",
      "doi": ""
    },
    {
      "text": "Heikki Sjöman, Nazare Soares, Martinus Suijkerbuijk, Jørgen Blindheim, Martin Steinert, and Dag T. Wisland. 2018. The Breathing Room: Breathing Interval and Heart Rate Capturing through Ultra Low Power Radar. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3170427.3186473",
      "doi": "10.1145/3170427.3186473"
    },
    {
      "text": "Tobias Sonne and Mads Møller Jensen. 2016. ChillFish: A Respiration Game for Children with ADHD. In Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction(Eindhoven, Netherlands) (TEI ’16). Association for Computing Machinery, New York, NY, USA, 271–278. https://doi.org/10.1145/2839462.2839480",
      "doi": "10.1145/2839462.2839480"
    },
    {
      "text": "Tobias Sonne and Mads Møller Jensen. 2016. Evaluating the ChillFish Biofeedback Game with Children with ADHD. In IDC. ACM Press, New York, New York, USA, 271–278. https://doi.org/10.1145/2839462.2839480",
      "doi": ""
    },
    {
      "text": "Misha Sra, Xuhai Xu, and Pattie Maes. 2018. BreathVR: Leveraging Breathing as a Directly Controlled Interface for Virtual Reality Games. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173914",
      "doi": "10.1145/3173574.3173914"
    },
    {
      "text": "Ekaterina R. Stepanova, John Desnoyers-Stewart, Philippe Pasquier, and Bernhard E. Riecke. 2020. JeL: Breathing Together to Connect with Others and Nature. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 641–654. https://doi.org/10.1145/3357236.3395532",
      "doi": "10.1145/3357236.3395532"
    },
    {
      "text": "William Steptoe, Anthony Steed, and Mel Slater. 2013. Human tails: Ownership and control of extended humanoid avatars. IEEE Transactions on Visualization and Computer Graphics 19, 4(2013), 583–590. https://doi.org/10.1109/TVCG.2013.32",
      "doi": "10.5555/2478535.2478595"
    },
    {
      "text": "Aaron Tabor, Scott Bateman, Erik Scheme, Book Sadprasid, and m.c. schraefel. 2021. Understanding the Design and Effectiveness of Peripheral Breathing Guide Use During Information Work. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 516, 13 pages. https://doi.org/10.1145/3411764.3445388",
      "doi": "10.1145/3411764.3445388"
    },
    {
      "text": "Paul Tennent, Duncan Rowland, Joe Marshall, Stefan Rennick Egglestone, Alexander Harrison, Zachary Jaime, Brendan Walker, and Steve Benford. 2011. Breathalising Games: Understanding the Potential of Breath Control in Game Interfaces. In Proceedings of the 8th International Conference on Advances in Computer Entertainment Technology (Lisbon, Portugal) (ACE ’11). Association for Computing Machinery, New York, NY, USA, Article 58, 8 pages. https://doi.org/10.1145/2071423.2071496",
      "doi": "10.1145/2071423.2071496"
    },
    {
      "text": "Marieke van Rooij, Adam Lobel, Owen Harris, Niki Smit, and Isabela Granic. 2016. DEEP: A Biofeedback Virtual Reality Game for Children At-Risk for Anxiety. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 1989–1997. https://doi.org/10.1145/2851581.2892452",
      "doi": "10.1145/2851581.2892452"
    },
    {
      "text": "Jay Vidyarthi, Bernhard E. Riecke, and Diane Gromala. 2012. Sonic Cradle: Designing for an Immersive Experience of Meditation by Connecting Respiration to Music. In Proceedings of the Designing Interactive Systems Conference (Newcastle Upon Tyne, United Kingdom) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 408–417. https://doi.org/10.1145/2317956.2318017",
      "doi": "10.1145/2317956.2318017"
    },
    {
      "text": "Thomas Waltemate, Dominik Gall, Daniel Roth, Mario Botsch, and Marc Erich Latoschik. 2018. The impact of avatar personalization and immersion on virtual body ownership, presence, and emotional response. IEEE Transactions on Visualization and Computer Graphics 24, 4(2018), 1643–1652. https://doi.org/10.1109/TVCG.2018.2794629",
      "doi": "10.1109/TVCG.2018.2794629"
    },
    {
      "text": "Joanneke Weerdmeester, Marieke van Rooij, Owen Harris, Niki Smit, Rutger C.M.E Engels, and Isabela Granic. 2017. Exploring the Role of Self-Efficacy in Biofeedback Video Games. In Extended Abstracts Publication of the Annual Symposium on Computer-Human Interaction in Play (Amsterdam, The Netherlands) (CHI PLAY ’17 Extended Abstracts). Association for Computing Machinery, New York, NY, USA, 453–461. https://doi.org/10.1145/3130859.3131299",
      "doi": ""
    },
    {
      "text": "M Abdullah Zafar, Beena Ahmed, Rami Al Rihawi, and Ricardo Gutierrez-Osuna. 2018. Gaming away stress: Using biofeedback games to learn paced breathing. Transactions on Affective Computing 11, 3 (2018), 519–531. https://doi.org/10.1109/TAFFC.2018.2816945",
      "doi": ""
    },
    {
      "text": "Daniel Zielasko, Neha Neha, Benjamin Weyers, and Torsten W. Kuhlen. 2017. BlowClick 2.0: A trigger based on non-verbal vocal input. In Proceedings - IEEE Virtual Reality. IEEE, 319–320. https://doi.org/10.1109/VR.2017.7892305",
      "doi": ""
    },
    {
      "text": "Daniel Zielasko, Neha Neha, Benjamin Weyers, and Torsten W. Kuhlen. 2017. Blowclick: A reliable non-verbal vocal input metaphor for clicking. In 2017 IEEE Symposium on 3D User Interfaces, 3DUI 2017 - Proceedings. IEEE, 40–49. https://doi.org/10.1109/3DUI.2017.7893316",
      "doi": ""
    }
  ]
}