{
  "doi": "10.1145/3491102.3517631",
  "title": "Investigating and Validating On-body Temperature Sensors for Personal Heat Exposure Tracking.",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "Individuals and communities around the world are increasingly exposed to extreme heat as a result of climate change. Urban residents are particularly vulnerable to extreme heat due to the urban heat island effect. However, understanding an individual’s heat exposure and risk is difficult to assess due to variations in temperature within an urban environment. In this paper, we examine the potential for wearable temperature sensors to accurately measure personal heat exposure. We synthesize literature from fields spanning urban planning to public health and present the results of a user study validating a set of four commonly used off-the-shelf temperature sensors in two different urban settings across five on-body locations. Our investigation found that wearable temperature sensors are less reliable in highly urban areas and when worn in direct sunlight. We discuss important design considerations for wearable temperature sensors and identify actionable ways to improve future studies.",
  "tags": [
    "wearable sensors",
    "personal heat exposures",
    "urban heat island",
    "extreme heat"
  ],
  "authors": [
    {
      "name": "Dana Habeeb",
      "institution": "School of Informatics, Computing, & Engineering, Indiana University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240398",
      "orcid": "missing"
    },
    {
      "name": "James Clawson",
      "institution": "School of Informatics, Computing, and Engineering, Indiana University Bloomington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659675313",
      "orcid": "missing"
    },
    {
      "name": "Arash Zakeresfahani",
      "institution": "School of Informatics, Computing, & Engineering, Indiana University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238871",
      "orcid": "missing"
    },
    {
      "name": "Zebulon Holtz",
      "institution": "School of Informatics, Computing, & Engineering, Indiana University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238912",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "G Brooke Anderson and Michelle L Bell. 2012. Lights out: impact of the August 2003 power outage on mortality in New York, NY. Epidemiology (Cambridge, Mass.) 23, 2 (2012), 189.",
      "doi": ""
    },
    {
      "text": "Edward Arens and H Zhang. 2004. The Skin’s Role in Human Thermoregulation and Comfort.In Thermal and Moisture Transport in Fibrous Materials, N. Pan and P. Gibson (Eds.). Woodhead Publishing Ltd, Cambridge, UK, 560 – 602.",
      "doi": ""
    },
    {
      "text": "A John Arnfield. 2003. Two decades of urban climate research: a review of turbulence, exchanges of energy and water, and the urban heat island. International journal of climatology 23, 1 (2003), 1–26.",
      "doi": ""
    },
    {
      "text": "Louis Atallah, Benny Lo, Rachel King, and Guang-Zhong Yang. 2011. Sensor positioning for activity recognition using wearable accelerometers. IEEE Transactions on Biomedical Circuits and Systems 5, 4 (2011), 320–329.",
      "doi": ""
    },
    {
      "text": "Elizabeth Bailey, Christopher Fuhrmann, Jennifer Runkle, Scott Stevens, Michael Brown, and Margaret Sugg. 2020. Wearable sensors for personal temperature exposure assessments: A comparative study. Environmental research 180 (2020), 108858.",
      "doi": ""
    },
    {
      "text": "Elizabeth F Bailey. 2019. Wearable Sensor for Personal Temperature Exposure Assessments: A Comparative Study. Ph.D. Dissertation. Appalachian State University.",
      "doi": ""
    },
    {
      "text": "Rupa Basu and Jonathan M Samet. 2002. An exposure assessment study of ambient heat exposure in an elderly population in Baltimore, Maryland.Environmental health perspectives 110, 12 (2002), 1219–1224.",
      "doi": ""
    },
    {
      "text": "Francisco Benita and Bige Tunçer. 2019. Exploring the effect of urban features and immediate environment on body responses. Urban Forestry & Urban Greening 43 (2019), 126365.",
      "doi": ""
    },
    {
      "text": "Paul Berdahl and Sarah E Bretz. 1997. Preliminary survey of the solar reflectance of cool roofing materials. Energy and Buildings 25, 2 (1997), 149–158.",
      "doi": ""
    },
    {
      "text": "Molly C Bernhard, Shia T Kent, Meagan E Sloan, Mary B Evans, Leslie A McClure, and Julia M Gohlke. 2015. Measuring personal heat exposure in an urban and rural environment. Environmental research 137 (2015), 410–418.",
      "doi": ""
    },
    {
      "text": "Miriam M Calkins. 2018. Occupational heat exposure and injury risk in Washington State construction workers. Ph.D. Dissertation. University of Washington.",
      "doi": ""
    },
    {
      "text": "CDC. 2004. Extreme heat: a prevention guide to promote your personal health and safety. Centers for Disease Control and Prevention Website.",
      "doi": ""
    },
    {
      "text": "CDC. 2006. Heat-Related Deaths–United States, 1999-2003. MMWR: Morbidity and mortality weekly report 55, 29 (2006), 796–798.",
      "doi": ""
    },
    {
      "text": "Anne HY Chu, Sheryl HX Ng, Mahsa Paknezhad, Alvaro Gauterin, David Koh, Michael S Brown, and Falk Müller-Riemenschneider. 2017. Comparison of wrist-worn Fitbit Flex and waist-worn ActiGraph for measuring steps in free-living adults. PLoS One 12, 2 (2017), e0172535.",
      "doi": ""
    },
    {
      "text": "Peter J Colvonen. 2021. Response To: Investigating sources of inaccuracy in wearable optical heart rate sensors. NPJ Digital Medicine 4, 1 (2021), 1–2.",
      "doi": ""
    },
    {
      "text": "Susanna Conti, Paola Meli, Giada Minelli, Renata Solimini, Virgilia Toccaceli, Monica Vichi, Carmen Beltrano, and Luigi Perini. 2005. Epidemiologic study of mortality during the Summer 2003 heat wave in Italy. Environmental research 98, 3 (2005), 390–399.",
      "doi": ""
    },
    {
      "text": "Allison Crimmins, J Balbus, JL Gamble, CB Beard, JE Bell, D Dodgen, RJ Eisen, N Fann, MD Hawkins, SC Herring, L Jantarasami, D.M Mills, S Saha, M.C. Sarofim, J Trtanj, and L Ziska (Eds.). 2016. The Impacts of Climate Change on Human Health in the United States: A Scientific Assessment. U.S. Global Change Research Program, Washington, DC, USA. http://dx.doi.org/10.7930/J0R49NQX",
      "doi": ""
    },
    {
      "text": "JS Dumas, MA Jagger, and KW Kintziger. 2016. Where to wear ibuttons: Individual level temperature and humidity observations for public health surveillance. presented at American Meteorological Society Annual Meeting. https://ams.confex.com/ ams/96Annual/webprogram/Paper280434.html",
      "doi": ""
    },
    {
      "text": "Fatema El-Amrawy and Mohamed Ismail Nounou. 2015. Are currently available wearable devices for activity tracking and heart rate monitoring accurate, precise, and medically beneficial?Healthcare informatics research 21, 4 (2015), 315–320.",
      "doi": ""
    },
    {
      "text": "Bennett A Fallow, Takashi Tarumi, and Hirofumi Tanaka. 2013. Influence of skin type and wavelength on light wave reflectance. Journal of clinical monitoring and computing 27, 3 (2013), 313–317.",
      "doi": ""
    },
    {
      "text": "Katrin Hänsel, Romina Poguntke, Hamed Haddadi, Akram Alomainy, and Albrecht Schmidt. 2018. What to Put on the User: Sensing Technologies for Studies and Physiology Aware Systems. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173719",
      "doi": ""
    },
    {
      "text": "Katharine Hayhoe, Scott Sheridan, Laurence Kalkstein, and Scott Greene. 2010. Climate change, heat waves, and mortality projections for Chicago. Journal of Great Lakes Research 36 (2010), 65–73.",
      "doi": ""
    },
    {
      "text": "Daniel Holliday, Stephanie Wilson, and Simone Stumpf. 2016. User Trust in Intelligent Systems: A Journey Over Time. In Proceedings of the 21st International Conference on Intelligent User Interfaces (Sonoma, California, USA) (IUI ’16). Association for Computing Machinery, New York, NY, USA, 164–168. https://doi.org/10.1145/2856767.2856811",
      "doi": "10.1145/2856767.2856811"
    },
    {
      "text": "Jason Hubbart, Timothy Link, Colin Campbell, and Doug Cobos. 2005. Evaluation of a low-cost temperature measurement system for environmental applications. Hydrological Processes: An International Journal 19, 7 (2005), 1517–1523.",
      "doi": ""
    },
    {
      "text": "Jason A Hubbart. 2011. An inexpensive alternative solar radiation shield for ambient air temperature and relative humidity micro-sensors. Journal of Natural and Environmental Sciences 2, 2 (2011), 9–14.",
      "doi": ""
    },
    {
      "text": "Anthony E Iyoho, Laurel J Ng, and Lisa MacFadden. 2017. Modeling of gender differences in thermoregulation. Military medicine 182, suppl_1 (2017), 295–303.",
      "doi": ""
    },
    {
      "text": "Hanna Kaciuba-Uscilko and Ryszard Grucza. 2001. Gender differences in thermoregulation. Current Opinion in Clinical Nutrition & Metabolic Care 4, 6(2001), 533–536.",
      "doi": ""
    },
    {
      "text": "Laurence S Kalkstein and Robert E Davis. 1989. Weather and human mortality: an evaluation of demographic and interregional responses in the United States. Annals of the Association of American Geographers 79, 1(1989), 44–64.",
      "doi": ""
    },
    {
      "text": "Kai Kunze and Paul Lukowicz. 2014. Sensor placement variations in wearable activity recognition. IEEE Pervasive Computing 13, 4 (2014), 32–41.",
      "doi": ""
    },
    {
      "text": "ER Kuras, DM Hondula, and J Brown-Saracino. 2015. Heterogeneity in individually experienced temperatures (IETs) within an urban neighborhood: insights from a new approach to measuring heat exposure. International journal of biometeorology 59, 10 (2015), 1363–1372.",
      "doi": ""
    },
    {
      "text": "Evan R Kuras, David M Hondula, Summer Betzel, Christopher Dastan, Jason Eneboe, Miranda Kaml, Mary Munoz, Lauren Rohan-Kohl, Mara Sevig, Marianna Singh, 2014. Investigating the Individual Experience in Extreme Heat: A Quick Response Project in Phoenix, Arizona. Quick Response Grant Report series 244 (2014).",
      "doi": ""
    },
    {
      "text": "Karine Laaidi, Abdelkrim Zeghnoun, Benedicte Dousset, Philippe Bretin, Stephanie Vandentorren, Emmanuel Giraudet, and Pascal Beaudeau. 2012. The impact of heat islands on mortality in Paris during the August 2003 heat wave. Environmental health perspectives 120, 2 (2012), 254.",
      "doi": ""
    },
    {
      "text": "Stefanie Lanzinger, Regina Hampel, Susanne Breitner, Regina Rückerl, Ute Kraus, Josef Cyrys, Uta Geruschkat, Annette Peters, and Alexandra Schneider. 2014. Short-term effects of air temperature on blood pressure and pulse pressure in potentially susceptible individuals. International journal of hygiene and environmental health 217, 7(2014), 775–784.",
      "doi": ""
    },
    {
      "text": "George Luber and Michael McGeehin. 2008. Climate change and extreme heat events. American journal of preventive medicine 35, 5 (2008), 429–435.",
      "doi": ""
    },
    {
      "text": "Karin Lundgren, Kalev Kuklane, and Vidhya Venugopal. 2014. Occupational heat stress and associated productivity loss estimation using the PHS model (ISO 7933): a case study from workplaces in Chennai, India. Global health action 7, 1 (2014), 25283.",
      "doi": ""
    },
    {
      "text": "Valerie Vi Thien Mac, Vicki Hertzberg, and Linda A McCauley. 2019. Examining agricultural workplace micro and macroclimate data using decision tree analysis to determine heat illness risk. Journal of occupational and environmental medicine 61, 2 (2019), 107–114.",
      "doi": ""
    },
    {
      "text": "Antonio Martinez-Nicolas, Martin Meyer, Stefan Hunkler, Juan Antonio Madrid, Maria Angeles Rol, Andrea H Meyer, Andy Schötzau, Selim Orgül, and Kurt Kräuchi. 2015. Daytime variation in ambient temperature affects skin temperatures and blood pressure: Ambulatory winter/summer comparison in healthy young women. Physiology & behavior 149 (2015), 203–211.",
      "doi": ""
    },
    {
      "text": "Hiroe Matsuzuki, Akiyoshi Ito, Makoto Ayabe, Yasuo Haruyama, Shigeru Tomita, Shizuo Katamoto, and Takashi Muto. 2011. The effects of work environments on thermal strain on workers in commercial kitchens. Industrial health 49, 5 (2011), 605–613.",
      "doi": ""
    },
    {
      "text": "Andreas Matzarakis, Manuela De Rocco, and Georges Najjar. 2009. Thermal bioclimate in Strasbourg-the 2003 heat wave. Theoretical and Applied Climatology 98, 3-4 (2009), 209–220.",
      "doi": ""
    },
    {
      "text": "Mark P McCarthy, Martin J Best, and Richard A Betts. 2010. Climate change in cities due to global warming and urban effects. Geophysical Research Letters 37, 9 (2010), L09705.",
      "doi": ""
    },
    {
      "text": "Georgia Miskell, Jennifer A Salmond, and David E Williams. 2018. Use of a handheld low-cost sensor to explore the effect of urban design features on local-scale spatial and temporal air quality variability. Science of The Total Environment 619 (2018), 480–490.",
      "doi": ""
    },
    {
      "text": "Diane C Mitchell, Javier Castro, Tracey L Armitage, Alondra J Vega-Arroyo, Sally C Moyce, Daniel J Tancredi, Deborah H Bennett, James H Jones, Tord Kjellstrom, and Marc B Schenker. 2017. Recruitment, methods and descriptive results of a physiologic assessment of latino farmworkers: the California heat illness prevention study (CHIPS). Journal of occupational and environmental medicine 59, 7 (2017), 649.",
      "doi": ""
    },
    {
      "text": "Ian W Murray and Felisa A Smith. 2012. Estimating the influence of the thermal environment on activity patterns of the desert woodrat (Neotoma lepida) using temperature chronologies. Canadian journal of zoology 90, 9 (2012), 1171–1180.",
      "doi": ""
    },
    {
      "text": "Makoto Nakayoshi, Manabu Kanda, Rui Shi, and Richard de Dear. 2015. Outdoor thermal physiology along human pathways: a study using a wearable measurement system. International journal of biometeorology 59, 5 (2015), 503–515.",
      "doi": ""
    },
    {
      "text": "Tim R Oke. 1973. City size and the urban heat island. Atmospheric Environment (1967) 7, 8 (1973), 769–779.",
      "doi": ""
    },
    {
      "text": "Timothy R Oke. 1987. Boundary layer climates. Routledge, New York, NY.",
      "doi": ""
    },
    {
      "text": "Pablo Pancardo, Francisco Acosta, José Hernández-Nolasco, Miguel Wister, and Diego López-de Ipiña. 2015. Real-time personalized monitoring to estimate occupational heat stress in Ambient assisted working. Sensors 15, 7 (2015), 16956–16980.",
      "doi": ""
    },
    {
      "text": "Jennifer D Runkle, Can Cui, Chris Fuhrmann, Scott Stevens, Jeff Del Pinal, and Margaret M Sugg. 2019. Evaluation of wearable sensors for physiologic monitoring of individually experienced temperatures in outdoor workers in southeastern US. Environment international 129 (2019), 229–238.",
      "doi": ""
    },
    {
      "text": "Jan C Semenza, Joel E McCullough, W Dana Flanders, Michael A McGeehin, and John R Lumpkin. 1999. Excess hospital admissions during the July 1995 heat wave in Chicago. American journal of preventive medicine 16, 4 (1999), 269–277.",
      "doi": ""
    },
    {
      "text": "Anna Shcherbina, C Mikael Mattsson, Daryl Waggott, Heidi Salisbury, Jeffrey W Christle, Trevor Hastie, Matthew T Wheeler, and Euan A Ashley. 2017. Accuracy in wrist-worn, sensor-based measurements of heart rate and energy expenditure in a diverse cohort. Journal of personalized medicine 7, 2 (2017), 3.",
      "doi": ""
    },
    {
      "text": "AD Harper Smith, DR Crabtree, JLJ Bilzon, and NP Walsh. 2009. The validity of wireless iButtons® and thermistors for human skin temperature measurement. Physiological measurement 31, 1 (2009), 95.",
      "doi": ""
    },
    {
      "text": "Ian D Stewart and Tim R Oke. 2012. Local climate zones for urban temperature studies. Bulletin of the American Meteorological Society 93, 12 (2012), 1879–1900.",
      "doi": ""
    },
    {
      "text": "Brian Stone. 2007. Urban and rural temperature trends in proximity to large US cities: 1951–2000. International Journal of Climatology 27, 13 (2007), 1801–1807.",
      "doi": ""
    },
    {
      "text": "Brian Stone, Jason Vargo, and Dana Habeeb. 2012. Managing climate change in cities: will climate action plans work?Landscape and Urban Planning 107, 3 (2012), 263–271.",
      "doi": ""
    },
    {
      "text": "Margaret M Sugg, Christopher M Fuhrmann, and Jennifer D Runkle. 2018. Temporal and spatial variation in personal ambient temperatures for outdoor working populations in the southeastern USA. International journal of biometeorology 62, 8 (2018), 1521–1534.",
      "doi": ""
    },
    {
      "text": "Margaret M Sugg, Scott Stevens, and Jennifer Runkle. 2019. Estimating personal ambient temperature in moderately cold environments for occupationally exposed populations.Environmental research 173 (2019), 497–507.",
      "doi": ""
    },
    {
      "text": "Julie M Tarara and Gwen-Alyn Hoheisel. 2007. Low-cost shielding to minimize radiation errors of temperature sensors in the field. HortScience 42, 6 (2007), 1372–1379.",
      "doi": ""
    },
    {
      "text": "Adam J Terando, Elsa Youngsteadt, Emily K Meineke, and Sara G Prado. 2017. Ad hoc instrumentation methods in ecological studies produce highly biased temperature measurements. Ecology and evolution 7, 23 (2017), 9890–9904.",
      "doi": ""
    },
    {
      "text": "Navid Hashemi Tonekaboni, Lakshmish Ramaswamy, Deepak Mishra, Andrew Grundstein, Sujeet Kulkarni, and Yanzhe Yin. 2018. SCOUTS: A Smart Community Centric Urban Heat Monitoring Framework. In Proceedings of the 1st ACM SIGSPATIAL Workshop on Advances on Resilient and Intelligent Cities(Seattle, WA, USA) (ARIC’18). Association for Computing Machinery, New York, NY, USA, 27–30. https://doi.org/10.1145/3284566.3284570",
      "doi": "10.1145/3284566.3284570"
    },
    {
      "text": "Pak Keung Tsin, Anders Knudby, E Scott Krayenhoff, Hung Chak Ho, Michael Brauer, and Sarah B Henderson. 2016. Microscale mobile monitoring of urban air temperature. Urban Climate 18(2016), 58–72.",
      "doi": ""
    },
    {
      "text": "Maximilian Ueberham and Uwe Schlink. 2018. Wearable sensors for multifactorial personal exposure measurements–A ranking study. Environment international 121 (2018), 130–138.",
      "doi": ""
    },
    {
      "text": "Maximilian Ueberham, Uwe Schlink, Martin Dijst, and Ulrike Weiland. 2019. Cyclists’ Multiple Environmental Urban Exposures—Comparing Subjective and Objective Measurements. Sustainability 11, 5 (2019), 1412.",
      "doi": ""
    },
    {
      "text": "Christopher K Uejio, Laurel Harduar Morano, Jihoon Jung, Kristina Kintziger, Meredith Jagger, Juanita Chalmers, and Tisha Holmes. 2018. Occupational heat exposure among municipal workers. International archives of occupational and environmental health 91, 6(2018), 705–715.",
      "doi": ""
    },
    {
      "text": "Ambarish Vaidyanathan, Josephine Malilay, Paul Schramm, and Shubhayu Saha. 2020. Heat-Related Deaths—United States, 2004–2018. Morbidity and Mortality Weekly Report 69, 24 (2020), 729.",
      "doi": ""
    },
    {
      "text": "Sherrilyn H Wainwright, Sharunda D Buchanan, M Mainzer, R Gibson Parrish, and Thomas H Sinks. 1999. Cardiovascular mortality—the hidden peril of heat waves. Prehospital and disaster medicine 14, 04 (1999), 18–27.",
      "doi": ""
    },
    {
      "text": "Suwei Wang, Molly B Richardson, Connor YH Wu, Carly D Cholewa, Claudiu T Lungu, Benjamin F Zaitchik, and Julia M Gohlke. 2019. Estimating Occupational Heat Exposure From Personal Sampling of Public Works Employees in Birmingham, Alabama. Journal of occupational and environmental medicine 61, 6 (2019), 518–524.",
      "doi": ""
    },
    {
      "text": "Liming Zhou, Robert E Dickinson, Yuhong Tian, Jingyun Fang, Qingxiang Li, Robert K Kaufmann, Compton J Tucker, and Ranga B Myneni. 2004. Evidence for a significant urbanization effect on climate in China. Proceedings of the National Academy of Sciences of the United States of America 101, 26 (2004), 9540–9544.",
      "doi": ""
    },
    {
      "text": "Yan Zhou and J Marshall Shepherd. 2010. Atlanta’s urban heat island under extreme heat conditions and potential mitigation strategies. Natural Hazards 52, 3 (2010), 639–668.",
      "doi": ""
    }
  ]
}