{
  "doi": "10.1145/3491102.3517596",
  "title": "Perceiving Affordances Differently: The Unintended Consequences When Young Autistic Adults Engage with Social Media",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-21",
  "year": 2022,
  "badges": [],
  "abstract": "Social media can facilitate numerous benefits, ranging from facilitating access to social, instrumental, financial, and other support, to professional development and civic participation. However, these benefits may not be generalizable to all users. Therefore, we conducted an ethnographic case study with eight Autistic young adults, ten staff members, and four parents to understand how Autistic users of social media engage with others, as well as any unintended consequences of use. We leveraged an affordances perspective to understand how Autistic young adults share and consume user-generated content, make connections, and engage in networked interactions with others via social media. We found that they often used a literal interpretation of digital affordances that sometimes led to negative consequences including physical harm, financial loss, social anxiety, feelings of exclusion, and inadvertently damaging their social relationships. We make recommendations for redesigning social media affordances to be more inclusive of neurodiverse users.",
  "tags": [
    "Autistic Young Adults",
    "Social Media",
    "Affordances"
  ],
  "authors": [
    {
      "name": "Xinru Page",
      "institution": "Department of Computer Science, Brigham Young University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444608113",
      "orcid": "missing"
    },
    {
      "name": "Andrew Capener",
      "institution": "Department of Computer Science, Brigham Young University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236407",
      "orcid": "missing"
    },
    {
      "name": "Spring Cullen",
      "institution": "Department of Computer Science, Brigham Young University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237940",
      "orcid": "missing"
    },
    {
      "name": "Tao Wang",
      "institution": "University of California Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659589006",
      "orcid": "missing"
    },
    {
      "name": "Monica Garfield",
      "institution": "CIS, Bentley University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100058010",
      "orcid": "missing"
    },
    {
      "name": "Pamela J. Wisniewski",
      "institution": "Department of Computer Science, University of Central Florida, United States",
      "img": "/do/10.1145/contrib-81498641142/rel-imgonly/wisniewski.jpg",
      "acmid": "81498641142",
      "orcid": "0000-0002-6223-1029"
    }
  ],
  "references": [
    {
      "text": "Christine van der Aa, Monique M. H. Pollmann, Aske Plaat, and Rutger Jan van der Gaag. 2016. Computer-mediated communication in adults with high-functioning autism spectrum disorders and controls. Research in Autism Spectrum Disorders 23: 15–27. https://doi.org/10.1016/j.rasd.2015.11.007",
      "doi": ""
    },
    {
      "text": "Christine van der Aa, Monique M. H. Pollmann, Aske Plaat, and Rutger Jan van der Gaag. 2016. Computer-mediated communication in adults with high-functioning autism spectrum disorders and controls. Research in Autism Spectrum Disorders 23: 15–27. https://doi.org/10.1016/j.rasd.2015.11.007",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti and Ralph Gross. 2006. Imagined Communities: Awareness, Information Sharing, and Privacy on the Facebook. In Privacy Enhancing Technologies. 36–58.",
      "doi": ""
    },
    {
      "text": "Tawfiq Ammari and Sarita Schoenebeck. 2015. Networked Empowerment on Facebook Groups for Parents of Children with Special Needs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15), 2805–2814. https://doi.org/10.1145/2702123.2702324",
      "doi": "10.1145/2702123.2702324"
    },
    {
      "text": "Tawfiq Ammari, Sarita Yardi Schoenebeck, and Meredith Ringel Morris. 2014. Accessing Social Support and Overcoming Judgment on Social Media among Parents of Children with Special Needs. In Eighth International AAAI Conference on Weblogs and Social Media. Retrieved May 11, 2020 from https://www.aaai.org/ocs/index.php/ICWSM/ICWSM14/paper/view/8032",
      "doi": ""
    },
    {
      "text": "A. E. van Asselt-Goverts, P. J. C. M. Embregts, A. H. C. Hendriks, K. M. Wegman, and J. P. Teunisse. 2015. Do Social Networks Differ? Comparison of the Social Networks of People with Intellectual Disabilities, People with Autism Spectrum Disorders and Other People Living in the Community. Journal of Autism and Developmental Disorders 45, 5: 1191–1203. https://doi.org/10.1007/s10803-014-2279-3",
      "doi": ""
    },
    {
      "text": "Karla Badillo-Urquiola, Chhaya Chouhan, Stevie Chancellor, Munmun De Choudhary, and Pamela Wisniewski. 2019. Beyond Parental Control: Designing Adolescent Online Safety Apps Using Value Sensitive Design. Journal of Adolescent Research: 0743558419884692. https://doi.org/10.1177/0743558419884692",
      "doi": ""
    },
    {
      "text": "Karla Badillo-Urquiola, Scott Harpin, and Pamela Wisniewski. 2017. Abandoned but Not Forgotten: Providing Access While Protecting Foster Youth from Online Risks. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC ’17), 17–26. https://doi.org/10.1145/3078072.3079724",
      "doi": "10.1145/3078072.3079724"
    },
    {
      "text": "Karla Badillo-Urquiola, Xinru Page, and Pamela J. Wisniewski. 2019. Risk vs. Restriction: The Tension Between Providing a Sense of Normalcy and Keeping Foster Teens Safe Online. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), 267:1-267:14. https://doi.org/10.1145/3290605.3300497",
      "doi": ""
    },
    {
      "text": "Karla Badillo-Urquiola, Diva Smriti, Brenna McNally, Evan Golub, Elizabeth Bonsignore, and Pamela J. Wisniewski. 2019. Stranger Danger!: Social Media App Features Co-designed with Children to Keep Them Safe Online. In Proceedings of the 18th ACM International Conference on Interaction Design and Children (IDC ’19), 394–406. https://doi.org/10.1145/3311927.3323133",
      "doi": ""
    },
    {
      "text": "E.P.S. Baumer, P. Adams, V. Khovanskaya, T. Liao, M.E. Smith, V.S. Sosik, and K. Williams. 2013. Limiting, Leaving, and (re)Lapsing: An Exploration of Facebook Non-Use Practices and Experiences. In Proc. CHI 2013.",
      "doi": ""
    },
    {
      "text": "Eric P. S. Baumer, Shion Guha, Emily Quan, David Mimno, and Geri K. Gay. 2015. Missing Photos, Suffering Withdrawal, or Finding Freedom? How Experiences of Social Media Non-Use Influence the Likelihood of Reversion. Social media & society 1, 2. https://doi.org/10.1177/2056305115614851",
      "doi": ""
    },
    {
      "text": "Carol Beatty. 2013. Implementing Olmstead by Outlawing Waiting Lists. Tulsa Law Review 49: 713.",
      "doi": ""
    },
    {
      "text": "DANAH BOYD. 2010. Social Network Sites as Networked Publics: Affordances, Dynamics, and Implications. In A Networked Self. Routledge.",
      "doi": ""
    },
    {
      "text": "Danah M. Boyd and Nicole B. Ellison. 2007. Social Network Sites: Definition, History, and Scholarship. Journal of Computer-Mediated Communication 13, 1: 210–230. https://doi.org/10.1111/j.1083-6101.2007.00393.x",
      "doi": "10.1111/j.1083-6101.2007.00393.x"
    },
    {
      "text": "Moira Burke and Mike Develin. 2016. Once More with Feeling: Supportive Responses to Social Sharing on Facebook. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, 1462–1474. https://doi.org/10.1145/2818048.2835199",
      "doi": "10.1145/2818048.2835199"
    },
    {
      "text": "Moira Burke, Robert Kraut, and Cameron Marlow. 2011. Social Capital on Facebook: Differentiating Uses and Users. In Proc. CHI 2011 (CHI ’11), 571–580. https://doi.org/10.1145/1978942.1979023",
      "doi": "10.1145/1978942.1979023"
    },
    {
      "text": "Moira Burke, Cameron Marlow, and Thomas Lento. 2010. Social Network Activity and Social Well-being. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’10), 1909–1912. https://doi.org/10.1145/1753326.1753613",
      "doi": "10.1145/1753326.1753613"
    },
    {
      "text": "CDC. 2020. Data and Statistics on Autism Spectrum Disorder | CDC. Centers for Disease Control and Prevention. Retrieved June 21, 2020 from https://www.cdc.gov/ncbddd/autism/data.html",
      "doi": ""
    },
    {
      "text": "CDC. 2020. Basics About Autism Spectrum Disorder (ASD) | NCBDDD | CDC. Centers for Disease Control and Prevention. Retrieved January 7, 2022 from https://www.cdc.gov/ncbddd/autism/facts.html",
      "doi": ""
    },
    {
      "text": "CDC. 2020. Diagnostic Criteria | Autism Spectrum Disorder (ASD) | NCBDDD | CDC. Centers for Disease Control and Prevention. Retrieved January 7, 2022 from https://www.cdc.gov/ncbddd/autism/hcp-dsm.html",
      "doi": ""
    },
    {
      "text": "CDC. 2021. Data and Statistics on Autism Spectrum Disorder | CDC. Centers for Disease Control and Prevention. Retrieved January 7, 2022 from https://www.cdc.gov/ncbddd/autism/data.html",
      "doi": ""
    },
    {
      "text": "Darren Chadwick and Caroline Wesson. 2016. Digital Inclusion and Disability. In Applied Cyberpsychology: Practical Applications of Cyberpsychological Theory and Research, Alison Attrill and Chris Fullwood (eds.). Palgrave Macmillan UK, London, 1–23. https://doi.org/10.1057/9781137517036_1",
      "doi": ""
    },
    {
      "text": "Erin E Cook, Amanda B Nickerson, Jilynn M Werth, and Kathleen P Allen. 2017. Service providers’ perceptions of and responses to bullying of individuals with disabilities. Journal of Intellectual Disabilities 21, 4: 277–296. https://doi.org/10.1177/1744629516650127",
      "doi": ""
    },
    {
      "text": "Sarah M. Coyne, Adam A. Rogers, Jessica D. Zurcher, Laura Stockdale, and McCall Booth. 2020. Does time spent using social media impact mental health?: An eight year longitudinal study - ScienceDirect. Computers in Human Behavior 104. https://doi.org/10.1016/j.chb.2019.106160",
      "doi": ""
    },
    {
      "text": "Ralf De Wolf. 2020. Contextualizing how teens manage personal and interpersonal privacy on social media. New Media & Society 22, 6: 1058–1075. https://doi.org/10.1177/1461444819876570",
      "doi": ""
    },
    {
      "text": "Jesse Shore Dellarocas Jiye Baek, and Chrysanthos. Twitter Is Not the Echo Chamber We Think It Is. MIT Sloan Management Review. Retrieved August 16, 2019 from https://sloanreview.mit.edu/article/twitter-is-not-the-echo-chamber-we-think-it-is/",
      "doi": ""
    },
    {
      "text": "Michael A. DeVito, Jeremy Birnholtz, and Jeffery T. Hancock. 2017. Platforms, People, and Perception: Using Affordances to Understand Self-Presentation on Social Media. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW ’17), 740–754. https://doi.org/10.1145/2998181.2998192",
      "doi": "10.1145/2998181.2998192"
    },
    {
      "text": "Nicole B. Ellison and Danah M. boyd. 2013. Sociality through Social Network Sites. In The Oxford Handbook of Internet Studies, William H. Dutton (ed.). OUP Oxford.",
      "doi": ""
    },
    {
      "text": "Nicole B. Ellison, Charles Steinfield, and Cliff Lampe. 2007. The Benefits of Facebook “Friends:” Social Capital and College Students’ Use of Online Social Network Sites. Journal of Computer-Mediated Communication 12, 4: 1143–1168. https://doi.org/10.1111/j.1083-6101.2007.00367.x",
      "doi": ""
    },
    {
      "text": "Nicole B. Ellison and Jessica Vitak. 2015. Social network site affordances and their relationship to social capital processes. In The handbook of the psychology of communication technology. Wiley-Blackwell, 205–227. https://doi.org/10.1002/9781118426456.ch9",
      "doi": ""
    },
    {
      "text": "Nicole B. Ellison and Jessica Vitak. 2015. Social network site affordances and their relationship to social capital processes. The Handbook of the Psychology of Communication Technology 32: 205.",
      "doi": ""
    },
    {
      "text": "Lee B. Erickson, Pamela Wisniewski, Heng Xu, John M. Carroll, Mary Beth Rosson, and Daniel F. Perkins. 2016. The Boundaries Between: Parental Involvement in a Teen's Online World. J. Assoc. Inf. Sci. Technol. 67, 6: 1384–1403. https://doi.org/10.1002/asi.23450",
      "doi": "10.1002/asi.23450"
    },
    {
      "text": "Sandra K. Evans, Katy E. Pearce, Jessica Vitak, and Jeffrey W. Treem. 2017. Explicating Affordances: a Conceptual Framework for Understanding Affordances in Communication Research. Journal of Computer-Mediated Communication 22, 1: 35–52. https://doi.org/10.1111/jcc4.12180",
      "doi": "10.1111/jcc4.12180"
    },
    {
      "text": "Stevenson Fergus and Marc A. Zimmerman. 2005. ADOLESCENT RESILIENCE: A Framework for Understanding Healthy Development in the Face of Risk. Annual review of public health 26, 1: 399–419. https://doi.org/10.1146/annurev.publhealth.26.021304.144357",
      "doi": ""
    },
    {
      "text": "Kathleen A. Flannery and Robert Wisner-Carlson. 2020. Autism and Education. Child and Adolescent Psychiatric Clinics of North America 29, 2: 319–343. https://doi.org/10.1016/j.chc.2019.12.005",
      "doi": ""
    },
    {
      "text": "Jesse Fox and Jennifer J. Moreland. 2015. The dark side of social networking sites: An exploration of the relational and psychological stressors associated with Facebook use and affordances. Computers in Human Behavior 45: 168–176. https://doi.org/10.1016/j.chb.2014.11.083",
      "doi": "10.1016/j.chb.2014.11.083"
    },
    {
      "text": "Maria Fridh, Marie Köhler, Birgit Modén, Martin lindström, and Maria Rosvall. 2018. Subjective health complaints and exposure to peer victimization among disabled and non-disabled adolescents: A population-based study in Sweden. Scandinavian Journal of Public Health 46, 2: 262–271. https://doi.org/10.1177/1403494817705558",
      "doi": ""
    },
    {
      "text": "James Ngetha Gachau. 2016. The Role of Social Media in Participatory Democracy: A Case Study of Facebook Groups. In Proceedings of the 19th International Conference on Supporting Group Work (GROUP ’16), 467–472. https://doi.org/10.1145/2957276.2997020",
      "doi": "10.1145/2957276.2997020"
    },
    {
      "text": "Kiran Garimella, Gianmarco De Francisci Morales, Aristides Gionis, and Michael Mathioudakis. 2018. Political Discourse on Social Media: Echo Chambers, Gatekeepers, and the Price of Bipartisanship. In Proceedings of the 2018 World Wide Web Conference (WWW ’18), 913–922. https://doi.org/10.1145/3178876.3186139",
      "doi": "10.1145/3178876.3186139"
    },
    {
      "text": "Reza Ghaiumy, Kaileigh A. Byrne, Pamela Wisniewski, Xinru Page, and Bart P. Knijnenburg. 2021. To Disclose or Not to Disclose: Examining the Privacy Decision-Making Processes of Older vs. Younger Adults. In Proceedings of the 2021 ACM conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "Arup Kumar Ghosh, Karla Badillo-Urquiola, Shion Guha, Joseph J. LaViola Jr, and Pamela J. Wisniewski. 2018. Safety vs. Surveillance: What Children Have to Say About Mobile Apps for Parental Control. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), 124:1-124:14. https://doi.org/10.1145/3173574.3173698",
      "doi": "10.1145/3173574.3173698"
    },
    {
      "text": "James J. Gibson. 1977. The theory of affordances. In Perceiving, acting, and knowing: toward an ecological psychology, John Bransford Robert E Shaw (ed.). Hillsdale, N.J.: Lawrence Erlbaum Associates, pp.67-82. Retrieved October 29, 2020 from https://hal.archives-ouvertes.fr/hal-00692033",
      "doi": ""
    },
    {
      "text": "James J. Gibson. 2014. The Ecological Approach to Visual Perception: Classic Edition. Psychology Press, New York, London.",
      "doi": ""
    },
    {
      "text": "Kristen Gillespie-Lynch, Steven K. Kapp, Christina Shane-Simpson, David Shane Smith, and Ted Hutman. 2014. Intersections Between the Autism Spectrum and the Internet: Perceived Benefits and Preferred Functions of Computer-Mediated Communication. Intellectual and Developmental Disabilities 52, 6: 456–469. https://doi.org/10.1352/1934-9556-52.6.456",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1959. Presentation of Self in Everyday Life. . Doubleday, New York, New York. Retrieved November 12, 2008 from http://books.google.com/books?hl=en&lr=&id=mgaFYGRHB_0C&oi=fnd&pg=PA52&dq=Presentation+of+Self+in+Everyday+Life+impression&ots=-RG35r5M1O&sig=pLnYk_-TEvoyTc9bG9UKj36t_H0#PPA52,M1",
      "doi": ""
    },
    {
      "text": "Jonathan Gray, Cornel Sandvoss, and C. Lee Harrington. 2017. Fandom, Second Edition: Identities and Communities in a Mediated World. NYU Press.",
      "doi": ""
    },
    {
      "text": "McLeod Frampton Gwynette, Danielle Morriss, Nancy Warren, James Truelove, Jennifer Warthen, Charles Paul Ross, George Mood, Charlotte Anne Snook, and Jeffrey Borckardt. 2017. Social Skills Training for Adolescents With Autism Spectrum Disorder Using Facebook (Project Rex Connect): A Survey Study. JMIR Mental Health 4, 1: e4. https://doi.org/10.2196/mental.6605",
      "doi": ""
    },
    {
      "text": "McLeod Frampton Gwynette, Shawn S. Sidhu, and Tolga Atilla Ceranoglu. 2018. Electronic Screen Media Use in Youth With Autism Spectrum Disorder. Child and Adolescent Psychiatric Clinics 27, 2: 203–219. https://doi.org/10.1016/j.chc.2017.11.013",
      "doi": ""
    },
    {
      "text": "Jasper van Haasteren. 2011. Autism: Social norms depend on what is typical. Nature 480, 7377: 321–321. https://doi.org/10.1038/480321e",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai and Gina Walejko. 2008. THE PARTICIPATION DIVIDE: Content creation and sharing in the digital age. Information, Communication & Society 11, 2: 239–256. https://doi.org/10.1080/13691180801946150",
      "doi": ""
    },
    {
      "text": "Sameer Hinduja and Justin W. Patchin. 2010. Bullying, Cyberbullying, and Suicide. Archives of Suicide Research 14, 3: 206–221. https://doi.org/10.1080/13811118.2010.494133",
      "doi": ""
    },
    {
      "text": "Christian Pieter Hoffmann, Christoph Lutz, and Miriam Meckel. 2015. Content creation on the Internet: a social cognitive perspective on the participation divide. Information, Communication & Society 18, 6: 696–716. https://doi.org/10.1080/1369118X.2014.991343",
      "doi": ""
    },
    {
      "text": "Megan Hofmann, Cynthia L Bennett, Jinjuan Heidi Feng, Dhruv Jain, Richard Ladner, and Jennifer Mankoff. 2021. 2021 SIG on Access in SIGCHI. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–3. Retrieved January 7, 2022 from https://doi.org/10.1145/3411763.3450405",
      "doi": ""
    },
    {
      "text": "Patricia Howlin and Philippa Moss. 2012. Adults with Autism Spectrum Disorders. The Canadian Journal of Psychiatry 57, 5: 275–283. https://doi.org/10.1177/070674371205700502",
      "doi": ""
    },
    {
      "text": "A.K.M. Najmul Islam and Sameer Patil. 2015. Engagement and Well-being on Social Network Sites. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW ’15), 375–382. https://doi.org/10.1145/2675133.2675299",
      "doi": ""
    },
    {
      "text": "Gerald C. Kane, Maryam Alavi, Giuseppe Labianca, and Stephen P. Borgatti. 2014. What's Different About Social Media Networks? A Framework and Research Agenda. MIS Q. 38, 1: 275–304.",
      "doi": "10.5555/2600518.2600532"
    },
    {
      "text": "Bumsoo Kim and Yonghwan Kim. 2019. Facebook versus Instagram: How perceived gratifications and technological attributes are related to the change in social media usage. The Social Science Journal 56, 2: 156–167. https://doi.org/10.1016/j.soscij.2018.10.002",
      "doi": ""
    },
    {
      "text": "Dam Hee Kim and Nicole B. Ellison. 2021. From observation on social media to offline political participation: The social media affordances approach. New Media & Society: 1461444821998346. https://doi.org/10.1177/1461444821998346",
      "doi": ""
    },
    {
      "text": "Robin M. Kowalski, Gary W. Giumetti, Amber N. Schroeder, and Micah R. Lattanner. 2014. Bullying in the digital age: a critical review and meta-analysis of cyberbullying research among youth. Psychological Bulletin 140, 4: 1073–1137. https://doi.org/10.1037/a0035618",
      "doi": ""
    },
    {
      "text": "Priya Kumar and Sarita Schoenebeck. 2015. The Modern Day Baby Book: Enacting Good Mothering and Stewarding Privacy on Facebook. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW ’15), 1302–1312. https://doi.org/10.1145/2675133.2675149",
      "doi": "10.1145/2675133.2675149"
    },
    {
      "text": "M Leary. 2011. Self-presentational persona: Simultaneous management of multiple impressions. Journal of Personality and Social Psychology 101, 5: 1033-1033–1049.",
      "doi": ""
    },
    {
      "text": "Dokyun Lee, Kartik Hosanagar, and Harikesh S. Nair. 2018. Advertising Content and Consumer Engagement on Social Media: Evidence from Facebook. Management Science 64, 11: 5105–5131. https://doi.org/10.1287/mnsc.2017.2902",
      "doi": "10.1287/mnsc.2017.2902"
    },
    {
      "text": "Paul M. Leonardi. 2017. The Social Media Revolution. Inf. Organ. 27, 1: 47–59. https://doi.org/10.1016/j.infoandorg.2017.01.004",
      "doi": "10.1016/j.infoandorg.2017.01.004"
    },
    {
      "text": "Paul M. Leonardi and Emmanuelle Vaast. 2017. Social Media and Their Affordances for Organizing: A Review and Agenda for Research. Social Science Research Network, Rochester, NY. Retrieved January 7, 2022 from https://papers.ssrn.com/abstract=2993824",
      "doi": ""
    },
    {
      "text": "Lisa Jo Rudy. 2021. Making Sense of the Three Levels of Autism. Verywell Health. Retrieved September 4, 2021 from https://www.verywellhealth.com/what-are-the-three-levels-of-autism-260233",
      "doi": ""
    },
    {
      "text": "Eden Litt and Eszter Hargittai. 2016. “Just Cast the Net, and Hopefully the Right Fish Swim into It”: Audience Management on Social Network Sites. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW ’16), 1488–1500. https://doi.org/10.1145/2818048.2819933",
      "doi": "10.1145/2818048.2819933"
    },
    {
      "text": "Eden Litt and Eszter Hargittai. 2016. The Imagined Audience on Social Network Sites. Social Media + Society 2, 1: 2056305116633482. https://doi.org/10.1177/2056305116633482",
      "doi": ""
    },
    {
      "text": "Jingyan Lu, Qiang Hao, and Mengguo Jing. 2016. Consuming, sharing, and creating content: How young students use new social media in and outside school. Computers in Human Behavior 64: 55–64. https://doi.org/10.1016/j.chb.2016.06.019",
      "doi": "10.1016/j.chb.2016.06.019"
    },
    {
      "text": "Weixu Lu and Keith N Hampton. 2017. Beyond the power of networks: Differentiating network structure from social media affordances for perceived social support. New Media & Society 19, 6: 861–879. https://doi.org/10.1177/1461444815621514",
      "doi": ""
    },
    {
      "text": "Kirsty Macmillan, Tessa Berg, Mike Just, and Mary Stewart. 2020. Are autistic children more vulnerable online? Relating autism to online safety, child wellbeing and parental risk management. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. Association for Computing Machinery, New York, NY, USA, 1–11. Retrieved January 7, 2022 from https://doi.org/10.1145/3419249.3420160",
      "doi": "10.1145/3419249.3420160"
    },
    {
      "text": "Ann Majchrzak, Samer Faraj, Gerald C. Kane, and Bijan Azad. 2013. The Contradictory Influence of Social Media Affordances on Online Communal Knowledge Sharing. Journal of Computer-Mediated Communication 19, 1: 38–55. https://doi.org/10.1111/jcc4.12030",
      "doi": ""
    },
    {
      "text": "Jennifer Mankoff, Gillian R. Hayes, and Devva Kasnitz. 2010. Disability studies as a source of critical inquiry for the field of assistive technology. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility (ASSETS ’10), 3–10. https://doi.org/10.1145/1878803.1878807",
      "doi": "10.1145/1878803.1878807"
    },
    {
      "text": "Alice E. Marwick and danah boyd. 2011. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, 1: 114–133. https://doi.org/10.1177/1461444810365313",
      "doi": ""
    },
    {
      "text": "Micah O. Mazurek. 2013. Social media use among adults with autism spectrum disorders. Computers in Human Behavior 29, 4: 1709–1714. https://doi.org/10.1016/j.chb.2013.02.004",
      "doi": "10.1016/j.chb.2013.02.004"
    },
    {
      "text": "Micah O. Mazurek. 2013. Social media use among adults with autism spectrum disorders. Computers in Human Behavior 29, 4: 1709–1714. https://doi.org/10.1016/j.chb.2013.02.004",
      "doi": "10.1016/j.chb.2013.02.004"
    },
    {
      "text": "Micah O. Mazurek, Paul T. Shattuck, Mary Wagner, and Benjamin P. Cooper. 2012. Prevalence and Correlates of Screen-Based Media Use Among Youths with Autism Spectrum Disorders. Journal of Autism and Developmental Disorders 42, 8: 1757–1767. https://doi.org/10.1007/s10803-011-1413-8",
      "doi": ""
    },
    {
      "text": "Brenna McNally, Priya Kumar, Chelsea Hordatt, Matthew Louis Mauriello, Shalmali Naik, Leyla Norooz, Alazandra Shorter, Evan Golub, and Allison Druin. 2018. Co-designing Mobile Online Safety Applications with Children. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–9. Retrieved January 10, 2022 from https://doi.org/10.1145/3173574.3174097",
      "doi": "10.1145/3173574.3174097"
    },
    {
      "text": "Nicole Baumer MEd MD and Julia Frueh MD. 2021. What is neurodiversity? Harvard Health. Retrieved January 7, 2022 from https://www.health.harvard.edu/blog/what-is-neurodiversity-202111232645",
      "doi": ""
    },
    {
      "text": "Hugh Miller. 1995. The Presentation of Self in Electronic Life: Goffman on the Internet. Embodied Knowledge and Virtual Space Conference. Retrieved December 2, 2008 from http://www.isr.uci.edu/∼jpd/classes/ics234cw04/miller.pdf",
      "doi": ""
    },
    {
      "text": "P. Mitchell, R. Saltmarsh, and H. Russell. 1997. Overly literal interpretations of speech in autism: understanding that messages arise from minds. Journal of Child Psychology and Psychiatry, and Allied Disciplines 38, 6: 685–691. https://doi.org/10.1111/j.1469-7610.1997.tb01695.x",
      "doi": ""
    },
    {
      "text": "Megan A. Moreno and Jonathan D'Angelo. 2019. Social Media Intervention Design: Applying an Affordances Framework. Journal of Medical Internet Research 21, 3: e11014. https://doi.org/10.2196/11014",
      "doi": ""
    },
    {
      "text": "Donald A. Norman. 2013. The design of everyday things. New York: Basic Books, a member of the Perseus Books Group. Retrieved July 13, 2021 from https://search.lib.byu.edu/byu/record/cat.6406662.item.31197234535414?holding=fg3p0da95rkgk9oy",
      "doi": ""
    },
    {
      "text": "Xinru Page, Reza Ghaiumy Anaraky, Bart P. Knijnenburg, and Pamela J. Wisniewski. 2019. Pragmatic Tool vs. Relational Hindrance: Exploring Why Some Social Media Users Avoid Privacy Features. Proceedings of the ACM on Human-Computer Interaction 3, CSCW: 110:1-110:23. https://doi.org/10.1145/3359212",
      "doi": ""
    },
    {
      "text": "Xinru Page and Marco Marabelli. 2017. Changes in Social Media Behavior During Life Periods of Uncertainty. In Proceedings of the Eleventh International AAAI Conference on Weblogs and Social Media.",
      "doi": ""
    },
    {
      "text": "Xinru Page, Pamela Wisniewski, Bart P. Knijnenburg, and Moses Namara. 2018. Social Media's Have-Nots: An Era of Social Disenfranchisement. Internet Research 28, 5. https://doi.org/10.1108/IntR-03-2017-0123",
      "doi": ""
    },
    {
      "text": "Roberta Pearson. 2010. Fandom in the Digital Era. Popular Communication 8, 1: 84–95. https://doi.org/10.1080/15405700903502346",
      "doi": ""
    },
    {
      "text": "Sandra Petronio. 2010. Communication Privacy Management Theory: What Do We Know About Family Privacy Regulation? Journal of Family Theory & Review 2, 3: 175–196. https://doi.org/10.1111/j.1756-2589.2010.00052.x",
      "doi": ""
    },
    {
      "text": "Anne Marie Piper, Raymundo Cornejo, Lisa Hurwitz, and Caitlin Unumb. 2016. Technological Caregiving: Supporting Online Activity for Adults with Cognitive Impairments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), 5311–5323. https://doi.org/10.1145/2858036.2858260",
      "doi": "10.1145/2858036.2858260"
    },
    {
      "text": "Thomas V. Pollet, Sam G.B. Roberts, and Robin I.M. Dunbar. 2010. Use of Social Network Sites and Instant Messaging Does Not Lead to Increased Offline Social Network Size, or to Emotionally Closer Relationships with Offline Network Members. Cyberpsychology, Behavior, and Social Networking 14, 4: 253–258. https://doi.org/10.1089/cyber.2010.0161",
      "doi": ""
    },
    {
      "text": "Lee Rainie and Barry Wellman. 2014. Networked: The New Social Operating System. The MIT Press, Cambridge.",
      "doi": "10.5555/2636776"
    },
    {
      "text": "J O Renty and Herbert Roeyers. 2006. Quality of life in high-functioning adults with autism spectrum disorder: The predictive value of disability and support characteristics. Autism 10, 5: 511–524. https://doi.org/10.1177/1362361306066604",
      "doi": ""
    },
    {
      "text": "Victoria J. Rideout, Ulla G. Foehr, and Donald F. Roberts. 2010. Generation M[superscript 2]: Media in the Lives of 8- to 18-Year-Olds. Henry J. Retrieved September 9, 2021 from https://eric.ed.gov/?id=ED527859",
      "doi": ""
    },
    {
      "text": "Kathryn E. Ringland, Christine T. Wolf, LouAnne E. Boyd, Mark S. Baldwin, and Gillian R. Hayes. 2016. Would You Be Mine: Appropriating Minecraft as an Assistive Technology for Youth with Autism. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’16), 33–41. https://doi.org/10.1145/2982142.2982172",
      "doi": "10.1145/2982142.2982172"
    },
    {
      "text": "Kathryn E. Ringland, Christine T. Wolf, Heather Faucett, Lynn Dombrowski, and Gillian R. Hayes. 2016. “Will I always be not social?”: Re-Conceptualizing Sociality in the Context of a Minecraft Community for Autism. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), 1256–1269. https://doi.org/10.1145/2858036.2858038",
      "doi": "10.1145/2858036.2858038"
    },
    {
      "text": "Sara McLean, Ken Meadows, Austin Heffernan, and Nicole Campbell. 2020. Using online decision trees to support students’ self-efficacy in the laboratory | Advances in Physiology Education. Advances in Physiology Education. https://doi.org/10.1152/advan.00016.2019",
      "doi": ""
    },
    {
      "text": "Gerrit I. van Schalkwyk, Carla E. Marin, Mayra Ortiz, Max Rolison, Zheala Qayyum, James C. McPartland, Eli R. Lebowitz, Fred R. Volkmar, and Wendy K. Silverman. 2017. Social Media Use, Friendship Quality, and the Moderating Role of Anxiety in Adolescents with Autism Spectrum Disorder. Journal of Autism and Developmental Disorders 47, 9: 2805–2813. https://doi.org/10.1007/s10803-017-3201-6",
      "doi": ""
    },
    {
      "text": "Susan M. Schultz, Gloria Jacobs, and Jacob Schultz. 2013. A Promising Practice: Using Facebook as a Communication and Social Networking Tool. Rural Special Education Quarterly 32, 4: 38–44. https://doi.org/10.1177/875687051303200405",
      "doi": ""
    },
    {
      "text": "Lauren Scissors, Moira Burke, and Steven Wengrovitz. 2016. What's in a Like?: Attitudes and Behaviors Around Receiving Likes on Facebook. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, 1501–1510. https://doi.org/10.1145/2818048.2820066",
      "doi": "10.1145/2818048.2820066"
    },
    {
      "text": "Mihye Seo, Jinhee Kim, and Hyeseung Yang. 2016. Frequent Interaction and Fast Feedback Predict Perceived Social Support: Using Crawled and Self-Reported Data of Facebook Users. Journal of Computer-Mediated Communication 21, 4: 282–297. https://doi.org/10.1111/jcc4.12160",
      "doi": "10.1111/jcc4.12160"
    },
    {
      "text": "Christina Shane-Simpson, Adriana Manago, Naomi Gaggi, and Kristen Gillespie-Lynch. 2018. Why do college students prefer Facebook, Twitter, or Instagram? Site affordances, tensions between privacy and self-expression, and implications for social capital. Computers in Human Behavior 86: 276–288. https://doi.org/10.1016/j.chb.2018.04.041",
      "doi": ""
    },
    {
      "text": "Ariel Shensa, Jaime E. Sidani, César G. Escobar-Viera, Galen E. Switzer, Brian A. Primack, and Sophia Choukas-Bradley. 2020. Emotional support from social media and face-to-face relationships: Associations with depression risk among young adults. Journal of Affective Disorders 260: 38–44. https://doi.org/10.1016/j.jad.2019.08.092",
      "doi": ""
    },
    {
      "text": "Carmit-Noa Shpigelman and Carol J. Gill. 2014. Facebook Use by Persons with Disabilities. Journal of Computer-Mediated Communication 19, 3: 610–624. https://doi.org/10.1111/jcc4.12059",
      "doi": "10.1111/jcc4.12059"
    },
    {
      "text": "Shruti Sannon, Elizabeth L. Murnane, Natalya N. Bazarova, and Geri Gay. 2019. I was really, really nervous posting it. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Retrieved January 10, 2022 from https://dl.acm.org/doi/abs/10.1145/3290605.3300583",
      "doi": "10.1145/3290605.3300583"
    },
    {
      "text": "Aaron Smith and Maeve Duggan. 2018. Crossing the Line: What Counts as Online Harassment? Pew Research Center: Internet, Science & Tech. Retrieved January 26, 2018 from http://www.pewinternet.org/2018/01/04/crossing-the-line-what-counts-as-online-harassment/",
      "doi": ""
    },
    {
      "text": "Edmund Sonuga-Barke and Anita Thapar. 2021. The neurodiversity concept: is it helpful for clinicians and scientists? The Lancet Psychiatry 8, 7: 559–561. https://doi.org/10.1016/S2215-0366(21)00167-X",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Kathrin Gerling, Cynthia L. Bennett, Emeline Brulé, Rua M. Williams, Jennifer Rode, and Jennifer Mankoff. 2020. Nothing About Us Without Us: Investigating the Role of Critical Disability Studies in HCI. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (CHI EA ’20), 1–8. https://doi.org/10.1145/3334480.3375150",
      "doi": "10.1145/3334480.3375150"
    },
    {
      "text": "Anselm L. Strauss. 1987. Qualitative Analysis for Social Scientists. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Darko Striga and Vedran Podobnik. 2018. Benford's Law and Dunbar's Number: Does Facebook Have a Power to Change Natural and Anthropological Laws? IEEE Access 6: 14629–14642. https://doi.org/10.1109/ACCESS.2018.2805712",
      "doi": ""
    },
    {
      "text": "Lee Taber and Steve Whittaker. 2020. “On Finsta, I can say ‘Hail Satan’”: Being Authentic but Disagreeable on Instagram. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), 1–14. https://doi.org/10.1145/3313831.3376182",
      "doi": "10.1145/3313831.3376182"
    },
    {
      "text": "Jaime Teevan, Meredith Ringel Morris, and Katrina Panovich. 2011. Factors Affecting Response Quantity, Quality, and Speed for Questions Asked Via Social Network Status Messages. In Fifth International AAAI Conference on Weblogs and Social Media. Retrieved December 31, 2011 from http://www.aaai.org/ocs/index.php/ICWSM/ICWSM11/paper/viewPaper/2795",
      "doi": ""
    },
    {
      "text": "Catalina L. Toma. 2010. Affirming the self through online profiles: beneficial effects of social networking sites. 1749–1752. https://doi.org/10.1145/1753326.1753588",
      "doi": ""
    },
    {
      "text": "Jeffrey W. Treem and Paul M. Leonardi. 2013. Social Media Use in Organizations: Exploring the Affordances of Visibility, Editability, Persistence, and Association. Annals of the International Communication Association 36, 1: 143–189. https://doi.org/10.1080/23808985.2013.11679130",
      "doi": ""
    },
    {
      "text": "Sabine Trepte. 2021. The Social Media Privacy Model: Privacy and Communication in the Light of Social Media Affordances. Communication Theory 31, 4: 549–570. https://doi.org/10.1093/ct/qtz035",
      "doi": ""
    },
    {
      "text": "Sabine Trepte, Michael Scharkow, and Tobias Dienlin. 2020. The privacy calculus contextualized: The influence of affordances. Computers in Human Behavior 104: 106115. https://doi.org/10.1016/j.chb.2019.08.022",
      "doi": "10.1016/j.chb.2019.08.022"
    },
    {
      "text": "Patti M. Valkenburg, Adrian Meier, and Ine Beyens. 2021. Social Media Use and its Impact on Adolescent Mental Health: An Umbrella Review of the Evidence. Current Opinion in Psychology. https://doi.org/10.1016/j.copsyc.2021.08.017",
      "doi": ""
    },
    {
      "text": "Jessica Vitak. 2012. The Impact of Context Collapse and Privacy on Social Network Site Disclosures. Journal of Broadcasting & Electronic Media 56, 4: 451–470. https://doi.org/10.1080/08838151.2012.732140",
      "doi": ""
    },
    {
      "text": "Jessica Vitak and Jinyoung Kim. 2014. “You Can'T Block People Offline”: Examining How Facebook's Affordances Shape the Disclosure Process. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW ’14), 461–474. https://doi.org/10.1145/2531602.2531672",
      "doi": "10.1145/2531602.2531672"
    },
    {
      "text": "Jessica Vitak, Cliff Lampe, Rebecca Gray, and Nicole B. Ellison. 2012. “Why won't you be my Facebook friend?”: strategies for managing context collapse in the workplace. In Proceedings of the 2012 iConference (iConference ’12), 555–557. https://doi.org/10.1145/2132176.2132286",
      "doi": ""
    },
    {
      "text": "Joseph B. Walther. 1996. Computer-Mediated Communication: Impersonal, Interpersonal, and Hyperpersonal Interaction. Communication Research 23, 1: 3–43. https://doi.org/10.1177/009365096023001001",
      "doi": ""
    },
    {
      "text": "Yi-Chia Wang, Moira Burke, and Robert Kraut. 2016. Modeling Self-Disclosure in Social Networking Sites. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW ’16), 74–85. https://doi.org/10.1145/2818048.2820010",
      "doi": "10.1145/2818048.2820010"
    },
    {
      "text": "Deborah M. Ward, Karen E. Dill-Shackleford, and Micah O. Mazurek. 2018. Social Media Use and Happiness in Adults with Autism Spectrum Disorder. Cyberpsychology, Behavior, and Social Networking 21, 3: 205–209. https://doi.org/10.1089/cyber.2017.0331",
      "doi": ""
    },
    {
      "text": "Deborah M. Ward, Karen E. Dill-Shackleford, and Micah O. Mazurek. 2018. Social Media Use and Happiness in Adults with Autism Spectrum Disorder. Cyberpsychology, Behavior and Social Networking 21, 3: 205–209. https://doi.org/10.1089/cyber.2017.0331",
      "doi": ""
    },
    {
      "text": "Pamela Wisniewski, Heng Xu, Jack Carroll, and Mary Beth Rosson. 2013. Grand Challenges of Researching Adolescent Online Safety: A Family Systems Approach. Retrieved May 25, 2016 from http://aisel.aisnet.org/amcis2013/SocialTechnicalIssues/GeneralPresentations/10",
      "doi": ""
    },
    {
      "text": "Brian A. Zaboski and Eric A. Storch. 2018. Comorbid autism spectrum disorder and anxiety disorders: a brief review. Future Neurology 13, 1: 31–37. https://doi.org/10.2217/fnl-2017-0030",
      "doi": ""
    },
    {
      "text": "Yong Zhao and Wei Qiu. 2011. The Potential of Social Media for Students with Disabilities. In Breakthrough Teaching and Learning: How Educational and Assistive Technologies are Driving Innovation, Tracy Gray and Heidi Silver-Pacuilla (eds.). Springer, New York, NY, 71–86. https://doi.org/10.1007/978-1-4419-7768-7_5",
      "doi": ""
    },
    {
      "text": "Yuehua Zhao, Jin Zhang, and Yanyan Wang. 2017. Social media and autism support: Investigation on autism support groups on Facebook. https://doi.org/10.9776/17360",
      "doi": ""
    },
    {
      "text": "Annuska Zolyomi, Andrew Begel, Jennifer Frances Waldern, John Tang, Michael Barnett, Edward Cutrell, Daniel McDuff, Sean Andrist, and Meredith Ringel Morris. 2019. Managing Stress: The Needs of Autistic Adults in Video Calling. Proceedings of the ACM on Human-Computer Interaction 3, CSCW: 134:1-134:29. https://doi.org/10.1145/3359236",
      "doi": ""
    },
    {
      "text": "Annuska Zolyomi, Ridley Jones, and Tomer Kaftan. 2020. #ActuallyAutistic Sense-Making on Twitter. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’20), 1–4. https://doi.org/10.1145/3373625.3418001",
      "doi": "10.1145/3373625.3418001"
    },
    {
      "text": "Annuska Zolyomi and Jaime Snyder. 2021. Social-Emotional-Sensory Design Map for Affective Computing Informed by Neurodivergent Experiences. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1: 77:1-77:37. https://doi.org/10.1145/3449151",
      "doi": ""
    },
    {
      "text": "Jolene Zywica, Kimberly A. Richards, and Kim Gomez. 2011. Affordances of a scaffolded‐social learning network. On the Horizon 19, 1: 33–42. https://doi.org/10.1108/10748121111107690",
      "doi": ""
    },
    {
      "text": "Here's Why You Should STOP Using Functioning Labels. Retrieved January 7, 2022 from https://planningacrossthespectrum.com/blog/why-stop-using-functioning-labels/",
      "doi": ""
    },
    {
      "text": "Student Services: Transition Planning for your 18-22 Year Old. Sharon Public Schools. Retrieved April 25, 2019 from http://www.sharon.k12.ma.us/site/default.aspx?PageID=514",
      "doi": ""
    },
    {
      "text": "PatientsLikeMe. PatientsLikeMe. Retrieved May 17, 2019 from https://www.patientslikeme.com/",
      "doi": ""
    },
    {
      "text": "Asperger & Autism Forum Community Wrong Planet. Wrong Planet. Retrieved May 17, 2019 from https://wrongplanet.net/planning-family-vacation-autism-10-tips-success/",
      "doi": ""
    },
    {
      "text": "(1) ADHD + Aspergers dating! | Facebook. Retrieved January 10, 2022 from https://www.facebook.com/groups/122165315254",
      "doi": ""
    },
    {
      "text": "(1) Asperger's Spouses / Significant Others | Facebook. Retrieved January 10, 2022 from https://www.facebook.com/groups/AspergersRelationships",
      "doi": ""
    }
  ]
}