{
  "doi": "10.1145/3491102.3517523",
  "title": "Templates and Trust-o-meters: Towards a widely deployable indicator of trust in Wikipedia",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "The success of Wikipedia and other user-generated content communities has been driven by the openness of recruiting volunteers globally, but this openness has also led to a persistent lack of trust in its content. Despite several attempts at developing trust indicators to help readers more quickly and accurately assess the quality of content, challenges remain for practical deployment to general consumers. In this work we identify and address three key challenges: empirically determining which metrics from prior and existing community approaches most impact reader trust; 2) validating indicator placements and designs that are both compact yet noticed by readers; and 3) demonstrating that such indicators can not only lower trust but also increase perceived trust in the system when appropriate. By addressing these, we aim to provide a foundation for future tools that can practically increase trust in user generated content and the sociotechnical systems that generate and maintain them.",
  "authors": [
    {
      "name": "Andrew Kuznetsov",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528678",
      "orcid": "missing"
    },
    {
      "name": "Margeigh Novotny",
      "institution": "Wikimedia Foundation, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660232902",
      "orcid": "missing"
    },
    {
      "name": "Jessica Klein",
      "institution": "Wikimedia Foundation, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237122",
      "orcid": "missing"
    },
    {
      "name": "Diego Saez-Trumper",
      "institution": "Research, Wikimedia Foundation, Spain",
      "img": "/do/10.1145/contrib-81488668681/rel-imgonly/perfil1.jpg",
      "acmid": "81488668681",
      "orcid": "missing"
    },
    {
      "name": "Aniket Kittur",
      "institution": "Human Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81350583094/rel-imgonly/kittur_photo.jpg",
      "acmid": "81350583094",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2022. Wikipedia Pageview statistics. https://en.wikipedia.org/wiki/Wikipedia:Pageview_statistics",
      "doi": ""
    },
    {
      "text": "B Adler, Luca De Alfaro, and Ian Pye. 2010. Detecting wikipedia vandalism using wikitrust. Notebook papers of CLEF 1 (2010), 22–23.",
      "doi": ""
    },
    {
      "text": "B Thomas Adler. 2012. WikiTrust: content-driven reputation for the Wikipedia. Ph.D. Dissertation. UC Santa Cruz.",
      "doi": ""
    },
    {
      "text": "B Thomas Adler, Krishnendu Chatterjee, Luca De Alfaro, Marco Faella, Ian Pye, and Vishwanath Raman. 2008. Assigning trust to Wikipedia content. In Proceedings of the 4th International Symposium on Wikis. 1–12.",
      "doi": "10.1145/1822258.1822293"
    },
    {
      "text": "B Thomas Adler and Luca De Alfaro. 2007. A content-driven reputation system for the Wikipedia. In Proceedings of the 16th international conference on World Wide Web. 261–270.",
      "doi": "10.1145/1242572.1242608"
    },
    {
      "text": "Yochai Benkler. 2017. Peer production, the commons, and the future of the firm. Strategic Organization 15, 2 (2017), 264–274.",
      "doi": ""
    },
    {
      "text": "Jan Panero Benway. 1998. Banner blindness: The irony of attention grabbing on the World Wide Web. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 42. SAGE Publications Sage CA: Los Angeles, CA, 463–467.",
      "doi": ""
    },
    {
      "text": "Erik Borra, David Laniado, Esther Weltevrede, Michele Mauri, Giovanni Magni, Tommaso Venturini, Paolo Ciuccarelli, Richar Rogers, and Andreas Kaltenbrunner. 2015. A platform for visually exploring the development of Wikipedia articles. In Ninth International AAAI Conference on Web and Social Media. Citeseer.",
      "doi": ""
    },
    {
      "text": "Erik Borra, Esther Weltevrede, Paolo Ciuccarelli, Andreas Kaltenbrunner, David Laniado, Giovanni Magni, Michele Mauri, Richard Rogers, and Tommaso Venturini. 2015. Societal controversies in Wikipedia articles. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 193–196.",
      "doi": "10.1145/2702123.2702436"
    },
    {
      "text": "Erik Borra, Esther Weltevrede, Paolo Ciuccarelli, Andreas Kaltenbrunner, David Laniado, Giovanni Magni, Michele Mauri, Richard Rogers, Tommaso Venturini, 2014. Contropedia-the analysis and visualization of controversies in Wikipedia articles.. In OpenSym. 34–1.",
      "doi": ""
    },
    {
      "text": "Susan L Bryant, Andrea Forte, and Amy Bruckman. 2005. Becoming Wikipedian: transformation of participation in a collaborative online encyclopedia. In Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work. 1–10.",
      "doi": "10.1145/1099203.1099205"
    },
    {
      "text": "Erik Brynjolfsson, Felix Eggers, and Avinash Gannamaneni. 2018. Measuring welfare with massive online choice experiments: A brief introduction. In AEA Papers and Proceedings, Vol. 108. 473–76.",
      "doi": ""
    },
    {
      "text": "Fanny Chevalier, Stéphane Huot, and Jean-Daniel Fekete. 2010. Wikipediaviz: Conveying article quality for casual wikipedia readers. In 2010 IEEE Pacific Visualization Symposium (PacificVis). IEEE, 49–56.",
      "doi": ""
    },
    {
      "text": "Si-Chi Chin, W Nick Street, Padmini Srinivasan, and David Eichmann. 2010. Detecting Wikipedia vandalism with active learning and statistical language models. In Proceedings of the 4th workshop on Information credibility. 3–10.",
      "doi": "10.1145/1772938.1772942"
    },
    {
      "text": "Dan Cosley, Dan Frankowski, Loren Terveen, and John Riedl. 2007. SuggestBot: using intelligent task routing to help people find work in wikipedia. In Proceedings of the 12th international conference on Intelligent user interfaces. 32–41.",
      "doi": "10.1145/1216295.1216309"
    },
    {
      "text": "Quang Vinh Dang and Claudia-Lavinia Ignat. 2016. Quality assessment of wikipedia articles without feature engineering. In Proceedings of the 16th ACM/IEEE-CS on Joint Conference on Digital Libraries. 27–30.",
      "doi": "10.1145/2910896.2910917"
    },
    {
      "text": "Peter Denning, Jim Horning, David Parnas, and Lauren Weinstein. 2005. Wikipedia risks. Commun. ACM 48, 12 (2005), 152–152.",
      "doi": "10.1145/1101779.1101804"
    },
    {
      "text": "Pierpaolo Dondio, Stephen Barrett, Stefan Weber, and Jean Marc Seigneur. 2006. Extracting trust from domain analysis: A case study on the wikipedia project. In International Conference on Autonomic and Trusted Computing. Springer, 362–373.",
      "doi": "10.1007/11839569_35"
    },
    {
      "text": "Kimberly D Elsbach and Greg Elofson. 2000. How the packaging of decision explanations affects perceptions of trustworthiness. Academy of Management Journal 43, 1 (2000), 80–89.",
      "doi": ""
    },
    {
      "text": "Andrew J Flanagin and Miriam J Metzger. 2011. From Encyclopaedia Britannica to Wikipedia: Generational differences in the perceived credibility of online encyclopedia information. Information, Communication & Society 14, 3 (2011), 355–374.",
      "doi": ""
    },
    {
      "text": "Brian J Fogg, Cathy Soohoo, David R Danielson, Leslie Marable, Julianne Stanford, and Ellen R Tauber. 2003. How do users evaluate the credibility of Web sites? A study with over 2,500 participants. In Proceedings of the 2003 conference on Designing for user experiences. 1–15.",
      "doi": "10.1145/997078.997097"
    },
    {
      "text": "Brian J Fogg and Hsiang Tseng. 1999. The elements of computer credibility. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 80–87.",
      "doi": "10.1145/302979.303001"
    },
    {
      "text": "Mihai Georgescu, Nattiya Kanhabua, Daniel Krause, Wolfgang Nejdl, and Stefan Siersdorfer. 2013. Extracting event-related information from article updates in wikipedia. In European Conference on Information Retrieval. Springer, 254–266.",
      "doi": "10.1007/978-3-642-36973-5_22"
    },
    {
      "text": "Yolanda Gil and Donovan Artz. 2007. Towards content trust of web resources. Journal of Web Semantics 5, 4 (2007), 227–239.",
      "doi": "10.1016/j.websem.2007.09.005"
    },
    {
      "text": "Jim Giles. 2005. Internet encyclopaedias go head to head.",
      "doi": ""
    },
    {
      "text": "Ruediger Glott, Philipp Schmidt, and Rishab Ghosh. 2010. Wikipedia survey–overview of results. United Nations University: Collaborative Creativity Group 8 (2010), 1158–1178.",
      "doi": ""
    },
    {
      "text": "Shane Greenstein and Feng Zhu. 2018. Do experts or crowd-based models produce more bias? Evidence from encyclopædia britannica and wikipedia. Mis Quarterly (2018).",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker and R Stuart Geiger. 2019. ORES: Lowering Barriers with Participatory Machine Learning in Wikipedia. arXiv preprint arXiv:1909.05189(2019).",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker, Bryan Song, D Alex Stuart, Aniket Kittur, and John Riedl. 2011. NICE: Social translucence through UI intervention. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration. 101–104.",
      "doi": "10.1145/2038558.2038575"
    },
    {
      "text": "Stephen Harrison. 2020. Twitter wants to use wikipedia to help determine who gets a blue checkmark. https://slate.com/technology/2020/12/twitter-checkmark-verification-wikipedia-notability.html",
      "doi": ""
    },
    {
      "text": "Marit Hinnosaar, Toomas Hinnosaar, Michael E Kummer, and Olga Slivko. 2019. Wikipedia matters. Available at SSRN 3046400(2019).",
      "doi": ""
    },
    {
      "text": "Paul Hitlin. 2016. Turkers in this canvassing: young, well-educated and frequent users. Pew Research Center 437(2016).",
      "doi": ""
    },
    {
      "text": "Meiqun Hu, Ee-Peng Lim, Aixin Sun, Hady Wirawan Lauw, and Ba-Quy Vuong. 2007. Measuring article quality in wikipedia: models and evaluation. In Proceedings of the sixteenth ACM conference on Conference on information and knowledge management. 243–252.",
      "doi": "10.1145/1321440.1321476"
    },
    {
      "text": "Panagiotis G Ipeirotis. 2010. Demographics of mechanical turk. (2010).",
      "doi": ""
    },
    {
      "text": "Matthew L Jensen, Paul Benjamin Lowry, and Jeffrey L Jenkins. 2011. Effects of automated and participative decision support in computer-aided credibility assessment. Journal of Management Information Systems 28, 1 (2011), 201–234.",
      "doi": "10.2753/MIS0742-1222280107"
    },
    {
      "text": "Grace YoungJoo Jeon and Soo Young Rieh. 2014. Answers from the crowd: how credible are strangers in social Q&A?IConference 2014 Proceedings(2014).",
      "doi": ""
    },
    {
      "text": "Johan Jessen and Anker Helms Jørgensen. 2012. Aggregated trustworthiness: Redefining online credibility through social validation. First Monday (2012).",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Darren Scott Appling, Eric Gilbert, and Amy Bruckman. 2019. ” Did You Suspect the Post Would be Removed?” Understanding User Reactions to Content Removals on Reddit. Proceedings of the ACM on human-computer interaction 3, CSCW(2019), 1–33.",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Amy Bruckman, and Eric Gilbert. 2019. Does transparency in moderation really matter? User behavior after content removal explanations on reddit. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–27.",
      "doi": ""
    },
    {
      "text": "Kari Kelton, Kenneth R Fleischmann, and William A Wallace. 2008. Trust in digital information. Journal of the American Society for Information Science and Technology 59, 3 (2008), 363–374.",
      "doi": ""
    },
    {
      "text": "Aniket Kittur and Robert E Kraut. 2008. Harnessing the wisdom of crowds in wikipedia: quality through coordination. In Proceedings of the 2008 ACM conference on Computer supported cooperative work. 37–46.",
      "doi": "10.1145/1460563.1460572"
    },
    {
      "text": "Aniket Kittur, Bongwon Suh, and Ed H Chi. 2008. Can you ever trust a Wiki? Impacting perceived trustworthiness in Wikipedia. In Proceedings of the 2008 ACM conference on Computer supported cooperative work. 477–480.",
      "doi": "10.1145/1460563.1460639"
    },
    {
      "text": "Vasilis Kostakis and Marios Papachristou. 2014. Commons-based peer production and digital fabrication: The case of a RepRap-based, Lego-built 3D printing-milling machine. Telematics and Informatics 31, 3 (2014), 434–443.",
      "doi": "10.1016/j.tele.2013.09.006"
    },
    {
      "text": "Mark Kramer, Andy Gregorowicz, and Bala Iyer. 2008. Wiki trust metrics based on phrasal analysis. In Proceedings of the 4th International Symposium on Wikis. 1–10.",
      "doi": "10.1145/1822258.1822291"
    },
    {
      "text": "Travis Kriplean, Ivan Beschastnikh, and David W McDonald. 2008. Articulations of wikiwork: uncovering valued work in wikipedia through barnstars. In Proceedings of the 2008 ACM conference on Computer supported cooperative work. 47–56.",
      "doi": "10.1145/1460563.1460573"
    },
    {
      "text": "Sanne Kruikemeier and Sophie Lecheler. 2018. News consumer perceptions of new journalistic sourcing techniques. Journalism Studies 19, 5 (2018), 632–649.",
      "doi": ""
    },
    {
      "text": "Srijan Kumar, Justin Cheng, Jure Leskovec, and VS Subrahmanian. 2017. An army of me: Sockpuppets in online discussion communities. In Proceedings of the 26th International Conference on World Wide Web. 857–866.",
      "doi": "10.1145/3038912.3052677"
    },
    {
      "text": "Zui Chih Lee and Jennifer Yurchisin. 2011. The impact of website attractiveness, consumer-website identification, and website trustworthiness on purchase intention. International Journal of Electronic Customer Relationship Management 5, 3-4(2011), 272–287.",
      "doi": ""
    },
    {
      "text": "Kevin E Levay, Jeremy Freese, and James N Druckman. 2016. The demographic and political composition of Mechanical Turk samples. Sage Open 6, 1 (2016), 2158244016636433.",
      "doi": ""
    },
    {
      "text": "Sook Lim. 2013. College students’ credibility judgments and heuristics concerning Wikipedia. Information Processing & Management 49, 2 (2013), 405–419.",
      "doi": "10.1016/j.ipm.2012.10.004"
    },
    {
      "text": "Teun Lucassen, Rienco Muilwijk, Matthijs L Noordzij, and Jan Maarten Schraagen. 2013. Topic familiarity and information skills in online credibility evaluation. Journal of the American Society for Information Science and Technology 64, 2 (2013), 254–264.",
      "doi": "10.1002/asi.22743"
    },
    {
      "text": "Teun Lucassen, Matthijs L Noordzij, and Jan Maarten Schraagen. 2011. Reference blindness: The influence of references on trust in Wikipedia. (2011).",
      "doi": ""
    },
    {
      "text": "Teun Lucassen and Jan Maarten Schraagen. 2010. Trust in wikipedia: how users trust information from an unknown source. In Proceedings of the 4th workshop on Information credibility. 19–26.",
      "doi": "10.1145/1772938.1772944"
    },
    {
      "text": "Teun Lucassen and Jan Maarten Schraagen. 2011. Evaluating WikiTrust: A trust support tool for Wikipedia. First Monday (2011).",
      "doi": ""
    },
    {
      "text": "Teun Lucassen and Jan Maarten Schraagen. 2012. The role of topic familiarity in online credibility evaluation support. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 56. SAGE Publications Sage CA: Los Angeles, CA, 1233–1237.",
      "doi": ""
    },
    {
      "text": "Brendan Luyt, Tay Chee Hsien Aaron, Lim Hai Thian, and Cheng Kian Hong. 2008. Improving Wikipedia’s accuracy: Is edit age a solution?Journal of the American Society for Information Science and Technology 59, 2 (2008), 318–330.",
      "doi": ""
    },
    {
      "text": "Connor McMahon, Isaac Johnson, and Brent Hecht. 2017. The substantial interdependence of Wikipedia and Google: A case study on the relationship between peer production communities and information technologies. In Eleventh International AAAI Conference on Web and Social Media.",
      "doi": ""
    },
    {
      "text": "Ericka Menchen-Trevino and Eszter Hargittai. 2011. YOUNG ADULTS’CREDIBILITY ASSESSMENT OF WIKIPEDIA. Information, Communication & Society 14, 1 (2011), 24–51.",
      "doi": ""
    },
    {
      "text": "Miriam J Metzger, Andrew J Flanagin, and Ryan B Medders. 2010. Social and heuristic approaches to credibility evaluation online. Journal of communication 60, 3 (2010), 413–439.",
      "doi": ""
    },
    {
      "text": "Jason Mittell. 2012. Wikis and participatory fandom. In The participatory cultures handbook. Routledge, 53–60.",
      "doi": ""
    },
    {
      "text": "Jarkko Moilanen and Tere Vadén. 2013. 3D printing community and emerging practices of peer production. First Monday (2013).",
      "doi": ""
    },
    {
      "text": "Jonathan Morgan and Dario Taraborelli. 2019. Research directions towards the Wikimedia 2030 strategy. https://wikimediafoundation.org/news/2019/02/14/research-directions-towards-the-wikimedia-2030-strategy/",
      "doi": ""
    },
    {
      "text": "Jonathan T Morgan, Siko Bouterse, Heather Walls, and Sarah Stierch. 2013. Tea and sympathy: crafting positive new user experiences on wikipedia. In Proceedings of the 2013 conference on Computer supported cooperative work. 839–848.",
      "doi": "10.1145/2441776.2441871"
    },
    {
      "text": "Garrett Morrow, Briony Swire-Thompson, Jessica Polny, Matthew Kopec, and John Wihbey. 2020. The Emerging Science of Content Labeling: Contextualizing Social Media Content Moderation. Available at SSRN (2020).",
      "doi": ""
    },
    {
      "text": "Sai T Moturu and Huan Liu. 2009. Evaluating the trustworthiness of Wikipedia articles through quality and credibility. In Proceedings of the 5th international symposium on wikis and open collaboration. 1–2.",
      "doi": "10.1145/1641309.1641349"
    },
    {
      "text": "Sarah Myers West. 2018. Censored, suspended, shadowbanned: User interpretations of content moderation on social media platforms. New Media & Society 20, 11 (2018), 4366–4383.",
      "doi": ""
    },
    {
      "text": "Jason RC Nurse, Sadie Creese, Michael Goldsmith, and Koen Lamberts. 2012. Using information trustworthiness advice in decision making. In 2012 Workshop on Socio-Technical Aspects in Security and Trust. IEEE, 35–42.",
      "doi": "10.1109/STAST.2012.10"
    },
    {
      "text": "Jason RC Nurse, Syed Sadiqur Rahman, Sadie Creese, Michael Goldsmith, and Koen Lamberts. 2011. Information quality and trustworthiness: A topical state-of-the-art review. (2011).",
      "doi": ""
    },
    {
      "text": "Samantha R Paige, Janice L Krieger, and Michael L Stellefson. 2017. The influence of eHealth literacy on perceived trust in online health communication channels and sources. Journal of health communication 22, 1 (2017), 53–65.",
      "doi": ""
    },
    {
      "text": "Katherine Panciera, Aaron Halfaker, and Loren Terveen. 2009. Wikipedians are born, not made: a study of power editors on Wikipedia. In Proceedings of the ACM 2009 international conference on Supporting group work. 51–60.",
      "doi": "10.1145/1531674.1531682"
    },
    {
      "text": "Kartikey Pant, Tanvi Dadu, and Radhika Mamidi. 2020. Towards detection of subjective bias using contextualized word embeddings. In Companion Proceedings of the Web Conference 2020. 75–76.",
      "doi": "10.1145/3366424.3382704"
    },
    {
      "text": "Gabriele Paolacci and Jesse Chandler. 2014. Inside the Turk: Understanding Mechanical Turk as a participant pool. Current Directions in Psychological Science 23, 3 (2014), 184–188.",
      "doi": ""
    },
    {
      "text": "Jarutas Pattanaphanchai, Kieron O’Hara, and Wendy Hall. 2013. Trustworthiness criteria for supporting users to assess the credibility of web information. In Proceedings of the 22nd International Conference on World Wide Web. 1123–1130.",
      "doi": "10.1145/2487788.2488132"
    },
    {
      "text": "Peter Pirolli, Evelin Wollny, and Bongwon Suh. 2009. So you know you’re getting the best possible information: a tool that increases Wikipedia credibility. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1505–1508.",
      "doi": "10.1145/1518701.1518929"
    },
    {
      "text": "Russell A Poldrack, Aniket Kittur, Donald Kalar, Eric Miller, Christian Seppa, Yolanda Gil, D Stott Parker, Fred W Sabb, and Robert M Bilder. 2011. The cognitive atlas: toward a knowledge foundation for cognitive neuroscience. Frontiers in neuroinformatics 5 (2011), 17.",
      "doi": ""
    },
    {
      "text": "Nicholas Reimann. 2020. Twitter fact-checks President Trump for the first time. https://www.forbes.com/sites/nicholasreimann/2020/05/26/twitter-fact-checks-president-trump-for-the-first-time/?sh=4a98a4612905",
      "doi": ""
    },
    {
      "text": "Antonio J Reinoso, Rocıo Munoz-Mansilla, Israel Herraiz, and Felipe Ortega. 2012. Characterization of the Wikipedia traffic. In ICIW 2012: Seventh International Conference on Internet and Web Applications and Services. 156–162.",
      "doi": ""
    },
    {
      "text": "Elena Rocco. 1998. Trust breaks down in electronic contexts but can be repaired by some initial face-to-face contact. In Proceedings of the SIGCHI conference on Human factors in computing systems. 496–502.",
      "doi": "10.1145/274644.274711"
    },
    {
      "text": "Camille Roth, Dario Taraborelli, and Nigel Gilbert. 2008. Measuring wiki viability: an empirical assessment of the social dynamics of a large sample of wikis. In Proceedings of the 4th International Symposium on Wikis. 1–5.",
      "doi": "10.1145/1822258.1822294"
    },
    {
      "text": "Diego Saez-Trumper. 2019. Online disinformation and the role of wikipedia. arXiv preprint arXiv:1910.12596(2019).",
      "doi": ""
    },
    {
      "text": "C Estelle Smith, Bowen Yu, Anjali Srivastava, Aaron Halfaker, Loren Terveen, and Haiyi Zhu. 2020. Keeping Community in the Loop: Understanding Wikipedia Stakeholder Values for Machine Learning-Based Systems. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376783"
    },
    {
      "text": "Rebecca Solnit. 2010. A paradise built in hell: The extraordinary communities that arise in disaster. Penguin.",
      "doi": ""
    },
    {
      "text": "Bongwon Suh, Ed H Chi, Aniket Kittur, and Bryan A Pendleton. 2008. Lifting the veil: improving accountability and social transparency in Wikipedia with wikidashboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1037–1040.",
      "doi": "10.1145/1357054.1357214"
    },
    {
      "text": "Marsha Ann Tate. 2018. Web wisdom: How to evaluate and create information quality on the Web. CRC Press.",
      "doi": ""
    },
    {
      "text": "W Ben Towne, Aniket Kittur, Peter Kinnaird, and James Herbsleb. 2013. Your process is showing: controversy management and perceived quality in wikipedia. In Proceedings of the 2013 conference on Computer supported cooperative work. 1059–1068.",
      "doi": "10.1145/2441776.2441896"
    },
    {
      "text": "Victor A Tsygankov. 2004. Evaluation of website trustworthiness from customer perspective, a framework. In Proceedings of the 6th international conference on Electronic commerce. 265–271.",
      "doi": "10.1145/1052220.1052254"
    },
    {
      "text": "Dirk Van Der Linden, Emma Williams, Joseph Hallett, and Awais Rashid. 2020. The impact of surface features on choice of (in) secure answers by Stackoverflow readers. IEEE Transactions on Software Engineering(2020), 1–1.",
      "doi": ""
    },
    {
      "text": "Nicholas Vincent, Isaac Johnson, and Brent Hecht. 2018. Examining Wikipedia with a broader lens: Quantifying the value of Wikipedia’s relationships with other large-scale online communities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3174140"
    },
    {
      "text": "Simon Waldman. 2004. Who knows. The Guardian 26(2004).",
      "doi": ""
    },
    {
      "text": "John Wihbey, Garrett Morrow, Myojung Chung, and Mike Peacey. 2021. The Bipartisan Case for Labeling as a Content Moderation Method: Findings from a National Survey. Available at SSRN (2021).",
      "doi": ""
    },
    {
      "text": "Thomas Wöhner and Ralf Peters. 2009. Assessing the quality of Wikipedia articles with lifecycle based metrics. In Proceedings of the 5th International Symposium on Wikis and Open Collaboration. 1–10.",
      "doi": "10.1145/1641309.1641333"
    },
    {
      "text": "Diyi Yang, Aaron Halfaker, Robert Kraut, and Eduard Hovy. 2016. Who did what: Editor role identification in Wikipedia. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 10.",
      "doi": ""
    },
    {
      "text": "Heng-Li Yang and Cheng-Yu Lai. 2010. Motivations of Wikipedia content contributors. Computers in human behavior 26, 6 (2010), 1377–1383.",
      "doi": ""
    },
    {
      "text": "Tae Yano and Moonyoung Kang. 2016. Taking advantage of wikipedia in natural language processing. Technical Report. Technical report, Carnegie Mellon University Language Technologies Institute.",
      "doi": ""
    },
    {
      "text": "Honglei Zeng, Maher A Alhossaini, Li Ding, Richard Fikes, and Deborah L McGuinness. 2006. Computing trust from revision history. Technical Report. Stanford Univ Ca Knowledge Systems LAB.",
      "doi": ""
    }
  ]
}