{
  "doi": "10.1145/3491102.3517490",
  "title": "“It Feels Like Taking a Gamble”: Exploring Perceptions, Practices, and Challenges of Using Makeup and Cosmetics for People with Visual Impairments",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "Makeup and cosmetics offer the potential for self-expression and the reshaping of social roles for visually impaired people. However, there exist barriers to conducting a beauty regime because of the reliance on visual information and color variances in makeup. We present a content analysis of 145 YouTube videos to demonstrate visually impaired individuals’ unique practices before, during, and after doing makeup. Based on the makeup practices, we then conducted semi-structured interviews with 12 visually impaired people to discuss their perceptions of and challenges with the makeup process in more depth. Overall, through our findings and discussion, we present novel perceptions of makeup from visually impaired individuals (e.g., broader representations of blindness and beauty). The existing challenges provide opportunities for future research to address learning barriers, insufficient feedback, and physical and environmental barriers, making the experience of doing makeup more accessible to people with visual impairments.",
  "authors": [
    {
      "name": "Franklin Mingzhe Li",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-99659463523/rel-imgonly/citations.jpg",
      "acmid": "99659463523",
      "orcid": "0000-0003-4995-4545"
    },
    {
      "name": "Franchesca Spektor",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659442213",
      "orcid": "missing"
    },
    {
      "name": "Meng Xia",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659274880",
      "orcid": "missing"
    },
    {
      "name": "Mina Huh",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700740",
      "orcid": "0000-0002-0031-9180"
    },
    {
      "name": "Peter Cederberg",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659894702",
      "orcid": "missing"
    },
    {
      "name": "Yuqi Gong",
      "institution": "School of Computer Science, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239648",
      "orcid": "missing"
    },
    {
      "name": "Kristen Shinohara",
      "institution": "School of Information, Rochester Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319501668",
      "orcid": "0000-0002-1157-6369"
    },
    {
      "name": "Patrick Carrington",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81549308756/rel-imgonly/199a1731.jpg",
      "acmid": "81549308756",
      "orcid": "0000-0001-8923-0803"
    }
  ],
  "references": [
    {
      "text": "Dragan Ahmetovic, Cole Gleason, Chengxiong Ruan, Kris Kitani, Hironobu Takagi, and Chieko Asakawa. 2016. NavCog: a navigational cognitive assistant for the blind. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services. 90–99.",
      "doi": "10.1145/2935334.2935361"
    },
    {
      "text": "Aira. 2014. Home - Aira : Aira. https://aira.io/. (Accessed on 06/14/2021).",
      "doi": ""
    },
    {
      "text": "Hend S Al-Khalifa. 2008. Utilizing QR code and mobile phones for blinds and visually impaired people. In International Conference on Computers for Handicapped Persons. Springer, 1065–1069.",
      "doi": "10.1007/978-3-540-70540-6_159"
    },
    {
      "text": "Taleb Alashkar, Songyao Jiang, and Yun Fu. 2017. Rule-based facial makeup recommendation system. In 2017 12th IEEE International Conference on Automatic Face & Gesture Recognition (FG 2017). IEEE, 325–330.",
      "doi": "10.1109/FG.2017.47"
    },
    {
      "text": "Saleh Alghamdi, Ron Van Schyndel, and Ahmed Alahmadi. 2013. Indoor navigational aid using active RFID and QR-code for sighted and blind people. In 2013 IEEE Eighth International Conference on Intelligent Sensors, Sensor Networks and Information Processing. IEEE, 18–22.",
      "doi": ""
    },
    {
      "text": "Yelena Moroz Alpert. 2021. How to Build the Ultimate Capsule Makeup Collection | Real Simple. https://www.realsimple.com/beauty-fashion/makeup/capsule-makeup-collection. (Accessed on 12/20/2021).",
      "doi": ""
    },
    {
      "text": "Lisa Anthony, YooJin Kim, and Leah Findlater. 2013. Analyzing user-generated youtube videos to understand touchscreen use by people with motor impairments. In Proceedings of the SIGCHI conference on human factors in computing systems. 1223–1232.",
      "doi": "10.1145/2470654.2466158"
    },
    {
      "text": "BeMyEyes. 2015. Be My Eyes - See the world together. https://www.bemyeyes.com/. (Accessed on 06/14/2021).",
      "doi": ""
    },
    {
      "text": "Cynthia L Bennett, Jane E, Martez E Mott, Edward Cutrell, and Meredith Ringel Morris. 2018. How teens with visual impairments take, edit, and share photos on social media. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3173574.3173650"
    },
    {
      "text": "Jeffrey P Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, 2010. Vizwiz: nearly real-time answers to visual questions. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. 333–342.",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "James C Bliss, Michael H Katcher, Charles H Rogers, and Raymond P Shepard. 1970. Optical-to-tactile image conversion for the blind. IEEE Transactions on Man-Machine Systems 11, 1 (1970), 58–65.",
      "doi": ""
    },
    {
      "text": "Erin Brady, Meredith Ringel Morris, Yu Zhong, Samuel White, and Jeffrey P Bigham. 2013. Visual challenges in the everyday lives of blind people. In Proceedings of the SIGCHI conference on human factors in computing systems. 2117–2126.",
      "doi": "10.1145/2470654.2481291"
    },
    {
      "text": "Molly Burke. 2014. Molly Burke - YouTube. https://www.youtube.com/channel/UCwf9TcLyS5KDoLRLjke41Hg. (Accessed on 09/07/2021).",
      "doi": ""
    },
    {
      "text": "Fiona Campbell. 2009. Contours of ableism: The production of disability and abledness. Springer.",
      "doi": ""
    },
    {
      "text": "Jaime Carvalho, Tiago Guerreiro, Luis Duarte, and Luis Carriço. 2012. Audio-based puzzle gaming for blind people. In Proceedings of the Mobile Accessibility Workshop at MobileHCI (MOBACC). Citeseer.",
      "doi": ""
    },
    {
      "text": "Eliza Chandler and Esther Ignagni. 2018. Strange beauty: Aesthetic possibilities for desiring disability into the future. In Interdisciplinary Approaches to Disability. Routledge, 255–265.",
      "doi": ""
    },
    {
      "text": "Minsuk Chang, Mina Huh, and Juho Kim. 2021. RubySlippers: Supporting Content-based Voice Navigation for How-to Videos. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445131"
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory: A practical guide through qualitative analysis. sage.",
      "doi": ""
    },
    {
      "text": "Ricardo Chincha and YingLi Tian. 2011. Finding objects for blind people based on SURF features. In 2011 IEEE International Conference on Bioinformatics and Biomedicine Workshops (BIBMW). IEEE, 526–527.",
      "doi": "10.1109/BIBMW.2011.6112423"
    },
    {
      "text": "Toby Chong, Nolwenn Maudet, Katsuki Harima, and Takeo Igarashi. 2021. Exploring a Makeup Support System for Transgender Passing based on Automatic Gender Recognition. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445364"
    },
    {
      "text": "James M Coughlan and Joshua Miele. 2017. AR4VI: AR as an accessibility tool for people with visual impairments. In 2017 IEEE International Symposium on Mixed and Augmented Reality (ISMAR-Adjunct). IEEE, 288–292.",
      "doi": ""
    },
    {
      "text": "Kirsten Dellinger and Christine L Williams. 1997. Makeup at work: Negotiating appearance rules in the workplace. Gender & Society 11, 2 (1997), 151–177.",
      "doi": ""
    },
    {
      "text": "Samruddhi Deshpande and Revati Shriram. 2016. Real time text detection and recognition on hand held objects to assist blind people. In 2016 International Conference on Automatic Control and Dynamic Optimization Techniques (ICACDOT). IEEE, 1020–1024.",
      "doi": ""
    },
    {
      "text": "Lucy Edwards. [n.d.]. Lucy Edwards - YouTube. https://www.youtube.com/channel/UChhMknOcAZOQXC1rh0ler-Q. (Accessed on 12/21/2021).",
      "doi": ""
    },
    {
      "text": "Lucy Edwards. 2009. Lucy Edwards - YouTube. https://www.youtube.com/c/lucyedwards/featured. (Accessed on 09/07/2021).",
      "doi": ""
    },
    {
      "text": "Mordecai Cohen Ettinger. 2018. Disability Justice and Beauty as a Liberatory Practice. WSQ: Women’s Studies Quarterly 46, 1 (2018), 237–240.",
      "doi": ""
    },
    {
      "text": "Giovanni Fusco, Ender Tekin, Richard E Ladner, and James M Coughlan. 2014. Using computer vision to access appliance displays. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility. 281–282.",
      "doi": "10.1145/2661334.2661404"
    },
    {
      "text": "Langis Gagnon, Samuel Foucher, Maguelonne Heritier, Marc Lalonde, David Byrns, Claude Chapdelaine, James Turner, Suzanne Mathieu, Denis Laurendeau, Nath Tan Nguyen, 2009. Towards computer-vision software tools to increase production and accessibility of video description for people with vision loss. Universal Access in the Information Society 8, 3 (2009), 199–218.",
      "doi": "10.1007/s10209-008-0141-0"
    },
    {
      "text": "Elodie Gentina, Kay M Palan, and Marie-Hélène Fosse-Gomez. 2012. The practice of using makeup: A consumption ritual of adolescent girls. Journal of Consumer Behaviour 11, 2 (2012), 115–123.",
      "doi": ""
    },
    {
      "text": "Kshitij Gulati, Gaurav Verma, Mukesh Mohania, and Ashish Kundu. 2021. BeautifAI–A Personalised Occasion-oriented Makeup Recommendation System. arXiv preprint arXiv:2109.06072(2021).",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Xiang’Anthony’ Chen, Haoran Qi, Samuel White, Suman Ghosh, Chieko Asakawa, and Jeffrey P Bigham. 2016. Vizlens: A robust and interactive screen reader for interfaces in the real world. In Proceedings of the 29th annual symposium on user interface software and technology. 651–664.",
      "doi": "10.1145/2984511.2984518"
    },
    {
      "text": "Anhong Guo, Jeeeun Kim, Xiang’Anthony’ Chen, Tom Yeh, Scott E Hudson, Jennifer Mankoff, and Jeffrey P Bigham. 2017. Facade: Auto-generating tactile interfaces to appliances. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 5826–5838.",
      "doi": "10.1145/3025453.3025845"
    },
    {
      "text": "Danna Gurari, Qing Li, Abigale J Stangl, Anhong Guo, Chi Lin, Kristen Grauman, Jiebo Luo, and Jeffrey P Bigham. 2018. Vizwiz grand challenge: Answering visual questions from blind people. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 3608–3617.",
      "doi": ""
    },
    {
      "text": "Rex Hartson and Pardha S Pyla. 2012. The UX Book: Process and guidelines for ensuring a quality user experience. Elsevier.",
      "doi": "10.5555/2207824"
    },
    {
      "text": "Liang He, Zijian Wan, Leah Findlater, and Jon E Froehlich. 2017. TacTILE: a preliminary toolchain for creating accessible graphics with 3D-printed overlays and auditory annotations. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. 397–398.",
      "doi": "10.1145/3132525.3134818"
    },
    {
      "text": "Sarah Heiss. 2011. Locating the bodies of women and disability in definitions of beauty: An analysis of Dove’s campaign for real beauty. Disability Studies Quarterly 31, 1 (2011).",
      "doi": ""
    },
    {
      "text": "Jaylin Herskovitz, Jason Wu, Samuel White, Amy Pavel, Gabriel Reyes, Anhong Guo, and Jeffrey P Bigham. 2020. Making mobile augmented reality applications accessible. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. 1–14.",
      "doi": "10.1145/3373625.3417006"
    },
    {
      "text": "Leona Holloway, Kim Marriott, and Matthew Butler. 2018. Accessible maps for the blind: Comparing 3D printed models with tactile graphics. In Proceedings of the 2018 chi conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3173772"
    },
    {
      "text": "Holly. 2018. Blind Girl Make-up Tips and Tricks - Life of a Blind Girl. https://lifeofablindgirl.com/2018/07/29/blind-girl-make-up-tips-and-tricks/. (Accessed on 09/07/2021).",
      "doi": ""
    },
    {
      "text": "Amy Hurst. 2019. Fabrication, 3D Printing, and Making. In Web Accessibility. Springer, 755–776.",
      "doi": ""
    },
    {
      "text": "Junichi Ishikiriyama and Kenji Suzuki. 2017. An interactive virtual mirror to support makeup for visually impaired persons. In 2017 IEEE International Conference on Systems, Man, and Cybernetics (SMC). IEEE, 1393–1398.",
      "doi": "10.1109/SMC.2017.8122808"
    },
    {
      "text": "Hanen Jabnoun, Faouzi Benzarti, and Hamid Amiri. 2014. Object recognition for blind people based on features extraction. In International Image Processing, Applications and Systems Conference. IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Lottie Jackson. 2019. The Rise Of Disability Friendly Beauty Brands | British Vogue. https://www.vogue.co.uk/beauty/article/the-rise-of-disability-friendly-beauty-brands. (Accessed on 06/14/2021).",
      "doi": ""
    },
    {
      "text": "Jhilmil Jain and Nina Bhatti. 2009. Imaging-based cosmetics advisory service. In CHI’09 Extended Abstracts on Human Factors in Computing Systems. 3781–3786.",
      "doi": ""
    },
    {
      "text": "Jaanvi Jairath and Rhea Daima. [n.d.]. Role of Pop Culture in Popularizing Gender-Bending Fashion and Ideals of Beauty and Makeup. International Journal 1, 3 ([n. d.]).",
      "doi": ""
    },
    {
      "text": "Chandrika Jayant, Hanjie Ji, Samuel White, and Jeffrey P Bigham. 2011. Supporting blind photography. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility. 203–210.",
      "doi": "10.1145/2049536.2049573"
    },
    {
      "text": "Alison Kafer. 2019. Crip kin, manifesting. Catalyst: Feminism, theory, technoscience 5, 1 (2019), 1–37.",
      "doi": ""
    },
    {
      "text": "Hsin-Liu Kao, Manisha Mohan, Chris Schmandt, Joseph A Paradiso, and Katia Vega. 2016. Chromoskin: Towards interactive cosmetics using thermochromic pigments. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 3703–3706.",
      "doi": "10.1145/2851581.2890270"
    },
    {
      "text": "Ümit Kennedy. 2016. Exploring YouTube as a transformative tool in the “The Power of MAKEUP!” movement. M/C Journal 19, 4 (2016).",
      "doi": ""
    },
    {
      "text": "Mohammad Kianpisheh, Franklin Mingzhe Li, and Khai N Truong. 2019. Face recognition assistant for people with visual impairments. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 3 (2019), 1–24.",
      "doi": "10.1145/3351248"
    },
    {
      "text": "Masatomo Kobayashi, Kentarou Fukuda, Hironobu Takagi, and Chieko Asakawa. 2009. Providing synthesized audio description for online videos. In Proceedings of the 11th international ACM SIGACCESS conference on Computers and accessibility. 249–250.",
      "doi": "10.1145/1639642.1639699"
    },
    {
      "text": "Aida Komkaite, Liga Lavrinovica, Maria Vraka, and Mikael B Skov. 2019. Underneath the Skin: An Analysis of YouTube Videos to Understand Insertable Device Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300444"
    },
    {
      "text": "Rodolphe Korichi and Delphine Pelle-de Queral. 2008. Why women use makeup: Implication of psychological. Journal of cosmetic science 59 (2008), 127–137.",
      "doi": ""
    },
    {
      "text": "Kohl Kreatives. [n.d.]. Kohl Kreatives. https://www.kohlkreatives.com/. (Accessed on 12/17/2021).",
      "doi": ""
    },
    {
      "text": "Aleksandra Królak, Weiqin Chen, Norun C Sanderson, and Siri Kessel. 2017. The accessibility of MOOCs for blind learners. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. 401–402.",
      "doi": "10.1145/3132525.3134796"
    },
    {
      "text": "Martin Kurze. 1996. TDraw: a computer-based tactile drawing tool for blind people. In Proceedings of the second annual ACM conference on Assistive technologies. 131–138.",
      "doi": "10.1145/228347.228368"
    },
    {
      "text": "Jonathan Lazar, Abiodun Olalere, and Brian Wentz. 2012. Investigating the accessibility and usability of job application web sites for blind users. Journal of Usability Studies 7, 2 (2012), 68–87.",
      "doi": "10.5555/2835476.2835479"
    },
    {
      "text": "Franklin Mingzhe Li, Di Laura Chen, Mingming Fan, and Khai N Truong. 2019. FMT: A wearable camera-based object tracking memory aid for older adults. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 3 (2019), 1–25.",
      "doi": "10.1145/3300961"
    },
    {
      "text": "Franklin Mingzhe Li, Di Laura Chen, Mingming Fan, and Khai N Truong. 2021. “I Choose Assistive Devices That Save My Face” A Study on Perceptions of Accessibility and Assistive Technology Use Conducted in China. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445321"
    },
    {
      "text": "Franklin Mingzhe Li, Jamie Dorst, Peter Cederberg, and Patrick Carrington. 2021. Non-Visual Cooking: Exploring Practices and Challenges of Meal Preparation by People with Visual Impairments. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility. 1–11.",
      "doi": "10.1145/3441852.3471215"
    },
    {
      "text": "Franklin Mingzhe Li, Cheng Lu, Zhicong Lu, Patrick Carrington, and Khai N Truong. 2022. An Exploration of Captioning Practices and Challenges of Individual Content Creators on YouTube for People with Hearing Impairments. Proceedings of the ACM on Human-Computer Interaction 6, CSCW1(2022), 1–26.",
      "doi": "10.1145/3512922"
    },
    {
      "text": "Mingzhe Li, Mingming Fan, and Khai N Truong. 2017. BrailleSketch: A gesture-based text input method for people with visual impairments. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. 12–21.",
      "doi": "10.1145/3132525.3132528"
    },
    {
      "text": "Chihling Liu, Debbie Isobel Keeling, and Margaret K Hogg. 2016. Strategy narratives and wellbeing challenges: The role of everyday self-presentation. Journal of Business Research 69, 1 (2016), 234–243.",
      "doi": ""
    },
    {
      "text": "Luoqi Liu, Junliang Xing, Si Liu, Hui Xu, Xi Zhou, and Shuicheng Yan. 2014. Wow! you are so beautiful today!ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM) 11, 1s (2014), 1–22.",
      "doi": ""
    },
    {
      "text": "Xingyu Liu, Patrick Carrington, Xiang’Anthony’ Chen, and Amy Pavel. 2021. What Makes Videos Accessible to Blind and Visually Impaired People?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445233"
    },
    {
      "text": "April Long. 2019. Blindness & Beauty: How Visually Impaired Women Are Changing the Industry | Allure. https://www.allure.com/story/blind-women-beauty-industry-tactile-packaging-for-visually-impaired. (Accessed on 09/07/2021).",
      "doi": ""
    },
    {
      "text": "Elizabeth Mabry. 2020. Disability Representation in the Beauty Industry - Digital Beauty. https://digitalbeauty.com/disability-representation-in-the-beauty-industry/. (Accessed on 12/20/2021).",
      "doi": ""
    },
    {
      "text": "MAC. [n.d.]. MAC Lipsticks | MAC Cosmetics - Official Site. https://www.maccosmetics.com/products/13854/products/makeup/lips/lipstick. (Accessed on 08/02/2021).",
      "doi": ""
    },
    {
      "text": "Sergio Mascetti, Chiara Rossetti, Andrea Gerino, Cristian Bernareggi, Lorenzo Picinali, and Alessandro Rizzi. 2016. Towards a natural user interface to support people with visual impairments in detecting colors. In International Conference on Computers Helping People with Special Needs. Springer, 171–178.",
      "doi": ""
    },
    {
      "text": "Tim Morris, Paul Blenkhorn, Luke Crossey, Quang Ngo, Martin Ross, David Werner, and Christina Wong. 2006. Clearspeech: A display reader for the visually handicapped. IEEE Transactions on Neural Systems and Rehabilitation Engineering 14, 4(2006), 492–500.",
      "doi": ""
    },
    {
      "text": "Maki Nakagawa, Koji Tsukada, and Itiro Siio. 2011. Smart makeup system: supporting makeup using lifelog sharing. In Proceedings of the 13th international conference on Ubiquitous computing. 483–484.",
      "doi": "10.1145/2030112.2030182"
    },
    {
      "text": "Rebecca Nash, George Fieldman, Trevor Hussey, Jean-Luc Lévêque, and Patricia Pineau. 2006. Cosmetics: They influence more than Caucasian female facial attractiveness. Journal of applied social psychology 36, 2 (2006), 493–504.",
      "doi": ""
    },
    {
      "text": "Rosiana Natalie, Ebrima Jarjue, Hernisa Kacorri, and Kotaro Hara. 2020. ViScene: A Collaborative Authoring Tool for Scene Descriptions in Videos. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. 1–4.",
      "doi": ""
    },
    {
      "text": "Miguel Neiva. 2017. ColorADD: color identification system for color-blind people. In Injuries and Health Problems in Football. Springer, 303–314.",
      "doi": ""
    },
    {
      "text": "Tam V Nguyen and Luoqi Liu. 2017. Smart mirror: Intelligent makeup recommendation and synthesis. In Proceedings of the 25th ACM international conference on Multimedia. 1253–1254.",
      "doi": "10.1145/3123266.3127926"
    },
    {
      "text": "Xinyu Ou, Si Liu, Xiaochun Cao, and Hefei Ling. 2016. Beauty emakeup: A deep makeup transfer system. In Proceedings of the 24th ACM international conference on Multimedia. 701–702.",
      "doi": "10.1145/2964284.2973812"
    },
    {
      "text": "Amy Pavel, Gabriel Reyes, and Jeffrey P Bigham. 2020. Rescribe: Authoring and Automatically Editing Audio Descriptions. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 747–759.",
      "doi": "10.1145/3379337.3415864"
    },
    {
      "text": "William Christopher Payne, Alex Yixuan Xu, Fabiha Ahmed, Lisa Ye, and Amy Hurst. 2020. How Blind and Visually Impaired Composers, Producers, and Songwriters Leverage and Adapt Music Technology. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. 1–12.",
      "doi": "10.1145/3373625.3417002"
    },
    {
      "text": "Akriti Pradhan, Gabriela Daniels, 2021. Inclusive beauty: how buying and using cosmetics can be made more accessible for the visually impaired (VI) and blind consumer. Cosmetics and Toiletries 136, 4 (2021), DM4–DM15.",
      "doi": ""
    },
    {
      "text": "Anne Quito. 2018. Inclusive design: Procter & Gamble updates Herbal Essences shampoo bottles for blind customers — Quartz. https://qz.com/quartzy/1418531/inclusive-design-procter-gamble-updates-herbal-essences-shampoo-bottles-for-blind-customers/. (Accessed on 08/10/2021).",
      "doi": ""
    },
    {
      "text": "Marci Robin. 2021. The Best and Worst Beauty Packaging for Blind People, According to Molly Burke — Watch Video | Allure. https://www.allure.com/story/molly-burke-universal-design-beauty-products-blind-accessibility. (Accessed on 09/07/2021).",
      "doi": ""
    },
    {
      "text": "Lee Bartky Sandra. 1988. Foucault, femininity, and the modernization of patriarchal power. Feminism and Foucault: Reflections on Resistance. Ed. Irene Diamond and Lee Quinby. Boston: Northeastern UP 79 (1988).",
      "doi": ""
    },
    {
      "text": "Daisuke Sato, Uran Oh, Kakuya Naito, Hironobu Takagi, Kris Kitani, and Chieko Asakawa. 2017. Navcog3: An evaluation of a smartphone-based blind indoor navigation assistant with semantic features in a large-scale environment. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. 270–279.",
      "doi": "10.1145/3132525.3132535"
    },
    {
      "text": "Woosuk Seo and Hyunggu Jung. 2017. Exploring the community of blind or visually impaired people on youtube. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. 371–372.",
      "doi": "10.1145/3132525.3134801"
    },
    {
      "text": "Woosuk Seo and Hyunggu Jung. 2018. Understanding blind or visually impaired people on youtube through qualitative analysis of videos. In Proceedings of the 2018 ACM International Conference on Interactive Experiences for TV and Online Video. 191–196.",
      "doi": "10.1145/3210825.3213565"
    },
    {
      "text": "Woosuk Seo and Hyunggu Jung. 2020. Understanding the community of blind or visually impaired vloggers on YouTube. Universal Access in the Information Society(2020), 1–14.",
      "doi": ""
    },
    {
      "text": "Woosuk Seo and Hyunggu Jung. 2021. Challenges and opportunities to improve the accessibility of YouTube for people with visual impairments as content creators. Universal Access in the Information Society(2021), 1–4.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara and Jacob O Wobbrock. 2011. In the shadow of misperception: assistive technology use and social interactions. In Proceedings of the SIGCHI conference on human factors in computing systems. 705–714.",
      "doi": "10.1145/1978942.1979044"
    },
    {
      "text": "Kristen Shinohara and Jacob O Wobbrock. 2016. Self-conscious or self-confident? A diary study conceptualizing the social accessibility of assistive technology. ACM Transactions on Accessible Computing (TACCESS) 8, 2 (2016), 1–31.",
      "doi": "10.1145/2827857"
    },
    {
      "text": "Arabelle Sicardi. 2019. Beauty is designing packaging for the visually impaired | Vogue Business. https://www.voguebusiness.com/beauty/braille-beauty-packaging-loccitane. (Accessed on 06/14/2021).",
      "doi": ""
    },
    {
      "text": "Charlotte Tilbury. [n.d.]. Makeup Looks For All Occasions | Charlotte Tilbury. https://www.charlottetilbury.com/uk/secrets/category/how-tos/occasion. (Accessed on 12/20/2021).",
      "doi": ""
    },
    {
      "text": "Alison Tran, Robert Rosales, and Lynn Copes. 2020. Paint a Better Mood? Effects of Makeup Use on YouTube Beauty Influencers’ Self-Esteem. SAGE Open 10, 2 (2020), 2158244020933591.",
      "doi": ""
    },
    {
      "text": "Bantita Treepong, Hironori Mitake, and Shoichi Hasegawa. 2018. Makeup Creativity Enhancement with an Augmented Reality Face Makeup System. Computers in Entertainment (CIE) 16, 4 (2018), 1–17.",
      "doi": "10.1145/3277452"
    },
    {
      "text": "Anh Truong, Peggy Chi, David Salesin, Irfan Essa, and Maneesh Agrawala. 2021. Automatic Generation of Two-Level Hierarchical Tutorials from Instructional Makeup Videos. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445721"
    },
    {
      "text": "Ruolin Wang, Zixuan Chen, Mingrui Ray Zhang, Zhaoheng Li, Zhixiu Liu, Zihan Dang, Chun Yu, and Xiang’Anthony’ Chen. 2021. Revamp: Enhancing Accessible Information Seeking Experience of Online Shopping for Blind or Low Vision Users. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445547"
    },
    {
      "text": "WHO. 2021. Blindness and vision impairment. https://www.who.int/news-room/fact-sheets/detail/blindness-and-visual-impairment. (Accessed on 06/14/2021).",
      "doi": ""
    },
    {
      "text": "Michele A Williams, Amy Hurst, and Shaun K Kane. 2013. ” Pray before you step out” describing personal and situational blind navigation behaviors. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility. 1–8.",
      "doi": "10.1145/2513383.2513449"
    },
    {
      "text": "Beste F Yuksel, Pooyan Fazli, Umang Mathur, Vaishali Bisht, Soo Jung Kim, Joshua Junhee Lee, Seung Jung Jin, Yue-Ting Siu, Joshua A Miele, and Ilmi Yoon. 2020. Human-in-the-Loop Machine Learning to Increase Video Accessibility for Visually Impaired and Blind Users. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 47–60.",
      "doi": "10.1145/3357236.3395433"
    },
    {
      "text": "Mary Zajicek, Chris Powell, and Chris Reeves. 1998. A web navigation tool for the blind. In Proceedings of the third international ACM conference on Assistive technologies. 204–206.",
      "doi": "10.1145/274497.274534"
    },
    {
      "text": "Yuhang Zhao, Shaomei Wu, Lindsay Reynolds, and Shiri Azenkot. 2017. The effect of computer-generated descriptions on photo-sharing experiences of people with visual impairments. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–22.",
      "doi": "10.1145/3134756"
    }
  ]
}