{
  "doi": "10.1145/3491102.3501887",
  "title": "Get To The Point! Problem-Based Curated Data Views To Augment Care For Critically Ill Patients",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Electronic health records in critical care medicine offer unprecedented opportunities for clinical reasoning and decision making. Paradoxically, these data-rich environments have also resulted in clinical decision support systems (CDSSs) that fit poorly into clinical contexts, and increase health workers cognitive load. In this paper, we introduce a novel approach to designing CDSSs that are embedded in clinical workflows, by presenting problem-based curated data views tailored for problem-driven discovery, team communication, and situational awareness. We describe the design and evaluation of one such CDSS, In-Sight, that embodies our approach and addresses the clinical problem of monitoring critically ill pediatric patients. Our work is the result of a co-design process, further informed by empirical data collected through formal usability testing, focus groups, and a simulation study with domain experts. We discuss the potential and limitations of our approach, and share lessons learned in our iterative co-design process.",
  "tags": [
    "checklist",
    "clinical decision support systems",
    "visualization",
    "intensive care medicine"
  ],
  "authors": [
    {
      "name": "Minfan Zhang",
      "institution": "Department of Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234773",
      "orcid": "missing"
    },
    {
      "name": "Daniel Ehrmann",
      "institution": "Hospital for Sick Children, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239915",
      "orcid": "missing"
    },
    {
      "name": "Mjaye Mazwi",
      "institution": "Hospital for Sick Children, Canada and University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659502360",
      "orcid": "missing"
    },
    {
      "name": "Danny Eytan",
      "institution": "Hospital for Sick Children, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659689618",
      "orcid": "missing"
    },
    {
      "name": "Marzyeh Ghassemi",
      "institution": "MIT, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658631203",
      "orcid": "missing"
    },
    {
      "name": "Fanny Chevalier",
      "institution": "Department of Computer Science and Statistical Sciences, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81325488036",
      "orcid": "0000-0002-5585-7971"
    }
  ],
  "references": [
    {
      "text": "Shiri Assis-Hassid, Barbara J Grosz, Eyal Zimlichman, Ronen Rozenblum, and David W Bates. 2019. Assessing EHR use during hospital morning rounds: A multi-faceted study. PloS one 14, 2 (2019), e0212816. https://doi.org/10.1371/journal.pone.0212816",
      "doi": ""
    },
    {
      "text": "Ragnar Bade, Stefan Schlechtweg, and Silvia Miksch. 2004. Connecting time-oriented data and information to a coherent interactive visualization. In Proceedings of the SIGCHI conference on Human factors in computing systems. 105–112. https://doi.org/doi/10.1145/985692.985706",
      "doi": "10.1145/985692.985706"
    },
    {
      "text": "Jason M Baron, Richard Huang, Dustin McEvoy, and Anand S Dighe. 2021. Use of machine learning to predict clinical decision support compliance, reduce alert burden, and evaluate duplicate laboratory test ordering alerts. JAMIA open 4, 1 (2021), ooab006. https://doi.org/10.1093/jamiaopen/ooab006",
      "doi": ""
    },
    {
      "text": "David W Bates, Gilad J Kuperman, Samuel Wang, Tejal Gandhi, Anne Kittler, Lynn Volk, Cynthia Spurr, Ramin Khorasani, Milenko Tanasijevic, and Blackford Middleton. 2003. Ten commandments for effective clinical decision support: making the practice of evidence-based medicine a reality. Journal of the American Medical Informatics Association 10, 6(2003), 523–530. https://academic.oup.com/jamia/article/10/6/523/760582",
      "doi": ""
    },
    {
      "text": "Rinaldo Bellomo, Claudio Ronco, Ravindra L Mehta, Pierre Asfar, Julie Boisramé-Helms, Michael Darmon, Jean-Luc Diehl, Jacques Duranteau, Eric AJ Hoste, Joannes-Boyau Olivier, 2017. Acute kidney injury in the ICU: from injury to recovery: reports from the 5th Paris International Conference. Annals of intensive care 7, 1 (2017), 1–40. https://doi.org/10.1186/s13613-017-0260-y",
      "doi": ""
    },
    {
      "text": "Hemant K Bhargava and Abhay Nath Mishra. 2014. Electronic medical records and physician productivity: Evidence from panel data analysis. Management Science 60, 10 (2014), 2543–2562. https://doi.org/doi/10.1287/mnsc.2014.1934",
      "doi": "10.1287/mnsc.2014.1934"
    },
    {
      "text": "David Blumenthal and Marilyn Tavenner. 2010. The “meaningful use” regulation for electronic health records. New England Journal of Medicine 363, 6 (2010), 501–504. https://doi.org/doi/full/10.1056/nejmp1006114",
      "doi": ""
    },
    {
      "text": "Alex AT Bui, Denise R Aberle, and Hooshang Kangarloo. 2007. TimeLine: visualizing integrated patient records. IEEE Transactions on Information Technology in Biomedicine 11, 4(2007), 462–473. https://doi.org/10.1109/titb.2006.884365",
      "doi": "10.1109/TITB.2006.884365"
    },
    {
      "text": "Andreas Buja, John Alan McDonald, John Michalak, and Werner Stuetzle. 1991. Interactive data visualization using focusing and linking. In Proceedings of the 2nd conference on Visualization’91. 156–163. https://doi.org/10.1109/VISUAL.1991.175794",
      "doi": "10.5555/949607.949633"
    },
    {
      "text": "Mackinlay Card. 1999. Readings in information visualization: using vision to think. Morgan Kaufmann. https://doi.org/doi/10.5555/300679",
      "doi": ""
    },
    {
      "text": "Alex Chaparro, Joseph R Keebler, Elizabeth H Lazzara, and Anastasia Diamond. 2019. Checklists: A review of their origins, benefits, and current uses as a cognitive aid in medicine. ergonomics in design 27, 2 (2019), 21–26. https://doi.org/10.1177/1064804618819181",
      "doi": ""
    },
    {
      "text": "James J Cimino, Anthony Aguirre, Stephen B Johnson, and Ping Peng. 1993. Generic queries for meeting clinical information needs.Bulletin of the Medical Library Association 81, 2 (1993), 195. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC225762/",
      "doi": ""
    },
    {
      "text": "Rhonda Collins. 2020. Clinician cognitive overload and its implications for nurse leaders. Nurse Leader 18, 1 (2020), 44–47. https://doi.org/10.1016/j.mnl.2019.11.007",
      "doi": ""
    },
    {
      "text": "Definitive Healthcare, HIMSS Analytics, and Vocera. 2019. Technology and Clinician Cognitive Overload - Easing the Pain. Technical Report. https://www.vocera.com/public/pdf/Vocera_HIMSS_Analytics_Survey_Report_2019_UK.pdf",
      "doi": ""
    },
    {
      "text": "Molla S Donaldson, Janet M Corrigan, Linda T Kohn, 2000. To err is human: building a safer health system. (2000). https://doi.org/10.17226/9728",
      "doi": ""
    },
    {
      "text": "Anthony Faiola, Preethi Srinivas, and Jon Duke. 2015. Supporting clinical cognition: a human-centered approach to a novel ICU information visualization dashboard. In AMIA Annual Symposium Proceedings, Vol. 2015. American Medical Informatics Association, 560. https://pubmed.ncbi.nlm.nih.gov/26958190/",
      "doi": ""
    },
    {
      "text": "Amy Franklin, Swaroop Gantela, Salsawit Shifarraw, Todd R Johnson, David J Robinson, Brent R King, Amit M Mehta, Charles L Maddow, Nathan R Hoot, Vickie Nguyen, 2017. Dashboard visualizations: Supporting real-time throughput decision-making. Journal of biomedical informatics 71 (2017), 211–221. https://doi.org/10.1016/j.jbi.2017.05.024",
      "doi": ""
    },
    {
      "text": "Amit X Garg, Neill KJ Adhikari, Heather McDonald, M Patricia Rosas-Arellano, Philip J Devereaux, Joseph Beyene, Justina Sam, and R Brian Haynes. 2005. Effects of computerized clinical decision support systems on practitioner performance and patient outcomes: a systematic review. Jama 293, 10 (2005), 1223–1238. https://doi.org/10.1001/jama.293.10.1223",
      "doi": ""
    },
    {
      "text": "Michael Glueck, Peter Hamilton, Fanny Chevalier, Simon Breslav, Azam Khan, Daniel Wigdor, and Michael Brudno. 2015. PhenoBlocks: Phenotype comparison visualizations. IEEE Transactions on Visualization and Computer Graphics 22, 1(2015), 101–110. https://doi.org/10.1109/tvcg.2015.2467733",
      "doi": "10.1109/TVCG.2015.2467733"
    },
    {
      "text": "Travis R Goodwin and Sanda M Harabagiu. 2016. Medical question answering for clinical decision support. In Proceedings of the 25th ACM international on conference on information and knowledge management. 297–306. https://doi.org/10.1145/2983323.2983819",
      "doi": "10.1145/2983323.2983819"
    },
    {
      "text": "Brigette Hales, Marius Terblanche, Robert Fowler, and William Sibbald. 2008. Development of medical checklists for improved quality of patient care. International Journal for Quality in Health Care 20, 1 (2008), 22–30. https://doi.org/10.1093/intqhc/mzm062",
      "doi": ""
    },
    {
      "text": "Yong Y Han, Joseph A Carcillo, Shekhar T Venkataraman, Robert SB Clark, R Scott Watson, Trung C Nguyen, Hülya Bayir, and Richard A Orr. 2005. Unexpected increased mortality after implementation of a commercially sold computerized physician order entry system. Pediatrics 116, 6 (2005), 1506–1512. https://doi.org/10.1542/peds.2005-1287",
      "doi": ""
    },
    {
      "text": "Marissa A Hendrickson, Genevieve B Melton, and Michael B Pitt. 2019. The review of systems, the electronic health record, and billing. Jama 322, 2 (2019), 115–116. https://doi.org/10.1001/jama.2019.5667",
      "doi": ""
    },
    {
      "text": "Joy Higgs and Mark A Jones. 2008. Clinical decision making and multiple problem spaces. Clinical reasoning in the health professions 3 (2008), 3–17.",
      "doi": ""
    },
    {
      "text": "Oliver Hulland, Jeanne Farnan, Raphael Rabinowitz, Lisa Kearns, Michele Long, Bradley Monash, Priti Bhansali, and H Barrett Fromme. 2017. What’s the Purpose of Rounds? A Qualitative Study Examining the Perceptions of Faculty and Students.Journal of hospital medicine 12, 11 (2017), 892–897. https://doi.org/10.12788/jhm.2835",
      "doi": ""
    },
    {
      "text": "Olaronke G Iroju and Janet O Olaleke. 2015. A systematic review of natural language processing in healthcare. International Journal of Information Technology and Computer Science 7, 8(2015), 44–50. https://doi.org/10.5815/ijitcs.2015.08.07",
      "doi": ""
    },
    {
      "text": "Maia Jacobs, Jeffrey He, Melanie F. Pradier, Barbara Lam, Andrew C Ahn, Thomas H McCoy, Roy H Perlis, Finale Doshi-Velez, and Krzysztof Z Gajos. 2021. Designing AI for Trust and Collaboration in Time-Constrained Medical Decisions: A Sociotechnical Lens. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14. https://doi.org/doi/10.1145/3411764.3445385",
      "doi": "10.1145/3411764.3445385"
    },
    {
      "text": "Archana Laxmisan, Forogh Hakimzada, Osman R Sayan, Robert A Green, Jiajie Zhang, and Vimla L Patel. 2007. The multitasking clinician: decision-making and cognitive demand during and after team handoffs in emergency care. International journal of medical informatics 76, 11-12(2007), 801–811. https://doi.org/10.1016/j.ijmedinf.2006.09.019",
      "doi": ""
    },
    {
      "text": "Anna S Messmer, Carina Zingg, Martin Müller, Joel Loic Gerber, Joerg Christian Schefold, and Carmen Andrea Pfortmueller. 2020. Fluid overload and mortality in adult critical care patients—a systematic review and meta-analysis of observational studies. Critical care medicine 48, 12 (2020), 1862–1870. https://doi.org/10.1097/ccm.0000000000004617",
      "doi": ""
    },
    {
      "text": "Mark A Musen, Blackford Middleton, and Robert A Greenes. 2021. Clinical decision-support systems. In Biomedical informatics. Springer, 795–840. https://doi.org/10.1007/978-1-4471-4474-8_22",
      "doi": ""
    },
    {
      "text": "Jerome A Osheroff, Jonathan M Teich, Donald Levick, Luis Saldana, Ferdinand T Velasco, Dean F Sittig, Kendall M Rogers, and Robert A Jenders. 2012. Improving outcomes with clinical decision support: an implementer’s guide. Himss Publishing. https://www.routledge.com/Improving-Outcomes-with-Clinical-Decision-Support-An-Implementers-Guide/Osheroff-Teich-Levick-Saldana-Velasco-Sittig-Rogers-Jenders/p/book/9780984457731",
      "doi": ""
    },
    {
      "text": "Jerome A Osheroff, Jonathan M Teich, Blackford Middleton, Elaine B Steen, Adam Wright, and Don E Detmer. 2007. A roadmap for national action on clinical decision support. Journal of the American medical informatics association 14, 2(2007), 141–145. https://doi.org/10.1197/jamia.m2334",
      "doi": ""
    },
    {
      "text": "Shobha Phansalkar, Judy Edworthy, Elizabeth Hellier, Diane L Seger, Angela Schedlbauer, Anthony J Avery, and David W Bates. 2010. A review of human factors principles for the design and implementation of medication safety alerts in clinical information systems. Journal of the American Medical Informatics Association 17, 5(2010), 493–501. https://doi.org/10.1136/jamia.2010.005264",
      "doi": ""
    },
    {
      "text": "Catherine Plaisant, Brett Milash, Anne Rose, Seth Widoff, and Ben Shneiderman. 1996. LifeLines: visualizing personal histories. In Proceedings of the SIGCHI conference on Human factors in computing systems. 221–227. https://doi.org/doi/10.1145/238386.238493",
      "doi": "10.1145/238386.238493"
    },
    {
      "text": "Catherine Plaisant, Richard Mushlin, Aaron Snyder, Jia Li, Dan Heller, and Ben Shneiderman. 2003. LifeLines: using visualization to enhance navigation and analysis of patient records. In The craft of information visualization. Elsevier, 308–312. https://pubmed.ncbi.nlm.nih.gov/9929185/",
      "doi": ""
    },
    {
      "text": "Margit Pohl, Sylvia Wiltner, Alexander Rind, Wolfgang Aigner, Silvia Miksch, Thomas Turic, and Felix Drexler. 2011. Patient development at a glance: An evaluation of a medical data visualization. In IFIP Conference on Human-Computer Interaction. Springer, 292–299. https://link.springer.com/chapter/10.1007/978-3-642-23768-3_24",
      "doi": ""
    },
    {
      "text": "Jan Powers and Karen Samaan. 2014. Malnutrition in the ICU patient population. Critical Care Nursing Clinics 26, 2 (2014), 227–242. https://doi.org/10.1016/j.ccell.2014.01.003",
      "doi": ""
    },
    {
      "text": "Seth M Powsner and Edward R Tufte. 1994. Graphical summary of patient status. Lancet 344, 8919 (1994), 386–389. https://doi.org/10.1016/s0140-6736(94)91406-0",
      "doi": ""
    },
    {
      "text": "Alexander Rind, Taowei David Wang, Wolfgang Aigner, Silvia Miksch, Krist Wongsuphasawat, Catherine Plaisant, and Ben Shneiderman. 2013. Interactive information visualization to explore and query electronic health records. Foundations and Trends in Human-Computer Interaction 5, 3(2013), 207–298. https://doi.org/doi/10.1561/1100000039",
      "doi": "10.1561/1100000039"
    },
    {
      "text": "Adrian C Rodriguez, Darrell A Lee, and Mary Beth Flynn Makic. 2017. Situational awareness in critical care: An aviation approach to reduce error. Journal of PeriAnesthesia Nursing 32, 6 (2017), 650–652.",
      "doi": ""
    },
    {
      "text": "Keith J Ruskin and Dirk Hueske-Kraus. 2015. Alarm fatigue: impacts on patient safety. Current Opinion in Anesthesiology 28, 6 (2015), 685–690. https://doi.org/10.1097/aco.0000000000000260",
      "doi": ""
    },
    {
      "text": "Jeffrey R Saffle. 2016. Fluid creep and over-resuscitation. Critical care clinics 32, 4 (2016), 587–598. https://doi.org/10.1016/j.ccc.2016.06.007",
      "doi": ""
    },
    {
      "text": "Michelle Schmerge. 2016. Promoting Patient-Centered Team-Based Care: An Advocacy Toolkit. (2016).",
      "doi": ""
    },
    {
      "text": "Sandeep Sharma, Muhammad F Hashmi, and Rotem Friede. 2020. Interprofessional rounds in the ICU. StatPearls [Internet](2020). https://pubmed.ncbi.nlm.nih.gov/29939553/",
      "doi": ""
    },
    {
      "text": "Hyoung Seok Shin. 2019. Reasoning processes in clinical reasoning: from the perspective of cognitive psychology. Korean journal of medical education 31, 4 (2019), 299. https://doi.org/10.3946/kjme.2019.140",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 1994. Dynamic queries for visual information seeking. IEEE software 11, 6 (1994), 70–77. https://doi.org/10.1109/52.329404",
      "doi": "10.1109/52.329404"
    },
    {
      "text": "Edward H Shortliffe and Michael F Chiang. 2021. Biomedical data: Their acquisition, storage, and use. In Biomedical informatics. Springer, 45–75. https://doi.org/10.1007/0-387-36278-9_2",
      "doi": ""
    },
    {
      "text": "Dean F Sittig, Adam Wright, Jerome A Osheroff, Blackford Middleton, Jonathan M Teich, Joan S Ash, Emily Campbell, and David W Bates. 2008. Grand challenges in clinical decision support. Journal of biomedical informatics 41, 2 (2008), 387–392. https://doi.org/10.1016/j.jbi.2007.09.003",
      "doi": "10.1016/j.jbi.2007.09.003"
    },
    {
      "text": "Nicole Sultanum, Michael Brudno, Daniel Wigdor, and Fanny Chevalier. 2018. More text please! understanding and supporting the use of visualization for clinical text overview. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 422. https://doi.org/doi/10.1145/3173574.3173996",
      "doi": "10.1145/3173574.3173996"
    },
    {
      "text": "Nicole Sultanum, Devin Singh, Michael Brudno, and Fanny Chevalier. 2018. Doccurate: A Curation-Based Approach for Clinical Text Visualization. IEEE transactions on visualization and computer graphics 25, 1(2018), 142–151. http://www.cs.toronto.edu/~fanny/pubs/pdf/doccurate-vast2018.pdf",
      "doi": ""
    },
    {
      "text": "Reed T Sutton, David Pincock, Daniel C Baumgart, Daniel C Sadowski, Richard N Fedorak, and Karen I Kroeker. 2020. An overview of clinical decision support systems: benefits, risks, and strategies for success. NPJ digital medicine 3, 1 (2020), 1–10. https://doi.org/10.1038/s41746-020-0221-y",
      "doi": ""
    },
    {
      "text": "Øyvind Thomassen, Ansgar Storesund, Eirik Søfteland, and Guttorm Brattebø. 2014. The effects of safety checklists in medicine: a systematic review. Acta Anaesthesiologica Scandinavica 58, 1 (2014), 5–18. https://doi.org/doi/10.1111/aas.12207",
      "doi": ""
    },
    {
      "text": "Thi Ngoc Trang Tran, Alexander Felfernig, Christoph Trattner, and Andreas Holzinger. 2021. Recommender systems in the healthcare domain: state-of-the-art and research issues. Journal of Intelligent Information Systems 57, 1 (2021), 171–201. https://doi.org/10.1007/s10844-020-00633-6",
      "doi": ""
    },
    {
      "text": "Stacey L Valentine, Anil Sapru, Renee A Higgerson, Phillip C Spinella, Heidi R Flori, Dionne A Graham, Molly Brett, Maureen Convery, LeeAnn M Christie, Laurie Karamessinis, 2012. Fluid balance in critically ill children with acute lung injury. Critical care medicine 40, 10 (2012), 2883.",
      "doi": ""
    },
    {
      "text": "J Van der Greef, S Martin, P Juhasz, A Adourian, T Plasterer, ER Verheij, and RN McBurney. 2007. The art and practice of systems biology in medicine: mapping patterns of relationships. Journal of proteome research 6, 4 (2007), 1540–1559. https://doi.org/doi/full/10.1021/pr0606530",
      "doi": ""
    },
    {
      "text": "Qiru Wang and RS Laramee. 2021. EHR STAR: The State-Of-the-Art in Interactive EHR Visualization. In Computer Graphics Forum. Wiley Online Library.",
      "doi": ""
    },
    {
      "text": "Taowei David Wang, Catherine Plaisant, Alexander J Quinn, Roman Stanchak, Shawn Murphy, and Ben Shneiderman. 2008. Aligning temporal data by sentinel events: discovering patterns in electronic health records. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 457–466. https://doi.org/doi/10.1145/1357054.1357129",
      "doi": "10.1145/1357054.1357129"
    },
    {
      "text": "Robert L Wears and Marc Berg. 2005. Computer technology and clinical work: still waiting for Godot. Jama 293, 10 (2005), 1261–1263. https://doi.org/10.1001/jama.293.10.1261",
      "doi": ""
    },
    {
      "text": "Adam Wilcox, Spencer S Jones, David A Dorr, Wayne Cannon, Laurie Burns, Kelli Radican, Kent Christensen, Cherie Brunker, Ann Larsen, Scott P Narus, 2005. Use and impact of a computer-generated patient summary worksheet for primary care. In AMIA Annual Symposium Proceedings, Vol. 2005. American Medical Informatics Association, 824. https://doi.org/pmc/articles/PMC1560720/",
      "doi": ""
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, and John Zimmerman. 2019. Unremarkable AI: Fitting intelligent decision support into critical, clinical decision-making processes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11. https://doi.org/doi/10.1145/3290605.3300468",
      "doi": "10.1145/3290605.3300468"
    },
    {
      "text": "Zhilan Zhou, Ximing Wen, Yue Wang, and David Gotz. 2021. Modeling and Leveraging Analytic Focus During Exploratory Visual Analysis. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15. https://doi.org/doi/10.1145/3411764.3445674",
      "doi": "10.1145/3411764.3445674"
    }
  ]
}