{
  "doi": "10.1145/3491102.3517505",
  "title": "Designing Word Filter Tools for Creator-led Comment Moderation",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-21",
  "year": 2022,
  "badges": [],
  "abstract": "Online social platforms centered around content creators often allow comments on content, where creators can then moderate the comments they receive. As creators can face overwhelming numbers of comments, with some of them harassing or hateful, platforms typically provide tools such as word filters for creators to automate aspects of moderation. From needfinding interviews with 19 creators about how they use existing tools, we found that they struggled with writing good filters as well as organizing and revising their filters, due to the difficulty of determining what the filters actually catch. To address these issues, we present FilterBuddy, a system that supports creators in authoring new filters or building from pre-made ones, as well as organizing their filters and visualizing what comments are captured by them over time. We conducted an early-stage evaluation of FilterBuddy with YouTube creators, finding that participants see FilterBuddy not just as a moderation tool, but also a means to organize their comments to better understand their audiences.",
  "authors": [
    {
      "name": "Shagun Jhaver",
      "institution": "Rutgers University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658987207",
      "orcid": "missing"
    },
    {
      "name": "Quan Ze Chen",
      "institution": "Paul G. Allen School of Computer Science & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365511",
      "orcid": "missing"
    },
    {
      "name": "Detlef Knauss",
      "institution": "Paul G. Allen School of Computer Science & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237294",
      "orcid": "missing"
    },
    {
      "name": "Amy X. Zhang",
      "institution": "Paul G. Allen School of Computer Science & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658640424",
      "orcid": "0000-0001-9462-9835"
    }
  ],
  "references": [
    {
      "text": "Crystal Abidin. 2015. Communicative Intimacies: Influencers and Percieved Interconnectedness. (2015).",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300233",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Rachel Berryman and Misha Kavka. 2017. ‘I Guess A Lot of People See Me as a Big Sister or a Friend’: the role of intimacy in the celebrification of beauty vloggers. Journal of Gender Studies 26, 3 (2017), 307–320. https://doi.org/10.1080/09589236.2017.1288611 arXiv:https://doi.org/10.1080/09589236.2017.1288611",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Tianying Chen, Sarita Schoenebeck, and Cliff Lampe. 2018. When Online Harassment is Perceived as Justified. In Twelfth International AAAI Conference on Web and Social Media.",
      "doi": ""
    },
    {
      "text": "Sean Burch. 2019. YouTube says ’INAPPROPRIATE comments’ could result in video demonetization. https://www.thewrap.com/youtube-inappropriate-comments-demonetization/",
      "doi": ""
    },
    {
      "text": "Jean Burgess and Joshua Green. 2018. YouTube: Online video and participatory culture. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Facebook Business Center. 2021. About Facebook Pages. https://www.facebook.com/business/help/461775097570076?id=939256796236247",
      "doi": ""
    },
    {
      "text": "Jie Cai and Donghee Yvette Wohn. 2019. What Are Effective Strategies of Handling Harassment on Twitch? Users’ Perspectives. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing (Austin, TX, USA) (CSCW ’19). Association for Computing Machinery, New York, NY, USA, 166–170. https://doi.org/10.1145/3311957.3359478",
      "doi": "10.1145/3311957.3359478"
    },
    {
      "text": "Marilyn A Campbell. 2005. Cyber bullying: An old problem in a new guise?Journal of Psychologists and Counsellors in Schools 15, 1 (2005), 68–76.",
      "doi": ""
    },
    {
      "text": "Robyn Caplan and Tarleton Gillespie. 2020. Tiered governance and demonetization: The shifting terms of labor and compensation in the platform economy. Social Media+ Society 6, 2 (2020), 2056305120936636.",
      "doi": ""
    },
    {
      "text": "Caitlin Ring Carlson, Luc Cousineau, and Caitlin Ring Carlson. 2020. Are You Sure You Want to View This Community? Exploring the Ethics of Reddit’s Quarantine Practice. Journal of Media Ethics 00, 00 (2020), 1–12. https://doi.org/10.1080/23736992.2020.1819285",
      "doi": ""
    },
    {
      "text": "Alissa Centivany and Bobby Glushko. 2016. ”Popcorn Tastes Good”: Participatory Policymaking and Reddit’s. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1126–1137. https://doi.org/10.1145/2858036.2858516",
      "doi": "10.1145/2858036.2858516"
    },
    {
      "text": "Ngai Keung Chan. 2019. “Becoming an expert in driving for Uber”: Uber driver/bloggers’ performance of expertise and self-presentation on YouTube. New Media & Society 21, 9 (2019), 2048–2067.",
      "doi": ""
    },
    {
      "text": "Eshwar Chandrasekharan, Shagun Jhaver, Amy Bruckman, and Eric Gilbert. 2022. Quarantined! Examining the Effects of a Community-Wide Moderation Intervention on Reddit. ACM Trans. Comput.-Hum. Interact.(2022). https://doi.org/10.1145/3490499",
      "doi": ""
    },
    {
      "text": "Eshwar Chandrasekharan, Umashanthi Pavalanathan, Anirudh Srinivasan, Adam Glynn, Jacob Eisenstein, and Eric Gilbert. 2017. You Can’t stay here: The efficacy of Reddit’s 2015 ban examined through hate speech. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 31 (Dec. 2017), 22 pages. https://doi.org/10.1145/3134666",
      "doi": "10.1145/3134666"
    },
    {
      "text": "Eshwar Chandrasekharan, Mattia Samory, Anirudh Srinivasan, and Eric Gilbert. 2017. The Bag of Communities: Identifying Abusive Behavior Online with Preexisting Internet Data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 3175–3187. https://doi.org/10.1145/3025453.3026018",
      "doi": "10.1145/3025453.3026018"
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory: a practical guide through qualitative analysis. https://doi.org/10.1016/j.lisr.2007.11.003 arXiv:arXiv:1011.1669v3",
      "doi": ""
    },
    {
      "text": "Clement Chau. 2010. YouTube as a participatory culture. New directions for youth development 2010, 128 (2010), 65–74.",
      "doi": ""
    },
    {
      "text": "A Chen. 2019. How YouTubers plan to take on YouTube for better working conditions. MIT Technology Review(2019).",
      "doi": ""
    },
    {
      "text": "Chloe Condon. 2021. Some of you have never had...https://twitter.com/chloecondon/status/1425197893678366723.",
      "doi": ""
    },
    {
      "text": "Kate Crawford and Tarleton Gillespie. 2016. What is a flag for? Social media reporting tools and the vocabulary of complaint. New Media & Society 18, 3 (2016), 410–428. https://doi.org/10.1177/1461444814543163 arXiv:https://doi.org/10.1177/1461444814543163",
      "doi": ""
    },
    {
      "text": "Twitch Creator Dashboard. 2021. Creator Dashboard. https://help.twitch.tv/s/article/creator-dashboard?language=en_US",
      "doi": ""
    },
    {
      "text": "Stuart Cunningham and David Craig. 2017. Being ‘really real’on YouTube: authenticity, community and brand culture in social media entertainment. Media International Australia 164, 1 (2017), 71–81.",
      "doi": ""
    },
    {
      "text": "Jesse Davis and Mark Goadrich. 2006. The relationship between Precision-Recall and ROC curves. In Proceedings of the 23rd international conference on Machine learning. 233–240.",
      "doi": "10.1145/1143844.1143874"
    },
    {
      "text": "Jesse Dodge, Maarten Sap, Ana Marasovic, William Agnew, Gabriel Ilharco, Dirk Groeneveld, Margaret Mitchell, Matt Gardner, and Hugging Face. 2021. Documenting Large Webtext Corpora: A Case Study on the Colossal Clean Crawled Corpus. (2021).",
      "doi": ""
    },
    {
      "text": "Bryan Dosono and Bryan Semaan. 2019. Moderation Practices as Emotional Labor in Sustaining Online Communities: The Case of AAPI Identity Work on Reddit. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300372",
      "doi": "10.1145/3290605.3300372"
    },
    {
      "text": "Stefanie Duguay, Jean Burgess, and Nicolas Suzor. 2020. Queer women’s experiences of patchwork platform governance on Tinder, Instagram, and Vine. Convergence 26, 2 (2020), 237–252.",
      "doi": ""
    },
    {
      "text": "Stine Eckert. 2018. Fighting for recognition: Online abuse of women bloggers in Germany, Switzerland, the United Kingdom, and the United States. New Media & Society 20, 4 (2018), 1282–1302.",
      "doi": ""
    },
    {
      "text": "Jad Esber, Boaz Sender, Ethan Zuckerman, Crystal Lee, Nana Nwachukwu, Oumou Ly, Peter Suber, Primavera De Filippi, Sahar Massachi, Samuel Klein, 2021. A meta-proposal for Twitter’s bluesky project. Available at SSRN 3816729(2021).",
      "doi": ""
    },
    {
      "text": "Umer Farooq and Jonathan Grudin. 2016. Human-computer Integration. Interactions 23, 6 (2016), 26–32.",
      "doi": "10.1145/3001896"
    },
    {
      "text": "Julia R. Fernandez and Jeremy Birnholtz. 2019. ”I Don’t Want Them to Not Know”: Investigating Decisions to Disclose Transgender Identity on Dating Platforms. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 226 (nov 2019), 21 pages. https://doi.org/10.1145/3359328",
      "doi": ""
    },
    {
      "text": "Jessica L. Feuston and Jed R. Brubaker. 2021. Putting Tools in Their Place: The Role of Time and Perspective in Human-AI Collaboration for Qualitative Analysis. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 469 (oct 2021), 25 pages. https://doi.org/10.1145/3479856",
      "doi": "10.1145/3479856"
    },
    {
      "text": "Guo Freeman and Donghee Yvette Wohn. 2020. Streaming your Identity: Navigating the Presentation of Gender and Sexuality through Live Streaming. Computer Supported Cooperative Work (CSCW) 29, 6 (2020), 795–825.",
      "doi": "10.1007/s10606-020-09386-w"
    },
    {
      "text": "R. Stuart Geiger. 2016. Bot-based collective blocklists in Twitter: the counterpublic moderation of harassment in a networked public space. Information, Communication & Society 19, 6 (2016), 787–803. https://doi.org/10.1080/1369118X.2016.1153700 arXiv:https://doi.org/10.1080/1369118X.2016.1153700",
      "doi": ""
    },
    {
      "text": "Ysabel Gerrard. 2018. Beyond the hashtag: Circumventing content moderation on social media. New Media & Society 20, 12 (2018), 4492–4511. https://doi.org/10.1177/1461444818776611 arXiv:https://doi.org/10.1177/1461444818776611",
      "doi": ""
    },
    {
      "text": "Tarleton Gillespie. 2018. Custodians of the Internet: Platforms, content moderation, and the hidden decisions that shape social media. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Robert Gorwa, Reuben Binns, and Christian Katzenbach. 2020. Algorithmic content moderation: Technical and political challenges in the automation of platform governance. Big Data & Society 7, 1 (2020), 2053951719897945.",
      "doi": ""
    },
    {
      "text": "Mary L Gray and Siddharth Suri. 2019. Ghost work: How to stop Silicon Valley from building a new global underclass. Eamon Dolan Books.",
      "doi": ""
    },
    {
      "text": "Michael Green, Ania Bobrowicz, and Chee Siang Ang. 2015. The lesbian, gay, bisexual and transgender community online: discussions of bullying and self-disclosure in YouTube videos. Behaviour & Information Technology 34, 7 (2015), 704–712.",
      "doi": "10.5555/3013642.3013648"
    },
    {
      "text": "Oliver L. Haimson, Daniel Delmonaco, Peipei Nie, and Andrea Wegner. 2021. Disproportionate Removals and Differing Content Moderation Experiences for Conservative, Transgender, and Black Social Media Users: Marginalization and Moderation Gray Areas. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 466 (oct 2021), 35 pages. https://doi.org/10.1145/3479610",
      "doi": "10.1145/3479610"
    },
    {
      "text": "William A. Hamilton, Oliver Garretson, and Andruid Kerne. 2014. Streaming on Twitch: Fostering Participatory Communities of Play within Live Mixed Media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1315–1324. https://doi.org/10.1145/2556288.2557048",
      "doi": "10.1145/2556288.2557048"
    },
    {
      "text": "Ivan Hare and James Weinstein. 2009. Extreme Speech and Democracy. Oxford University Press, USA.",
      "doi": ""
    },
    {
      "text": "Elizabeth Fish Hatfield. 2018. (Not) getting paid to do what you love: Gender, social media, and aspirational work.",
      "doi": ""
    },
    {
      "text": "Susan Herring, Kirk Job-Sluder, Rebecca Scheckler, and Sasha Barab. 2002. Searching for safety online: Managing” trolling” in a feminist forum. The information society 18, 5 (2002), 371–384.",
      "doi": ""
    },
    {
      "text": "Zorah Hilvert-Bruce, James T Neill, Max Sjöblom, and Juho Hamari. 2018. Social motivations of live-streaming viewer engagement on Twitch. Computers in Human Behavior 84 (2018), 58–67.",
      "doi": "10.1016/j.chb.2018.02.013"
    },
    {
      "text": "Jacob Hoffman-Andrews. 2021. Block Together. https://blocktogether.org",
      "doi": ""
    },
    {
      "text": "Mattias Holmbom. 2015. The YouTuber: A qualitative study of popular content creators.",
      "doi": ""
    },
    {
      "text": "Manoel Horta Ribeiro, Shagun Jhaver, Savvas Zannettou, Jeremy Blackburn, Gianluca Stringhini, Emiliano De Cristofaro, and Robert West. 2021. Do Platform Migrations Compromise Content Moderation? Evidence from r/The_Donald and r/Incels. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 316 (oct 2021), 24 pages. https://doi.org/10.1145/3476057",
      "doi": "10.1145/3476057"
    },
    {
      "text": "Homa Hosseinmardi, Sabrina Arredondo Mattson, Rahat Ibn Rafiq, Richard Han, Qin Lv, and Shivakant Mishra. 2015. Detection of cyberbullying incidents on the instagram social network. arXiv preprint arXiv:1503.03909(2015).",
      "doi": ""
    },
    {
      "text": "Jane Im, Sonali Tandon, Eshwar Chandrasekharan, Taylor Denby, and Eric Gilbert. 2020. Synthesized Social Signals: Computationally-Derived Social Signals from Account Histories. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376383",
      "doi": ""
    },
    {
      "text": "Jelani Ince, Fabio Rojas, and Clayton A Davis. 2017. The social media response to Black Lives Matter: How Twitter users interact with Black Lives Matter through hashtag use. Ethnic and racial studies 40, 11 (2017), 1814–1830.",
      "doi": ""
    },
    {
      "text": "Steven J. Jackson, Tarleton Gillespie, and Sandy Payette. 2014. The Policy Knot: Re-Integrating Policy, Practice and Design in Cscw Studies of Social Computing. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (Baltimore, Maryland, USA) (CSCW ’14). Association for Computing Machinery, New York, NY, USA, 588–602. https://doi.org/10.1145/2531602.2531674",
      "doi": "10.1145/2531602.2531674"
    },
    {
      "text": "Shagun Jhaver, Darren Scott Appling, Eric Gilbert, and Amy Bruckman. 2019. “Did You Suspect the Post Would Be Removed?”: Understanding User Reactions to Content Removals on Reddit. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 192 (Nov. 2019), 33 pages. https://doi.org/10.1145/3359294",
      "doi": "10.1145/3359294"
    },
    {
      "text": "Shagun Jhaver, Iris Birman, Eric Gilbert, and Amy Bruckman. 2019. Human-Machine Collaboration for Content Regulation: The Case of Reddit Automoderator. ACM Trans. Comput.-Hum. Interact. 26, 5, Article 31 (July 2019), 35 pages. https://doi.org/10.1145/3338243",
      "doi": "10.1145/3338243"
    },
    {
      "text": "Shagun Jhaver, Christian Boylston, Diyi Yang, and Amy Bruckman. 2021. Evaluating the Effectiveness of Deplatforming as a Moderation Strategy on Twitter. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 381 (oct 2021), 30 pages. https://doi.org/10.1145/3479525",
      "doi": "10.1145/3479525"
    },
    {
      "text": "Shagun Jhaver, Amy Bruckman, and Eric Gilbert. 2019. Does Transparency in Moderation Really Matter? User Behavior After Content Removal Explanations on Reddit. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 150 (nov 2019), 27 pages. https://doi.org/10.1145/3359252",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Larry Chan, and Amy Bruckman. 2018. The View from the Other Side: The Border Between Controversial Speech and Harassment on Kotaku in Action. First Monday 23, 2 (2018). http://firstmonday.org/ojs/index.php/fm/article/view/8232",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Seth Frey, and Amy Zhang. 2022. Decentralizing Platform Power: A Design Space of Multi-level Governance in Online Social Platforms. arXiv preprint arXiv:2108.12529(2022).",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Sucheta Ghoshal, Amy Bruckman, and Eric Gilbert. 2018. Online Harassment and Content Moderation: The Case of Blocklists. ACM Trans. Comput.-Hum. Interact. 25, 2, Article 12 (March 2018), 33 pages. https://doi.org/10.1145/3185593",
      "doi": "10.1145/3185593"
    },
    {
      "text": "Jialun ”Aaron” Jiang, Charles Kiene, Skyler Middler, Jed R. Brubaker, and Casey Fiesler. 2019. Moderation Challenges in Voice-based Online Communities on Discord. Proc. ACM Hum.-Comput. Interact. 3, CSCW (2019), Article 55. https://doi.org/10.1145/3359157",
      "doi": "10.1145/3359157"
    },
    {
      "text": "Jialun Aaron Jiang, Morgan Klaus Scheuerman, Casey Fiesler, and Jed R Brubaker. 2021. Understanding international perceptions of the severity of harmful content online. PloS one 16, 8 (2021), e0256762.",
      "doi": ""
    },
    {
      "text": "David Kaye. 2019. Speech police: The global struggle to govern the Internet. Columbia Global Reports.",
      "doi": ""
    },
    {
      "text": "Moira Kenney. 2001. Mapping gay LA: The intersection of place and politics. Temple University Press.",
      "doi": ""
    },
    {
      "text": "Jina Kim, Kunwoo Bae, Eunil Park, and Angel P. del Pobil. 2019. Who Will Subscribe to My Streaming Channel? The Case of Twitch. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing (Austin, TX, USA) (CSCW ’19). Association for Computing Machinery, New York, NY, USA, 247–251. https://doi.org/10.1145/3311957.3359470",
      "doi": "10.1145/3311957.3359470"
    },
    {
      "text": "Yubo Kou and Xinning Gui. 2021. Flag and Flaggability in Automated Moderation: The Case of Reporting Toxic Behavior in an Online Game Community. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445279"
    },
    {
      "text": "Patricia G Lange. 2007. Commenting on comments: Investigating responses to antagonism on YouTube. In Society for Applied anthropology conference, Vol. 31. 163–190.",
      "doi": ""
    },
    {
      "text": "Clayton Lewis. 1982. Using the” thinking-aloud” method in cognitive interface design. IBM TJ Watson Research Center Yorktown Heights, NY.",
      "doi": ""
    },
    {
      "text": "Rebecca Lewis, Alice E Marwick, and William Clyde Partin. 2021. “We Dissect Stupidity and Respond to It”: Response Videos and Networked Harassment on YouTube. American Behavioral Scientist 65, 5 (2021), 735–756.",
      "doi": ""
    },
    {
      "text": "Jie Li, Xinning Gui, Yubo Kou, and Yukun Li. 2019. Live Streaming as Co-Performance: Dynamics between Center and Periphery in Theatrical Engagement. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 64 (nov 2019), 22 pages. https://doi.org/10.1145/3359166",
      "doi": "10.1145/3359166"
    },
    {
      "text": "Brian Lubars and Chenhao Tan. 2019. Ask not what AI can do, but what AI should do: Towards a framework of task delegability. Advances in Neural Information Processing Systems 32 (2019).",
      "doi": ""
    },
    {
      "text": "May O Lwin, Benjamin Li, and Rebecca P Ang. 2012. Stop bugging me: An examination of adolescents’ protection behavior against online harassment. Journal of adolescence 35, 1 (2012), 31–41.",
      "doi": ""
    },
    {
      "text": "Maximilian Mackeprang, Claudia Müller-Birn, and Maximilian Timo Stauss. 2019. Discovering the Sweet Spot of Human-Computer Configurations: A Case Study in Information Extraction. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 195 (nov 2019), 30 pages. https://doi.org/10.1145/3359297",
      "doi": "10.1145/3359297"
    },
    {
      "text": "Kaitlin Mahar, Amy X. Zhang, and David Karger. 2018. Squadbox: A Tool to Combat Email Harassment Using Friendsourced Moderation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 586, 13 pages. https://doi.org/10.1145/3173574.3174160",
      "doi": "10.1145/3173574.3174160"
    },
    {
      "text": "Keri Mallari, Spencer Williams, and Gary Hsieh. 2021. Understanding Analytics Needs of Video Game Streamers. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 337, 12 pages. https://doi.org/10.1145/3411764.3445320",
      "doi": "10.1145/3411764.3445320"
    },
    {
      "text": "Alice Marwick. 2015. You may know me from YouTube. A companion to celebrity 333 (2015).",
      "doi": ""
    },
    {
      "text": "Mike Masnick. 2019. Protocols, Not Platforms: A Technological Approach to Free Speech. https://knightcolumbia.org/content/protocols-not-platforms-a-technological-approach-to-free-speech",
      "doi": ""
    },
    {
      "text": "J Nathan Matias. 2016. Going dark: Social factors in collective action against platform operators in the Reddit blackout. In Proceedings of the 2016 CHI conference on human factors in computing systems. ACM, 1138–1151.",
      "doi": "10.1145/2858036.2858391"
    },
    {
      "text": "J Nathan Matias, Amy Johnson, Whitney Erin Boesel, Brian Keegan, Jaclyn Friedman, and Charlie DeTar. 2015. Reporting, reviewing, and responding to harassment on Twitter. Available at SSRN 2602018(2015).",
      "doi": ""
    },
    {
      "text": "Nathan J. Matias. 2016. The Civic Labor of Online Moderators. In Internet Politics and Policy conference (Oxford, United Kingdom). Oxford, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Sharan B Merriam. 2002. Introduction to Qualitative Research. Qualitative research in practice: Examples for discussion and analysis 1 (2002).",
      "doi": ""
    },
    {
      "text": "Channel Moderation. 2021. How to Use AutoMod. https://help.twitch.tv/s/article/how-to-use-automod?language=en_US",
      "doi": ""
    },
    {
      "text": "Casey Newton. 2019. The trauma floor: The secret lives of Facebook moderators in America. The Verge 25(2019), 2019.",
      "doi": ""
    },
    {
      "text": "Valentin Niebler. 2020. ‘YouTubers unite’: collective action by YouTube content creators.",
      "doi": ""
    },
    {
      "text": "Safiya Umoja Noble. 2018. Algorithms of oppression. New York University Press.",
      "doi": ""
    },
    {
      "text": "Fayika Farhat Nova, Md. Rashidujjaman Rifat, Pratyasha Saha, Syed Ishtiaque Ahmed, and Shion Guha. 2018. Silenced Voices: Understanding Sexual Harassment on Anonymous Social Media Among Bangladeshi People. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing (Jersey City, NJ, USA) (CSCW ’18). Association for Computing Machinery, New York, NY, USA, 209–212. https://doi.org/10.1145/3272973.3274057",
      "doi": "10.1145/3272973.3274057"
    },
    {
      "text": "Katherine Ognyanova. 2019. In Putin’s Russia, information has you: Media control and internet censorship in the Russian Federation. In Censorship, surveillance, and privacy: Concepts, methodologies, tools, and applications. IGI Global, 1769–1786.",
      "doi": ""
    },
    {
      "text": "Deokgun Park, Simranjit Sachar, Nicholas Diakopoulos, and Niklas Elmqvist. 2016. Supporting comment moderators in identifying high quality online news comments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1114–1125.",
      "doi": "10.1145/2858036.2858389"
    },
    {
      "text": "Simon Parkin. 2018. The YouTube stars heading for burnout:“The most fun job imaginable became deeply bleak.”. The Guardian 8(2018), 2018.",
      "doi": ""
    },
    {
      "text": "Block Party. 2021. Block party. https://www.blockpartyapp.com/",
      "doi": ""
    },
    {
      "text": "Jessica A. Pater, Moon K. Kim, Elizabeth D. Mynatt, and Casey Fiesler. 2016. Characterizations of Online Harassment: Comparing Policies Across Social Media Platforms. In Proceedings of the 19th International Conference on Supporting Group Work (Sanibel Island, Florida, USA) (GROUP ’16). ACM, New York, NY, USA, 369–374. https://doi.org/10.1145/2957276.2957297",
      "doi": "10.1145/2957276.2957297"
    },
    {
      "text": "Emily Pedersen. 2019. ” My Videos are at the Mercy of the YouTube Algorithm”: How Content Creators Craft Algorithmic Personas and Perceive the Algorithm that Dictates their Work.",
      "doi": ""
    },
    {
      "text": "Anthony J Pellicone and June Ahn. 2017. The Game of Performing Play: Understanding streaming as cultural production. In Proceedings of the 2017 CHI conference on human factors in computing systems. 4863–4874.",
      "doi": "10.1145/3025453.3025854"
    },
    {
      "text": "David Pinsof and Martie G Haselton. 2017. The effect of the promiscuity stereotype on opposition to gay rights. PloS one 12, 7 (2017), e0178534.",
      "doi": ""
    },
    {
      "text": "Bailey Poland. 2016. Haters: Harassment, abuse, and violence online. U of Nebraska Press.",
      "doi": ""
    },
    {
      "text": "Chand Rajendra-Nicolucci and Ethan Zuckerman. 2021. Top 100: The most popular social media platforms and what they can teach us. https://knightcolumbia.org/blog/top-100-the-most-popular-social-media-platforms-and-what-they-can-teach-us",
      "doi": ""
    },
    {
      "text": "Tobias Raun. 2018. Capitalizing intimacy: New subcultural forms of micro-celebrity strategies and affective labour on YouTube. Convergence 24, 1 (2018), 99–113.",
      "doi": ""
    },
    {
      "text": "Elissa M Redmiles, Jessica Bodford, and Lindsay Blackwell. 2019. “I just want to feel safe”: A Diary Study of Safety Perceptions on Social Media. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 13. 405–416.",
      "doi": ""
    },
    {
      "text": "Kathryn E Ringland, Christine T Wolf, Lynn Dombrowski, and Gillian R Hayes. 2015. Making” Safe” Community-Centered Practices in a Virtual World Dedicated to Children with Autism. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 1788–1800.",
      "doi": ""
    },
    {
      "text": "Sarah T Roberts. 2019. Behind the Screen: Content Moderation in the Shadows of Social Media. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Jonathan Rosa. 2019. Looking like a language, sounding like a race. Oxf Studies in Anthropology of.",
      "doi": ""
    },
    {
      "text": "Maarten Sap, Dallas Card, Saadia Gabriel, Yejin Choi, and Noah A Smith. 2019. The risk of racial bias in hate speech detection. In Proceedings of the 57th annual meeting of the association for computational linguistics. 1668–1678.",
      "doi": ""
    },
    {
      "text": "J Ben Schafer, Dan Frankowski, Jon Herlocker, and Shilad Sen. 2007. Collaborative filtering recommender systems. In The adaptive web. Springer, 291–324.",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman, Stacy M. Branham, and Foad Hamidi. 2018. Safe Spaces and Safe Places: Unpacking Technology-Mediated Experiences of Safety and Harm with Transgender People. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 155 (nov 2018), 27 pages. https://doi.org/10.1145/3274424",
      "doi": "10.1145/3274424"
    },
    {
      "text": "Morgan Klaus Scheuerman, Jialun Aaron Jiang, Casey Fiesler, and Jed R. Brubaker. 2021. A Framework of Severity for Harmful Content Online. Proc. ACM Hum.-Comput. Interact. 2, CSCW (2021), 1–33.",
      "doi": "10.1145/3479512"
    },
    {
      "text": "Nathan Schneider, Primavera De Filippi, Seth Frey, Joshua Tan, and Amy Zhang. 2021. Modular Politics: Toward a Governance Layer for Online Communities. Proc. ACM Hum.-Comput. Interact.CSCW (Oct. 2021).",
      "doi": "10.1145/3449090"
    },
    {
      "text": "Joseph Seering, Robert Kraut, and Laura Dabbish. 2017. Shaping Pro and Anti-Social Behavior on Twitch Through Moderation and Example-Setting. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). ACM, New York, NY, USA, 111–125. https://doi.org/10.1145/2998181.2998277",
      "doi": "10.1145/2998181.2998277"
    },
    {
      "text": "Joseph Seering, Tony Wang, Jina Yoon, and Geoff Kaufman. 2019. Moderator engagement and community development in the age of algorithms. New Media & Society(2019), 1461444818821316.",
      "doi": ""
    },
    {
      "text": "Scott Simon and Emma Bowman. 2019. Propaganda, hate speech, violence: The working lives of Facebook’s content moderators. NPR Technology (2019).",
      "doi": ""
    },
    {
      "text": "Peter K Smith, Jess Mahdavi, Manuel Carvalho, and Neil Tippett. 2006. An investigation into cyberbullying, its forms, awareness and impact, and the relationship between age and gender in cyberbullying. Research Brief No. RBX03-06. London: DfES(2006).",
      "doi": ""
    },
    {
      "text": "Miriah Steiger, Timir J Bharucha, Sukrit Venkatagiri, Martin J. Riedl, and Matthew Lease. 2021. The Psychological Well-Being of Content Moderators: The Emotional Labor of Commercial Moderation and Avenues for Improving Support. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 341, 14 pages. https://doi.org/10.1145/3411764.3445092",
      "doi": "10.1145/3411764.3445092"
    },
    {
      "text": "YouTube Studio. 2021. Navigate Youtube studio - YouTube help. https://support.google.com/youtube/answer/7548152?hl=en",
      "doi": ""
    },
    {
      "text": "Nicolas P Suzor, Sarah Myers West, Andrew Quodling, and Jillian York. 2019. What Do We Mean When We Talk About Transparency? Toward Meaningful Transparency in Commercial Content Moderation. International Journal of Communication 13 (2019), 18.",
      "doi": ""
    },
    {
      "text": "Alexandra To, Wenxia Sweeney, Jessica Hammer, and Geoff Kaufman. 2020. ”They Just Don’t Get It”: Towards Social Technologies for Coping with Interpersonal Racism. Proc. ACM Hum.-Comput. Interact. 4, CSCW1, Article 024 (May 2020), 29 pages. https://doi.org/10.1145/3392828",
      "doi": "10.1145/3392828"
    },
    {
      "text": "Brendesha M Tynes, Henry A Willis, Ashley M Stewart, and Matthew W Hamilton. 2019. Race-related traumatic events online and mental health among adolescents of color. Journal of Adolescent Health 65, 3 (2019), 371–377.",
      "doi": ""
    },
    {
      "text": "Stefanie Ullmann and Marcus Tomalin. 2020. Quarantining online hate speech: technical and ethical perspectives. Ethics and Information Technology 22, 1 (2020), 69–80.",
      "doi": ""
    },
    {
      "text": "Jirassaya Uttarapong, Jie Cai, and Donghee Yvette Wohn. 2021. Harassment Experiences of Women and LGBTQ Live Streamers and How They Handled Negativity. (2021), 7–19. https://doi.org/10.1145/3452918.3458794",
      "doi": ""
    },
    {
      "text": "Kristen Vaccaro, Ziang Xiao, Kevin Hamilton, and Karrie Karahalios. 2021. Contestability For Content Moderation. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 318 (oct 2021), 28 pages. https://doi.org/10.1145/3476059",
      "doi": "10.1145/3476059"
    },
    {
      "text": "Maarten W Van Someren, Yvonne F Barnard, and Jacobijn AC Sandberg. 1994. The think aloud method: a practical approach to modelling cognitive. London: AcademicPress 11(1994).",
      "doi": ""
    },
    {
      "text": "Jessica Vitak, Kalyani Chadha, Linda Steiner, and Zahra Ashktorab. 2017. Identifying Women’s Experiences With and Strategies for Mitigating Negative Effects of Online Harassment. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1231–1245. https://doi.org/10.1145/2998181.2998337",
      "doi": "10.1145/2998181.2998337"
    },
    {
      "text": "Emily A. Vogels. 2021. The state of online harassment. https://www.pewresearch.org/internet/2021/01/13/the-state-of-online-harassment/",
      "doi": ""
    },
    {
      "text": "Jeremy Waldron. 2012. The harm in hate speech. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Jeremy Waldron. 2017. The conditions of legitimacy: A response to James Weinstein. Const. Comment. 32(2017), 697.",
      "doi": ""
    },
    {
      "text": "James Weinstein. 2017. Hate speech bans, democracy, and political legitimacy. Const. Comment. 32(2017), 527.",
      "doi": ""
    },
    {
      "text": "Sarah Myers West. 2018. Censored, suspended, shadowbanned: User interpretations of content moderation on social media platforms. New Media & Society(2018).",
      "doi": ""
    },
    {
      "text": "Stephanie N Williams and Annette V Clarke. 2019. How the Desensitization of Police Violence, Stereotyped Language, and Racial Bias Impact Black Communities. Psychology and Cognitive Sciences–Open Journal 5, 2 (2019).",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn. 2019. Volunteer Moderators in Twitch Micro Communities: How They Get Involved, the Roles They Play, and the Emotional Labor They Experience. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 160.",
      "doi": "10.1145/3290605.3300390"
    },
    {
      "text": "Donghee Yvette Wohn and Guo Freeman. 2020. Audience Management Practices of Live Streamers on Twitch. In ACM International Conference on Interactive Media Experiences (Cornella, Barcelona, Spain) (IMX ’20). Association for Computing Machinery, New York, NY, USA, 106–116. https://doi.org/10.1145/3391614.3393653",
      "doi": ""
    },
    {
      "text": "Stephen Wolfram. 2019. Testifying at the Senate about A.I.‑Selected Content on the Internet-Stephen Wolfram Writings. https://writings.stephenwolfram.com/2019/06/testifying-at-the-senate-about-a-i-selected-content-on-the-internet/",
      "doi": ""
    },
    {
      "text": "Haoti Zhong, Hao Li, Anna Squicciarini, Sarah Rajtmajer, Christopher Griffin, David Miller, and Cornelia Caragea. 2016. Content-Driven Detection of Cyberbullying on the Instagram Social Network. In Proceedings of the Twenty-Fifth International Joint Conference on Artificial Intelligence (New York, New York, USA) (IJCAI’16). AAAI Press, 3952–3958.",
      "doi": "10.5555/3061053.3061172"
    }
  ]
}