{
  "doi": "10.1145/3491102.3501978",
  "title": "Focusing for Interaction Design: An Introspective Somatic Method",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "Attending to the challenges of describing first-person experience, this article illustrates different uses of the Focusing method in interaction design and HCI, offering a systematic way of accessing the subtle qualities of lived experiences for design use. In this approach, the implicit bodily knowledge -or felt sense- becomes the material capture of aesthetic experiences used to inform data collection, ideation and prototyping. We offer a high-level, yet systematic coverage of Focusing applied to two case studies, informing both a set of instructions to use the method and a series of design considerations to adopt this understudied tool of introspection in interaction design research and practice.",
  "tags": [
    "Interaction Design",
    "Design Methods",
    "Soma Design",
    "HCI",
    "Focusing"
  ],
  "authors": [
    {
      "name": "Claudia Núñez-Pacheco",
      "institution": "KTH Royal Institute of Technology, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758692457",
      "orcid": "0000-0001-7454-8659"
    },
    {
      "name": "Lian Loke",
      "institution": "Architecture, Design and Planning, The University of Sydney, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309499718",
      "orcid": "0000-0001-7174-8209"
    }
  ],
  "references": [
    {
      "text": "Kristina Andersen and Peter Knees. 2016. The Dial: Exploring Computational Strangeness. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). Association for Computing Machinery, New York, NY, USA, 1352–1358. DOI:https://doi.org/10.1145/2851581.2892439",
      "doi": "10.1145/2851581.2892439"
    },
    {
      "text": "Jane Bacon. 2007. Psyche moving:“Active imagination” and “focusing” in movement-based performance and psychotherapy. Body, Movement and Dance in Psychotherapy 2, 1 (2007), 17–28.",
      "doi": ""
    },
    {
      "text": "Madeline Balaam, Rob Comber, Rachel E. Clarke, Charles Windlin, Anna Ståhl, Kristina Höök, and Geraldine Fitzpatrick. 2019. Emotion Work in Experience-Centered Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 602, 1–12. DOI:https://doi.org/10.1145/3290605.3300832",
      "doi": "10.1145/3290605.3300832"
    },
    {
      "text": "Janet Banfield. 2016. Geography meets Gendlin: an exploration of disciplinary potential through artistic practice. Springer",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2015. Humanistic hci. Synthesis Lectures on Human-Centered Informatics 8, 4 (2015), 1–185.",
      "doi": ""
    },
    {
      "text": "Ilias Bergström and Martin Jonsson. 2016. Sarka: Sonification and Somaesthetic Appreciation Design. In Proceedings of the 3rd International Symposium on Movement and Computing (MOCO '16). Association for Computing Machinery, New York, NY, USA, Article 1, 1–8. DOI:https://doi.org/10.1145/2948910.294892",
      "doi": "10.1145/2948910.2948922"
    },
    {
      "text": "Michel Bitbol and Claire Petitmengin. 2013. A defense of introspection from within. Constructivist Foundations 8, 3 (2013).",
      "doi": ""
    },
    {
      "text": "Kieran Browne and Ben Swift. 2018. The Other Side: Algorithm as Ritual in Artificial Intelligence. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). Association for Computing Machinery, New York, NY, USA, Paper alt11, 1–9. DOI:https://doi.org/10.1145/3170427.3188404",
      "doi": "10.1145/3170427.3188404"
    },
    {
      "text": "Marion Buchenau and Jane Fulton Suri. 2000. Experience prototyping. In Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques (DIS '00). Association for Computing Machinery, New York, NY, USA, 424–433. DOI:https://doi.org/10.1145/347642.347802",
      "doi": "10.1145/347642.347802"
    },
    {
      "text": "Juliet M Corbin and Anselm Strauss. 1990. Grounded theory research: Procedures, canons, and evaluative criteria. Qualitative sociology 13, 1 (1990), 3–21.",
      "doi": ""
    },
    {
      "text": "Ann Weiser Cornell and Barbara McGavin. 2002. The focusing student's and companion's manual. Vol. 1. Focusing Resources.",
      "doi": ""
    },
    {
      "text": "Peter Dalsgaard. 2014. Pragmatism and Design Thinking. International Journal of design 8, 1 (2014).",
      "doi": ""
    },
    {
      "text": "Antonio R Damasio. 1999. The feeling of what happens: Body and emotion in the making of consciousness. Houghton Mifflin Harcourt.",
      "doi": ""
    },
    {
      "text": "Antonio R Damasio. 2012. Self comes to mind: Constructing the conscious brain. Vintage.",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins and Aubree Ball. 2018. Revealing Tensions in Autobiographical Design in HCI. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). Association for Computing Machinery, New York, NY, USA, 753–764. DOI:https://doi.org/10.1145/3196709.319678",
      "doi": "10.1145/3196709.3196781"
    },
    {
      "text": "John Dewey. 1934. Art as experience. Penguin.",
      "doi": ""
    },
    {
      "text": "Brian S. Dixon. 2020. Dewey and Design: A Pragmatist Perspective for Design Research (pp. 1– 208). Cham: Springer International Publishing.",
      "doi": ""
    },
    {
      "text": "Paul Dourish,. 2001. Where the action is: the foundations of embodied interaction: The MIT Press.",
      "doi": ""
    },
    {
      "text": "Sara Eriksson, Kristina Höök, Richard Shusterman, Dag Svanes, Carl Unander-Scharin, and Åsa Unander-Scharin. 2020. Ethics in Movement: Shaping and Being Shaped in Human-Drone Interaction. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI '20). Association for Computing Machinery, New York, NY, USA, 1–14. DOI:https://doi.org/10.1145/3313831.3376678",
      "doi": "10.1145/3313831.3376678"
    },
    {
      "text": "Jules Françoise, Yves Candau, Sarah Fdili Alaoui, and Thecla Schiphorst. 2017. Designing for Kinesthetic Awareness: Revealing User Experiences through Second-Person Inquiry. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 5171–5183. DOI:https://doi.org/10.1145/3025453.3025714",
      "doi": "10.1145/3025453.3025714"
    },
    {
      "text": "Batya Friedman. 1996. Value-sensitive design. interactions 3, 6 (1996), 16–23.",
      "doi": ""
    },
    {
      "text": "Denise Gastaldo, Lilian Magalhães, Christine Carrasco, and Charity Davy. 2012. Body-map storytelling as research: Methodological considerations for telling the stories of undocumented workers through body mapping. Toronto: Creative Commons (2012).",
      "doi": ""
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural probes. interactions 6, 1 (Jan./Feb. 1999), 21–29. DOI:https://doi.org/10.1145/291224.291235",
      "doi": ""
    },
    {
      "text": "Bill Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. In Proceedings of the SIGCHI conference on Human factors in computing systems. 233–240.",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Bill Gaver, Andrew Boucher, Sarah Pennington, and Brendan Walker. 2004. Cultural probes and the value of uncertainty. interactions 11, 5 (2004), 53–56.",
      "doi": ""
    },
    {
      "text": "Eugene T Gendlin. 1978. Focusing: Random House Digital, Inc.",
      "doi": ""
    },
    {
      "text": "Eugene T Gendlin. 1980. Imagery is more powerful with focusing: theory and practice. Imagery, Springer: 65-73.",
      "doi": ""
    },
    {
      "text": "Eugene T Gendlin. 1993. Three assertions about the body. The Folio, 12(1), 21-33.",
      "doi": ""
    },
    {
      "text": "Eugene T Gendlin. 1996. Focusing-oriented psychotherapy: A manual of the experiential method, Guilford Press.",
      "doi": ""
    },
    {
      "text": "Eugene T Gendlin. 2012. Implicit Precision. Knowing Without Thinking: Mind, Action, Cognition and the Phenonenon of the Background, 141.",
      "doi": ""
    },
    {
      "text": "Graham R Gibbs. 2018. Analyzing qualitative data. Vol. 6. Sage.",
      "doi": ""
    },
    {
      "text": "Saul Greenberg, Sheelagh Carpendale, Nicolai Marquardt, and Bill Buxton. 2011. Sketching user experiences: The workbook. Elsevier.",
      "doi": "10.5555/2208198"
    },
    {
      "text": "Steve Harrison, Deborah Tatar, and Phoebe Sengers. 2007. The three paradigms of HCI. In Alt. Chi. Session at the SIGCHI Conference on human factors in computing systems San Jose, California, USA. 1–18.",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl. 2010. “Experience Design: Technology for All the Right Reasons.” Synthesis Lectures on Human-Centered Informatics 3(1): 1–95.",
      "doi": "10.5555/1855019"
    },
    {
      "text": "Karey Helms. 2019. Do You Have to Pee? A Design Space for Intimate and Somatic Data. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19). Association for Computing Machinery, New York, NY, USA, 1209–1222. DOI:https://doi.org/10.1145/3322276.3322290",
      "doi": "10.1145/3322276.3322290"
    },
    {
      "text": "Karen Holtzblatt, Jessamyn Burns Wendell and Shelley Wood. 2004. Rapid contextual design: a how-to guide to key techniques for user-centered design: Elsevier.",
      "doi": ""
    },
    {
      "text": "Sarah Homewood and Anna Vallgårda. 2020. Putting Phenomenological Theories to Work in the Design of Self-Tracking Technologies. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (DIS '20). Association for Computing Machinery, New York, NY, USA, 1833–1846. DOI:https://doi.org/10.1145/3357236.3395550",
      "doi": "10.1145/3357236.3395550"
    },
    {
      "text": "Kristina Höök. 2010. Transferring qualities from horseback riding to design. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (NordiCHI '10). Association for Computing Machinery, New York, NY, USA, 226–235. DOI:https://doi.org/10.1145/1868914.1868943",
      "doi": "10.1145/1868914.1868943"
    },
    {
      "text": "Kristina Höök. 2018. Designing with the body: somaesthetic interaction design. MIT Press",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Sara Eriksson, Marie Louise Juul Søndergaard, Marianela Ciolfi Felice, Nadia Campo Woytuk, Ozgun Kilic Afsar, Vasiliki Tsaknaki, and Anna Ståhl. 2019. Soma Design and Politics of the Body. In Proceedings of the Halfway to the Future Symposium 2019 (HTTF 2019). Association for Computing Machinery, New York, NY, USA, Article 1, 1–8. DOI:https://doi.org/10.1145/3363384.336338",
      "doi": "10.1145/3363384.3363385"
    },
    {
      "text": "Caroline Hummels, Kees CJ Overbeeke, and Sietske Klooster. 2007. Move to get moved: a search for methods, tools and knowledge to design for expressive and rich movement-based interaction. Personal and Ubiquitous Computing 11, 8 (2007), 677–690.",
      "doi": "10.1007/s00779-006-0135-y"
    },
    {
      "text": "Caroline Hummels and Jelle Van Dijk. 2015. Seven principles to design for embodied sensemaking. In Proceedings of the ninth international conference on tangible, embedded, and embodied interaction. 21–28.",
      "doi": "10.1145/2677199.2680577"
    },
    {
      "text": "Akira Ikemi and Shinya Kubota. 1996. Humanistic Psychology in Japanese Corporations: Listening and the: Small Steps of Change. Journal of Humanistic Psychology 36, 1 (1996), 104–121.",
      "doi": ""
    },
    {
      "text": "Akira Ikemi. 2014. Sunflowers, sardines and responsive combodying: Three perspectives on embodiment. Person-centered & experiential psychotherapies 13, 1 (2014), 19–30.",
      "doi": ""
    },
    {
      "text": "Emily Ip, Sunmin Lee, Thecla Schiphorst, 2014. The wearable self: Braiding a feminist critique within a somaesthetics framework for design. In International Conference of Design, User Experience, and Usability. Springer, 285–296.",
      "doi": ""
    },
    {
      "text": "Riitta Jaaskelainen. 2000. Focus on methodology in think-aloud studies on translating. Benjamins Translation Library 37: 71-82.",
      "doi": ""
    },
    {
      "text": "Mark Johnson. 2008, Meaning and the body. New Scientist, 197(2638), 46-47.",
      "doi": ""
    },
    {
      "text": "Mark Johnson 2013. The body in the mind: The bodily basis of meaning, imagination, and reason: University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Jon Kabat-Zinn. 2009. Wherever you go, there you are: Mindfulness meditation in everyday life: Hachette UK.",
      "doi": ""
    },
    {
      "text": "Reuben Kirkham. 2020. Using European Human Rights Jurisprudence for Incorporating Values into Design. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (DIS '20). Association for Computing Machinery, New York, NY, USA, 115–128. DOI:https://doi.org/10.1145/3357236.3395539",
      "doi": "10.1145/3357236.3395539"
    },
    {
      "text": "Scott R. Klemmer, Björn Hartmann, and Leila Takayama. 2006. How bodies matter: five themes for interaction design. In Proceedings of the 6th conference on Designing Interactive systems (DIS '06). Association for Computing Machinery, New York, NY, USA, 140–149. DOI:https://doi.org/10.1145/1142405.1142429",
      "doi": "10.1145/1142405.1142429"
    },
    {
      "text": "Joseph La Delfa, Mehmet Aydin Baytas, Rakesh Patibanda, Hazel Ngari, Rohit Ashok Khot, and Florian 'Floyd' Mueller. 2020. Drone Chi: Somaesthetic Human-Drone Interaction. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. DOI:https://doi.org/10.1145/3313831.3376786",
      "doi": "10.1145/3313831.3376786"
    },
    {
      "text": "George Lakoff and Mark Johnson. 2008. Metaphors we live by: University of Chicago press.",
      "doi": ""
    },
    {
      "text": "Wonjun Lee, Youn-kyung Lim, and Richard Shusterman. 2014. Practicing somaesthetics: exploring its impact on interactive product design ideation. In Proceedings of the 2014 conference on Designing interactive systems(DIS '14). Association for Computing Machinery, New York, NY, USA, 1055–1064. DOI:https://doi.org/10.1145/2598510.2598561",
      "doi": "10.1145/2598510.2598561"
    },
    {
      "text": "David E Lewis., Matthew J. O'Reilly, Sieu K. Khuu, and Joel Pearson. 2013. Conditioning the Mind's Eye: Associative Learning With Voluntary Mental Imagery. Clinical Psychological Science 1, no. 4 (October 2013): 390–400. https://doi.org/10.1177/2167702613484716.",
      "doi": ""
    },
    {
      "text": "Youn-kyung Lim, Erik Stolterman, Heekyoung Jung, and Justin Donaldson. 2007. Interaction gestalt and the design of aesthetic interactions. In Proceedings of the 2007 conference on Designing pleasurable products and interfaces (DPPI '07). Association for Computing Machinery, New York, NY, USA, 239–254. DOI:https://doi.org/10.1145/1314161.1314183",
      "doi": ""
    },
    {
      "text": "Karin Lindgaard and Heico Wesselius. 2017. Once More, with Feeling; Design Thinking and Embodied Cognition. She ji, Journal of Design, Economics and Innovation, 3(2), 83-92.",
      "doi": ""
    },
    {
      "text": "Paul Locher, Kees Overbeeke, and Stephan Wensveen. 2010. Aesthetic interaction: A framework. Design Issues 26, 2 (2010), 70–79.",
      "doi": ""
    },
    {
      "text": "Loke, L., & Robertson, T. (2007). Making strange with the falling body in interactive technology design. Paper presented at the Proceedings of the 3rd European Conference on Design and Semantics of Form and Movement.",
      "doi": ""
    },
    {
      "text": "Lian Loke and Toni Robertson. 2010. Studies of dancers: Moving from experience to interaction design. International Journal of Design (2010).",
      "doi": ""
    },
    {
      "text": "Lian Loke and Toni Robertson. 2011. The lived body in design: Mapping the terrain. In Proceedings of the 23rd Australian Computer-Human Interaction Conference. 181–184.",
      "doi": "10.1145/2071536.2071565"
    },
    {
      "text": "Lian Loke and George Khut. 2014. Intimate Aesthetics and Facilitated Interaction. In L. Candy, Ferguson, S. (Ed.), Interactive Experience in the Digital Age – Evaluating New Art Practice: Springer International Publishing.",
      "doi": ""
    },
    {
      "text": "Lian Loke and Thecla Schiphorst. 2018. The somatic turn in human-computer interaction. interactions 25, 5 (September-October 2018), 54–5863. DOI:https://doi.org/10.1145/3236675.",
      "doi": "10.1145/3236675"
    },
    {
      "text": "Silang Maranan, D., Fdili Alaoui, S., Schiphorst, T., Pasquier, P., Subyen, P., & Bartram, L. (2014). Designing for movement: evaluating computational models using LMA effort qualities. Paper presented at the Proceedings of the 32nd annual ACM conference on Human factors in computing systems.",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura, Laia Turmo Vidal, Asreen Rostami, and Annika Waern. 2016. Embodied Sketching. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 6014–6027. DOI:https://doi.org/10.1145/2858036.2858486",
      "doi": ""
    },
    {
      "text": "John McCarthy and Peter Wright. 2004. Technology as experience. interactions 11, 5 (2004), 42–43.",
      "doi": ""
    },
    {
      "text": "Elisa D. Mekler and Kasper Hornbæk. 2019. A Framework for the Experience of Meaning in Human-Computer Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 225, 1–15. DOI:https://doi.org/10.1145/3290605.3300455",
      "doi": ""
    },
    {
      "text": "Maurice Merleau-Ponty. 1962. Phenomenology of perception: Routledge Classics.",
      "doi": ""
    },
    {
      "text": "Carman Neustaedter and Phoebe Sengers. 2012. Autobiographical design in HCI research: designing and learning through use-it-yourself. In Proceedings of the Designing Interactive Systems Conference (DIS '12). Association for Computing Machinery, New York, NY, USA, 514–523. DOI:https://doi.org/10.1145/2317956.2318034",
      "doi": "10.1145/2317956.2318034"
    },
    {
      "text": "Claudia Núñez-Pacheco. 2018. \"Reflection through Inner Presence: A Sensitising Concept for Design\" Multimodal Technol. Interact. 2, no. 1: 5. https://doi.org/10.3390/mti2010005",
      "doi": ""
    },
    {
      "text": "Claudia Núñez Pacheco and Lian Loke. 2017. Tacit narratives: Surfacing aesthetic meaning by using wearable props and focusing. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction. 233–242.",
      "doi": "10.1145/3024969.3024979"
    },
    {
      "text": "Claudia Núñez-Pacheco and Lian Loke. 2018. Towards a technique for articulating aesthetic experiences in design using Focusing and the Felt Sense. The Design Journal 21, 4 (2018), 583–603.",
      "doi": ""
    },
    {
      "text": "Claudia Núñez-Pacheco and Lian Loke. 2020. Aesthetic Qualities of Thermal and Vibrotactile Materials for Somatic Contemplation. ISEA 2020.",
      "doi": ""
    },
    {
      "text": "Claudia Núñez-Pacheco and Lian Loke. 2020. Getting into someone else's soul: communicating embodied experience.Digital Creativity31, 4 (2020),245–258.",
      "doi": ""
    },
    {
      "text": "Francisco A Olivares, Esteban Vargas, Claudio Fuentes, David Martínez-Pernía, and Andrés Canales-Johnson. 2015. Neurophenomenology revisited: second-person methods for the study of human consciousness. Frontiers in psychology 6 (2015), 673",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Esko Kurvinen, and Tomi Kankainen. 2003. Understanding contexts by being there: case studies in bodystorming. Personal Ubiquitous Comput. 7, 2 (July 2003), 125–134. DOI:https://doi.org/10.1007/s00779-003-0238-7",
      "doi": "10.1007/s00779-003-0238-7"
    },
    {
      "text": "Cale J. Passmore and Regan Mandryk. 2018. An About Face: Diverse Representation in Games. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '18). Association for Computing Machinery, New York, NY, USA, 365–380. DOI:https://doi.org/10.1145/3242671.3242711",
      "doi": ""
    },
    {
      "text": "Marianne Graves Petersen, Ole Sejer Iversen, Peter Gall Krogh, and Martin Ludvigsen. 2004. Aesthetic interaction: a pragmatist's aesthetics of interactive systems. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques (DIS '04). Association for Computing Machinery, New York, NY, USA, 269–276. DOI:https://doi.org/10.1145/1013115.1013153",
      "doi": "10.1145/1013115.1013153"
    },
    {
      "text": "Claire Petitmengin and Jean-Philippe Lachaux. 2013. Microcognitive science: bridging experiential and neuronal microdynamics. Front. Hum. Neurosci. 7:617. doi: 10.3389/fnhum.2013.00617",
      "doi": ""
    },
    {
      "text": "Claire Petitmengin, Martijn van Beek, Michel Bitbol, Jean-Michel Nissou, and Andreas Roepstorff. 2019. Studying the experience of meditation through Micro-phenomenology. Current Opinion in Psychology 28: 54-59.",
      "doi": ""
    },
    {
      "text": "Michael Polanyi. 1967. The tacit dimension. Garden City, New York, 217.",
      "doi": ""
    },
    {
      "text": "Mirjana Prpa, Sarah Fdili-Alaoui, Thecla Schiphorst, and Philippe Pasquier. 2020. Articulating Experience: Reflections from Experts Applying Micro-Phenomenology to Design Research in HCI. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. DOI:https://doi.org/10.1145/3313831.3376664",
      "doi": "10.1145/3313831.3376664"
    },
    {
      "text": "Laury Rappaport. 2008. Focusing-oriented art therapy: Accessing the body's wisdom and creative intelligence: Jessica Kingsley Publishers.",
      "doi": ""
    },
    {
      "text": "Carl R Rogers and Richard E Farson. 1979. Active listening. Organizational Psychology, 168-180.",
      "doi": ""
    },
    {
      "text": "David I Rome. 2014. Your body knows the answer: Using your felt sense to solve problems, effect change, and liberate creativity. Shambhala Publications.",
      "doi": ""
    },
    {
      "text": "Thecla Schiphorst. 2011. Self-evidence: applying somatic connoisseurship to experience design. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). Association for Computing Machinery, New York, NY, USA, 145–160. DOI:https://doi.org/10.1145/1979742.1979640",
      "doi": "10.1145/1979742.1979640"
    },
    {
      "text": "Dennis Schleicher, Peter Jones, and Oksana Kachur. 2010. Bodystorming as embodied designing. interactions17, 6 (November + December 2010), 47–51. DOI:https://doi.org/10.1145/1865245.1865256",
      "doi": ""
    },
    {
      "text": "Donald A Schön. 1984. The architectural studio as an exemplar of education for reflection-in-action. Journal of Architectural Education 38, 1 (1984),",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. 2012. Thinking through the body: Essays in Somaesthetics. New York, Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Stebbins, R. A. 2001. Exploratory research in the social sciences (Vol. 48): Sage.",
      "doi": ""
    },
    {
      "text": "Dag Svanæs and Louise Barkhuus. 2020. The Designer's Body as Resource in Design: Exploring Combinations of Point-of-view and Tense. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. DOI:https://doi.org/10.1145/3313831.3376430",
      "doi": "10.1145/3313831.3376430"
    },
    {
      "text": "Paul Tennent, Joe Marshall, Vasiliki Tsaknaki, Charles Windlin, Kristina Höök, and Miquel Alfaras. 2020. Soma Design and Sensory Misalignment. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. DOI:https://doi.org/10.1145/3313831.3376812",
      "doi": "10.1145/3313831.3376812"
    },
    {
      "text": "Les Todres. 2007. Embodied enquiry: Phenomenological touchstones for research, psychotherapy, and spirituality: Palgrave Macmillan.",
      "doi": ""
    },
    {
      "text": "Vasiliki Tsaknaki, Madeline Balaam, Anna Ståhl, Pedro Sanches, Charles Windlin, Pavel Karpashevich, and Kristina Höök. 2019. Teaching Soma Design. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19). Association for Computing Machinery, New York, NY, USA, 1237–1249. DOI:https://doi.org/10.1145/3322276.3322327",
      "doi": "10.1145/3322276.3322327"
    },
    {
      "text": "Laia Turmo Vidal, Elena Márquez Segura, and Annika Waern. 2018. Sensory bodystorming for collocated physical training design. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (NordiCHI '18). Association for Computing Machinery, New York, NY, USA, 247–259. DOI:https://doi.org/10.1145/3240167.3240224",
      "doi": "10.1145/3240167.3240224"
    },
    {
      "text": "Pierre Vermersch. 2010. Les points de vue en première, seconde et troisième personne dans les trois étapes d'une recherche: conception, réalisation, analyse. Expliciter 85:19-32.",
      "doi": ""
    },
    {
      "text": "HarryWeger Jr, Gina Castle Bell, Elizabeth M Minei, and Melissa C Robinson. 2014. The relative effectiveness of active listening in initial interactions. International Journal of Listening 28, 1 (2014), 13–31",
      "doi": ""
    },
    {
      "text": "Danielle Wilde, Thecla Schiphorst, and Sietske Klooster. 2011. Move to design/design to move: a conversation about designing for the body. interactions, 18(4), 22-27.",
      "doi": ""
    },
    {
      "text": "Danielle Wilde, Anna Vallgårda, and Oscar Tomico. 2017. Embodied Design Ideation Methods: Analysing the Power of Estrangement. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 5158–5170. DOI:https://doi.org/10.1145/3025453.3025873",
      "doi": "10.1145/3025453.3025873"
    },
    {
      "text": "Charles Windlin, Anna Ståhl, Pedro Sanches, Vasiliki Tsaknaki, Pavel Karpashevich, Madeline Balaam, and Kristina Höök. 2019. Soma Bits-Mediating Technology to Orchestrate Bodily Experiences. RTD 2019-Research through Design Conference 2019, the Science Centre, Delft, on 19th to 22nd March 2019.",
      "doi": ""
    },
    {
      "text": "Peter Wright, Jayne Wallace, and John McCarthy. 2008. Aesthetics and experience-centered design. ACM Trans. Comput.-Hum. Interact. 15, 4, Article 18 (November 2008), 21 pages. DOI:https://doi.org/10.1145/1460355.1460360",
      "doi": "10.1145/1460355.1460360"
    },
    {
      "text": "John Zimmerman and Jodi Forlizzi. 2008. The role of design artifacts in design theory construction. Artifact, 2(1), 41-45.",
      "doi": ""
    }
  ]
}