{
  "doi": "10.1145/3491102.3501995",
  "title": "“It’s Kind of Like Code-Switching”: Black Older Adults’ Experiences with a Voice Assistant for Health Information Seeking",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Black older adults from lower socioeconomic environments are often neglected in health technology interventions. Voice assistants have a potential to make healthcare more accessible to older adults, yet, little is known about their experiences with this type of health information seeking, especially Black older adults. Through a three-phase exploratory study, we explored health information seeking with 30 Black older adults in lower-income environments to understand how they ask health-related questions, and their perceptions of the Google Home being used for that purpose. Through our analysis, we identified the health information needs and common search topics, and discussed the communication breakdowns and types of repair performed. We contribute an understanding of cultural code-switching that has to be done by these older adults when interacting with voice assistants, and the importance of such phenomenon when designing for historically excluded groups.",
  "tags": [
    "older adults",
    "code-switching",
    "cultural relevance",
    "race",
    "speech recognition",
    "voice assistants",
    "health information seeking",
    "identity"
  ],
  "authors": [
    {
      "name": "Christina N. Harrington",
      "institution": "HCI Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659201505",
      "orcid": "0000-0003-1850-6459"
    },
    {
      "name": "Radhika Garg",
      "institution": "School of Information Studies, Syracuse University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260587",
      "orcid": "0000-0002-2073-0567"
    },
    {
      "name": "Amanda Woodward",
      "institution": "School of Social Work, Michigan State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660074798",
      "orcid": "missing"
    },
    {
      "name": "Dimitri Williams",
      "institution": "College of Computing and Digital Media, DePaul University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235167",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Omar Abou Khaled and Elena Mugellini. 2021. Seniors’ Perception of Smart Speakers: Challenges and Opportunities Elicited in the Silver&Home Living Lab. In Proceedings of the 21st Congress of the International Ergonomics Association (IEA 2021): Volume II: Inclusive Design. Springer, Virtual, 137.",
      "doi": ""
    },
    {
      "text": "Frans Albarillo. 2018. Information Code-Switching: A Study of Language Preferences in Academic Libraries. College & Research Libraries 79, 5 (2018), 624. https://doi.org/10.5860/crl.79.5.624",
      "doi": ""
    },
    {
      "text": "H Samy Alim and Geneva Smitherman. 2012. Articulate while Black: Barack Obama, language, and race in the US. Oxford University Press, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Monica Anderson and Andrew Perrin. 2017.. Pew Research Center, Washington, DC, USA. https://www.pewresearch.org/internet/2017/05/17/tech-adoption-climbs-among-older-adults/",
      "doi": ""
    },
    {
      "text": "A Baker-Bell. 2017. I can switch my language, but I can’t switch my skin:What teachers must understand about linguistic racism.Corwin Press Thousand Oaks, CA, 97–109.",
      "doi": ""
    },
    {
      "text": "April Baker-Bell. 2020. Dismantling anti-black linguistic racism in English language arts classrooms: Toward an anti-racist black language pedagogy. Theory Into Practice 59, 1 (2020), 8–21.",
      "doi": ""
    },
    {
      "text": "Laura H Barg-Walkow, Christina N Harrington, Tracy L Mitzner, Jordan Q Hartley, and Wendy A Rogers. 2017. Understanding older adults’ perceptions of and attitudes towards exergames. Gerontechnology: international journal on the fundamental aspects of technology to serve the ageing society 16, 2 (2017), 81.",
      "doi": ""
    },
    {
      "text": "Erin Beneteau, Olivia K. Richards, Mingrui Zhang, Julie A. Kientz, Jason Yip, and Alexis Hiniker. 2019. Communication Breakdowns Between Families and Alexa. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi-org.libezproxy2.syr.edu/10.1145/3290605.3300473",
      "doi": ""
    },
    {
      "text": "Ruha Benjamin. 2019. Race after technology: Abolitionist tools for the new jim code. Polity, USA.",
      "doi": ""
    },
    {
      "text": "Ruha Benjamin. 2019. White Supremacy and Artificial Intelligence. Solutions Journalism. https://www.yesmagazine.org/social-justice/2019/08/29/technology-racism-artificial-intelligence-white-supremacy",
      "doi": ""
    },
    {
      "text": "Frank Bentley, Chris Luvogt, Max Silverman, Rushani Wirasinghe, Brooke White, and Danielle Lottridge. 2018. Understanding the long-term use of smart speaker assistants. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 3 (2018), 1–24.",
      "doi": "10.1145/3264901"
    },
    {
      "text": "Timothy W Bickmore, Rebecca A Silliman, Kerrie Nelson, Debbie M Cheng, Michael Winter, Lori Henault, and Michael K Paasche-Orlow. 2013. A Randomized Controlled Trial of an Automated Exercise Coach for Older Adults. Journal of the American Geriatrics Society 61, 10 (2013), 1676–1683. https://doi.org/10.1111/jgs.12449",
      "doi": ""
    },
    {
      "text": "Kenneth A Blocker, Travis Kadylak, Lyndsie M Koon, Christopher E Kovac, and Wendy A Rogers. 2020. Digital Home Assistants and Aging: Initial Perspectives from Novice Older Adult Users. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 64. SAGE Publications Sage CA, Los Angeles, CA, 1367–1371. Issue 1.",
      "doi": ""
    },
    {
      "text": "Jan-Petter Blom, John J Gumperz, 2000. Social meaning in linguistic structure: Code-switching in Norway (2nd ed.). London: Routledge, London, 111–136. https://doi.org/10.4324/9781003060406",
      "doi": ""
    },
    {
      "text": "Barbara E Bullock and Almeida Jacqueline Toribio. 2009. Themes in the study of code-switching.Cambridge University Press, United Kingdom, Chapter 1, 1–18.",
      "doi": ""
    },
    {
      "text": "US Census Bureau. 2021. Older Americans Month: May 2021. https://www.census.gov/newsroom/stories/older-americans-month.html",
      "doi": ""
    },
    {
      "text": "Devon W Carbado and Mitu Gulati. 1999. Working identity. Cornell L. Rev. 85(1999), 1259.",
      "doi": ""
    },
    {
      "text": "Clare Carroll, Catherine Chiodo, Adena Xin Lin, Meg Nidever, and Jayanth Prathipati. 2017. Robin: enabling independence for individuals with cognitive disabilities using voice assistive technology. In Proceedings of the 2017 CHI conference extended abstracts on human factors in computing systems. ACM, New York, NY, USA, 46–53.",
      "doi": "10.1145/3027063.3049266"
    },
    {
      "text": "Nancy Carter, Denise Bryant-Lukosiu, Alba DiCenso, Jennifer Blythe, and Alan J. Neville. 2014. The use of triangulation in qualitative research. Oncology Nursing Forum 41, 5 (Sep 2014), 545–547.",
      "doi": ""
    },
    {
      "text": "Justine Cassell. 2009. Social practice: Becoming enculturated in human-computer interaction. In International conference on universal access in human-computer interaction. Springer, San Diego, CA, USA, 303–313.",
      "doi": "10.1007/978-3-642-02713-0_32"
    },
    {
      "text": "Janghee Cho and Emilee Rader. 2020. The Role of Conversational Grounding in Supporting Symbiosis Between People and Digital Assistants. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–28.",
      "doi": "10.1145/3392838"
    },
    {
      "text": "Noam Chomsky 2006. Language and mind. Cambridge University Press, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Karen Church and Barry Smyth. 2009. Understanding the intent behind mobile information needs. In Proceedings of the 14th international conference on Intelligent user interfaces. ACM, New York, NY, USA, 247–256.",
      "doi": "10.1145/1502650.1502686"
    },
    {
      "text": "Leigh Clark, Nadia Pantidi, Orla Cooney, Philip Doyle, Diego Garaialde, Justin Edwards, Brendan Spillane, Emer Gilmartin, Christine Murad, Cosmin Munteanu, Vincent Wade, and Benjamin R. Cowan. 2019. What Makes a Good Conversation? Challenges in Designing Truly Conversational Agents. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300705",
      "doi": "10.1145/3290605.3300705"
    },
    {
      "text": "Lisa Delpit. 1996. Other people’s children: Cultural conflict in the classroom. The New York Press, New York.",
      "doi": ""
    },
    {
      "text": "Gilbert Dizon. 2017. Using intelligent personal assistants for second language learning: A case study of Alexa. Tesol Journal 8, 4 (2017), 811–830.",
      "doi": ""
    },
    {
      "text": "Rachel Dorn. 2019. Dialect-specific models for automatic speech recognition of African American vernacular English. In Proceedings of the Student Research Workshop Associated with RANLP 2019. INCOMA Ltd., Varna, Bulgaria, 16–20.",
      "doi": ""
    },
    {
      "text": "Xiaotong Du, Willow Yao, and Sunyoung Kim. 2021. Lessons Learned from Supporting Low-Income Older Adults to Use a Tablet PC in the Age of Digital Divide. In Adjunct Publication of the 23rd International Conference on Mobile Human-Computer Interaction (Virtual) (MobileHCI ’21 Adjunct). Association for Computing Machinery, New York, NY, USA, Article 14, 5 pages. https://doi.org/10.1145/3447527.3474860",
      "doi": "10.1145/3447527.3474860"
    },
    {
      "text": "Mark Dworkin, Apurba Chakraborty, Sangyoon Lee, Colleen Monahan, Lisa Hightow-Weidman, Robert Garofalo, Dima Qato, and Antonio Jimenez. 2018. A realistic talking human embodied agent mobile phone intervention to promote HIV medication adherence and retention in care in young HIV-positive African American men who have sex with men: qualitative study. JMIR mHealth and uHealth 6, 7 (2018), e10211.",
      "doi": ""
    },
    {
      "text": "Ari J Elliot, Christopher J Mooney, Kathryn Z Douthit, and Martin F Lynch. 2014. Predictors of older adults’ technology use and its relationship to depressive symptoms and well-being. Journals of Gerontology Series B: Psychological Sciences and Social Sciences 69, 5 (2014), 667–677.",
      "doi": ""
    },
    {
      "text": "David Elsweiler, Stefan Mandl, and Brian Kirkegaard Lunn. 2010. Understanding casual-leisure information needs: a diary study in the context of television viewing. In Proceedings of the third symposium on Information interaction in context. ACM, New York, NY, USA, 25–34.",
      "doi": "10.1145/1840784.1840790"
    },
    {
      "text": "Tony Fernandes. 1995. Global Interface Design: A Guide to Designing International User Interfaces. Academic Press Professional, Inc., USA.",
      "doi": "10.5555/207588"
    },
    {
      "text": "Samantha Finkelstein, Amy Ogan, Caroline Vaughn, and Justine Cassell. 2013. Alex: A virtual peer that identifies student dialect. In Proc. Workshop on Culturally-aware Technology Enhanced Learning in conjuction with EC-TEL (Bozen-Bolzano, Italy). Springer, New York, NY, USA, 1–4.",
      "doi": ""
    },
    {
      "text": "Rachel Garfield, Anthony Damico, and Kendal Orgera. 2020. The coverage gap: uninsured poor adults in states that do not expand Medicaid. Peterson KFF-Health System Tracker. Disponível em:. Acesso em 29(2020), 1–11.",
      "doi": ""
    },
    {
      "text": "Radhika Garg and Yash Cui, Hua andKapadia. 2021. “Learn, Use, and (Intermittently) Abandon”: Exploring the Practices of Early Smart Speaker Adopters in Urban India. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 351 (October 2021), 27 pages. https://doi.org/10.1145/3359165",
      "doi": "10.1145/3479495"
    },
    {
      "text": "Radhika Garg and Subhasree Sengupta. 2019. “When you can do it, why can’t I?”: Racial and Socioeconomic Differences in Family Technology Use and Non-Use. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–22.",
      "doi": "10.1145/3359165"
    },
    {
      "text": "Radhika Garg and Subhasree Sengupta. 2020. He Is Just Like Me: A Study of the Long-Term Use of Smart Speakers by Parents and Children. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 1, Article 11 (March 2020), 24 pages. https://doi.org/10.1145/3381002",
      "doi": "10.1145/3381002"
    },
    {
      "text": "Darrell J Gaskin, Roland J Thorpe Jr, Emma E McGinty, Kelly Bower, Charles Rohde, J Hunter Young, Thomas A LaVeist, and Lisa Dubay. 2014. Disparities in diabetes: the nexus of race, poverty, and place. American journal of public health 104, 11 (2014), 2147–2155.",
      "doi": ""
    },
    {
      "text": "Isabela Gasparini, Marcelo S. Pimenta, and José Palazzo M. De Oliveira. 2011. Vive La DifféRence! A Survey of Cultural-Aware Issues in HCI. In Proceedings of the 10th Brazilian Symposium on Human Factors in Computing Systems and the 5th Latin American Conference on Human-Computer Interaction (Porto de Galinhas, Pernambuco, Brazil) (IHC+CLIHC ’11). Brazilian Computer Society, Porto Alegre, BRA, 13–22.",
      "doi": ""
    },
    {
      "text": "Andrea Grimes and Richard Harper. 2008. Celebratory Technology: New Directions for Food Research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 467–476. https://doi.org/10.1145/1357054.1357130",
      "doi": "10.1145/1357054.1357130"
    },
    {
      "text": "Itika Gupta, Barbara Di Eugenio, Devika Salunke, Andrew Boyd, Paula Allen-Meares, Carolyn Dickens, and Olga Garcia. 2020. Heart Failure Education of African American and Hispanic/Latino Patients: Data Collection and Analysis. In Proceedings of the First Workshop on Natural Language Processing for Medical Conversations. Association for Computational Linguistics, Stroudsburg, PA, 41–46.",
      "doi": ""
    },
    {
      "text": "LaToya N Hall, Lisa J Ficker, Letha A Chadiha, Carmen R Green, James S Jackson, and Peter A Lichtenberg. 2016. Promoting retention: African American older adults in a research volunteer registry. Gerontology and geriatric medicine 2 (2016), 2333721416677469.",
      "doi": ""
    },
    {
      "text": "Christina Harrington, Sheena Erete, and Anne Marie Piper. 2019. Deconstructing community-based collaborative design: Towards more equitable participatory design engagements. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–25.",
      "doi": "10.1145/3359318"
    },
    {
      "text": "Christina N. Harrington. 2020. The Forgotten Margins: What is Community-Based Participatory Health Design Telling Us?Interactions 27, 3 (April 2020), 24–29. https://doi.org/10.1145/3386381",
      "doi": "10.1145/3386381"
    },
    {
      "text": "Christina N. Harrington, Katya Borgos-Rodriguez, and Anne Marie Piper. 2019. Engaging Low-Income African American Older Adults in Health Discussions through Community-Based Design Workshops. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300823",
      "doi": "10.1145/3290605.3300823"
    },
    {
      "text": "Courtney Heldreth and Tabitha Yong. 2021. Racial Equity in Everyday Products - Library. https://design.google/library/racial-equity-everyday-products/",
      "doi": ""
    },
    {
      "text": "Man Huang, Derek Hansen, and Bo Xie. 2012. Older Adults’ Online Health Information Seeking Behavior. In Proceedings of the 2012 IConference. Association for Computing Machinery, New York, NY, USA, 338–345. https://doi.org/10.1145/2132176.2132220",
      "doi": "10.1145/2132176.2132220"
    },
    {
      "text": "Brian Jack, Timothy Bickmore, Megan Hempstead, Leanne Yinusa-Nyahkoon, Ekaterina Sadikova, Suzanne Mitchell, Paula Gardiner, Fatima Adigun, Brian Penti, Daniel Schulman, 2015. Reducing preconception risks among African American women with conversational agent technology. The Journal of the American Board of Family Medicine 28, 4 (2015), 441–451.",
      "doi": ""
    },
    {
      "text": "Mohit Jain, Pratyush Kumar, Ishita Bhansali, Q Vera Liao, Khai Truong, and Shwetak Patel. 2018. FarmChat: a conversational agent to answer farmer queries. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (2018), 1–22.",
      "doi": "10.1145/3287048"
    },
    {
      "text": "KIM JUNHAN, JANA MUHIC, SUN YOUNG PARK, and LIONEL ROBERT. 2021. Trustworthy Conversational Agent Design for African Americans with Chronic Conditions during COVID-19. In CHI 2021 Workshop Realizing AI in Healthcare: Challenges Appearing in the Wild. ACM, New York, NY, 1–7.",
      "doi": ""
    },
    {
      "text": "Naveena Karusala, Aditya Vishwanath, Aditya Vashistha, Sunita Kumar, and Neha Kumar. 2018. “Only if you use English you will get to more things” Using Smartphones to Navigate Multilingualism. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–14.",
      "doi": ""
    },
    {
      "text": "Linus Kendall, Bidisha Chaudhuri, and Apoorva Bhalla. 2020. Understanding Technology as Situated Practice: Everyday use of Voice User Interfaces Among Diverse Groups of Users in Urban India. Information Systems Frontiers 22, 3 (2020), 585–605. https://doi.org/10.1007/s10796-020-10015-6",
      "doi": ""
    },
    {
      "text": "Tyler Kendall, Jason McLarty, and Brooke Josler. 2018. Online Resources for African American Language. https://oraal.uoregon.edu/facts",
      "doi": ""
    },
    {
      "text": "Junhan Kim, Sun Young Park, and Lionel P. Robert. 2020. Bridging the Health Disparity of African Americans Through Conversational Agents. Digit. Gov.: Res. Pract. 2, 1, Article 4 (Nov. 2020), 7 pages. https://doi.org/10.1145/3428122",
      "doi": ""
    },
    {
      "text": "Sunyoung Kim. 2021. Exploring How Older Adults Use a Smart Speaker–Based Voice Assistant in Their First Interactions: Qualitative Study. JMIR mHealth and uHealth 9, 1 (2021), e20427.",
      "doi": ""
    },
    {
      "text": "Sunyoung Kim and Abhishek Choudhury. 2021. Exploring older adults’ perception and use of smart speaker-based voice assistants: A longitudinal study. Computers in Human Behavior 124 (2021), 106914. https://doi.org/10.1016/j.chb.2021.106914",
      "doi": "10.1016/j.chb.2021.106914"
    },
    {
      "text": "Melanie Hines Knapp. 2015. African American Vernacular English (AAVE) In The Classroom: The Attitudes And Ideologies Of Urban Educators Toward AAVE. Ph.D. Dissertation. University of Mississippi.",
      "doi": ""
    },
    {
      "text": "Lisa M Koch, Alan M Gross, and Russell Kolts. 2001. Attitudes toward Black English and code switching. Journal of Black psychology 27, 1 (2001), 29–42.",
      "doi": ""
    },
    {
      "text": "Rafal Kocielnik, Raina Langevin, James S. George, Shota Akenaga, Amelia Wang, Darwin P. Jones, Alexander Argyle, Callan Fockele, Layla Anderson, Dennis T. Hsieh, Kabir Yadav, Herbert Duber, Gary Hsieh, and Andrea L. Hartzler. 2021. Can I Talk to You about Your Social Needs? Understanding Preference for Conversational User Interface in Health. In CUI 2021 - 3rd Conference on Conversational User Interfaces (Bilbao (online), Spain) (CUI ’21). Association for Computing Machinery, New York, NY, USA, Article 4, 10 pages. https://doi.org/10.1145/3469595.3469599",
      "doi": ""
    },
    {
      "text": "Allison Koenecke, Andrew Nam, Emily Lake, Joe Nudell, Minnie Quartey, Zion Mengesha, Connor Toups, John R Rickford, Dan Jurafsky, and Sharad Goel. 2020. Racial disparities in automated speech recognition. Proceedings of the National Academy of Sciences 117, 14(2020), 7684–7689.",
      "doi": ""
    },
    {
      "text": "Lyndsie M Koon, Sean A McGlynn, Kenneth A Blocker, and Wendy A Rogers. 2020. Perceptions of digital assistants from early adopters aged 55+. Ergonomics in Design 28, 1 (2020), 16–23.",
      "doi": ""
    },
    {
      "text": "Sylvie D. Lambert and Carmen G. Loiselle. 2008. Combining individual interviews and focus groups to enhance data richness. Journal of Advanced Nursing 62, 2 (2008), 228–237. https://doi.org/10.1111/j.1365-2648.2007.04559.x",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Mark Diaz, Robin Brewer, Chelsea Kim, and Anne Marie Piper. 2017. Going Gray, Failure to Hire, and the Ick Factor: Analyzing How Older Bloggers Talk about Ageism. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 655–668. https://doi.org/10.1145/2998181.2998275",
      "doi": "10.1145/2998181.2998275"
    },
    {
      "text": "Matt Levinson. 2013. The Digital Lives of Teens: Code Switching. https://www.edutopia.org/blog/digital-teens-code-switching-matt-levinson",
      "doi": ""
    },
    {
      "text": "Silvia B. Lovato, Anne Marie Piper, and Ellen A. Wartella. 2019. Hey Google, Do Unicorns Exist? Conversational Agents as a Path to Answers to Children’s Questions. In Proceedings of the 18th ACM International Conference on Interaction Design and Children (Boise, ID, USA) (IDC ’19). Association for Computing Machinery, New York, NY, USA, 301–313. https://doi.org/10.1145/3311927.3323150",
      "doi": "10.1145/3311927.3323150"
    },
    {
      "text": "Aaron Marcus and Emilie West Gould. 2000. Crosscurrents: Cultural Dimensions and Global Web User-Interface Design. Interactions 7, 4 (July 2000), 32–46. https://doi.org/10.1145/345190.345238",
      "doi": ""
    },
    {
      "text": "Aqueasha Martin-Hammond, Sravani Vemireddy, and Kartik Rao. 2018. Engaging Older Adults in the Participatory Design of Intelligent Health Search Tools. In Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare (New York, NY, USA) (PervasiveHealth ’18). Association for Computing Machinery, New York, NY, USA, 280–284. https://doi.org/10.1145/3240925.3240972",
      "doi": "10.1145/3240925.3240972"
    },
    {
      "text": "Aqueasha Martin-Hammond, Sravani Vemireddy, and Kartik Rao. 2019. Exploring older adults’ beliefs about the use of intelligent assistants for consumer health information management: A participatory design study. JMIR aging 2, 2 (2019), e15381.",
      "doi": ""
    },
    {
      "text": "Fabio Masina, Valeria Orso, Patrik Pluchino, Giulia Dainese, Stefania Volpato, Cristian Nelini, Daniela Mapelli, Anna Spagnolli, and Luciano Gamberini. 2020. Investigating the accessibility of voice assistants with impaired users: mixed methods study. Journal of medical Internet research 22, 9 (2020), e18431.",
      "doi": ""
    },
    {
      "text": "Courtney L. McCluney, Kathrina Robotham, Serenity Lee, Richard Smith, and Myles Durkee. 2019. The Costs of Code-Switching. Harvard Business Publishing. https://hbr.org/2019/11/the-costs-of-codeswitching",
      "doi": ""
    },
    {
      "text": "Sanjana Mendu, Mehdi Boukhechba, Janna R. Gordon, Debajyoti Datta, Edwin Molina, Gloria Arroyo, Sara K. Proctor, Kristen J. Wells, and Laura E. Barnes. 2018. Design of a Culturally-Informed Virtual Human for Educating Hispanic Women about Cervical Cancer. In Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare (New York, NY, USA) (PervasiveHealth ’18). Association for Computing Machinery, New York, NY, USA, 360–366. https://doi.org/10.1145/3240925.3240968",
      "doi": "10.1145/3240925.3240968"
    },
    {
      "text": "Carol Myers-Scotton. 1992. The Rise of Codeswitching as a Research Topic. Social Motivations for Codeswitching: Evidence from Africa 4 (1992), 7–7.",
      "doi": ""
    },
    {
      "text": "Phani Nallam, Siddhant Bhandari, Jamie Sanders, and Aqueasha Martin-Hammond. 2020. A Question of Access: Exploring the Perceived Benefits and Barriers of Intelligent Voice Assistants for Improving Access to Consumer Health Resources Among Low-Income Older Adults. Gerontology and Geriatric Medicine 6 (2020), 2333721420985975.",
      "doi": ""
    },
    {
      "text": "Jaye Nias and Margie Ruffin. 2020. CultureBot: A Culturally Relevant Humanoid Robotic Dialogue Agent. In Proceedings of the 2020 ACM Southeast Conference (Tampa, FL, USA) (ACM SE ’20). Association for Computing Machinery, New York, NY, USA, 280–283. https://doi.org/10.1145/3374135.3385306",
      "doi": "10.1145/3374135.3385306"
    },
    {
      "text": "NPR. 2020. The Smart Audio Report. Technical Report. National Public Radio. https://www.nationalpublicmedia.com/uploads/2020/04/The-Smart-Audio-Report_Spring-2020.pdf",
      "doi": ""
    },
    {
      "text": "Jung Sun Oh, Daqing He, Wei Jeng, Eleanor Mattern, and Leanne Bowler. 2013. Linguistic characteristics of eating disorder questions on Yahoo! Answers–content, style, and emotion. Proceedings of the American Society for Information Science and Technology 50, 1 (2013), 1–10.",
      "doi": ""
    },
    {
      "text": "Sanghee Oh, Kaitlin L Costello, Annie T Chen, and Barbara M Wildemuth. 2016. Qualitative methods for studying health information behaviors. Proceedings of the Association for Information Science and Technology 53, 1 (2016), 1–5.",
      "doi": ""
    },
    {
      "text": "Otis L Owens, Tisha Felder, Abbas S Tavakoli, Asa A Revels, Daniela B Friedman, Chanita Hughes-Halbert, and James R Hébert. 2019. Evaluation of a computer-based decision aid for promoting informed prostate cancer screening decisions among African American men: iDecide. American Journal of Health Promotion 33, 2 (2019), 267–278.",
      "doi": ""
    },
    {
      "text": "Alastair Pennycook. 2004. Performativity and language studies. Critical inquiry in language studies: An international journal 1, 1(2004), 1–19.",
      "doi": ""
    },
    {
      "text": "Alisha Pradhan, Leah Findlater, and Amanda Lazar. 2019. “Phantom Friend” or “Just a Box with Information”: Personification and Ontological Categorization of Smart Speaker-Based Voice Assistants by Older Adults. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 214 (Nov. 2019), 21 pages. https://doi.org/10.1145/3359316",
      "doi": "10.1145/3359316"
    },
    {
      "text": "Alisha Pradhan, Ben Jelen, Katie A. Siek, Joel Chan, and Amanda Lazar. 2020. Understanding Older Adults’ Participation in Design Workshops. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376299",
      "doi": ""
    },
    {
      "text": "Alisha Pradhan, Amanda Lazar, and Leah Findlater. 2020. Use of Intelligent Voice Assistants by Older Adults with Low Technology Use. ACM Trans. Comput.-Hum. Interact. 27, 4, Article 31 (Sept. 2020), 27 pages. https://doi.org/10.1145/3373759",
      "doi": "10.1145/3373759"
    },
    {
      "text": "Alisha Pradhan, Kanika Mehta, and Leah Findlater. 2018. “Accessibility Came by Accident” Use of Voice-Controlled Intelligent Personal Assistants by People with Disabilities. In Proceedings of the 2018 CHI Conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": ""
    },
    {
      "text": "Geoffrey K Pullum. 1999. African American Vernacular English is not standard English with mistakes. Praeger, Westport, CT, 59–66.",
      "doi": ""
    },
    {
      "text": "Sandeep Purao, Haijing Hao, and Chenhang Meng. 2021. The Use of Smart Home Speakers by the Elderly: Exploratory Analyses and Potential for Big Data. Big Data Research 25(2021), 100224. https://doi.org/10.1016/j.bdr.2021.100224",
      "doi": "10.1016/j.bdr.2021.100224"
    },
    {
      "text": "Verónica Caridad Rabelo, Kathrina J. Robotham, and Courtney L. McCluney. 2020. “Against a sharp white background”: How Black women experience the white gaze at work. Gender, Work & Organization n/a, n/a (2020), 1–19. https://doi.org/10.1111/gwao.12564 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/gwao.12564",
      "doi": ""
    },
    {
      "text": "Emilee Rader, Margaret Echelbarger, and Justine Cassell. 2011. Brick by Brick: Iterating Interventions to Bridge the Achievement Gap with Virtual Peers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 2971–2974. https://doi.org/10.1145/1978942.1979382",
      "doi": "10.1145/1978942.1979382"
    },
    {
      "text": "John Russell Rickford. 1999. African American vernacular English: Features, evolution, educational implications. Wiley-Blackwell, Hoboken, NJ.",
      "doi": ""
    },
    {
      "text": "Simon Robinson, Jennifer Pearson, Shashank Ahire, Rini Ahirwar, Bhakti Bhikne, Nimish Maravi, and Matt Jones. 2018. Revisiting “Hole in the Wall” Computing: Private Smart Speakers and Public Slum Settings. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3174072",
      "doi": "10.1145/3173574.3174072"
    },
    {
      "text": "Jamie Sanders and Aqueasha Martin-Hammond. 2019. Exploring Autonomy in the Design of an Intelligent Health Assistant for Older Adults. In Proceedings of the 24th International Conference on Intelligent User Interfaces: Companion (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 95–96. https://doi.org/10.1145/3308557.3308713",
      "doi": "10.1145/3308557.3308713"
    },
    {
      "text": "Ari Schlesinger, Kenton P. O’Hara, and Alex S. Taylor. 2018. Let’s Talk About Race: Identity, Chatbots, and AI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173889",
      "doi": "10.1145/3173574.3173889"
    },
    {
      "text": "Anna Schlomann, Hans-Werner Wahl, Peter Zentel, Vera Heyl, Leonore Knapp, Christiane Opfermann, Torsten Krämer, and Christian Rietz. 2021. Potential and Pitfalls of Digital Voice Assistants in Older Adults With and Without Intellectual Disabilities: Relevance of Participatory Design Elements and Ecologically Valid Field Studies. Frontiers in Psychology 12 (2021), 1–5.",
      "doi": ""
    },
    {
      "text": "Korok Sengupta, Sayan Sarcar, Alisha Pradhan, Roisin McNaney, Sergio Sayago, Debaleena Chattopadhyay, and Anirudha Joshi. 2020. Challenges and Opportunities of Leveraging Intelligent Conversational Assistant to Improve the Well-Being of Older Adults. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3334480.3381057",
      "doi": "10.1145/3334480.3381057"
    },
    {
      "text": "Ji Youn Shin and Jina Huh-Yoo. 2020. Designing Everyday Conversational Agents for Managing Health and Wellness: A Study of Alexa Skills Reviews. In Proceedings of the 14th EAI International Conference on Pervasive Computing Technologies for Healthcare (Atlanta, GA). ACM, New York, NY, USA, 50–61.",
      "doi": "10.1145/3421937.3422024"
    },
    {
      "text": "Andy Smith, Anirudha Joshi, Zhengjie Liu, Liam Bannon, Jan Gulliksen, and Christina Li. 2007. Institutionalizing HCI in Asia. In IFIP Conference on Human-Computer Interaction(Rio de Janeiro, Brazil). Springer, New York, NY, USA, 85–99.",
      "doi": ""
    },
    {
      "text": "Linda Tuhiwai Smith. 2021. Decolonizing methodologies: Research and indigenous peoples. Zed Books Ltd., United Kingdom.",
      "doi": ""
    },
    {
      "text": "Milka Trajkova and Aqueasha Martin-Hammond. 2020. “Alexa is a Toy”: Exploring Older Adults’ Reasons for Using, Limiting, and Abandoning Echo. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376760",
      "doi": "10.1145/3313831.3376760"
    },
    {
      "text": "Alexandra Vtyurina, Denis Savenkov, Eugene Agichtein, and Charles L. A. Clarke. 2017. Exploring Conversational Search With Humans, Assistants, and Wizards. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 2187–2193. https://doi.org/10.1145/3027063.3053175",
      "doi": ""
    },
    {
      "text": "Carl Weinschenk. 2021. Smart Speaker Research Finds Strong Adoption by Seniors. https://www.telecompetitor.com/smart-speaker-research-finds-strong-adoption-by-seniors/",
      "doi": ""
    },
    {
      "text": "Adia Harvey Wingfield. 2012. Changing times for Black professionals. Routledge, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Marisol Wong-Villacres, Aakash Gautam, Wendy Roldan, Lucy Pei, Jessa Dickinson, Azra Ismail, Betsy DiSalvo, Neha Kumar, Tammy Clegg, Sheena Erete, Emily Roden, Nithya Sambasivan, and Jason Yip. 2020. From Needs to Strengths: Operationalizing an Assets-Based Design of Technology. Association for Computing Machinery, New York, NY, USA, 527–535. https://doi-org.ezproxy.depaul.edu/10.1145/3406865.3418594",
      "doi": ""
    }
  ]
}