{
  "doi": "10.1145/3491102.3517708",
  "title": "Tech Help Desk: Support for Local Entrepreneurs Addressing the Long Tail of Computing Challenges",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "Even entrepreneurs whose businesses are not technological (e.g., handmade goods) need to be able to use a wide range of computing technologies in order to achieve their business goals. In this paper, we follow a participatory action research approach and collaborate with various stakeholders at an entrepreneurial co-working space to design “Tech Help Desk”, an on-going technical service for entrepreneurs. Our model for technical assistance is strategic, in how it is designed to fit the context of local entrepreneurs, and responsive, in how it prioritizes emergent needs. From our engagements with 19 entrepreneurs and support personnel, we reflect on the challenges with existing technology support for non-technological entrepreneurs. Our work highlights the importance of ensuring technological support services can adapt based on entrepreneurs’ ever-evolving priorities, preferences and constraints. Furthermore, we find technological support services should maintain broad technical support for entrepreneurs’ long tail of computing challenges.",
  "tags": [
    "technical assistance",
    "action research",
    "entrepreneurship",
    "community engagement",
    "small business"
  ],
  "authors": [
    {
      "name": "Yasmine Kotturi",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658689472",
      "orcid": "missing"
    },
    {
      "name": "Herman T Johnson",
      "institution": "Community Forge, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240387",
      "orcid": "missing"
    },
    {
      "name": "Michael Skirpan",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658688252",
      "orcid": "missing"
    },
    {
      "name": "Sarah E Fox",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758668257",
      "orcid": "0000-0002-7888-2598"
    },
    {
      "name": "Jeffrey P Bigham",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487593",
      "orcid": "0000-0002-2072-0625"
    },
    {
      "name": "Amy Pavel",
      "institution": "Carnegie Mellon University, United States and Computer Science Department, The University of Texas at Austin, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87258908457",
      "orcid": "0000-0002-3908-4366"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. Allegheny County, Equity and Inclusion. https://www.alleghenycounty.us/equity-inclusion/index.aspx. Accessed: 2021-09-01.",
      "doi": ""
    },
    {
      "text": "[n.d.]. Carnegie Mellon University created a map excluding nearby Black neighborhoods. https://www.publicsource.org/cmu-created-a-map-excluding-pittsburghs-black-neighborhoods-its-not-the-only-one/. Accessed: 2021-09-01.",
      "doi": ""
    },
    {
      "text": "[n.d.]. Carnegie Mellon University students to sign petition to confront local racism. https://actionnetwork.org/petitions/cmu-confront-racist-policing-in-our-community. Accessed: 2021-09-01.",
      "doi": ""
    },
    {
      "text": "[n.d.]. Pittsburgh, P.A., Report of Inequality Across Gender and Race. https://apps.pittsburghpa.gov/redtail/images/7109_Pittsburgh's_Inequality_Across_Gender_and_Race_09_18_19.pdf. Accessed: 2021-09-01.",
      "doi": ""
    },
    {
      "text": "[n.d.]. Wilkinsburg, P.A., Demographics. https://en.wikipedia.org/wiki/Wilkinsburg,_Pennsylvania. Accessed: 2021-09-01.",
      "doi": ""
    },
    {
      "text": "Kirsti Ala-Mutka. 2011. Mapping digital competence: Towards a conceptual understanding. (2011).",
      "doi": ""
    },
    {
      "text": "BY arc(). [n.d.]. codementor. https://www.codementor.io.",
      "doi": ""
    },
    {
      "text": "American Library Association. [n.d.]. Digital Literacy. https://literacy.ala.org/digital-literacy/.",
      "doi": ""
    },
    {
      "text": "Seyram Avle, Julie Hui, Silvia Lindtner, and Tawanna Dillahunt. 2019. Additional labors of the entrepreneurial self. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–24.",
      "doi": "10.1145/3359320"
    },
    {
      "text": "Rekha Balu, Pei Zhu, Fred Doolittle, Ellen Schiller, Joseph Jenkins, and Russell Gersten. 2015. Evaluation of Response to Intervention Practices for Elementary School Reading. NCEE 2016-4000.National Center for Education Evaluation and Regional Assistance (2015).",
      "doi": ""
    },
    {
      "text": "Fran Baum, Colin MacDougall, and Danielle Smith. 2006. Participatory action research. Journal of epidemiology and community health 60, 10 (2006), 854.",
      "doi": ""
    },
    {
      "text": "Elisabeth Beaunoyer, Sophie Dupéré, and Matthieu J Guitton. 2020. COVID-19 and digital inequalities: Reciprocal impacts and mitigation strategies. Computers in human behavior 111 (2020), 106424.",
      "doi": ""
    },
    {
      "text": "Andrew Begel and Nachiappan Nagappan. 2008. Pair programming: what’s in it for me?. In Proceedings of the Second ACM-IEEE international symposium on Empirical software engineering and measurement. 120–128.",
      "doi": "10.1145/1414004.1414026"
    },
    {
      "text": "John Carlo Bertot, Abigail McDermott, Ruth Lincoln, Brian Real, and Kaitlin Peterson. 2012. Public library funding and technology access survey: Survey findings and results. College Park, MD: Information Policy and Access Center (2012).",
      "doi": ""
    },
    {
      "text": "Stephen Billett, Raymond Smith, and Michelle Barker. 2005. Understanding work, learning and the remaking of cultural practices. Studies in continuing education 27, 3 (2005), 219–237.",
      "doi": ""
    },
    {
      "text": "Benjamin S Bloom. 1984. The 2 sigma problem: The search for methods of group instruction as effective as one-to-one tutoring. Educational researcher 13, 6 (1984), 4–16.",
      "doi": ""
    },
    {
      "text": "Chris Bopp, Ellie Harmon, and Amy Voida. 2017. Disempowered by data: Nonprofits, social enterprises, and the consequences of data-driven work. In Proceedings of the 2017 CHI conference on human factors in computing systems. 3608–3619.",
      "doi": "10.1145/3025453.3025694"
    },
    {
      "text": "Niels Bosma, Mirjam Van Praag, Roy Thurik, and Gerrit De Wit. 2004. The value of human and social capital investments for the business performance of startups. Small Business Economics 23, 3 (2004), 227–236.",
      "doi": ""
    },
    {
      "text": "Verizon Buisiness. [n.d.]. Verizon Business Survey Finds 68 of Small Businesses Believe They Can Recoup COVID-19 Related Losses. https://www.globenewswire.com/news-release/2020/05/26/2038680/0/en/Verizon-Business-Survey-Finds-68-of-Small-Businesses-Believe-They-Can-Recoup-COVID-19-Related-Losses.html.",
      "doi": ""
    },
    {
      "text": "Colleen Casey. 2014. Critical connections: The importance of community-based organizations and social capital to credit access for low-wealth entrepreneurs. Urban Affairs Review 50, 3 (2014), 366–390.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz and Linda Liska Belgrave. 2007. Grounded theory. The Blackwell encyclopedia of sociology(2007).",
      "doi": ""
    },
    {
      "text": "Parmit K Chilana, Nathaniel Hudson, Srinjita Bhaduri, Prashant Shashikumar, and Shaun Kane. 2018. Supporting remote real-time expert help: Opportunities and challenges for novice 3d modelers. In 2018 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). IEEE, 157–166.",
      "doi": ""
    },
    {
      "text": "Parmit K Chilana, Andrew J Ko, Jacob O Wobbrock, and Tovi Grossman. 2013. A multi-site field study of crowdsourced contextual help: usage and perspectives of end users and software teams. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 217–226.",
      "doi": "10.1145/2470654.2470685"
    },
    {
      "text": "What Works Clearinghouse. 2009. Assisting students struggling with reading: Response to intervention (RtI) and multi-tier intervention in the primary grades. Washington, DC: The Institute of Education Sciences (IES) (2009).",
      "doi": ""
    },
    {
      "text": "Anne Corden and Roy Sainsbury. 2006. Using verbatim quotations in reporting qualitative social research: researchers’ views. University of York York.",
      "doi": ""
    },
    {
      "text": "Ryan Decker, John Haltiwanger, Ron Jarmin, and Javier Miranda. 2014. The role of entrepreneurship in US job creation and economic dynamism. Journal of Economic Perspectives 28, 3 (2014), 3–24.",
      "doi": ""
    },
    {
      "text": "Tawanna R Dillahunt, Vaishnav Kameswaran, Desiree McLain, Minnie Lester, Delores Orr, and Kentaro Toyama. 2018. Entrepreneurship and the socio-technical chasm in a lean economy. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3173574.3173814"
    },
    {
      "text": "Lynn S Fuchs and Douglas Fuchs. 2007. A model for implementing responsiveness to intervention. Teaching exceptional children 39, 5 (2007), 14–20.",
      "doi": ""
    },
    {
      "text": "George W. Furnas, Thomas K. Landauer, Louis M. Gomez, and Susan T. Dumais. 1987. The vocabulary problem in human-system communication. Commun. ACM 30, 11 (1987), 964–971.",
      "doi": "10.1145/32206.32212"
    },
    {
      "text": "Diego Gambetta. 1988. Trust: Making and breaking cooperative relations. (1988).",
      "doi": ""
    },
    {
      "text": "Michelle Gantt and Bonnie A Nardi. 1992. Gardeners and gurus: patterns of cooperation among CAD users. In Proceedings of the SIGCHI conference on Human factors in computing systems. 107–117.",
      "doi": "10.1145/142750.142767"
    },
    {
      "text": "Morteza Ghobakhloo, Daniel Arias-Aranda, and Jose Benitez-Amado. 2011. Adoption of e-commerce applications in SMEs. Industrial Management & Data Systems(2011).",
      "doi": ""
    },
    {
      "text": "Christine A Halverson, Thomas Erickson, and Mark S Ackerman. 2004. Behind the help desk: evolution of a knowledge management system in a large organization. In Proceedings of the 2004 ACM conference on Computer supported cooperative work. 304–313.",
      "doi": "10.1145/1031607.1031657"
    },
    {
      "text": "Brian Hanks, Sue Fitzgerald, Renée McCauley, Laurie Murphy, and Carol Zander. 2011. Pair programming in education: A literature review. Computer Science Education 21, 2 (2011), 135–173.",
      "doi": ""
    },
    {
      "text": "Christina Harrington, Sheena Erete, and Anne Marie Piper. 2019. Deconstructing community-based collaborative design: Towards more equitable participatory design engagements. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–25.",
      "doi": "10.1145/3359318"
    },
    {
      "text": "Christina N Harrington, Katya Borgos-Rodriguez, and Anne Marie Piper. 2019. Engaging Low-Income African American Older Adults in Health Discussions through Community-based Design Workshops. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 593.",
      "doi": "10.1145/3290605.3300823"
    },
    {
      "text": "John Hattie and Helen Timperley. 2007. The power of feedback. Review of educational research 77, 1 (2007), 81–112.",
      "doi": ""
    },
    {
      "text": "Gillian R Hayes. 2011. The relationship of action research to human-computer interaction. ACM Transactions on Computer-Human Interaction (TOCHI) 18, 3(2011), 1–20.",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "Richard House. 2013. Too much too soon?: Early learning and the erosion of childhood. Hawthorn Press.",
      "doi": ""
    },
    {
      "text": "Julie Hui, Nefer Ra Barber, Wendy Casey, Suzanne Cleage, Danny C Dolley, Frances Worthy, Kentaro Toyama, and Tawanna R Dillahunt. 2020. Community collectives: Low-tech social support for digitally-engaged entrepreneurship. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376363"
    },
    {
      "text": "Julie Hui, Kentaro Toyama, Joyojeet Pal, and Tawanna Dillahunt. 2018. Making a living my way: Necessity-driven entrepreneurship in resource-constrained communities. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–24.",
      "doi": "10.1145/3274340"
    },
    {
      "text": "Kenan Institute. [n.d.]. Business incubators if you build it will entrepreneurs succeed. https://kenaninstitute.unc.edu/kenan-insight/business-incubators-if-you-build-it-will-entrepreneurs-succeed/.",
      "doi": ""
    },
    {
      "text": "Shane R Jimerson, Matthew K Burns, and Amanda M VanDerHeyden. 2016. From response to intervention to multi-tiered systems of support: Advances in the science and practice of assessment and intervention. In Handbook of response to intervention. Springer, 1–6.",
      "doi": ""
    },
    {
      "text": "Nikhita Joshi, Justin Matejka, Fraser Anderson, Tovi Grossman, and George Fitzmaurice. 2020. Micromentor: Peer-to-peer software help sessions in three minutes or less. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376230"
    },
    {
      "text": "Andrew J Ko, Brad A Myers, and Htet Htet Aung. 2004. Six learning barriers in end-user programming systems. In 2004 IEEE Symposium on Visual Languages-Human Centric Computing. IEEE, 199–206.",
      "doi": "10.1109/VLHCC.2004.47"
    },
    {
      "text": "Robert E Kraut 1987. Technology and the transformation of white-collar work. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Edward P Lazear. 2004. Balanced skills and entrepreneurship. American Economic Review 94, 2 (2004), 208–211.",
      "doi": ""
    },
    {
      "text": "Christopher A Le Dantec and Sarah Fox. 2015. Strangers at the gate: Gaining access, building rapport, and co-constructing community-based research. In Proceedings of the 18th ACM conference on computer supported cooperative work & social computing. 1348–1358.",
      "doi": "10.1145/2675133.2675147"
    },
    {
      "text": "Jungwoo Lee. 2004. Discriminant analysis of technology adoption behavior: a case of internet technologies in small businesses. Journal of computer information systems 44, 4 (2004), 57–66.",
      "doi": ""
    },
    {
      "text": "Calvin A Liang, Sean A Munson, and Julie A Kientz. 2021. Embracing Four Tensions in Human-Computer Interaction Research with Marginalized People. ACM Transactions on Computer-Human Interaction (TOCHI) 28, 2(2021), 1–47.",
      "doi": "10.1145/3443686"
    },
    {
      "text": "Wendy E Mackay. 1990. Patterns of sharing customizable software. In Proceedings of the 1990 ACM conference on Computer-supported cooperative work. 209–221.",
      "doi": "10.1145/99332.99356"
    },
    {
      "text": "Gideon D Markman and Robert A Baron. 2003. Person–entrepreneurship fit: why some people are more successful as entrepreneurs than others. Human resource management review 13, 2 (2003), 281–301.",
      "doi": ""
    },
    {
      "text": "Matthew R Marvel, Justin L Davis, and Curtis R Sproul. 2016. Human capital and entrepreneurship research: A critical review and future directions. Entrepreneurship Theory and Practice 40, 3 (2016), 599–626.",
      "doi": ""
    },
    {
      "text": "Douglas Massey and Nancy A Denton. 1993. American apartheid: Segregation and the making of the underclass. Harvard university press.",
      "doi": ""
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2011. IP-QAT: in-product questions, answers, & tips. In Proceedings of the 24th annual ACM symposium on User interface software and technology. 175–184.",
      "doi": "10.1145/2047196.2047218"
    },
    {
      "text": "Stanford Social Innovation Review Matthew Guttentag. [n.d.]. Six Ways to Support Small and Growing Businesses in Emerging Markets. https://ssir.org/articles/entry/six_ways_to_support_small_and_growing_businesses_in_emerging_markets.",
      "doi": ""
    },
    {
      "text": "McKinsey. [n.d.]. How COVID-19 has pushed companies over the technology tipping point and transformed business forever. https://www.mckinsey.com/business-functions/strategy-and-corporate-finance/our-insights/how-covid-19-has-pushed-companies-over-the-technology-tipping-point-and-transformed-business-forever.",
      "doi": ""
    },
    {
      "text": "Robert Alan Meeder. 1983. College affiliated small business development centers: A case study of the Southwestern Pennsylvania Business Development Center. Ph.D. Dissertation. University of Pittsburgh.",
      "doi": ""
    },
    {
      "text": "David Neumark, Brandon Wall, and Junfu Zhang. 2011. Do small businesses create more jobs? New evidence for the United States from the National Establishment Time Series. The Review of Economics and Statistics 93, 1 (2011), 16–29.",
      "doi": ""
    },
    {
      "text": "David G Novick, Edith Elizalde, and Nathaniel Bean. 2007. Toward a more accurate view of when and how people seek help with computer applications. In Proceedings of the 25th annual ACM international conference on Design of communication. 95–102.",
      "doi": "10.1145/1297144.1297165"
    },
    {
      "text": "OECD. [n.d.]. UNIVERSITY ENTREPRENEURSHIP SUPPORT: POLICY ISSUES, GOOD PRACTICES AND RECOMMENDATIONS. https://www.oecd.org/education/imhe/46588578.pdf.",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Kentaro Toyama, and Tawanna R Dillahunt. 2019. Towards an effective digital literacy intervention to assist returning citizens with job search. In Proceedings of the 2019 CHI conference on Human factors in computing systems. 1–12.",
      "doi": "10.1145/3290605.3300315"
    },
    {
      "text": "Lucy Pei and Roderic Crooks. 2020. Attenuated Access: Accounting for Startup, Maintenance, and Affective Costs in Resource-Constrained Communities. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376587"
    },
    {
      "text": "Noopur Raval and Joyojeet Pal. 2019. Making a” Pro”:’professionalism’after platforms in beauty-work. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–17.",
      "doi": ""
    },
    {
      "text": "Laura Robinson, Shelia R Cotten, Hiroshi Ono, Anabel Quan-Haase, Gustavo Mesch, Wenhong Chen, Jeremy Schulz, Timothy M Hale, and Michael J Stern. 2015. Digital inequalities and why they matter. Information, communication & society 18, 5 (2015), 569–582.",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, W Keith Edwards, and Rebecca E Grinter. 2017. Intersectional HCI: Engaging identity through gender, race, and class. In Proceedings of the 2017 CHI conference on human factors in computing systems. 5412–5427.",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Vandana Singh, Michael B Twidale, and Dinesh Rathi. 2006. Open source technical support: A look at peer help-giving. In Proceedings of the 39th Annual Hawaii International Conference on System Sciences (HICSS’06), Vol. 6. IEEE, 118c–118c.",
      "doi": "10.1109/HICSS.2006.370"
    },
    {
      "text": "Kim M Thompson, Paul T Jaeger, Natalie Greene Taylor, Mega Subramaniam, and John Carlo Bertot. 2014. Digital literacy and digital inclusion: Information policy and the public library. Rowman & Littlefield.",
      "doi": ""
    },
    {
      "text": "Jasper Tran O’Leary, Sara Zewde, Jennifer Mankoff, and Daniela K Rosner. 2019. Who gets to future? Race, representation, and design methods in Africatown. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300791"
    },
    {
      "text": "Michael B Twidale. 2005. Over the shoulder learning: supporting brief informal learning. Computer supported cooperative work (CSCW) 14, 6 (2005), 505–547.",
      "doi": ""
    },
    {
      "text": "Alexander Van Deursen and Jan Van Dijk. 2011. Internet skills and the digital divide. New media & society 13, 6 (2011), 893–911.",
      "doi": ""
    },
    {
      "text": "Laton Vermette, Joanna McGrenere, Colin Birge, Adam Kelly, and Parmit K Chilana. 2019. Freedom to personalize my digital classroom: Understanding teachers’ practices and motivations. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300548"
    },
    {
      "text": "Gerald M Weinberg. 1971. The psychology of computer programming. Vol. 29. Van Nostrand Reinhold New York.",
      "doi": ""
    },
    {
      "text": "Barbara M Wildemuth. 2004. The effects of domain knowledge on search tactic formulation. Journal of the american society for information science and technology 55, 3 (2004), 246–258.",
      "doi": "10.1002/asi.10367"
    },
    {
      "text": "Colin C Williams. 2008. Beyond necessity-driven versus opportunity-driven entrepreneurship: a study of informal entrepreneurs in England, Russia and Ukraine. The International Journal of Entrepreneurship and Innovation 9, 3(2008), 157–165.",
      "doi": ""
    },
    {
      "text": "Richmond Y Wong, Vera Khovanskaya, Sarah E Fox, Nick Merrill, and Phoebe Sengers. 2020. Infrastructural Speculations: Tactics for Designing and Interrogating Lifeworlds. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376515"
    }
  ]
}