{
  "doi": "10.1145/3491102.3502034",
  "title": "AirRacket: Perceptual Design of Ungrounded, Directional Force Feedback to Improve Virtual Racket Sports Experiences",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [
    "Best Paper"
  ],
  "abstract": "We present AirRacket, perceptual modeling and design of ungrounded, directional force feedback for virtual racket sports. Using compressed air propulsion jets to provide directional impact forces, we iteratively designed for three popular sports that span a wide range of force magnitudes: ping-pong, badminton, and tennis. To address the limited force magnitude of ungrounded force feedback technologies, we conducted a perception study which discovered the novel illusion that users perceive larger impact force magnitudes with longer impact duration, by an average factor of 2.57x. Through a series of formative, perceptual, and user experience studies with a combined total of 72 unique participants, we explored several perceptual designs using force magnitude scaling and duration scaling methods to expand the dynamic range of perceived force magnitude. Our user experience evaluation showed that perceptual designs can significantly improve realism and preference vs. physics-based designs for ungrounded force feedback systems.",
  "authors": [
    {
      "name": "Ching-Yi Tsai",
      "institution": "National Taiwan University, Taiwan",
      "img": "/do/10.1145/contrib-99659503784/rel-imgonly/white-feather-quill-and-inkpot.jpg",
      "acmid": "99659503784",
      "orcid": "missing"
    },
    {
      "name": "I-Lun Tsai",
      "institution": "Department of Computer Science and Information Engineering/ College of Electrical Engineering and Computer Science/, National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239619",
      "orcid": "missing"
    },
    {
      "name": "Chao-Jung Lai",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239187",
      "orcid": "missing"
    },
    {
      "name": "Derrek Chow",
      "institution": "University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239073",
      "orcid": "missing"
    },
    {
      "name": "Lauren Wei",
      "institution": "University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239360",
      "orcid": "missing"
    },
    {
      "name": "Lung-Pan Cheng",
      "institution": "National Taiwan University, Taiwan",
      "img": "/do/10.1145/contrib-81470651683/rel-imgonly/32956970-44d4-41fa-95c3-df5faf94a414_1_201_a.jpeg",
      "acmid": "81470651683",
      "orcid": "0000-0002-7712-8622"
    },
    {
      "name": "Mike Y. Chen",
      "institution": "National Taiwan University, Taiwan",
      "img": "/do/10.1145/contrib-81460645188/rel-imgonly/mikebiophotosmall.jpg",
      "acmid": "81460645188",
      "orcid": "0000-0001-5410-652X"
    }
  ],
  "references": [
    {
      "text": "Tomohiro Amemiya, Hideyuki Ando, and Taro Maeda. 2008. Lead-Me Interface for a Pulling Sensation from Hand-Held Devices. ACM Trans. Appl. Percept. 5, 3, Article 15 (Sept. 2008), 17 pages. https://doi.org/10.1145/1402236.1402239",
      "doi": "10.1145/1402236.1402239"
    },
    {
      "text": "Ivan Setia Arianto, Nuri Nuri, and Agus Yulianto. 2017. Effect of the pull and diameter string of badminton racket based on coeffisient of restitution value. Journal Of Natural Sciences And Mathematics Research 2, 1 (2017), 85–90.",
      "doi": ""
    },
    {
      "text": "Christiane Attig, Nadine Rauh, Thomas Franke, and Josef Krems. 2017. System Latency Guidelines Then and Now – Is Zero Latency Really Considered Necessary?. In Engineering Psychology and Cognitive Ergonomics: Cognition and Design, Don Harris (Ed.). Springer International Publishing, Vancouver, BC, Canada, 3–14. https://doi.org/10.1007/978-3-319-58475-1_1",
      "doi": ""
    },
    {
      "text": "Yuki Ban, Takuji Narumi, Tatsuya Fujii, Sho Sakurai, Jun Imura, Tomohiro Tanikawa, and Michitaka Hirose. 2013. Augmented Endurance: Controlling Fatigue While Handling Objects by Affecting Weight Perception Using Augmented Reality. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 69–78. https://doi.org/10.1145/2470654.2470665",
      "doi": "10.1145/2470654.2470665"
    },
    {
      "text": "Yuki Ban and Yusuke Ujitoko. 2021. Hit-Stop in VR: Combination of Pseudo-haptics and Vibration Enhances Impact Sensation. In 2021 IEEE World Haptics Conference (WHC). IEEE, IEEE, Montreal, QC, Canada, 991–996.",
      "doi": ""
    },
    {
      "text": "Ernest Baumgardt and Beverly Hillmann. 1961. Duration and size as determinants of peripheral retinal response. JOSA 51, 3 (1961), 340–344.",
      "doi": ""
    },
    {
      "text": "Taisa Belli, Milton Shoiti Misuta, Pedro Paulo Ribeiro de Moura, Thomas Dos Santos Tavares, Renê Augusto Ribeiro, Yura Yuka Sato Dos Santos, Karine Jacon Sarro, and Larissa Rafaela Galatti. 2019. Reproducibility and Validity of a Stroke Effectiveness Test in Table Tennis Based on the Temporal Game Structure. Frontiers in psychology 10 (28 Feb 2019), 427–427. https://doi.org/10.3389/fpsyg.2019.00427 https://pubmed.ncbi.nlm.nih.gov/30890981, https://doi.org/10.3389/fpsyg.2019.00427, 30890981[pmid],PMC6413726[pmcid].",
      "doi": ""
    },
    {
      "text": "Elias Blomstrand and Mike Demant. 2017. Simulation of a badminton racket-A parametric study of racket design parameters using FEA. Master’s thesis. Chalmers University of Technology.",
      "doi": ""
    },
    {
      "text": "Howard Brody. 1997. The physics of tennis. III. The ball–racket interaction. American Journal of Physics 65, 10 (1997), 981–987.",
      "doi": ""
    },
    {
      "text": "Tennis Companion. 2020. Tennis Racquet Weight, Balance & Swingweight Explained. https://tenniscompanion.org/tennis-racquet-weight-and-balance/",
      "doi": ""
    },
    {
      "text": "Rod Cross. 2014. Impact behavior of hollow balls. American Journal of Physics 82, 3 (2014), 189–195.",
      "doi": ""
    },
    {
      "text": "Rod Cross. 2014. Impact of sports balls with striking implements. Sports Engineering 17, 1 (2014), 3–22.",
      "doi": ""
    },
    {
      "text": "Rod Cross. 2017. Impact of a ping-pong ball. Physics Education 52, 3 (2017), 033002.",
      "doi": ""
    },
    {
      "text": "Massimiliano Di Luca and Arash Mahnan. 2019. Perceptual limits of visual-haptic simultaneity in virtual reality interactions. In 2019 IEEE World Haptics Conference (WHC). IEEE, IEEE, New York, NY, USA, 67–72.",
      "doi": ""
    },
    {
      "text": "Jörn Diedrichsen, Timothy Verstynen, Andrew Hon, Yi Zhang, and Richard Ivry. 2007. Illusions of Force Perception: The Role of Sensori-Motor Predictions, Visual Information, and Motor Errors. Journal of neurophysiology 97 (06 2007), 3305–13. https://doi.org/10.1152/jn.01076.2006",
      "doi": ""
    },
    {
      "text": "Gösta Ekman. 1966. Temporal integration of brightness. Vision research 6, 11-12 (1966), 683–688.",
      "doi": ""
    },
    {
      "text": "Sikana English. 2020. What Is a Forehand Shot in Badminton?https://www.thebadmintonguide.com/what-is-a-forehand-shot-in-badminton/",
      "doi": ""
    },
    {
      "text": "Farzam Farbiz, Zhou Hao Yu, Corey Manders, and Waqas Ahmad. 2007. An Electrical Muscle Stimulation Haptic Feedback for Mixed Reality Tennis Game. In ACM SIGGRAPH 2007 Posters (San Diego, California) (SIGGRAPH ’07). Association for Computing Machinery, New York, NY, USA, 140–es. https://doi.org/10.1145/1280720.1280873",
      "doi": "10.1145/1280720.1280873"
    },
    {
      "text": "Miguel A. Gomez, Anthony S. Leicht, Fernando Rivas, and Philip Furley. 2020. Long rallies and next rally performances in elite men’s and women’s badminton. PLOS ONE 15, 3 (03 2020), 1–16. https://doi.org/10.1371/journal.pone.0229604",
      "doi": ""
    },
    {
      "text": "Jun Gong, Da-Yuan Huang, Teddy Seyed, Te Lin, Tao Hou, Xin Liu, Molin Yang, Boyu Yang, Yuhan Zhang, and Xing-Dong Yang. 2018. Jetto: Using Lateral Force Feedback for Smartwatch Interactions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 426, 14 pages. https://doi.org/10.1145/3173574.3174000",
      "doi": "10.1145/3173574.3174000"
    },
    {
      "text": "SR Goodwill, Robert Kirk, and SJ Haake. 2005. Experimental and finite element analysis of a tennis ball impact on a rigid surface. Sports engineering 8, 3 (2005), 145–158.",
      "doi": ""
    },
    {
      "text": "Hakan Gurocak and Benjamin Parrish. 2002. AirGlove: a force feedback device for virtual reality. In Telemanipulator and Telepresence Technologies VIII. SPIE, Boston, MA, United States, 69–77. https://doi.org/10.1117/12.454731",
      "doi": ""
    },
    {
      "text": "Sung H Han, Maengkee Song, and Jiyoung Kwahk. 1999. A systematic method for analyzing magnitude estimation data. International Journal of Industrial Ergonomics 23, 5-6(1999), 513–524.",
      "doi": ""
    },
    {
      "text": "Seongkook Heo, Christina Chung, Geehyuk Lee, and Daniel Wigdor. 2018. Thor’s Hammer: An Ungrounded Force Feedback Device Utilizing Propeller-Induced Propulsive Force. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3174099",
      "doi": "10.1145/3173574.3174099"
    },
    {
      "text": "HTC. 2017. VIVE Racket Sports Set. https://www.vive.com/us/VR-racket-sports-set/",
      "doi": ""
    },
    {
      "text": "HTC. 2018. VIVE Controller. https://www.vive.com/us/accessory/controller2018/",
      "doi": ""
    },
    {
      "text": "HTC. 2019. VIVE VR Ping Pong Pro. https://www.viveport.com/b8691ae6-43b4-4565-b688-7a99c344d2f9",
      "doi": ""
    },
    {
      "text": "IMADA CO.,LTD.2017. IMADA ZTS-20N. https://www.forcegauge.net/en/catalog/zts010",
      "doi": ""
    },
    {
      "text": "Seungwoo Je, Myung Jin Kim, Woojin Lee, Byungjoo Lee, Xing-Dong Yang, Pedro Lopes, and Andrea Bianchi. 2019. Aero-Plane: A Handheld Force-Feedback Device That Renders Weight Motion Illusion on a Virtual 2D Plane. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 763–775. https://doi.org/10.1145/3332165.3347926",
      "doi": "10.1145/3332165.3347926"
    },
    {
      "text": "Seungwoo Je, Hyelip Lee, Myung Jin Kim, and Andrea Bianchi. 2018. Wind-Blaster: A Wearable Propeller-Based Prototype That Provides Ungrounded Force-Feedback. In ACM SIGGRAPH 2018 Emerging Technologies (Vancouver, British Columbia, Canada) (SIGGRAPH ’18). Association for Computing Machinery, New York, NY, USA, Article 23, 2 pages. https://doi.org/10.1145/3214907.3214915",
      "doi": "10.1145/3214907.3214915"
    },
    {
      "text": "Lynette A Jones and Hong Z Tan. 2012. Application of psychophysical techniques to haptic research. IEEE transactions on haptics 6, 3 (2012), 268–284.",
      "doi": ""
    },
    {
      "text": "Hiroyuki Kambara, Duk Shin, Toshihiro Kawase, Natsue Yoshimura, Katsuhito Akahane, Makoto Sato, and Yasuharu Koike. 2013. The effect of temporal perception on weight perception. Frontiers in psychology 4 (2013), 40.",
      "doi": ""
    },
    {
      "text": "DUANE V KNUDSON. 1991. Factors affecting force loading. J Sports Med Phys Fitness 31 (1991), 527–31.",
      "doi": ""
    },
    {
      "text": "Karl D Kryter and Karl S Pearsons. 1963. Some effects of spectral content and duration on perceived noise level. The Journal of the Acoustical Society of America 35, 6 (1963), 866–883.",
      "doi": ""
    },
    {
      "text": "For Fun Labs. 2020. Eleven: Table Tennis VR. https://elevenvr.com/",
      "doi": ""
    },
    {
      "text": "Anatole Lécuyer. 2009. Simulating haptic feedback using vision: A survey of research and applications of pseudo-haptic feedback. Presence: Teleoperators and Virtual Environments 18, 1(2009), 39–53.",
      "doi": "10.1162/pres.18.1.39"
    },
    {
      "text": "Marjorie R Leek. 2001. Adaptive procedures in psychophysical research. Perception & psychophysics 63, 8 (2001), 1279–1292.",
      "doi": ""
    },
    {
      "text": "Averlynn Lim. 2019. How to execute a Table Tennis Forehand and Backhand?https://www.myactivesg.com/Sports/Table-Tennis/Training-Method/Table-Tennis-for-Beginners/Table-Tennis-Forehand-and-Backhand",
      "doi": ""
    },
    {
      "text": "Shi-Hong Liu, Pai-Chien Yen, Yi-Hsuan Mao, Yu-Hsin Lin, Erick Chandra, and Mike Y Chen. 2020. HeadBlaster: a wearable approach to simulating motion perception using head-mounted air propulsion jets. ACM Transactions on Graphics (TOG) 39, 4 (2020), 84–1.",
      "doi": "10.1145/3386569.3392482"
    },
    {
      "text": "Y King Liu. 1983. Mechanical analysis of racket and ball during impact.Medicine and Science in Sports and Exercise 15, 5 (1983), 388–392.",
      "doi": ""
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: Simulating Physical Impact by Combining Tactile Stimulation with Electrical Muscle Stimulation. In Proceedings of the 28th Annual ACM Symposium on User Interface Software Technology (Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 11–19. https://doi.org/10.1145/2807442.2807443",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "S. Mack, E.R. Kandel, T.M. Jessell, J.H. Schwartz, S.A. Siegelbaum, and A.J. Hudspeth. 2013. Principles of Neural Science, Fifth Edition. McGraw-Hill Education, New York, NY, USA. https://books.google.com.tw/books?id=s64z-LdAIsEC",
      "doi": ""
    },
    {
      "text": "Lawrence E Marks. 1988. Magnitude estimation and sensory matching. Perception & Psychophysics 43, 6 (1988), 511–525.",
      "doi": ""
    },
    {
      "text": "Mayank. 2019. What is the Ideal Weight for a Good Badminton Racket?https://badmintonracketz.com/badminton-racket-weight/",
      "doi": ""
    },
    {
      "text": "Nintendo. 2017. Nintendo Switch Pro Controller. https://www.nintendo.com.hk/hardware/switch/accessories/",
      "doi": ""
    },
    {
      "text": "Nintendo. 2018. Instant Tennis. https://www.nintendo.com/games/detail/instant-tennis-switch/",
      "doi": ""
    },
    {
      "text": "Nintendo. 2020. ”Top Selling Title Sales Unit”. https://www.nintendo.co.jp/ir/en/finance/software/wii.html",
      "doi": ""
    },
    {
      "text": "P. O’Flynn, S. Maune, P. Clarke, Korrine Cook, and Samuel R. Atcherson. 2014. Impulse Noise: Can Hitting a Softball Harm Your Hearing?The Scientific World Journal 2014 (2014), 702723. https://doi.org/10.1155/2014/702723",
      "doi": ""
    },
    {
      "text": "Ryuta Okazaki and Hiroyuki Kajimoto. 2014. Altering distance perception from hitting with a stick by superimposing vibration to holding hand. In International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, Springer Berlin Heidelberg, Berlin, Heidelberg, 112–119.",
      "doi": ""
    },
    {
      "text": "OptiTrack. 2021. Primex-13. https://optitrack.com/cameras/primex-13/",
      "doi": ""
    },
    {
      "text": "Panasonic. 2002. 2SC1384 Transistor. https://pl-1.org/getproductfile.axd?id=3374&filename=2SC1384.pdf",
      "doi": ""
    },
    {
      "text": "PISCO. 2017. Low Friction Polyurethane Tube, UBS. https://en.pisco.co.jp/product/detail/d/d04/?fbclid=IwAR11e5fWiZlcjBgdxVjUk9DSO9NRLbCIBXtG-N_FCw2HNoIN_YpZSR_65Ps",
      "doi": ""
    },
    {
      "text": "Markus Rank, Zhuanghua Shi, Hermann J. Müller, and Sandra Hirche. 2010. Perception of delay in haptic telepresence systems. Presence: teleoperators and virtual environments 19, 5(2010), 389–399.",
      "doi": ""
    },
    {
      "text": "Jun Rekimoto. 2013. Traxion: A Tactile Interaction Device with Virtual Force Sensation. In ACM SIGGRAPH 2014 Emerging Technologies (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 427–432. https://doi.org/10.1145/2501988.2502044",
      "doi": "10.1145/2501988.2502044"
    },
    {
      "text": "E Paul Roetert and Mark Kovacs. 2019. Tennis anatomy. Human Kinetics, Champaign, Illinois, USA.",
      "doi": ""
    },
    {
      "text": "Joseph M. Romano and Katherine J. Kuchenbecker. 2009. The AirWand: Design and Characterization of a Large-Workspace Haptic Device. In Proceedings of the 2009 IEEE International Conference on Robotics and Automation (Kobe, Japan) (ICRA’09). IEEE Press, New York, NY, USA, 1010–1015.",
      "doi": ""
    },
    {
      "text": "Majed Samad, Elia Gatti, Anne Hermes, Hrvoje Benko, and Cesare Parise. 2019. Pseudo-haptic weight: Changing the perceived weight of virtual objects by manipulating control-display ratio. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3290605.3300550"
    },
    {
      "text": "Tomoya Sasaki, Richard Sahala Hartanto, Kao-Hua Liu, Keitarou Tsuchiya, Atsushi Hiyama, and Masahiko Inami. 2018. Leviopole: mid-air haptic interactions using multirotor. In ACM SIGGRAPH 2018 Emerging Technologies. Association for Computing Machinery, New York, NY, USA, 1–2.",
      "doi": "10.1145/3214907.3214913"
    },
    {
      "text": "Jotaro Shigeyama, Takeru Hashimoto, Shigeo Yoshida, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2019. Transcalibur: A Weight Shifting Virtual Reality Controller for 2D Shape Rendering Based on Computational Perception Model. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300241",
      "doi": "10.1145/3290605.3300241"
    },
    {
      "text": "Shuntaro Shimizu, Takeru Hashimoto, Shigeo Yoshida, Reo Matsumura, Takuji Narumi, and Hideaki Kuzuoka. 2021. Unident: Providing Impact Sensations on Handheld Objects via High-Speed Change of the Rotational Inertia. In 2021 IEEE Virtual Reality and 3D User Interfaces (VR). IEEE, Lisboa, Portugal, 11–20. https://doi.org/10.1109/VR50410.2021.00021",
      "doi": ""
    },
    {
      "text": "Mikyong Sim, Robert E Shaw, and MT Turvey. 1997. Intrinsic and required dynamics of a simple bat–ball skill.Journal of Experimental Psychology: Human Perception and Performance 23, 1(1997), 101.",
      "doi": ""
    },
    {
      "text": "Matjaž Stare, Uroš Žibrat, and Ales Filipcic. 2015. Stroke Effectivness in Professional and Junior Tennis. ISSN 21 (08 2015).",
      "doi": ""
    },
    {
      "text": "Dagmar Sternad, Marcos Duarte, Hiromu Katsumata, and Stefan Schaal. 2001. Bouncing a ball: tuning into dynamic stability.Journal of Experimental Psychology: Human Perception and Performance 27, 5(2001), 1163.",
      "doi": ""
    },
    {
      "text": "Joseph C Stevens and James W Hall. 1966. Brightness and loudness as functions of stimulus duration. Perception & Psychophysics 1, 9 (1966), 319–327.",
      "doi": ""
    },
    {
      "text": "Joseph C Stevens and Lawrence E Marks. 1980. Cross-modality matching functions generated by magnitude estimation. Perception & Psychophysics 27, 5 (1980), 379–389.",
      "doi": ""
    },
    {
      "text": "Fong Wee Teck. 2012. Force and Torque Simulation in Virtual Tennis. In Proceedings of the Workshop at SIGGRAPH Asia(Singapore, Singapore) (WASA ’12). Association for Computing Machinery, New York, NY, USA, 143–146. https://doi.org/10.1145/2425296.2425321",
      "doi": "10.1145/2425296.2425321"
    },
    {
      "text": "Fong Wee Teck, Chin Ching Ling, Farzam Farbiz, and Huang Zhiyong. 2012. Ungrounded Haptic Rendering Device for Torque Simulation in Virtual Tennis. In ACM SIGGRAPH 2012 Emerging Technologies (Los Angeles, California) (SIGGRAPH ’12). Association for Computing Machinery, New York, NY, USA, Article 26, 1 pages. https://doi.org/10.1145/2343456.2343482",
      "doi": ""
    },
    {
      "text": "Fong Wee Teck, Huang Zhiyong, Farzam Farbiz, Cher Jingting, Chin Ching Ling, and Susanto Rahardja. 2011. Ungrounded Handheld Device for Simulating High-Forces of Ball Impacts in Virtual Tennis. In SIGGRAPH Asia 2011 Emerging Technologies (Hong Kong, China) (SA ’11). Association for Computing Machinery, New York, NY, USA, Article 20, 1 pages. https://doi.org/10.1145/2073370.2073389",
      "doi": "10.1145/2073370.2073389"
    },
    {
      "text": "Tomaz. 2017. Tennis Forehand Technique – 8 Steps To A Modern. https://www.feeltennis.net/modern-forehand-technique/",
      "doi": ""
    },
    {
      "text": "TTC. 2020. Ideal Weight of a Table Tennis Racket. https://ttcrunch.com/articles/ideal-weight-of-a-table-tennis-racket/",
      "doi": ""
    },
    {
      "text": "M.T. Turvey and Claudia Carello. 1995. Chapter 11 - Dynamic Touch. In Perception of Space and Motion, William Epstein and Sheena Rogers (Eds.). Academic Press, San Diego, 401–490. https://doi.org/10.1016/B978-012240530-3/50013-4",
      "doi": ""
    },
    {
      "text": "Valve, L.L.C.2020. OpenVR. https://github.com/ValveSoftware/openvr",
      "doi": ""
    },
    {
      "text": "Yu-Wei Wang, Yu-Hsin Lin, Pin-Sung Ku, Yōko Miyatake, Yi-Hsuan Mao, Po Yu Chen, Chun-Miao Tseng, and Mike Y. Chen. 2021. JetController: High-Speed Ungrounded 3-DoF Force Feedback Controllers Using Air Propulsion Jets. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 124, 12 pages. https://doi.org/10.1145/3411764.3445549",
      "doi": ""
    },
    {
      "text": "Bob G Witmer and Michael J Singer. 1998. Measuring presence in virtual environments: A presence questionnaire. Presence 7, 3 (1998), 225–240.",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "MathWorks Staff Writer. 2020. How Long Is the Average Human Arm?https://www.reference.com/science/long-average-human-arm-62c7536c5e56f385",
      "doi": ""
    },
    {
      "text": "Andre Zenner and Antonio Kruger. 2017. Shifty: A Weight-Shifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 23, 4 (April 2017), 1285–1294. https://doi.org/10.1109/TVCG.2017.2656978",
      "doi": "10.1109/TVCG.2017.2656978"
    }
  ]
}