{
  "doi": "10.1145/3491102.3517635",
  "title": "CollabAlly: Accessible Collaboration Awareness in Document Editing",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Collaborative document editing tools are widely used in professional and academic workplaces. While these tools provide basic accessibility support, it is challenging for blind users to gain collaboration awareness that sighted people can easily obtain using visual cues (e.g., who is editing where and what). Through a series of co-design sessions with a blind coauthor, we identified the current practices and challenges in collaborative editing, and iteratively designed CollabAlly, a system that makes collaboration awareness in document editing accessible to blind users. CollabAlly extracts collaborator, comment, and text-change information and their context from a document and presents them in a dialog box to provide easy access and navigation. CollabAlly uses earcons to communicate background events unobtrusively, voice fonts to differentiate collaborators, and spatial audio to convey the location of document activity. In a study with 11 blind participants, we demonstrate that CollabAlly provides improved access to collaboration awareness by centralizing scattered information, sonifying visual information, and simplifying complex operations.",
  "authors": [
    {
      "name": "Cheuk Yin Phipson Lee",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659588503",
      "orcid": "missing"
    },
    {
      "name": "Zhuohao Zhang",
      "institution": "Information Science, University of Washington, Seattle, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659889006",
      "orcid": "missing"
    },
    {
      "name": "Jaylin Herskovitz",
      "institution": "Computer Science and Engineering, University of Michigan, United States",
      "img": "/do/10.1145/contrib-99659365819/rel-imgonly/me.jpeg",
      "acmid": "99659365819",
      "orcid": "0000-0002-9049-5056"
    },
    {
      "name": "JooYoung Seo",
      "institution": "School of Information Sciences, University of Illinois at Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659897005",
      "orcid": "missing"
    },
    {
      "name": "Anhong Guo",
      "institution": "Computer Science and Engineering, University of Michigan, United States",
      "img": "/do/10.1145/contrib-99658635901/rel-imgonly/anhong_website.jpg",
      "acmid": "99658635901",
      "orcid": "0000-0002-4447-7818"
    }
  ],
  "references": [
    {
      "text": "Dragan Ahmetovic, Cole Gleason, Chengxiong Ruan, Kris Kitani, Hironobu Takagi, and Chieko Asakawa. 2016. NavCog: A Navigational Cognitive Assistant for the Blind. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services(Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 90–99. https://doi.org/10.1145/2935334.2935361",
      "doi": "10.1145/2935334.2935361"
    },
    {
      "text": "Khaled Albusays, Stephanie Ludi, and Matt Huenerfauth. 2017. Interviews and Observation of Blind Software Developers at Work to Understand Code Navigation Challenges. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (Baltimore, Maryland, USA) (ASSETS ’17). Association for Computing Machinery, New York, NY, USA, 91–100. https://doi.org/10.1145/3132525.3132550",
      "doi": "10.1145/3132525.3132550"
    },
    {
      "text": "Ronald M. Baecker, Dimitrios Nastos, Ilona R. Posner, and Kelly L. Mawby. 1993. The User-Centered Iterative Design of Collaborative Writing Software. In Proceedings of the INTERACT ’93 and CHI ’93 Conference on Human Factors in Computing Systems(Amsterdam, The Netherlands) (CHI ’93). Association for Computing Machinery, New York, NY, USA, 399–405. https://doi.org/10.1145/169059.169312",
      "doi": "10.1145/169059.169312"
    },
    {
      "text": "Maryam Bandukda and Catherine Holloway. 2020. Audio AR to Support Nature Connectedness in People with Visual Disabilities. In Adjunct Proceedings of the 2020 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2020 ACM International Symposium on Wearable Computers (Virtual Event, Mexico) (UbiComp-ISWC ’20). Association for Computing Machinery, New York, NY, USA, 204–207. https://doi.org/10.1145/3410530.3414332",
      "doi": "10.1145/3410530.3414332"
    },
    {
      "text": "William A. Bettermann and Timothy Palumbo. 2016. Collaboration Made Easier - Working with Restricted Documents within Office 2013, OneDrive, and Office 365. In Proceedings of the 2016 ACM SIGUCCS Annual Conference (Denver, Colorado, USA) (SIGUCCS ’16). Association for Computing Machinery, New York, NY, USA, 43–45. https://doi.org/10.1145/2974927.2974959",
      "doi": ""
    },
    {
      "text": "Jeremy Birnholtz and Steven Ibara. 2012. Tracking Changes in Collaborative Writing: Edits, Visibility and Group Maintenance. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (Seattle, Washington, USA) (CSCW ’12). Association for Computing Machinery, New York, NY, USA, 809–818. https://doi.org/10.1145/2145204.2145325",
      "doi": "10.1145/2145204.2145325"
    },
    {
      "text": "Meera M Blattner, Denise A Sumikawa, and Robert M Greenberg. 1989. Earcons and icons: Their structure and common design principles. Human–Computer Interaction 4, 1 (1989), 11–44.",
      "doi": "10.1207/s15327051hci0401_1"
    },
    {
      "text": "BlindSquare. 2021. BlindSquare. https://www.blindsquare.com",
      "doi": ""
    },
    {
      "text": "Tom Boellstorff, Bonnie Nardi, Celia Pearce, and T. L. Taylor. 2013. Words with Friends: Writing Collaboratively Online. Interactions 20, 5 (sep 2013), 58–61. https://doi.org/10.1145/2501987",
      "doi": "10.1145/2501987"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Maria Claudia Buzzi, Marina Buzzi, Barbara Leporini, and Giulio Mori. 2012. Designing e-learning collaborative tools for blind people. E-Learning-Long-Distance and Lifelong Perspectives (2012), 125–144.",
      "doi": ""
    },
    {
      "text": "Maitraye Das, Darren Gergle, and Anne Marie Piper. 2019. “It Doesn’t Win You Friends”: Understanding Accessibility in Collaborative Writing for People with Vision Impairments. Proceedings of the ACM on Human-Computer Interaction 3, CSCW, Article 191 (nov 2019), 26 pages. https://doi.org/10.1145/3359293",
      "doi": "10.1145/3359293"
    },
    {
      "text": "Maitraye Das, Anne Marie Piper, and Darren Gergle. 2022. Design and Evaluation of Accessible Collaborative Writing Techniques for People with Vision Impairments. ACM transactions on computer-human interaction (TOCHI) 29, 2, Article 9 (jan 2022), 42 pages. https://doi.org/10.1145/3480169",
      "doi": ""
    },
    {
      "text": "Paul Dourish and Victoria Bellotti. 1992. Awareness and Coordination in Shared Workspaces. In Proceedings of the 1992 ACM Conference on Computer-Supported Cooperative Work (Toronto, Ontario, Canada) (CSCW ’92). Association for Computing Machinery, New York, NY, USA, 107–114. https://doi.org/10.1145/143457.143468",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "Eric Eggert and Shadi Abou-Zahra. 2019. Page structure concepts. https://www.w3.org/WAI/tutorials/page-structure",
      "doi": ""
    },
    {
      "text": "Thomas Erickson and Wendy A. Kellogg. 2000. Social Translucence: An Approach to Designing Systems That Support Social Processes. ACM transactions on computer-human interaction (TOCHI) 7, 1 (mar 2000), 59–83. https://doi.org/10.1145/344949.345004",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Robert S. Fish, Robert E. Kraut, and Mary D. P. Leland. 1988. Quilt: A Collaborative Tool for Cooperative Writing. In Proceedings of the ACM SIGOIS and IEEECS TC-OA 1988 Conference on Office Information Systems (Palo Alto, California, USA) (COCS ’88). Association for Computing Machinery, New York, NY, USA, 30–37. https://doi.org/10.1145/45410.45414",
      "doi": ""
    },
    {
      "text": "Flat. 2022. Online collaborative music notation software. https://flat.io/en-GB",
      "doi": ""
    },
    {
      "text": "David Gonçalves, André Rodrigues, and Tiago Guerreiro. 2020. Playing With Others: Depicting Multiplayer Gaming Experiences of People With Visual Impairments. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, Greece) (ASSETS ’20). Association for Computing Machinery, New York, NY, USA, Article 22, 12 pages. https://doi.org/10.1145/3373625.3418304",
      "doi": "10.1145/3373625.3418304"
    },
    {
      "text": "Google. 2021. Collaborate & comment with a screen reader. https://support.google.com/docs/answer/6239410?hl=en&ref_topic=6239407",
      "doi": ""
    },
    {
      "text": "Google. 2021. Diff-match-patch: repackaging of google’s diff match and patch libraries.https://github.com/diff-match-patch-python/diff-match-patch",
      "doi": ""
    },
    {
      "text": "Google. 2021. Google Colaboratory. https://colab.research.google.com/?utm_source=scs-index",
      "doi": ""
    },
    {
      "text": "Google. 2021. Google Docs. https://www.google.com/docs/about/",
      "doi": ""
    },
    {
      "text": "Google. 2021. Resonance audio. https://resonance-audio.github.io/resonance-audio/",
      "doi": ""
    },
    {
      "text": "Google. 2021. Text-to-speech. https://cloud.google.com/text-to-speech",
      "doi": ""
    },
    {
      "text": "Tom Gross, Chris Stary, and Alex Totter. 2005. User-centered awareness in computer-supported cooperative work-systems: Structured embedding of findings from social sciences. International Journal of Human-Computer Interaction 18, 3(2005), 323–360.",
      "doi": ""
    },
    {
      "text": "InVision. 2021. InVision | Digital product design, workflow & collaboration. https://www.invisionapp.com",
      "doi": ""
    },
    {
      "text": "Ida Larsen-Ledet and Marcel Borowski. 2020. “It Looks Like You Don’t Agree”: Idiosyncratic Practices and Preferences in Collaborative Writing. In 32nd Australian Conference on Human-Computer Interaction (Sydney, NSW, Australia) (OzCHI ’20). Association for Computing Machinery, New York, NY, USA, 339–354. https://doi.org/10.1145/3441000.3441032",
      "doi": ""
    },
    {
      "text": "Ida Larsen-Ledet and Henrik Korsgaard. 2019. Territorial functioning in collaborative writing. Computer Supported Cooperative Work (CSCW) 28, 3 (2019), 391–433.",
      "doi": "10.1007/s10606-019-09359-8"
    },
    {
      "text": "Cheuk Yin Phipson Lee, Zhuohao Zhang, Jaylin Herskovitz, JooYoung Seo, and Anhong Guo. 2021. CollabAlly: Accessible Collaboration Awareness in Document Editing. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, USA) (ASSETS ’21). Association for Computing Machinery, New York, NY, USA, Article 55, 4 pages. https://doi.org/10.1145/3441852.3476562",
      "doi": ""
    },
    {
      "text": "Junchen Li, Garreth W. Tigwell, and Kristen Shinohara. 2021. Accessibility of High-Fidelity Prototyping Tools. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 493, 17 pages. https://doi.org/10.1145/3411764.3445520",
      "doi": "10.1145/3411764.3445520"
    },
    {
      "text": "Muhanad S. Manshad, Enrico Pontelli, and Shakir J. Manshad. 2013. Exploring Tangible Collaborative Distance Learning Environments for the Blind and Visually Impaired. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France) (CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 55–60. https://doi.org/10.1145/2468356.2468367",
      "doi": "10.1145/2468356.2468367"
    },
    {
      "text": "Daniel Mendes, Sofia Reis, João Guerreiro, and Hugo Nicolau. 2020. Collaborative Tabletops for Blind People: The Effect of Auditory Design on Workspace Awareness. Proceedings of the ACM on Human-Computer Interaction 4, ISS, Article 197 (nov 2020), 19 pages. https://doi.org/10.1145/3427325",
      "doi": "10.1145/3427325"
    },
    {
      "text": "Microsoft. 2021. Microsoft Word. https://www.microsoft.com/en-us/microsoft-365/word",
      "doi": ""
    },
    {
      "text": "Microsoft. 2021. Use a screen reader to add, read, and delete comments in Word. https://support.microsoft.com/en-us/office/use-a-screen-reader-to-add-read-and-delete-comments-in-word-c4648d50-4f7b-4795-b487-9e3141a5a596#PickTab=Windows",
      "doi": ""
    },
    {
      "text": "Microsoft. 2021. Use a screen reader to track and review changes in a document in Word. https://support.microsoft.com/en-us/office/use-a-screen-reader-to-track-and-review-changes-in-a-document-in-word-8d415281-6ef2-41ea-8532-38e410be5988#PickTab=Windows",
      "doi": ""
    },
    {
      "text": "Microsoft Research. 2021. Microsoft Soundscape – A map delivered in 3D sound. https://www.microsoft.com/en-us/research/product/soundscape/.",
      "doi": ""
    },
    {
      "text": "Jonas Moll and Eva-Lotta Sallnäs Pysander. 2013. A Haptic Tool for Group Work on Geometrical Concepts Engaging Blind and Sighted Pupils. ACM Transactions on Accessible Computing (TACCESS) 4, 4, Article 14 (jul 2013), 37 pages. https://doi.org/10.1145/2493171.2493172",
      "doi": ""
    },
    {
      "text": "Sylvie Noël and Jean-Marc Robert. 2004. Empirical study on collaborative writing: What do co-authors do, use, and like?Computer Supported Cooperative Work (CSCW) 13, 1 (2004), 63–89.",
      "doi": ""
    },
    {
      "text": "Nuance. 2021. Nuance Vocalizer. https://www.nuance.com/omni-channel-customer-engagement/voice-and-ivr/text-to-speech/vocalizer.html",
      "doi": ""
    },
    {
      "text": "Ricardo Olenewa, Gary M. Olson, Judith S. Olson, and Daniel M. Russell. 2017. Now That We Can Write Simultaneously, How Do We Use That to Our Advantage?Commun. ACM 60, 8 (jul 2017), 36–43. https://doi.org/10.1145/2983527",
      "doi": "10.1145/2983527"
    },
    {
      "text": "Judith S. Olson, Gary M. Olson, Marianne Storrøsten, and Mark Carter. 1993. Groupwork Close up: A Comparison of the Group Design Process with and without a Simple Group Editor. ACM Transactions on Information Systems (TOIS) 11, 4 (oct 1993), 321–348. https://doi.org/10.1145/159764.159763",
      "doi": "10.1145/159764.159763"
    },
    {
      "text": "Judith S. Olson, Dakuo Wang, Gary M. Olson, and Jingwen Zhang. 2017. How People Write Together Now: Beginning the Investigation with Advanced Undergraduates in a Project Course. ACM Transactions on Computer-Human Interaction (TOCHI) 24, 1, Article 4 (mar 2017), 40 pages. https://doi.org/10.1145/3038919",
      "doi": "10.1145/3038919"
    },
    {
      "text": "Anastasia Schaadhardt, Alexis Hiniker, and Jacob O. Wobbrock. 2021. Understanding Blind Screen-Reader Users’ Experiences of Digital Artboards. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 270, 19 pages. https://doi.org/10.1145/3411764.3445242",
      "doi": "10.1145/3411764.3445242"
    },
    {
      "text": "John G. Schoeberlein and Yuanqiong Wang. 2012. Accessible Collaborative Writing for Persons Who Are Blind: A Usability Study. In Proceedings of the 14th International ACM SIGACCESS Conference on Computers and Accessibility (Boulder, Colorado, USA) (ASSETS ’12). Association for Computing Machinery, New York, NY, USA, 267–268. https://doi.org/10.1145/2384916.2384986",
      "doi": ""
    },
    {
      "text": "John G. Schoeberlein and Yuanqiong Wang. 2013. Improving Collaborative Writing for the Blind. ACM SIGACCESS Accessibility and Computing107 (sep 2013), 11–16. https://doi.org/10.1145/2535803.2535805",
      "doi": ""
    },
    {
      "text": "John Gerard Schoeberlein and Yuanqiong Wang. 2014. Usability Evaluation of an Accessible Collaborative Writing Prototype for Blind Users. Journal of Usability Studies 10, 1 (nov 2014), 26–45.",
      "doi": "10.5555/2817310.2817313"
    },
    {
      "text": "Sketchboard. 2021. Online collaborative whiteboard | sketchboard. https://sketchboard.io/",
      "doi": ""
    },
    {
      "text": "John Tang. 2021. Understanding the Telework Experience of People with Disabilities. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1, Article 30 (apr 2021), 27 pages. https://doi.org/10.1145/3449104",
      "doi": "10.1145/3449104"
    },
    {
      "text": "Dakuo Wang, Judith S. Olson, Jingwen Zhang, Trung Nguyen, and Gary M. Olson. 2015. DocuViz: Visualizing Collaborative Writing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1865–1874. https://doi.org/10.1145/2702123.2702517",
      "doi": "10.1145/2702123.2702517"
    },
    {
      "text": "Dakuo Wang, Judith S Olson, Jingwen Zhang, Trung Nguyen, and Gary M Olson. 2015. How students collaboratively write using google docs. IConference 2015 Proceedings(2015).",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Haodan Tan, and Tun Lu. 2017. Why Users Do Not Want to Write Together When They Are Writing Together: Users’ Rationales for Today’s Collaborative Writing Practices. Proceedings of the ACM on Human-Computer Interaction 1, CSCW, Article 107 (Dec. 2017), 18 pages. https://doi.org/10.1145/3134742",
      "doi": "10.1145/3134742"
    },
    {
      "text": "Mirza Muhammad Waqar, Nafees Ahmad, Muhammad Aslam, and AM Martinez-Enriquez. 2020. Cloud based Co-authoring platform for visually impaired people. In 2020 17th International Conference on Electrical Engineering, Computing Science and Automatic Control (CCE). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Mirza Muhammad Waqar, Muhammad Aslam, and Muhammad Farhan. 2019. An Intelligent and Interactive Interface to Support Symmetrical Collaborative Educational Writing among Visually Impaired and Sighted Users. Symmetry 11, 2 (2019). https://doi.org/10.3390/sym11020238",
      "doi": ""
    },
    {
      "text": "Ryan Wedoff, Lindsay Ball, Amelia Wang, Yi Xuan Khoo, Lauren Lieberman, and Kyle Rector. 2019. Virtual Showdown: An Accessible Virtual Reality Game with Scaffolds for Youth with Visual Impairments. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300371",
      "doi": "10.1145/3290605.3300371"
    },
    {
      "text": "Gareth R. White, Geraldine Fitzpatrick, and Graham McAllister. 2008. Toward Accessible 3D Virtual Environments for the Blind and Visually Impaired. In Proceedings of the 3rd International Conference on Digital Interactive Media in Entertainment and Arts (Athens, Greece) (DIMEA ’08). Association for Computing Machinery, New York, NY, USA, 134–141. https://doi.org/10.1145/1413634.1413663",
      "doi": "10.1145/1413634.1413663"
    },
    {
      "text": "Soobin Yim, Dakuo Wang, Judith Olson, Viet Vu, and Mark Warschauer. 2017. Synchronous Collaborative Writing in the Classroom: Undergraduates’ Collaboration Practices and Their Impact on Writing Style, Quality, and Quantity. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 468–479. https://doi.org/10.1145/2998181.2998356",
      "doi": "10.1145/2998181.2998356"
    }
  ]
}