{
  "doi": "10.1145/3491102.3517588",
  "title": "Accost, Accede, or Amplify: Attitudes towards COVID-19 Misinformation on WhatsApp in India",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "Social media has witnessed an unprecedented growth in users based in low-income communities in the Global South. However, much remains unknown about the drivers of misinformation in such communities. To fill this gap, we conducted an interview-based study to examine how rural and urban communities in India engage with misinformation on WhatsApp. We found that misinformation led to bitterness and conflict – rural users who had higher social status heavily influenced the perceptions and engagement of marginalized members. While urban users relied on the expertise of gatekeepers for verification, rural users engaged in collective deliberations in offline spaces. Both rural and urban users knowingly forwarded misinformation. However, rural users propagated hyperlocal misinformation, whereas urban users forwarded misinformation to reduce their efforts to assess information credibility. Using a public sphere lens, we propose that the reactions to misinformation provide a view of Indian society and its schisms around class, urbanity, and social interactions.",
  "tags": [
    "rural",
    "Misinformation",
    "disinformation",
    "WhatsApp",
    "public sphere",
    "encrypted platforms"
  ],
  "authors": [
    {
      "name": "Rama Adithya Varanasi",
      "institution": "Information Science, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659188025",
      "orcid": "0000-0003-4485-6663"
    },
    {
      "name": "Joyojeet Pal",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100249207",
      "orcid": "0000-0002-9076-2046"
    },
    {
      "name": "Aditya Vashistha",
      "institution": "Cornell University, United States",
      "img": "/do/10.1145/contrib-81474703745/rel-imgonly/aditya-vashistha_2_orig.jpg",
      "acmid": "81474703745",
      "orcid": "0000-0001-5693-3326"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. FactEd by Alt News - YouTube. https://www.youtube.com/channel/UCIyajsbcEWqEQlFzJPntldQ.",
      "doi": ""
    },
    {
      "text": "[n.d.]. The focus of misinformation debates shifts south. https://www.niemanlab.org/2018/12/the-focus-of-misinformation-debates-shifts-south/.",
      "doi": ""
    },
    {
      "text": "[n.d.]. Introducing Birdwatch, a community-based approach to misinformation. https://blog.twitter.com/en_us/topics/product/2021/introducing-birdwatch-a-community-based-approach-to-misinformation, urldate = 2021-01-25,.",
      "doi": ""
    },
    {
      "text": "[n.d.]. Tattle - Tattle. https://tattle.co.in/datasets.",
      "doi": ""
    },
    {
      "text": "2021. Alt News. https://www.altnews.in/. [Online; accessed 15-April-2021].",
      "doi": ""
    },
    {
      "text": "2021. India Today. https://www.indiatoday.in/fact-check. [Online; accessed 15-April-2021].",
      "doi": ""
    },
    {
      "text": "2021. Inshorts:Stay informed. https://inshorts.com/. [Online; accessed 15-April-2021].",
      "doi": ""
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Irtaza Haider, Jay Chen, and Nicola Dell. 2019. ” Everyone Has Some Personal Stuff” Designing to Support Digital Privacy with Shared Mobile Phone Use in Bangladesh. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300410"
    },
    {
      "text": "Syeda Zainab Akbar, Anmol Panda, Divyanshu Kukreti, Azhagu Meena, and Joyojeet Pal. 2021. Misinformation as a Window into Prejudice: COVID-19 and the Information Environment in India. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3 (Jan. 2021), 1–28. https://doi.org/10.1145/3432948",
      "doi": "10.1145/3432948"
    },
    {
      "text": "Syeda Zainab Akbar, Ankur Sharma, Himani Negi, Anmol Panda, and Joyojeet Pal. 2020. Anatomy of a Rumour: Social media and the suicide of Sushant Singh Rajput. arXiv preprint arXiv:2009.11744(2020).",
      "doi": ""
    },
    {
      "text": "Md Sayeed Al-Zaman. 2021. A Thematic Analysis of Misinformation in India during the COVID-19 Pandemic. International Information & Library Review(2021), 1–11.",
      "doi": ""
    },
    {
      "text": "Hunt Allcott and Matthew Gentzkow. 2017. Social Media and Fake News in the 2016 Election. Journal of Economic Perspectives 31, 2 (May 2017), 211–236. https://doi.org/10.1257/jep.31.2.211",
      "doi": ""
    },
    {
      "text": "Verna Allee. 2000. Knowledge networks and communities of practice. OD practitioner 32, 4 (2000), 4–13.",
      "doi": ""
    },
    {
      "text": "Jennifer Allen, Antonio A Arechar, Gordon Pennycook, and David G Rand. 2020. Scaling up fact-checking using the wisdom of crowds. Preprint available at https://psyarxiv. com/9qdza (2020).",
      "doi": ""
    },
    {
      "text": "Mary Grace Antony and Ryan J Thomas. 2010. ‘This is citizen journalism at its finest’: YouTube and the public sphere in the Oscar Grant shooting incident. New media & society 12, 8 (2010), 1280–1296.",
      "doi": ""
    },
    {
      "text": "Ahmer Arif, John J. Robinson, Stephanie A. Stanek, Elodie S. Fichet, Paul Townsend, Zena Worku, and Kate Starbird. 2017. A Closer Look at the Self-Correcting Crowd: Examining Corrections in Online Rumors. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, Portland Oregon USA, 155–168. https://doi.org/10.1145/2998181.2998294",
      "doi": "10.1145/2998181.2998294"
    },
    {
      "text": "Bence Bago, David G Rand, and Gordon Pennycook. 2020. Fake news, fast and slow: Deliberation reduces belief in false (but not true) news headlines.Journal of experimental psychology: general(2020).",
      "doi": ""
    },
    {
      "text": "Eytan Bakshy, Solomon Messing, and Lada A Adamic. 2015. Exposure to ideologically diverse news and opinion on Facebook. Science 348, 6239 (2015), 1130–1132.",
      "doi": ""
    },
    {
      "text": "Shakuntala Banaji. 2018. Vigilante publics: Orientalism, modernity and Hindutva fascism in India. Javnost-The Public 25, 4 (2018), 333–350.",
      "doi": ""
    },
    {
      "text": "Shakuntala Banaji, Ramnath Bhat, Anushi Agarwal, Nihal Passanha, and Mukti Sadhana Pravin. 2019. WhatsApp vigilantes: An exploration of citizen reception and circulation of WhatsApp misinformation linked to mob violence in India. (2019).",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’10). Association for Computing Machinery, Atlanta, Georgia, USA, 1301–1310. https://doi.org/10.1145/1753326.1753521",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Christoph Bartneck and Jun Hu. 2009. Scientometric analysis of the CHI proceedings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’09). Association for Computing Machinery, New York, NY, USA, 699–708. https://doi.org/10.1145/1518701.1518810",
      "doi": "10.1145/1518701.1518810"
    },
    {
      "text": "Dominik Batorski and Ilona Grzywińska. 2018. Three dimensions of the public sphere on Facebook. Information, Communication & Society 21, 3 (2018), 356–374.",
      "doi": ""
    },
    {
      "text": "Y. Benkler, R. Faris, and H. Roberts. 2018. Network Propaganda: Manipulation, Disinformation, and Radicalization in American Politics. Oxford University Press. https://books.google.com/books?id=MVRuDwAAQBAJ",
      "doi": ""
    },
    {
      "text": "Nicola J. Bidwell. 2020. Women and the Sustainability of Rural Community Networks in the Global South. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development (Guayaquil, Ecuador) (ICTD2020). Association for Computing Machinery, New York, NY, USA, Article 21, 13 pages. https://doi.org/10.1145/3392561.3394649",
      "doi": "10.1145/3392561.3394649"
    },
    {
      "text": "Petter Bae Brandtzaeg, Marika Lüders, Jochen Spangenberg, Linda Rath-Wiggins, and Asbjørn Følstad. 2016. Emerging journalistic verification practices concerning social media. Journalism Practice 10, 3 (2016), 323–342.",
      "doi": ""
    },
    {
      "text": "Nadia M. Brashier, Gordon Pennycook, Adam J. Berinsky, and David G. Rand. 2021. Timing matters when correcting fake news. Proceedings of the National Academy of Sciences 118, 5 (Feb. 2021). https://doi.org/10.1073/pnas.2020043118 Publisher: National Academy of Sciences Section: Social Sciences.",
      "doi": ""
    },
    {
      "text": "Joshua A Braun and Jessica L Eklund. 2019. Fake news, real money: Ad tech platforms, profit-driven hoaxes, and the business of journalism. Digital Journalism 7, 1 (2019), 1–21.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "J Scott Brennen, Felix M Simon, and Rasmus Kleis Nielsen. 2021. Beyond (Mis) Representation: Visuals in COVID-19 Misinformation. The International Journal of Press/Politics 26, 1 (2021), 277–299.",
      "doi": ""
    },
    {
      "text": "Michael V Bronstein, Gordon Pennycook, Adam Bear, David G Rand, and Tyrone D Cannon. 2019. Belief in fake news is associated with delusionality, dogmatism, religious fundamentalism, and reduced analytic thinking. Journal of applied research in memory and cognition 8, 1 (2019), 108–117.",
      "doi": ""
    },
    {
      "text": "Axel Bruns. 2005. Gatewatching: Collaborative online news production. Vol. 26. Peter Lang.",
      "doi": ""
    },
    {
      "text": "Michael X Delli Carpini, Fay Lomax Cook, and Lawrence R Jacobs. 2004. Public deliberation, discursive participation, and citizen engagement: A review of the empirical literature. Annu. Rev. Polit. Sci. 7(2004), 315–344.",
      "doi": ""
    },
    {
      "text": "Gautami Challagulla, Margaret Young, and Edward Cutrell. [n.d.]. Local Pocket Internet and Global Social Media Bridging the Digital Gap: Facebook and Youth Sub-Stratum in Urban India. ([n. d.]).",
      "doi": ""
    },
    {
      "text": "Priyank Chandra and Joyojeet Pal. 2019. Rumors and Collective Sensemaking: Managing Ambiguity in an Informal Marketplace. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300563",
      "doi": ""
    },
    {
      "text": "Jay Chen, Michael Paik, and Kelly McCabe. 2014. Exploring internet security perceptions and practices in urban ghana. In Proceedings of the Tenth USENIX Conference on Usable Privacy and Security(SOUPS ’14). USENIX Association, USA, 129–142.",
      "doi": "10.5555/3235838.3235850"
    },
    {
      "text": "Liang Chen, Xiaohui Wang, and Tai-Quan Peng. 2018. Nature and Diffusion of Gynecologic Cancer–Related Misinformation on Social Media: Analysis of Tweets. Journal of Medical Internet Research 20, 10 (2018), e11515. https://doi.org/10.2196/11515 Company: Journal of Medical Internet Research Distributor: Journal of Medical Internet Research Institution: Journal of Medical Internet Research Label: Journal of Medical Internet Research Publisher: JMIR Publications Inc., Toronto, Canada.",
      "doi": ""
    },
    {
      "text": "Xinran Chen, Sei-Ching Joanna Sin, Yin-Leng Theng, and Chei Sian Lee. 2015. Why Students Share Misinformation on Social Media: Motivation, Gender, and Study-Level Differences. The Journal of Academic Librarianship 41, 5 (Sept. 2015), 583–592. https://doi.org/10.1016/j.acalib.2015.07.003",
      "doi": ""
    },
    {
      "text": "John W Creswell and Dana L Miller. 2000. Determining validity in qualitative inquiry. Theory into practice 39, 3 (2000), 124–130.",
      "doi": ""
    },
    {
      "text": "Lincoln Dahlberg. 2001. The Internet and democratic discourse: Exploring the prospects of online deliberative forums extending the public sphere. Information, communication & society 4, 4 (2001), 615–633.",
      "doi": ""
    },
    {
      "text": "Lincoln Dahlberg. 2011. Re-Constructing Digital Democracy: An Outline of Four ‘Positions’. New Media & Society 13, 6 (Sept. 2011), 855–872. https://doi.org/10.1177/1461444810389569",
      "doi": ""
    },
    {
      "text": "Peter Dahlgren. 2005. The Internet, Public Spheres, and Political Communication: Dispersion and Deliberation. Political Communication 22, 2 (April 2005), 147–162. https://doi.org/10.1080/10584600590933160",
      "doi": ""
    },
    {
      "text": "N. DiFonzo, P. Bordia, American Psychological Association, and Inc Ovid Technologies. 2007. Rumor Psychology: Social and Organizational Approaches. American Psychological Association. https://books.google.com/books?id=XlHYAAAAIAAJ",
      "doi": ""
    },
    {
      "text": "Ullrich KH Ecker, Stephan Lewandowsky, and David TW Tang. 2010. Explicit warnings reduce but do not eliminate the continued influence of misinformation. Memory & cognition 38, 8 (2010), 1087–1100.",
      "doi": ""
    },
    {
      "text": "Gowhar Farooq. 2018. Politics of Fake News: How WhatsApp Became a Potent Propaganda Tool in India. Media Watch 9, 1 (2018), 106–117. https://doi.org/10.15655/mw/2018/v9i1/49279",
      "doi": ""
    },
    {
      "text": "Martin Flintham, Christian Karner, Khaled Bachour, Helen Creswick, Neha Gupta, and Stuart Moran. 2018. Falling for Fake News: Investigating the Consumption of News via Social Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–10. https://doi.org/10.1145/3173574.3173950",
      "doi": "10.1145/3173574.3173950"
    },
    {
      "text": "Claudia Flores-Saviaga and Saiph Savage. 2020. Fighting disaster misinformation in Latin America: the# 19S Mexican earthquake case study. Personal and Ubiquitous Computing(2020), 1–21.",
      "doi": ""
    },
    {
      "text": "Christopher Fox. 1983. Information and misinformation. An investigation of the notions of information, misinformation, informing, and misinforming. (1983).",
      "doi": ""
    },
    {
      "text": "Nancy Fraser. 1990. Rethinking the public sphere: A contribution to the critique of actually existing democracy. Social text25/26(1990), 56–80.",
      "doi": ""
    },
    {
      "text": "Kiran Garimella and Dean Eckles. 2020. Images and misinformation in political groups: evidence from WhatsApp in India. arXiv preprint arXiv:2005.09784(2020).",
      "doi": ""
    },
    {
      "text": "Christine Geeng, Savanna Yee, and Franziska Roesner. 2020. Fake News on Facebook and Twitter: Investigating How People (Don’t) Investigate. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–14. https://doi.org/10.1145/3313831.3376784",
      "doi": "10.1145/3313831.3376784"
    },
    {
      "text": "Annie Gowen. 2018. As mob lynchings fueled by WhatsApp sweep India, authorities struggle to combat fake news.The Washington Post (2018), NA–NA.",
      "doi": ""
    },
    {
      "text": "Lucas Graves. 2016. Deciding what’s true: The rise of political fact-checking in American journalism. Columbia University Press.",
      "doi": ""
    },
    {
      "text": "Andrew Guess, Brendan Nyhan, and Jason Reifler. 2018. Selective exposure to misinformation: Evidence from the consumption of fake news during the 2016 US presidential campaign. European Research Council 9, 3 (2018), 4.",
      "doi": ""
    },
    {
      "text": "Jürgen Habermas. 1990. Moral consciousness and communicative action. MIT press.",
      "doi": ""
    },
    {
      "text": "Jurgen Habermas. 1996. Between Facts and Norms: Contributions to a Discourse Theory of Law and Democracy. MIT Press.",
      "doi": ""
    },
    {
      "text": "Jurgen Habermas and Jürgen Habermas. 1991. The structural transformation of the public sphere: An inquiry into a category of bourgeois society. MIT press.",
      "doi": ""
    },
    {
      "text": "Md Mahfuzul Haque, Mohammad Yousuf, Ahmed Shatil Alam, Pratyasha Saha, Syed Ishtiaque Ahmed, and Naeemul Hassan. 2020. Combating Misinformation in Bangladesh: Roles and Responsibilities as Perceived by Journalists, Fact-checkers, and Users. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–32.",
      "doi": "10.1145/3415201"
    },
    {
      "text": "Y. Linlin Huang, Kate Starbird, Mania Orand, Stephanie A. Stanek, and Heather T. Pedersen. 2015. Connected Through Crisis: Emotional Proximity and the Spread of Misinformation Online. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW ’15. ACM Press, Vancouver, BC, Canada, 969–980. https://doi.org/10.1145/2675133.2675202",
      "doi": "10.1145/2675133.2675202"
    },
    {
      "text": "Eslam Hussein, Prerna Juneja, and Tanushree Mitra. 2020. Measuring misinformation in video search platforms: An audit study on YouTube. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–27.",
      "doi": "10.1145/3392854"
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E Grinter. 2010. Postcolonial computing: a lens on design and development. In Proceedings of the SIGCHI conference on human factors in computing systems. 1311–1320.",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Md Saiful Islam, Tonmoy Sarkar, Sazzad Hossain Khan, Abu-Hena Mostofa Kamal, S. M. Murshid Hasan, Alamgir Kabir, Dalia Yeasmin, Mohammad Ariful Islam, Kamal Ibne Amin Chowdhury, Kazi Selim Anwar, Abrar Ahmad Chughtai, and Holly Seale. 2020. COVID-19–Related Infodemic and Its Impact on Public Health: A Global Social Media Analysis. The American Journal of Tropical Medicine and Hygiene 103, 4 (Oct. 2020), 1621–1629. https://doi.org/10.4269/ajtmh.20-0812 Publisher: The American Society of Tropical Medicine and Hygiene Section: The American Journal of Tropical Medicine and Hygiene.",
      "doi": ""
    },
    {
      "text": "Esther Han Beol Jang, Philip Garrison, Ronel Vincent Vistal, Maria Theresa D. Cunanan, Maria Theresa Perez, Philip Martinez, Matthew William Johnson, John Andrew Evangelista, Syed Ishtiaque Ahmed, Josephine Dionisio, Mary Claire Aguilar Barela, and Kurtis Heimerl. 2019. Trust and Technology Repair Infrastructures in the Remote Rural Philippines: Navigating Urban-Rural Seams. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 99 (nov 2019), 25 pages. https://doi.org/10.1145/3359201",
      "doi": ""
    },
    {
      "text": "R Tallal Javed, Mirza Elaaf Shuja, Muhammad Usama, Junaid Qadir, Waleed Iqbal, Gareth Tyson, Ignacio Castro, and Kiran Garimella. 2020. A First Look at COVID-19 Messages on WhatsApp in Pakistan. arXiv preprint arXiv:2011.09145(2020).",
      "doi": ""
    },
    {
      "text": "Dan M Kahan, William H Simon, 1999. Deliberative politics: Essays on democracy and disagreement. Oxford University Press on Demand.",
      "doi": ""
    },
    {
      "text": "Alireza Karduni, Isaac Cho, Ryan Wesslen, Sashank Santhanam, Svitlana Volkova, Dustin L Arendt, Samira Shaikh, and Wenwen Dou. 2019. Vulnerable to misinformation? Verifi!. In Proceedings of the 24th International Conference on Intelligent User Interfaces. 312–323.",
      "doi": "10.1145/3301275.3302320"
    },
    {
      "text": "Natascha A Karlova and Karen E Fisher. 2013. A social diffusion model of misinformation and disinformation for understanding human information behaviour. (2013).",
      "doi": ""
    },
    {
      "text": "Natascha A Karlova and Jin Ha Lee. 2011. Notes from the underground city of disinformation: A conceptual investigation. Proceedings of the American Society for Information Science and Technology 48, 1 (2011), 1–9.",
      "doi": ""
    },
    {
      "text": "Jooyeon Kim, Behzad Tabibian, Alice Oh, Bernhard Schölkopf, and Manuel Gomez-Rodriguez. 2018. Leveraging the crowd to detect and reduce the spread of fake news and misinformation. In Proceedings of the eleventh ACM international conference on web search and data mining. 324–332.",
      "doi": "10.1145/3159652.3159734"
    },
    {
      "text": "Peter Krafft, Kaitlyn Zhou, Isabelle Edwards, Kate Starbird, and Emma S. Spiro. 2017. Centralized, Parallel, and Distributed Information Processing during Collective Sensemaking(CHI ’17). Association for Computing Machinery, New York, NY, USA, 12 pages. https://doi.org/10.1145/3025453.3026012",
      "doi": ""
    },
    {
      "text": "Peter M. Krafft and Emma S. Spiro. 2019. Keeping Rumors in Proportion: Managing Uncertainty in Rumor Systems. Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300876",
      "doi": ""
    },
    {
      "text": "John Kretzmann and John P. McKnight. 1996. Assets-based community development. National Civic Review 85, 4 (1996), 23–29. https://doi.org/10.1002/ncr.4100850405 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/ncr.4100850405.",
      "doi": ""
    },
    {
      "text": "Vijesh V Krishna, Lagesh M Aravalath, and Surjit Vikraman. 2019. Does caste determine farmer access to quality information?PloS one 14, 1 (2019), e0210721.",
      "doi": ""
    },
    {
      "text": "Lisa M Kruse, Dawn R Norris, and Jonathan R Flinchum. 2018. Social media as a public sphere? Politics on social media. The Sociological Quarterly 59, 1 (2018), 62–84.",
      "doi": ""
    },
    {
      "text": "David MJ Lazer, Matthew A Baum, Yochai Benkler, Adam J Berinsky, Kelly M Greenhill, Filippo Menczer, Miriam J Metzger, Brendan Nyhan, Gordon Pennycook, David Rothschild, 2018. The science of fake news. Science 359, 6380 (2018), 1094–1096.",
      "doi": ""
    },
    {
      "text": "Stephan Lewandowsky, Ullrich K. H. Ecker, Colleen M. Seifert, Norbert Schwarz, and John Cook. 2012. Misinformation and Its Correction: Continued Influence and Successful Debiasing. Psychological Science in the Public Interest 13, 3 (Dec. 2012), 106–131. https://doi.org/10.1177/1529100612451018",
      "doi": ""
    },
    {
      "text": "Sebastian Linxen, Christian Sturm, Florian Brühlmann, Vincent Cassau, Klaus Opwis, and Katharina Reinecke. 2021. How WEIRD is CHI?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3411764.3445488",
      "doi": "10.1145/3411764.3445488"
    },
    {
      "text": "Robert M Losee. 1997. A discipline independent definition of information. Journal of the American Society for information Science 48, 3(1997), 254–269.",
      "doi": "10.5555/249607.249615"
    },
    {
      "text": "Zhicong Lu, Yue Jiang, Cheng Lu, Mor Naaman, and Daniel Wigdor. 2020. The Government’s Dividend: Complex Perceptions of Social Media Misinformation in China. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–12. https://doi.org/10.1145/3313831.3376612",
      "doi": "10.1145/3313831.3376612"
    },
    {
      "text": "Caio Machado, Beatriz Kira, Vidya Narayanan, Bence Kollanyi, and Philip Howard. 2019. A Study of Misinformation in WhatsApp Groups with a Focus on the Brazilian Presidential Elections.. In Companion Proceedings of The 2019 World Wide Web Conference (San Francisco, USA) (WWW ’19). Association for Computing Machinery, New York, NY, USA, 1013–1019.",
      "doi": "10.1145/3308560.3316738"
    },
    {
      "text": "Cameron Martel, Gordon Pennycook, and David G Rand. 2020. Reliance on emotion promotes belief in fake news. Cognitive research: principles and implications 5, 1(2020), 1–20.",
      "doi": ""
    },
    {
      "text": "Alice E Marwick. 2018. Why do people share fake news? A sociotechnical model of media effects. Georgetown Law Technology Review 2, 2 (2018), 474–512.",
      "doi": ""
    },
    {
      "text": "Alice E Marwick and Danah Boyd. 2011. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New media & society 13, 1 (2011), 114–133.",
      "doi": ""
    },
    {
      "text": "Alison Mathie and Gord Cunningham. 2005. Who is Driving Development? Reflections on the Transformative Potential of Asset-based Community Development. Canadian Journal of Development Studies / Revue canadienne d’études du développement 26, 1 (Jan. 2005), 175–186. https://doi.org/10.1080/02255189.2005.9669031 Publisher: Routledge _eprint: https://doi.org/10.1080/02255189.2005.9669031.",
      "doi": ""
    },
    {
      "text": "Preeti Mudliar. 2018. Public WiFi is for men and mobile internet is for women: Interrogating politics of space and gender around WiFi hotspots. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–24.",
      "doi": "10.1145/3274395"
    },
    {
      "text": "Rahul Mukherjee. 2020. Mobile witnessing on WhatsApp: Vigilante virality and the anatomy of mob lynching. South Asian Popular Culture 18, 1 (2020), 79–101.",
      "doi": ""
    },
    {
      "text": "David Nemer. 2016. Online favela: The use of social media by the marginalized in Brazil. Information technology for development 22, 3 (2016), 364–379.",
      "doi": ""
    },
    {
      "text": "Midas Nouwens, Carla F. Griggio, and Wendy E. Mackay. 2017. ”WhatsApp Is for Family; Messenger Is for Friends”: Communication Places in App Ecosystems. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver Colorado USA, 727–735. https://doi.org/10.1145/3025453.3025484",
      "doi": "10.1145/3025453.3025484"
    },
    {
      "text": "Onook Oh, Manish Agrawal, and H Raghav Rao. 2013. Community intelligence and social media services: A rumor theoretic analysis of tweets during social crises. MIS quarterly (2013), 407–426.",
      "doi": ""
    },
    {
      "text": "Kenton P. O’Hara, Michael Massimi, Richard Harper, Simon Rubens, and Jessica Morris. 2014. Everyday Dwelling with WhatsApp. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW ’14. ACM Press, Baltimore, Maryland, USA, 1131–1143. https://doi.org/10.1145/2531602.2531679",
      "doi": "10.1145/2531602.2531679"
    },
    {
      "text": "Duncan Omanga. 2019. WhatsApp as ‘digital publics’: the Nakuru Analysts and the evolution of participation in county governance in Kenya. Journal of Eastern African Studies 13, 1 (2019), 175–191.",
      "doi": ""
    },
    {
      "text": "Mustafa Oz, Pei Zheng, and Gina Masullo Chen. 2018. Twitter versus Facebook: Comparing incivility, impoliteness, and deliberative attributes. New media & society 20, 9 (2018), 3400–3419.",
      "doi": ""
    },
    {
      "text": "Pinar Ozturk, Huaye Li, and Yasuaki Sakamoto. 2015. Combating rumor spread on social media: The effectiveness of refutation and warning. In 2015 48th Hawaii International Conference on System Sciences. IEEE, 2406–2414.",
      "doi": "10.1109/HICSS.2015.288"
    },
    {
      "text": "Z. Papacharissi. 2010. A Private Sphere: Democracy in a Digital Age. Wiley. https://books.google.com/books?id=cNMhtalEJDUC",
      "doi": ""
    },
    {
      "text": "Gordon Pennycook and David G. Rand. 2020. Who Falls for Fake News? The Roles of Bullshit Receptivity, Overclaiming, Familiarity, and Analytic Thinking. 88, 2 (2020), 185–200. https://doi.org/10.1111/jopy.12476",
      "doi": ""
    },
    {
      "text": "Gordon Pennycook and David G. Rand. 2021. The Psychology of Fake News. Trends in Cognitive Sciences 25, 5 (May 2021), 388–402. https://doi.org/10.1016/j.tics.2021.02.007",
      "doi": ""
    },
    {
      "text": "Julio C. S. Reis, Philipe Melo, Kiran Garimella, Jussara M. Almeida, Dean Eckles, and Fabrício Benevenuto. 2020. A Dataset of Fact-Checked Images Shared on WhatsApp During the Brazilian and Indian Elections. Proceedings of the International AAAI Conference on Web and Social Media 14, 1 (2020), 903–908.",
      "doi": ""
    },
    {
      "text": "Gustavo Resende, Philipe Melo, Hugo Sousa, Johnnatan Messias, Marisa Vasconcelos, Jussara Almeida, and Fabrício Benevenuto. 2019. (Mis) information dissemination in WhatsApp: Gathering, analyzing and countermeasures. In The World Wide Web Conference. 818–828.",
      "doi": "10.1145/3308558.3313688"
    },
    {
      "text": "Jenny Roberts. 2009. Ignorance is effectively bliss: Collateral consequences, silence, and misinformation in the guilty-plea process. Iowa L. Rev. 95(2009), 119.",
      "doi": ""
    },
    {
      "text": "Ralph L Rosnow. 1991. Inside rumor: A personal journey.American psychologist 46, 5 (1991), 484.",
      "doi": ""
    },
    {
      "text": "R. Ryle. 2011. Questioning Gender: A Sociological Exploration. SAGE Publications. https://books.google.com/books?id=CHHz_p-j9hMC",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Ed Cutrell, Kentaro Toyama, and Bonnie Nardi. 2010. Intermediated Technology Use in Developing Communities. In Proceedings of the 28th International Conference on Human Factors in Computing Systems - CHI ’10. ACM Press, Atlanta, Georgia, USA, 2583. https://doi.org/10.1145/1753326.1753718",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "Mike S Schäfer. 2015. Digital public sphere. The international encyclopedia of political communication (2015), 1–7.",
      "doi": ""
    },
    {
      "text": "Yaacov Schul. 1993. When warning succeeds: The effect of warning on success in ignoring invalid information. Journal of Experimental Social Psychology 29, 1 (1993), 42–62.",
      "doi": ""
    },
    {
      "text": "Colleen M Seifert. 2002. The continued influence of misinformation in memory: What makes a correction effective?In Psychology of learning and motivation. Vol. 41. Elsevier, 265–292.",
      "doi": ""
    },
    {
      "text": "Imani N Sherman, Elissa M Redmiles, and Jack W Stokes. 2020. Designing Indicators to Combat Fake Media. arXiv preprint arXiv:2010.00544(2020).",
      "doi": ""
    },
    {
      "text": "Kai Shu, Amy Sliva, Suhang Wang, Jiliang Tang, and Huan Liu. 2017. Fake news detection on social media: A data mining perspective. ACM SIGKDD explorations newsletter 19, 1 (2017), 22–36.",
      "doi": "10.1145/3137597.3137600"
    },
    {
      "text": "Manish Singh. 2019. Reliance Jio partners with Facebook to launch literacy program for first time internet users in India. Retrieved January 7, 2021 from https://social.techcrunch.com/2019/07/03/reliance-jio-facebook-digital-literacy-udaan-india/",
      "doi": ""
    },
    {
      "text": "Laura Spinney. 2019. In Congo, fighting a virus and a groundswell of fake news.",
      "doi": ""
    },
    {
      "text": "Catherine R Squires. 2002. Rethinking the black public sphere: An alternative vocabulary for multiple public spheres. Communication theory 12, 4 (2002), 446–468.",
      "doi": ""
    },
    {
      "text": "Janaki Srinivasan and Jenna Burrell. 2013. Revisiting the fishers of Kerala, India. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers-Volume 1. 56–66.",
      "doi": ""
    },
    {
      "text": "Kate Starbird, Dharma Dailey, Owla Mohamed, Gina Lee, and Emma S. Spiro. 2018. Engage Early, Correct More: How Journalists Participate in False Rumors Online during Crisis Events. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC Canada, 1–12. https://doi.org/10.1145/3173574.3173679",
      "doi": "10.1145/3173574.3173679"
    },
    {
      "text": "Kate Starbird and Leysia Palen. 2011. ”Voluntweeters” self-organizing by digital volunteers in times of crisis. In Proceedings of the SIGCHI conference on human factors in computing systems. 1071–1080.",
      "doi": "10.1145/1978942.1979102"
    },
    {
      "text": "Marco R Steenbergen, André Bächtiger, Markus Spörndli, and Jürg Steiner. 2003. Measuring political deliberation: A discourse quality index. Comparative European Politics 1, 1 (2003), 21–48.",
      "doi": ""
    },
    {
      "text": "Sharifa Sultana and Susan R. Fussell. 2021. Dissemination, Situated Fact-Checking, and Social Effects of Misinformation among Rural Bangladeshi Villagers During the COVID-19 Pandemic. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 436 (oct 2021), 34 pages. https://doi.org/10.1145/3479580",
      "doi": "10.1145/3479580"
    },
    {
      "text": "Sharifa Sultana, François Guimbretière, Phoebe Sengers, and Nicola Dell. 2018. Design within a patriarchal society: Opportunities and challenges in designing for rural women in bangladesh. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3174110"
    },
    {
      "text": "Shalini Talwar, Amandeep Dhir, Puneet Kaur, Nida Zafar, and Melfi Alrasheedy. 2019. Why do people share fake news? Associations between the dark side of social media use and fake news sharing behavior. Journal of Retailing and Consumer Services 51 (2019), 72–82.",
      "doi": ""
    },
    {
      "text": "Edson C Tandoc, Richard Ling, Oscar Westlund, Andrew Duffy, Debbie Goh, and Lim Zheng Wei. 2018. Audiences’ Acts of Authentication in the Age of Fake News: A Conceptual Framework. New Media & Society 20, 8 (Aug. 2018), 2745–2763. https://doi.org/10.1177/1461444817731756",
      "doi": ""
    },
    {
      "text": "Emily Thorson. 2016. Belief Echoes: The Persistent Effects of Corrected Misinformation. Political Communication 33, 3 (July 2016), 460–480. https://doi.org/10.1080/10584609.2015.1102187",
      "doi": ""
    },
    {
      "text": "Stefan Timmermans and Iddo Tavory. 2012. Theory construction in qualitative research: From grounded theory to abductive analysis. Sociological theory 30, 3 (2012), 167–186.",
      "doi": ""
    },
    {
      "text": "Data Source Triangulation. 2014. The use of triangulation in qualitative research. In Oncology nursing forum, Vol. 41. 545.",
      "doi": ""
    },
    {
      "text": "Borhan Uddin, Nahid Reza, Md Saiful Islam, Hasib Ahsan, and Mohammad Ruhul Amin. 2021. Fighting Against Fake News During Pandemic Era: Does Providing Related News Help Student Internet Users to Detect COVID-19 Misinformation?. In 13th ACM Web Science Conference 2021. 178–186.",
      "doi": "10.1145/3447535.3462508"
    },
    {
      "text": "Rama Adithya Varanasi, Aditya Vasishtha, and Nicola Dell. 2021. Tag a Teacher: A Qualitative Analysis of WhatsApp-Based Teacher Networks in Low-Income Indian Schools. In Proceedings of the 39rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’21. ACM Press.",
      "doi": "10.1145/3411764.3445221"
    },
    {
      "text": "Feeza Vasudeva and Nicholas Barkdull. 2020. WhatsApp in India? A case study of social media related lynchings. Social Identities 26, 5 (2020), 574–589.",
      "doi": ""
    },
    {
      "text": "Shriram Venkatraman. 2017. Social media in south India. UCL Press.",
      "doi": "10.5555/3239935"
    },
    {
      "text": "S. Vidyarthi, S. Mathur, Oxford University Press, and S. Agrawal. 2017. Understanding India’s New Approach to Spatial Planning and Development: A Salient Shift?Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Soroush Vosoughi, Deb Roy, and Sinan Aral. 2018. The Spread of True and False News Online. Science 359, 6380 (March 2018), 1146–1151. https://doi.org/10.1126/science.aap9559",
      "doi": ""
    },
    {
      "text": "Claire Wardle, Hossein Derakhshan, 2018. Thinking about ‘information disorder’: formats of misinformation, disinformation, and mal-information. Ireton, Cherilyn; Posetti, Julie. Journalism,‘fake news’& disinformation. Paris: Unesco(2018), 43–54.",
      "doi": ""
    },
    {
      "text": "Lina Zhou and Dongsong Zhang. 2007. An ontology-supported misinformation model: Toward a digital misinformation library. IEEE Transactions on Systems, Man, and Cybernetics-Part A: Systems and Humans 37, 5 (2007), 804–813.",
      "doi": "10.1109/TSMCA.2007.902648"
    }
  ]
}