{
  "doi": "10.1145/3491102.3517671",
  "title": "Designing Visuo-Haptic Illusions with Proxies in Virtual Reality: Exploration of Grasp, Movement Trajectory and Object Mass",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "Visuo-haptic illusions are a method to expand proxy-based interactions in VR by introducing unnoticeable discrepancies between the virtual and real world. Yet how different design variables affect the illusions with proxies is still unclear. To unpack a subset of variables, we conducted two user studies with 48 participants to explore the impact of (1) different grasping types and movement trajectories, and (2) different grasping types and object masses on the discrepancy which may be introduced. Our Bayes analysis suggests that grasping types and object masses (≤ 500 g) did not noticeably affect the discrepancy, but for movement trajectory, results were inconclusive. Further, we identified a significant difference between (un)restricted movement trajectories. Our data shows considerable differences in participants’ proprioceptive accuracy, which seem to correlate with their prior VR experience. Finally, we illustrate the impact of our key findings on the visuo-haptic illusion design process by showcasing a new design workflow.",
  "tags": [
    "Grasp",
    "Visuo-Haptic Illusions",
    "Object Mass",
    "Movement Trajectory"
  ],
  "authors": [
    {
      "name": "Martin Feick",
      "institution": "DFKI, Saarland Informatics Campus, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659247786",
      "orcid": "missing"
    },
    {
      "name": "Kora Persephone Regitz",
      "institution": "DFKI, Saarland Informatics Campus, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238663",
      "orcid": "missing"
    },
    {
      "name": "Anthony Tang",
      "institution": "University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100640680",
      "orcid": "0000-0003-4293-4082"
    },
    {
      "name": "Antonio Krüger",
      "institution": "DFKI, Saarland Informatics Campus, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548004671",
      "orcid": "0000-0002-8055-8367"
    }
  ],
  "references": [
    {
      "text": "Parastoo Abtahi and Sean Follmer. 2018. Visuo-Haptic Illusions for Improving the Perceived Performance of Shape Displays. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal, QC, Canada) (CHI ’18). 1–13. https://doi.org/10.1145/3173574.3173724",
      "doi": "10.1145/3173574.3173724"
    },
    {
      "text": "Parastoo Abtahi, Benoit Landry, Jackie (Junrui) Yang, Marco Pavone, Sean Follmer, and James A. Landay. 2019. Beyond The Force: Using Quadcopters to Appropriate Objects and the Environment for Haptics in Virtual Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland, UK) (CHI ’19). 1–13. https://doi.org/10.1145/3290605.3300589",
      "doi": "10.1145/3290605.3300589"
    },
    {
      "text": "Gabrielle E. Ansems, Trevor J. Allen, and Uwe Proske. 2006. Position Sense at the Human Forearm in the Horizontal Plane during Loading and Vibration of Elbow Muscles. The Journal of Physiology 5763, 2 (2006), 445–455. https://doi.org/10.1113/jphysiol.2006.115097",
      "doi": ""
    },
    {
      "text": "Bruno Araujo, Ricardo Jota, Varun Perumal, Jia Xian Yao, Karan Singh, and Daniel Wigdor. 2016. Snake Charmer: Physically Enabling Virtual Objects. In Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction(Eindhoven, Netherlands) (TEI ’16). 218–226. https://doi.org/10.1145/2839462.2839484",
      "doi": "10.1145/2839462.2839484"
    },
    {
      "text": "Mahdi Azmandian, Mark Hancock, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2016. Haptic Retargeting: Dynamic Repurposing of Passive Haptics for Enhanced Virtual Reality Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). 1968–1979. https://doi.org/10.1145/2858036.2858226",
      "doi": "10.1145/2858036.2858226"
    },
    {
      "text": "Yuki Ban, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2012. Modifying an Identified Position of Edged Shapes Using Pseudo-Haptic Effects. In Proceedings of the 18th ACM Symposium on Virtual Reality Software and Technology(VRST ’12). 93–96. https://doi.org/10.1145/2407336.2407353",
      "doi": "10.1145/2407336.2407353"
    },
    {
      "text": "Yuki Ban, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2014. Displaying Shapes with Various Types of Surfaces Using Visuo-Haptic Interaction. In Proceedings of the 20th ACM Symposium on Virtual Reality Software and Technology(Edinburgh, Scotland) (VRST ’14). 191–196. https://doi.org/10.1145/2671015.2671028",
      "doi": "10.1145/2671015.2671028"
    },
    {
      "text": "Iseult A. M. Beets, Marc Macé, Raf L. J. Meesen, Koen Cuypers, Oron Levin, and Stephan P. Swinnen. 2012. Active versus Passive Training of a Complex Bimanual Task: Is Prescriptive Proprioceptive Information Sufficient for Inducing Motor Learning?PLOS ONE 7 (2012). https://doi.org/10.1371/journal.pone.0037687",
      "doi": ""
    },
    {
      "text": "Brett Benda, Shaghayegh. Esmaeili, and Eric D. Ragan. 2020. Determining Detection Thresholds for Fixed Positional Offsets for Virtual Hand Remapping in Virtual Reality (ISMAR). In 2020 IEEE International Symposium on Mixed and Augmented Reality(ISMAR ’20). 269–278. https://doi.org/10.1109/ISMAR50242.2020.00050",
      "doi": ""
    },
    {
      "text": "Christopher C. Berger, Mar Gonzalez-Franco, Eyal Ofek, and Ken Hinckley. 2018. The Uncanny Valley of Haptics. Science Robotics 3, 17 (2018), eaar7010. https://doi.org/10.1126/scirobotics.aar7010 arXiv:https://www.science.org/doi/pdf/10.1126/scirobotics.aar7010",
      "doi": ""
    },
    {
      "text": "Joanna Bergström, Aske Mottelson, and Jarrod Knibbe. 2019. Resized Grasping in VR: Estimating Thresholds for Object Discrimination. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). 1175–1183. https://doi.org/10.1145/3332165.3347939",
      "doi": "10.1145/3332165.3347939"
    },
    {
      "text": "Jack Brookes, Matthew Warburton, Mshari Alghadier, Mark Mon-Williams, and Faisal Mushtaq. 2020. Studying Human Behavior with Virtual Reality: The Unity Experiment Framework. Behavior Research Methods 52, 2 (2020), 455–463. https://doi.org/10.3758/s13428-019-01242-0",
      "doi": ""
    },
    {
      "text": "Ian M. Bullock, Joshua Z. Zheng, Sara De La Rosa, Charlotte Guertler, and Aaron M. Dollar. 2013. Grasp Frequency and Usage in Daily Household and Machine Shop Tasks. IEEE Transactions on Haptics 6, 3 (2013), 296–308. https://doi.org/10.1109/TOH.2013.6",
      "doi": "10.1109/TOH.2013.6"
    },
    {
      "text": "Eric Burns, Sharif Razzaque, A.T. Panter, Mary Whitton, M.R. McCallus, and Frederick P. Brooks. 2005. The Hand is Slower than the Eye: A Quantitative Exploration of Visual Dominance over Proprioception. In IEEE Proceedings. VR 2005. Virtual Reality, 2005.3–10. https://doi.org/10.1109/VR.2005.1492747",
      "doi": ""
    },
    {
      "text": "Eric Burns, Sharif Razzaque, Abigail T. Panter, Mary C. Whitton, Matthew R. McCallus, and Frederick P. Brooks. 2006. The Hand Is More Easily Fooled than the Eye: Users Are More Sensitive to Visual Interpenetration than to Visual-Proprioceptive Discrepancy. Presence: Teleoperators and Virtual Environments 15, 1(2006), 1–15. https://doi.org/10.1162/pres.2006.15.1.1",
      "doi": "10.1162/pres.2006.15.1.1"
    },
    {
      "text": "Lung-Pan Cheng, Eyal Ofek, Christian Holz, Hrvoje Benko, and Andrew D. Wilson. 2017. Sparse Haptic Proxy: Touch Feedback in Virtual Environments Using a General Passive Prop. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). 3718–3728. https://doi.org/10.1145/3025453.3025753",
      "doi": "10.1145/3025453.3025753"
    },
    {
      "text": "Inrak Choi, Heather Culbertson, Mark R. Miller, Alex Olwal, and Sean Follmer. 2017. Grabity: A Wearable Haptic Interface for Simulating Weight and Grasping in Virtual Reality. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). 119–130. https://doi.org/10.1145/3126594.3126599",
      "doi": "10.1145/3126594.3126599"
    },
    {
      "text": "Inrak Choi, Elliot W. Hawkes, David L. Christensen, Christopher J. Ploch, and Sean Follmer. 2016. Wolverine: A Wearable Haptic Interface for Grasping in Virtual Reality. In 2016 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). 986–993. https://doi.org/10.1109/IROS.2016.7759169",
      "doi": "10.1145/2984751.2985725"
    },
    {
      "text": "Inrak Choi, Eyal Ofek, Hrvoje Benko, Mike Sinclair, and Christian Holz. 2018. CLAW: A Multifunctional Handheld Haptic Controller for Grasping, Touching, and Triggering in Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). 1–13. https://doi.org/10.1145/3173574.3174228",
      "doi": "10.1145/3173574.3174228"
    },
    {
      "text": "Mark R. Cutkosky. 1989. On Grasp Choice, Grasp Models, and the Design of Hands for Manufacturing Tasks. IEEE Transactions on Robotics and Automation 5, 3 (1989), 269–279. https://doi.org/10.1109/70.34763",
      "doi": ""
    },
    {
      "text": "Donald Degraen, André Zenner, and Antonio Krüger. 2019. Enhancing Texture Perception in Virtual Reality Using 3D-Printed Hair Structures. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland, UK) (CHI ’19). 1–12. https://doi.org/10.1145/3290605.3300479",
      "doi": "10.1145/3290605.3300479"
    },
    {
      "text": "Zoltan Dienes. 2014. Using Bayes to Get the Most out of Non-significant Results. Frontiers in Psychology 5 (2014). https://doi.org/10.3389/fpsyg.2014.00781",
      "doi": ""
    },
    {
      "text": "Shaghayegh Esmaeili, Brett Benda, and Eric D. Ragan. 2020. Detection of Scaled Hand Interactions in Virtual Reality: The Effects of Motion Direction and Task Complexity. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 453–462. https://doi.org/10.1109/VR46266.2020.00066",
      "doi": ""
    },
    {
      "text": "Martin Feick, Scott Bateman, Anthony Tang, André Miede, and Nicolai Marquardt. 2020. TanGi: Tangible Proxies For Embodied Object Exploration And Manipulation In Virtual Reality. In 2020 IEEE International Symposium on Mixed and Augmented Reality(ISMAR ’20). 195–206. https://doi.org/10.1109/ISMAR50242.2020.00042",
      "doi": ""
    },
    {
      "text": "Martin Feick, Niko Kleer, Anthony Tang, and Antonio Krüger. 2020. The Virtual Reality Questionnaire Toolkit. In Adjunct Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology, AP UIST 2020 (Virtual Event, USA) (UIST ’20 Adjunct). ACM, 68–69. https://dl.acm.org/doi/10.1145/3379350.3416188",
      "doi": ""
    },
    {
      "text": "Martin Feick, Niko Kleer, André Zenner, Anthony Tang, and Antonio Krüger. 2021. Visuo-Haptic Illusions for Linear Translation and Stretching Using Physical Proxies in Virtual Reality. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). 1–13. https://doi.org/10.1145/3411764.3445456",
      "doi": "10.1145/3411764.3445456"
    },
    {
      "text": "Thomas Feix, Ian M. Bullock, and Aaron M. Dollar. 2014. Analysis of Human Grasping Behavior: Correlating Tasks, Objects and Grasps. IEEE Transactions on Haptics 7, 4 (2014), 430–441. https://doi.org/10.1109/TOH.2014.2326867",
      "doi": ""
    },
    {
      "text": "Thomas Feix, Ian M. Bullock, and Aaron M. Dollar. 2014. Analysis of Human Grasping Behavior: Object Characteristics and Grasp Type. IEEE Transactions on Haptics 7, 3 (2014), 311–323. https://doi.org/10.1109/TOH.2014.2326871",
      "doi": ""
    },
    {
      "text": "Thomas Feix, Javier Romero, Heinz-Bodo Schmiedmayer, Aaron M Dollar, and Danica Kragic. 2016. The GRASP Taxonomy of Human Grasp Types. IEEE Transactions on Human-Machine Systems 46, 1 (2016), 66–77. https://doi.org/10.1109/THMS.2015.2470657",
      "doi": ""
    },
    {
      "text": "Andy Field. 2013. Discovering Statistics using IBM SPSS Statistics (4th Edition). SAGE Publications.",
      "doi": "10.5555/2502692"
    },
    {
      "text": "Anton Franzluebbers and Kyle Johnsen. 2018. Performance Benefits of High-Fidelity Passive Haptic Feedback in Virtual Reality Training. In Proceedings of the Symposium on Spatial User Interaction (Berlin, Germany) (SUI ’18). 16–24. https://doi.org/10.1145/3267782.3267790",
      "doi": "10.1145/3267782.3267790"
    },
    {
      "text": "James J. Gibson. 1933. Adaption, After-effect and Contrast in the Perception of Curved Lines. Journal of Experimental Psychology 16, 1 (1933), 1–31. https://doi.org/10.1037/h0074626",
      "doi": ""
    },
    {
      "text": "Eric J. Gonzalez, Parastoo Abtahi, and Sean Follmer. 2020. REACH+: Extending the Reachability of Encountered-Type Haptics Devices through Dynamic Redirection in VR. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). 236–248. https://doi.org/10.1145/3379337.3415870",
      "doi": "10.1145/3379337.3415870"
    },
    {
      "text": "Eric J. Gonzalez and Sean Follmer. 2019. Investigating the Detection of Bimanual Haptic Retargeting in Virtual Reality. In 25th ACM Symposium on Virtual Reality Software and Technology (Parramatta, NSW, Australia) (VRST ’19). 1–5. https://doi.org/10.1145/3359996.3364248",
      "doi": ""
    },
    {
      "text": "Mar Gonzalez-Franco and Jaron Lanier. 2017. Model of Illusions and Virtual Reality. Frontiers in Psychology 8 (2017). https://doi.org/10.3389/fpsyg.2017.01125",
      "doi": ""
    },
    {
      "text": "Xiaochi Gu, Yifei Zhang, Weize Sun, Yuanzhe Bian, Dao Zhou, and Per Ola Kristensson. 2016. Dexmo: An Inexpensive and Lightweight Mechanical Exoskeleton for Motion Capture and Force Feedback in VR. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). 1991–1995. https://doi.org/10.1145/2858036.2858487",
      "doi": "10.1145/2858036.2858487"
    },
    {
      "text": "Seongkook Heo, Christina Chung, Geehyuk Lee, and Daniel Wigdor. 2018. Thor’s Hammer: An Ungrounded Force Feedback Device Utilizing Propeller-Induced Propulsive Force. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal, QC, Canada) (CHI ’18). 1–11. https://doi.org/10.1145/3173574.3174099",
      "doi": ""
    },
    {
      "text": "Seongkook Heo, Jaeyeon Lee, and Daniel Wigdor. 2019. PseudoBend: Producing Haptic Illusions of Stretching, Bending, and Twisting Using Grain Vibrations. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). 803–813. https://doi.org/10.1145/3332165.3347941",
      "doi": "10.1145/3332165.3347941"
    },
    {
      "text": "Anuruddha Hettiarachchi and Daniel Wigdor. 2016. Annexing Reality: Enabling Opportunistic Use of Everyday Objects as Tangible Proxies in Augmented Reality. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). 1957–1967. https://doi.org/10.1145/2858036.2858134",
      "doi": "10.1145/2858036.2858134"
    },
    {
      "text": "Ken Hinckley, Randy Pausch, John C. Goble, and Neal F. Kassell. 1994. Passive Real-World Interface Props for Neurosurgical Visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, Massachusetts, USA) (CHI ’94). 452–458. https://doi.org/10.1145/191666.191821",
      "doi": "10.1145/191666.191821"
    },
    {
      "text": "Brent Edward Insko. 2001. Passive Haptics Significantly Enhances Virtual Environments. Ph. D. Dissertation. The University of North Carolina at Chapel Hill.",
      "doi": ""
    },
    {
      "text": "Harold Jeffreys. 1998. The Theory of Probability. OUP Oxford.",
      "doi": ""
    },
    {
      "text": "Christian Kaernbach. 1991. Simple Adaptive Testing with the Weighted Up-Down Method.Perception & Psychophysics 49, 3 (1991), 227–229. https://doi.org/10.3758/bf03214307",
      "doi": ""
    },
    {
      "text": "Noriko Kamakura, Michiko Matsuo, Harumi Ishii, Fumiko Mitsuboshi, and Yoriko Miura. 1980. Patterns of Static Prehension in Normal Hands.American Journal of Occupational Therapy 34, 7 (1980), 437–445. https://doi.org/10.5014/ajot.34.7.437",
      "doi": ""
    },
    {
      "text": "Robert S. Kennedy, Norman E. Lane, Kevin S. Berbaum, and Michael G. Lilienthal. 1993. Simulator Sickness Questionnaire: An Enhanced Method for Quantifying Simulator Sickness. The International Journal of Aviation Psychology 3, 3 (1993), 203–220. https://doi.org/10.1207/s15327108ijap0303_3",
      "doi": "10.1207/s15327108ijap0303_3"
    },
    {
      "text": "Christian Keysers, Valeria Gazzola, and Eric-Jan Wagenmakers. 2020. Using Bayes Factor Hypothesis Testing in Neuroscience to Establish Evidence of Absence. Nature neuroscience 23, 7 (2020), 788–799. https://doi.org/10.1038/s41593-020-0660-4",
      "doi": ""
    },
    {
      "text": "Frederick A.A. Kingdom and Nicolaas Prins. 2016. Chapter 5 - Adaptive Methods. In Psychophysics (Second Edition), Frederick A.A. Kingdom and Nicolaas Prins (Eds.). Academic Press, San Diego, 119–148. https://doi.org/10.1016/B978-0-12-407156-8.00005-0",
      "doi": ""
    },
    {
      "text": "Luv Kohli. 2010. Redirected Touching: Warping Space to Remap Passive Haptics. In 2010 IEEE Symposium on 3D User Interfaces (3DUI). 129–130. https://doi.org/10.1109/3DUI.2010.5444703",
      "doi": ""
    },
    {
      "text": "Jaeyeon Lee, Mike Sinclair, Mar Gonzalez-Franco, Eyal Ofek, and Christian Holz. 2019. TORC: A Virtual Reality Controller for In-Hand High-Dexterity Finger Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland, UK) (CHI ’19). 1–13. https://doi.org/10.1145/3290605.3300301",
      "doi": "10.1145/3290605.3300301"
    },
    {
      "text": "Benjamin Lok, Samir Naik, Mary Whitton, and Frederick P. Brooks. 2003. Effects of Handling Real Objects and Self-Avatar Fidelity on Cognitive Task Performance and Sense of Presence in Virtual Environments. Presence: Teleoperators and Virtual Environments 12, 6(2003), 615–628. https://doi.org/10.1162/105474603322955914",
      "doi": "10.1162/105474603322955914"
    },
    {
      "text": "Keith A. Markus. 2012. Principles and Practice of Structural Equation Modeling by Rex B. Kline. Structural Equation Modeling: A Multidisciplinary Journal 19, 3(2012), 509–512. https://doi.org/10.1080/10705511.2012.687667",
      "doi": ""
    },
    {
      "text": "Thomas H. Massie and J. K. Salisbury. 1994. The PHANToM Haptic Interface: A Device for Probing Virtual Objects. In Proceedings of the ASME Dynamic Systems and Control Division. 295–301.",
      "doi": ""
    },
    {
      "text": "William A. McNeely. 1993. Robotic Graphics: A New Approach to Force Feedback for Virtual Reality. In Proceedings of IEEE Virtual Reality Annual International Symposium(VRAIS ’93). 336–341. https://doi.org/10.1109/VRAIS.1993.380761",
      "doi": "10.1109/VRAIS.1993.380761"
    },
    {
      "text": "Thomas Muender, Anke V. Reinschluessel, Sean Drewes, Dirk Wenig, Tanja Döring, and Rainer Malaka. 2019. Does It Feel Real? Using Tangibles with Different Fidelities to Build and Explore Scenes in Virtual Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland, UK) (CHI ’19). 1–12. https://doi.org/10.1145/3290605.3300903",
      "doi": "10.1145/3290605.3300903"
    },
    {
      "text": "Niels Christian Nilsson, André Zenner, and Adalberto L. Simeone. 2021. Propping Up Virtual Reality With Haptic Proxies. IEEE Computer Graphics and Applications 41, 5 (2021), 104–112. https://doi.org/10.1109/MCG.2021.3097671",
      "doi": ""
    },
    {
      "text": "Nami Ogawa, Takuji Narumi, and Michitaka Hirose. 2021. Effect of Avatar Appearance on Detection Thresholds for Remapped Hand Movements. IEEE Transactions on Visualization and Computer Graphics 27, 7(2021), 3182–3197. https://doi.org//10.1109/TVCG.2020.2964758",
      "doi": "10.1109/TVCG.2020.2964758"
    },
    {
      "text": "Uwe Proske and Simon C. Gandevia. 2012. The Proprioceptive Senses: Their Roles in Signaling Body Shape, Body Position and Movement, and Muscle Force. Psychophysical Reviews 92, 4 (2012), 1651–1697. https://doi.org//10.1152/physrev.00048.2011",
      "doi": ""
    },
    {
      "text": "Fernando Ribeiro and José Oliviera. 2011. Factors Influencing Proprioception: What Do They Reveal?Psychophysical Reviews(2011). https://doi.org//10.5772/20335",
      "doi": ""
    },
    {
      "text": "Neung Ryu, Hye-Young Jo, Michel Pahud, Mike Sinclair, and Andrea Bianchi. 2021. GamesBond: Bimanual Haptic Illusion of Physically Connected Objects for Immersive VR Using Grip Deformation. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–10. https://doi.org/10.1145/3411764.3445727",
      "doi": "10.1145/3411764.3445727"
    },
    {
      "text": "Neung Ryu, Woojin Lee, Myung Jin Kim, and Andrea Bianchi. 2020. ElaStick: A Handheld Variable Stiffness Display for Rendering Dynamic Haptic Response of Flexible Object. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). 1035–1045. https://doi.org/10.1145/3379337.3415862",
      "doi": "10.1145/3379337.3415862"
    },
    {
      "text": "Majed Samad, Elia Gatti, Anne Hermes, Hrvoje Benko, and Cesare Parise. 2019. Pseudo-Haptic Weight: Changing the Perceived Weight of Virtual Objects By Manipulating Control-Display Ratio. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland, UK) (CHI ’19). 1–13. https://doi.org/10.1145/3290605.3300550",
      "doi": "10.1145/3290605.3300550"
    },
    {
      "text": "Valentin Schwind, Pascal Knierim, Cagri Tasci, Patrick Franczak, Nico Haas, and Niels Henze. 2017. ”These Are Not My Hands!”: Effect of Gender on the Perception of Avatar Hands in Virtual Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). 1577–1582. https://doi.org/10.1145/3025453.3025602",
      "doi": "10.1145/3025453.3025602"
    },
    {
      "text": "Jotaro Shigeyama, Takeru Hashimoto, Shigeo Yoshida, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2019. Transcalibur: A Weight Shifting Virtual Reality Controller for 2D Shape Rendering Based on Computational Perception Model. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland, UK) (CHI ’19). 1–11. https://doi.org/10.1145/3290605.3300241",
      "doi": "10.1145/3290605.3300241"
    },
    {
      "text": "Adalberto L. Simeone, Eduardo Velloso, and Hans Gellersen. 2015. Substitutional Reality: Using the Physical Environment to Design Virtual Reality Experiences. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). 3307–3316. https://doi.org/10.1145/2702123.2702389",
      "doi": "10.1145/2702123.2702389"
    },
    {
      "text": "Mike Sinclair, Eyal Ofek, Mar Gonzalez-Franco, and Christian Holz. 2019. CapstanCrunch: A Haptic VR Controller with User-Supplied Force Feedback. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology(New Orleans, LA, USA) (UIST ’19). 815–829. https://doi.org/10.1145/3332165.3347891",
      "doi": "10.1145/3332165.3347891"
    },
    {
      "text": "Frank Steinicke, Gerd Bruder, Jason Jerald, Harald Frenz, and Markus Lappe. 2010. Estimation of Detection Thresholds for Redirected Walking Techniques. IEEE Transactions on Visualization and Computer Graphics 16, 1(2010), 17–27. https://doi.org/10.1109/TVCG.2009.62",
      "doi": "10.1109/TVCG.2009.62"
    },
    {
      "text": "Francesca Stival, Stefano Michieletto, Matteo Cognolato, Enrico Pagello, Henning Müller, and Manfredo Atzori. 2019. A Quantitative Taxonomy of Human Hand Grasps.Journal of NeuroEngineering and Rehabilitation 16, 1(2019), 28. https://doi.org/10.1186/s12984-019-0488-x",
      "doi": ""
    },
    {
      "text": "Patrick L. Strandholt, Oana A. Dogaru, Niels C. Nilsson, Rolf Nordahl, and Stefania Serafin. 2020. Knock on Wood: Combining Redirected Touching and Physical Props for Tool-Based Interaction in Virtual Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). 1–13. https://doi.org/10.1145/3313831.3376303",
      "doi": "10.1145/3313831.3376303"
    },
    {
      "text": "Evan Strasnick, Christian Holz, Eyal Ofek, Mike Sinclair, and Hrvoje Benko. 2018. Haptic Links: Bimanual Haptics for Virtual Reality Using Variable Stiffness Actuation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal, QC, Canada) (CHI ’18). 1–12. https://doi.org/10.1145/3173574.3174218",
      "doi": "10.1145/3173574.3174218"
    },
    {
      "text": "Xavier de Tinguy, Claudio Pacchierotti, Mathieu Emily, Mathilde Chevalier, Aurélie Guignardat, Morgan Guillaudeux, Chloé Six, Anatole Lécuyer, and Maud Marchal. 2019. How Different Tangible and Virtual Objects Can Be While Still Feeling the Same?. In 2019 IEEE World Haptics Conference. 580–585. https://doi.org/10.1109/WHC.2019.8816164",
      "doi": ""
    },
    {
      "text": "Xavier de Tinguy, Claudio Pacchierotti, Anatole Lécuyer, and Maud Marchal. 2021. Capacitive Sensing for Improving Contact Rendering With Tangible Objects in VR. IEEE Transactions on Visualization and Computer Graphics 27, 4(2021), 2481–2487. https://doi.org/10.1109/TVCG.2020.3047689",
      "doi": ""
    },
    {
      "text": "Tzu-Yun Wei, Hsin-Ruey Tsai, Yu-So Liao, Chieh Tsai, Yi-Shan Chen, Chi Wang, and Bing-Yu Chen. 2020. ElastiLinks: Force Feedback between VR Controllers with Dynamic Points of Application of Force. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). 1023–1034. https://doi.org/10.1145/3379337.3415836",
      "doi": "10.1145/3379337.3415836"
    },
    {
      "text": "Eric Whitmire, Hrvoje Benko, Christian Holz, Eyal Ofek, and Mike Sinclair. 2018. Haptic Revolver: Touch, Shear, Texture, and Shape Rendering on a Reconfigurable Virtual Reality Controller. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal, QC, Canada) (CHI ’18). 1–12. https://doi.org/10.1145/3173574.3173660",
      "doi": "10.1145/3173574.3173660"
    },
    {
      "text": "Yizhong Xin, Xiaojun Bi, and Xiangshi Ren. 2012. Natural Use Profiles for the Pen: An Empirical Exploration of Pressure, Tilt, and Azimuth. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). 801–804. https://doi.org/10.1145/2207676.2208518",
      "doi": "10.1145/2207676.2208518"
    },
    {
      "text": "Jackie (Junrui) Yang, Hiroshi Horii, Alexander Thayer, and Rafael Ballagas. 2018. VR Grabbers: Ungrounded Haptic Retargeting for Precision Grabbing Tools. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology(Berlin, Germany) (UIST ’18). 889–899. https://doi.org/10.1145/3242587.3242643",
      "doi": "10.1145/3242587.3242643"
    },
    {
      "text": "André Zenner and Antonio Krüger. 2017. Shifty: A Weight-Shifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 23, 4(2017), 1285–1294. https://doi.org/10.1109/TVCG.2017.2656978",
      "doi": "10.1109/TVCG.2017.2656978"
    },
    {
      "text": "André Zenner and Antonio Krüger. 2019. Estimating Detection Thresholds for Desktop-Scale Hand Redirection in Virtual Reality. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces(VR). 47–55. https://doi.org/10.1109/VR.2019.8798143",
      "doi": ""
    },
    {
      "text": "André Zenner, Kristin Ullmann, and Antonio Krüger. 2021. Combining Dynamic Passive Haptics and Haptic Retargeting for Enhanced Haptic Feedback in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 27, 5(2021), 2627–2637. https://doi.org/10.1109/TVCG.2021.3067777",
      "doi": ""
    },
    {
      "text": "Yiwei Zhao, Lawrence H. Kim, Ye Wang, Mathieu Le Goc, and Sean Follmer. 2017. Robotic Assembly of Haptic Proxy Objects for Tangible Interaction and Virtual Reality. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (Brighton, United Kingdom) (ISS ’17). 82–91. https://doi.org/10.1145/3132272.3134143",
      "doi": "10.1145/3132272.3134143"
    },
    {
      "text": "Joshua Z. Zheng, Sara De La Rosa, and Aaron M. Dollar. 2011. An Investigation of Grasp Type and Frequency in Daily Household and Machine Shop Tasks. In 2011 IEEE International Conference on Robotics and Automation. 4169–4175. https://doi.org/10.1109/ICRA.2011.5980366",
      "doi": ""
    },
    {
      "text": "Kening Zhu, Taizhou Chen, Feng Han, and Yi-Shiun Wu. 2019. HapTwist: Creating Interactive Haptic Proxies in Virtual Reality Using Low-Cost Twistable Artefacts. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland, UK) (CHI ’19). 1–13. https://doi.org/10.1145/3290605.3300923",
      "doi": "10.1145/3290605.3300923"
    }
  ]
}