{
  "doi": "10.1145/3491102.3517554",
  "title": "Barriers to Online Dementia Information and Mitigation",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "There is growing interest in HCI to study ways to support access to accurate, accessible, relevant online health information for different populations. Yet, there remains a need to understand the barriers that are posed by the way our platforms are designed as well as how we might overcome these barriers for people with dementia. To address this, we conducted sixteen interviews and observation sessions with people with mild to moderate dementia. Our analysis uncovered four barriers to online health information and corresponding mitigation strategies that participants employed. We discuss how HCI researchers may apply these findings towards new technical approaches and standards concerning information accessibility and credibility for neurodiverse populations. Finally, we broaden the scope of HCI research to include investigations of the accessibility and credibility of online information for people with age-related cognitive impairment independent of proxies.",
  "authors": [
    {
      "name": "Emma Dixon",
      "institution": "College of Information Studies, University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366012",
      "orcid": "missing"
    },
    {
      "name": "Jesse Anderson",
      "institution": "College of Information Studies, University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235546",
      "orcid": "missing"
    },
    {
      "name": "Diana Blackwelder",
      "institution": "College of Information Studies, University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239212",
      "orcid": "missing"
    },
    {
      "name": "Mary L. Radnofsky",
      "institution": "College of Information Studies, University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701252",
      "orcid": "missing"
    },
    {
      "name": "Amanda Lazar",
      "institution": "College of Information Studies, University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659262040",
      "orcid": "0000-0001-8110-4239"
    }
  ],
  "references": [
    {
      "text": "Alzheimer's Association. Younger/Early-Onset Alzheimer's. Alzheimer's Disease and Dementia. Retrieved March 16, 2020 from https://alz.org/alzheimers-dementia/what-is-alzheimers/younger-early-onset",
      "doi": ""
    },
    {
      "text": "Alzheimer's Association. 2021. 2021 Alzheimer's Disease Facts and Figures. Alzheimers Dement, Chicago, IL.",
      "doi": ""
    },
    {
      "text": "Faranak Aminzadeh, Anna Byszewski, Frank J. Molnar, and Marg Eisner. 2007. Emotional impact of dementia diagnosis: Exploring persons with dementia and caregivers’ perspectives. Aging & Mental Health 11, 3: 281–290. https://doi.org/10.1080/13607860600963695",
      "doi": ""
    },
    {
      "text": "Laima Augustaitis, Leland A. Merrill, Kristi E Gamarel, and Oliver L. Haimson. 2021. Online Transgender Health Information Seeking: Facilitators, Barriers, and Future Directions. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–14. Retrieved December 18, 2021 from https://doi.org/10.1145/3411764.3445091",
      "doi": ""
    },
    {
      "text": "Nina Baruch, Charlotte L. Allan, Samuel Cundell, Samuel Clark, and Brian Murray. 2017. Promoting early dementia diagnosis: a video designed by patients, for patients. International Psychogeriatrics 29, 5: 863–867.",
      "doi": ""
    },
    {
      "text": "Susan Behuniak. 2011. The living dead? The construction of people with Alzheimer's disease as zombies. Ageing and Society 31: 70–92. https://doi.org/10.1017/S0144686X10000693",
      "doi": ""
    },
    {
      "text": "Gerd Berget. 2020. “Information Needs of the End Users Have Never Been Discussed”: An Investigation of the User-intermediary Interaction of People with Intellectual Impairments. In Proceedings of the 2020 Conference on Human Information Interaction and Retrieval (CHIIR ’20), 93–102. https://doi.org/10.1145/3343413.3377953",
      "doi": "10.1145/3343413.3377953"
    },
    {
      "text": "Talita Britto and Ednaldo Pizzolato. 2016. Towards Web Accessibility Guidelines of Interaction and Interface Design for People with Autism Spectrum Disorder.",
      "doi": ""
    },
    {
      "text": "David A. Broniatowski and Valerie F. Reyna. 2013. Gist and Verbatim in Narrative Memory. In 2013 Workshop on Computational Models of Narrative (OpenAccess Series in Informatics (OASIcs)), 43–51. https://doi.org/10.4230/OASIcs.CMN.2013.43",
      "doi": ""
    },
    {
      "text": "David A. Broniatowski and Valerie F. Reyna. 2015. Formalizing Risky Choice with a Logistic Model of Fuzzy Trace Theory. In Proceedings of the 37th Annual Meeting of the Cognitive Science Society.",
      "doi": ""
    },
    {
      "text": "David A. Broniatowski and Valerie F. Reyna. 2020. To illuminate and motivate: a fuzzy-trace model of the spread of information online. Computational and Mathematical Organization Theory 26, 4: 431–464. https://doi.org/10.1007/s10588-019-09297-2",
      "doi": "10.1007/s10588-019-09297-2"
    },
    {
      "text": "Isabel Cachola, Kyle Lo, Arman Cohan, and Daniel Weld. 2020. TLDR: Extreme Summarization of Scientific Documents. In Findings of the Association for Computational Linguistics: EMNLP 2020, 4766–4777. https://doi.org/10.18653/v1/2020.findings-emnlp.428",
      "doi": ""
    },
    {
      "text": "Ruth Chaplin and Ian Davidson. 2016. What are the experiences of people with dementia in employment? Dementia 15, 2: 147–161. https://doi.org/10.1177/1471301213519252",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing Grounded Theory: A practical guide through qualitative analysis. SAGE, London.",
      "doi": ""
    },
    {
      "text": "CHI 2021 Paper Chairs. 2020. Some Insights on CHI 2021 Paper Lengths. CHI2021 | May 8-13, Yokohama, Japan. Retrieved December 23, 2021 from http://chi2021.acm.org/",
      "doi": ""
    },
    {
      "text": "Denise Craig and Edward Strivens. 2016. Facing the times: A young onset dementia support group: FacebookTM style. Australasian Journal on Ageing 35, 1: 48–53. https://doi.org/10.1111/ajag.12264",
      "doi": ""
    },
    {
      "text": "Sameer Dhoju, Md Main Uddin Rony, Muhammad Ashad Kabir, and Naeemul Hassan. 2019. Differences in Health News from Reliable and Unreliable Media. In Companion Proceedings of The 2019 World Wide Web Conference (WWW ’19), 981–987. https://doi.org/10.1145/3308560.3316741",
      "doi": "10.1145/3308560.3316741"
    },
    {
      "text": "Mark Diaz, Isaac Johnson, Amanda Lazar, Anne Marie Piper, and Darren Gergle. 2018. Addressing Age-Related Bias in Sentiment Analysis. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 1–14. https://doi.org/10.1145/3173574.3173986",
      "doi": "10.1145/3173574.3173986"
    },
    {
      "text": "Emma Dixon and Amanda Lazar. 2020. The Role of Sensory Changes in Everyday Technology use by People with Mild to Moderate Dementia. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’20), 1–12. https://doi.org/10.1145/3373625.3417000",
      "doi": "10.1145/3373625.3417000"
    },
    {
      "text": "Emma Dixon, Anne Marie Piper, and Amanda Lazar. 2021. “Taking care of myself as long as I can”: How People with Dementia Configure Self-Management Systems. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–14. https://doi.org/10.1145/3411764.3445225",
      "doi": "10.1145/3411764.3445225"
    },
    {
      "text": "Perry Edelman, Daniel Kuhn, Bradley R. Fulton, and Gregory A. Kyrouac. 2006. Information and Service Needs of Persons With Alzheimer's Disease and Their Family Caregivers Living in Rural Communities. American Journal of Alzheimer's Disease & Other Dementias® 21, 4: 226–233. https://doi.org/10.1177/1533317506290664",
      "doi": ""
    },
    {
      "text": "David Evans. 2019. An exploration of the impact of younger-onset dementia on employment. Dementia 18, 1: 262–281. https://doi.org/10.1177/1471301216668661",
      "doi": ""
    },
    {
      "text": "Dorothy Forbes, Sara Finkelstein, Catherine Blake, Maggie Gibson, Debra Morgan, Maureen Markle-Reid, Ivan Culum, and Emily Thiessen. 2012. Knowledge exchange throughout the dementia care journey by Canadian rural community-based health care practitioners, persons with dementia, and their care partners: an interpretive descriptive study. Rural and Remote Health. https://doi.org/10.22605/RRH2201",
      "doi": ""
    },
    {
      "text": "Ed Freeman, Linda Clare, Nada Savitch, Lindsay Royan, Rachael Litherland, and Margot Lindsay. 2005. Improving website accessibility for people with early-stage dementia: A preliminary investigation. Aging & Mental Health 9, 5: 442–448. https://doi.org/10.1080/13607860500142838",
      "doi": ""
    },
    {
      "text": "Amira Ghenai and Yelena Mejova. 2018. Fake Cures: User-centric Modeling of Health Misinformation in Social Media. Proceedings of the ACM on Human-Computer Interaction 2, CSCW: 58:1-58:20. https://doi.org/10.1145/3274327",
      "doi": ""
    },
    {
      "text": "Ryan Colin Gibson, Mark D. Dunlop, Matt-Mouley Bouamrane, and Revathy Nayar. 2020. Designing Clinical AAC Tablet Applications with Adults who have Mild Intellectual Disabilities. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, 1–13. Retrieved January 10, 2022 from https://doi.org/10.1145/3313831.3376159",
      "doi": "10.1145/3313831.3376159"
    },
    {
      "text": "Sarah A. Gilbert, Casey Fiesler, Lindsay Blackwell, Michael Ann DeVito, Michaelanne Dye, Shamika Goddard, Kishonna L. Gray, David Nemer, and C. Estelle Smith. 2020. Public Scholarship and CSCW: Trials and Twitterations. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing, 447–456. Retrieved January 10, 2022 from https://doi.org/10.1145/3406865.3418589",
      "doi": ""
    },
    {
      "text": "Jose Guzman-Parra, Pilar Barnestein-Fonseca, Gloria Guerrero-Pertiñez, Peter Anderberg, Luis Jimenez-Fernandez, Esperanza Valero-Moreno, Jessica Marian Goodman-Casanova, Antonio Cuesta-Vargas, Maite Garolera, Maria Quintana, Rebeca I García-Betances, Evi Lemmens, Johan Sanmartin Berglund, and Fermin Mayoral-Cleries. 2020. Attitudes and Use of Information and Communication Technologies in Older Adults With Mild Cognitive Impairment or Early Stages of Dementia and Their Caregivers: Cross-Sectional Study. Journal of Medical Internet Research 22, 6: e17253. https://doi.org/10.2196/17253",
      "doi": ""
    },
    {
      "text": "Duke Han, Patricia Boyle, Bryan James, Lei Yu, and David Bennett. 2015. Mild Cognitive Impairment and Susceptibility to Scams in Old Age. Journal of Alzheimer's disease: JAD 49, 3: 845–851. https://doi.org/10.3233/JAD-150442",
      "doi": ""
    },
    {
      "text": "Julie M. Haney and Wayne G. Lutters. 2018. “It's Scary…It's Confusing…It's Dull”: How Cybersecurity Advocates Overcome Negative Perceptions of Security. 411–425. Retrieved June 30, 2021 from https://www.usenix.org/conference/soups2018/presentation/haney-perceptions",
      "doi": ""
    },
    {
      "text": "Julie M. Haney and Wayne G. Lutters. 2019. Motivating Cybersecurity Advocates: Implications for Recruitment and Retention. In Proceedings of the 2019 on Computers and People Research Conference (SIGMIS-CPR ’19), 109–117. https://doi.org/10.1145/3322385.3322388",
      "doi": ""
    },
    {
      "text": "Juliet Harland, Peter Bath, and Ann Wainwright. 2017. Making sense of dementia: a phenomenographic study of the information behaviours of people diagnosed with dementia. Aslib Journal of Information Management, 69, 3: 261–277.",
      "doi": ""
    },
    {
      "text": "Gillian R. Hayes. 2011. The relationship of action research to human-computer interaction. ACM Transactions on Computer-Human Interaction 18, 3: 15:1-15:20. https://doi.org/10.1145/1993060.1993065",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "Soumya Hegde and Ratnavalli Ellajosyula. 2016. Capacity issues and decision-making in dementia. Annals of Indian Academy of Neurology 19, Suppl 1: S34–S39. https://doi.org/10.4103/0972-2327.192890",
      "doi": ""
    },
    {
      "text": "Niels Hendriks, Liesbeth Huybrechts, Andrea Wilkinson, and Karin Slegers. 2014. Challenges in doing participatory design with people with dementia. In Proceedings of the 13th Participatory Design Conference on Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts - PDC ’14 - volume 2, 33–36. https://doi.org/10.1145/2662155.2662196",
      "doi": "10.1145/2662155.2662196"
    },
    {
      "text": "Meghan E Hollis, Marcus Felson, and Brandon C Welsh. 2013. The capable guardian in routine activities theory: A theoretical and conceptual reappraisal. Crime Prevention and Community Safety 15, 1: 65–79. https://doi.org/10.1057/cpcs.2012.14",
      "doi": ""
    },
    {
      "text": "Thomas Howard, Krishna Venkatasubramanian, Jeanine L M Skorinko, Pauline Bosma, John Mullaly, Brian Kelly, Deborah Lloyd, Mary Wishart, Emiton Alves, Nicole Jutras, Mariah Freark, and Nancy A. Alterio. 2021. Designing an App to Help Individuals with Intellectual and Developmental Disabilities to Recognize Abuse. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’21), 1–14. https://doi.org/10.1145/3441852.3471217",
      "doi": ""
    },
    {
      "text": "Ruimin Hu and Jinjuan Heidi Feng. 2015. Investigating Information Search by People with Cognitive Disabilities. ACM Transactions on Accessible Computing 7, 1: 1–30. https://doi.org/10.1145/2729981",
      "doi": "10.1145/2729981"
    },
    {
      "text": "Innovations in Dementia. Dementia Engagement and Empowerment Project (DEEP). DEEP. Retrieved September 9, 2021 from https://www.dementiavoices.org.uk/",
      "doi": ""
    },
    {
      "text": "iSpeech. 2018. iSpeech Web Reader: Make Your Website Talk| Site Text to Speech. Retrieved January 10, 2022 from https://www.ispeech.org/webapps/webreader",
      "doi": ""
    },
    {
      "text": "Gavindya Jayawardena, Anne Michalek, Andrew Duchowski, and Sampath Jayarathna. 2020. Pilot Study of Audiovisual Speech-In-Noise (SIN) Performance of Young Adults with ADHD. In ACM Symposium on Eye Tracking Research and Applications (ETRA ’20 Short Papers), 1–5. https://doi.org/10.1145/3379156.3391373",
      "doi": ""
    },
    {
      "text": "Jazette Johnson, Rebecca W. Black, Yunan Chen, and Gillian R. Hayes. 2019. Older Adults with Dementia in an Online Forum: A Preliminary Analysis. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing (CSCW ’19), 231–235. https://doi.org/10.1145/3311957.3359477",
      "doi": ""
    },
    {
      "text": "Jazette Johnson, Rebecca W. Black, and Gillian R. Hayes. 2020. Roles in the Discussion: An Analysis of Social Support in an Online Forum for People with Dementia. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2: 1–30. https://doi.org/10.1145/3415198",
      "doi": ""
    },
    {
      "text": "Bridget Jones, Heather Gage, Christian Bakker, Helena Barrios, Sarah Boucault, Johannes Mayer, Anna Metcalfe, Joany Millenaar, Wendy Parker, and Anneli Orrung Wallin. 2018. Availability of information on young onset dementia for patients and carers in six European countries. Patient Education and Counseling 101, 1: 159–165. https://doi.org/10.1016/j.pec.2017.07.013",
      "doi": ""
    },
    {
      "text": "Holtzblatt Karen and Jones Sandra. 1993. Contextual Inquiry: A Participatory Technique for System Design. In Participatory Design. CRC Press.",
      "doi": ""
    },
    {
      "text": "Nana Kesewaa Dankwa. 2021. “All Names are Pseudonyms”: A Critical Reflection on Pseudonymizing Names in HCI: “All Names are Pseudonyms.” In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems, 1–6. Retrieved January 10, 2022 from https://doi.org/10.1145/3411763.3450376",
      "doi": "10.1145/3411763.3450376"
    },
    {
      "text": "Al Majed Khan, Dr Mark D. Dunlop, Dr Marilyn Lennon, and Dr Mateusz Dubiel. 2021. Towards Designing Mobile Apps for Independent Travel: Exploring Current Barriers and Opportunities for Supporting Young Adults with Down's Syndrome. ACM Transactions on Accessible Computing 14, 3: 13:1-13:40. https://doi.org/10.1145/3460943",
      "doi": "10.1145/3460943"
    },
    {
      "text": "Nikki Hei Tong Lam and Benjamin K. P. Woo. 2020. YouTube as a New Medium for Dementia Education Among Chinese Americans. Community Mental Health Journal 56, 3: 435–439. https://doi.org/10.1007/s10597-019-00493-7",
      "doi": ""
    },
    {
      "text": "Amanda Lazar and Emma E. Dixon. 2019. Safe Enough to Share: Setting the Dementia Agenda Online. Proceedings of the ACM on Human-Computer Interaction 3, CSCW: 1–23. https://doi.org/10.1145/3359187",
      "doi": ""
    },
    {
      "text": "Kelly Mack, Emma McDonnell, Dhruv Jain, Lucy Lu Wang, Jon E. Froehlich, and Leah Findlater. 2021. What Do We Mean by “Accessibility Research”? A Literature Survey of Accessibility Papers in CHI and ASSETS from 1994 to 2019. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–18. Retrieved November 28, 2021 from https://doi.org/10.1145/3411764.3445412",
      "doi": "10.1145/3411764.3445412"
    },
    {
      "text": "Aarti Malhotra, Lifei Yu, Tobias Schroder, and Jesse Hoey. 2015. An exploratory study into the use of an emotionally aware cognitive assistant. Association for the Advancement of Artificial Intelligence: 6.",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Allison Battisti, Galina Madjaroff, and Helena Mentis. 2020. Realizing Choice: Online Safeguards for Couples Adapting to Cognitive Challenges. In Proceedings of the Sixteenth Symposium on Usable Privacy and Security, 13. https://doi.org/978-1-939133-16-8",
      "doi": ""
    },
    {
      "text": "Nora Mcdonald and Helena M. Mentis. 2021. “Citizens Too”: Safety Setting Collaboration Among Older Adults with Memory Concerns. ACM Transactions on Computer-Human Interaction 28, 5: 1–32. https://doi.org/10.1145/3465217",
      "doi": "10.1145/3465217"
    },
    {
      "text": "Helena M. Mentis, Galina Madjaroff, and Aaron K. Massey. 2019. Upside and Downside Risk in Online Security for Older Adults with Mild Cognitive Impairment. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, 1–13. https://doi.org/10.1145/3290605.3300573",
      "doi": "10.1145/3290605.3300573"
    },
    {
      "text": "Helena M. Mentis, Galina Madjaroff, Aaron Massey, and Zoya Trendafilova. 2020. The Illusion of Choice in Discussing Cybersecurity Safeguards Between Older Adults with Mild Cognitive Impairment and Their Caregivers. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2: 1–19. https://doi.org/10.1145/3415235",
      "doi": "10.1145/3415235"
    },
    {
      "text": "Anne M. P. Michalek, Silvana M. Watson, Ivan Ash, Stacie Ringleb, and Anastasia Raymer. 2014. Effects of noise and audiovisual cues on speech processing in adults with and without ADHD. International Journal of Audiology 53, 3: 145–152. https://doi.org/10.3109/14992027.2013.866282",
      "doi": ""
    },
    {
      "text": "Lourdes Moreno, Rodrigo Alarcon, and Paloma Martínez. 2021. Designing and Evaluating a User Interface for People with Cognitive Disabilities. In Proceedings of the XXI International Conference on Human Computer Interaction (Interacción ’21), 1–8. https://doi.org/10.1145/3471391.3471400",
      "doi": "10.1145/3471391.3471400"
    },
    {
      "text": "National Centers for Chronic Disease Prevention and Health Promotion. 2020. Health Equity | CDC. Retrieved August 25, 2021 from https://www.cdc.gov/chronicdisease/healthequity/index.htm",
      "doi": ""
    },
    {
      "text": "National Council of Dementia Minds. 2021. Dementia Minds - Insights of Persons Living Well with Neurocognitive Disorders. Retrieved March 8, 2022 from https://dementiaminds.org/dementia-minds/",
      "doi": ""
    },
    {
      "text": "National Institute of Health. 2017. Home Safety and Alzheimer's Disease. National Institute on Aging. Retrieved April 4, 2020 from https://www.nia.nih.gov/health/home-safety-and-alzheimers-disease",
      "doi": ""
    },
    {
      "text": "NeuroQ. NeuroQ | Brain Health Supplements | Improved Cognitive Health. NeuroQ. Retrieved September 3, 2021 from https://neuroq.com/",
      "doi": ""
    },
    {
      "text": "James Nicholson, Ben Morrison, Matt Dixon, Jack Holt, Lynne Coventry, and Jill McGlasson. 2021. Training and Embedding Cybersecurity Guardians in Older Communities. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–15. Retrieved June 30, 2021 from https://doi.org/10.1145/3411764.3445078",
      "doi": "10.1145/3411764.3445078"
    },
    {
      "text": "Christina Nicolaidis (ed.). 2022. Manuscript Submission Guidelines and Policies for Autism in Adulthood.",
      "doi": ""
    },
    {
      "text": "Hyunjin Noh and Jung Kwak. 2018. End-of-life decision making for persons with dementia: Proxies’ perception of support. Dementia 17, 4: 478–493. https://doi.org/10.1177/1471301216648473",
      "doi": ""
    },
    {
      "text": "Redhwan Nour. 2015. Web searching by individuals with cognitive disabilities. ACM SIGACCESS Accessibility and Computing, 111: 19–25. https://doi.org/10.1145/2809904.2809909",
      "doi": "10.1145/2809904.2809909"
    },
    {
      "text": "Norbert Nthala and Ivan Flechais. 2018. Informal Support Networks: an investigation into Home Data Security Practices. 63–82. Retrieved June 30, 2021 from https://www.usenix.org/conference/soups2018/presentation/nthala",
      "doi": ""
    },
    {
      "text": "Anna Offenwanger, Alan John Milligan, Minsuk Chang, Julia Bullard, and Dongwook Yoon. 2021. Diagnosing Bias in the Gender Representation of HCI Research Participants: How it Happens and Where We Are. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–18. Retrieved December 23, 2021 from https://doi.org/10.1145/3411764.3445383",
      "doi": "10.1145/3411764.3445383"
    },
    {
      "text": "Nikolay Pavlov. 2014. User Interface for People with Autism Spectrum Disorders. Journal of Software Engineering and Applications 2014. https://doi.org/10.4236/jsea.2014.72014",
      "doi": ""
    },
    {
      "text": "James W. Pennebaker,. The LIWC API. Receptiviti. Retrieved June 25, 2021 from https://www.receptiviti.com/liwc",
      "doi": ""
    },
    {
      "text": "Rosalind W. Picard. 2000. Affective Computing. MIT Press.",
      "doi": "10.5555/265013"
    },
    {
      "text": "Anne Marie Piper, Raymundo Cornejo, Lisa Hurwitz, and Caitlin Unumb. 2016. Technological Caregiving: Supporting Online Activity for Adults with Cognitive Impairments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16, 5311–5323. https://doi.org/10.1145/2858036.2858260",
      "doi": "10.1145/2858036.2858260"
    },
    {
      "text": "Lev Poretski, Taamannae Taabassum, and Anthony Tang. 2021. Immigrant Families’ Health-Related Information Behavior on Instant Messaging Platforms: Health-related Information Exchange in Immigrant Family Groups on Instant Messaging Platforms. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems, 1–6. Retrieved December 18, 2021 from https://doi.org/10.1145/3411763.3451751",
      "doi": ""
    },
    {
      "text": "Postlight. 2022. Mercury. Mercury by Postlight. Retrieved January 10, 2022 from https://mercury.postlight.com/",
      "doi": ""
    },
    {
      "text": "Shibley Rahman and Kate Swaffer. 2018. Assets-based approaches and dementia-friendly communities. Dementia 17, 2: 131–137. https://doi.org/10.1177/1471301217751533",
      "doi": ""
    },
    {
      "text": "Dora M. Raymaker, Steven K. Kapp, Katherine E. McDonald, Michael Weiner, Elesia Ashkenazy, and Christina Nicolaidis. 2019. Development of the AASPIRE Web Accessibility Guidelines for Autistic Web Users. Autism in Adulthood 1, 2: 146–157. https://doi.org/10.1089/aut.2018.0020",
      "doi": ""
    },
    {
      "text": "Luz Rello and Ricardo Baeza-Yates. 2013. Good fonts for dyslexia. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’13), 1–8. https://doi.org/10.1145/2513383.2513447",
      "doi": "10.1145/2513383.2513447"
    },
    {
      "text": "Tania Rocha, Diana Carvalho, Maximino Bessa, Sofia Reis, and Luı´s Magalha˜es. 2017. Usability evaluation of navigation tasks by people with intellectual disabilities: a Google and SAPO comparative study regarding different interaction modalities. Universal Access in the Information Society 16, 3: 581-592. https://doi.org/10.1007/s10209-016-0489-5",
      "doi": "10.1007/s10209-016-0489-5"
    },
    {
      "text": "Jason Rodriquez. 2013. Narrating Dementia: Self and Community in an Online Forum. Qualitative Health Research 23, 9: 1215–1227. https://doi.org/10.1177/1049732313501725",
      "doi": ""
    },
    {
      "text": "Hanna Schäfer, Santiago Hors-Fraile, Raghav Pavan Karumur, André Calero Valdez, Alan Said, Helma Torkamaan, Tom Ulmer, and Christoph Trattner. 2017. Towards Health (Aware) Recommender Systems. In Proceedings of the 2017 International Conference on Digital Health (DH ’17), 157–161. https://doi.org/10.1145/3079452.3079499",
      "doi": "10.1145/3079452.3079499"
    },
    {
      "text": "Ari Schlesinger, W. Keith Edwards, and Rebecca E. Grinter. 2017. Intersectional HCI: Engaging Identity through Gender, Race, and Class. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), 5412–5427. https://doi.org/10.1145/3025453.3025766",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Sara Shu and Benjamin K. P. Woo. 2020. Digital Media as a Proponent for Healthy Aging in the Older Chinese American Population: Longitudinal Analysis. JMIR Aging 3, 1: e20321. https://doi.org/10.2196/20321",
      "doi": ""
    },
    {
      "text": "Sara Shu and Benjamin K. P. Woo. 2020. The Roles of YouTube and WhatsApp in Dementia Education for the Older Chinese American Population: Longitudinal Analysis. JMIR Aging 3, 1: e18179. https://doi.org/10.2196/18179",
      "doi": ""
    },
    {
      "text": "Fabiola Silvaggi, Matilde Leonardi, Pietro Tiraboschi, Cristina Muscio, Claudia Toppo, and Alberto Raggi. 2020. Keeping People with Dementia or Mild Cognitive Impairment in Employment: A Literature Review on Its Determinants. International Journal of Environmental Research and Public Health 17, 3: 842. https://doi.org/10.3390/ijerph17030842",
      "doi": ""
    },
    {
      "text": "Laurianne Sitbon, Andrew Bayor, Filip Bircanin, Stewart Koplick, and Margot Brereton. 2018. An Exploration of How People with Intellectual Disability Engage with Online Information Retrieval. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA ’18), 1–6. https://doi.org/10.1145/3170427.3188599",
      "doi": "10.1145/3170427.3188599"
    },
    {
      "text": "Laurianne Sitbon and Margot Brereton. 2020. Co-design to Include Users with Intellectual Disability in Information Interaction Research. In Proceedings of the 2020 Conference on Human Information Interaction and Retrieval (CHIIR ’20), 481–483. https://doi.org/10.1145/3343413.3378019",
      "doi": "10.1145/3343413.3378019"
    },
    {
      "text": "Karin Slegers, Andrea Wilkinson, and Niels Hendriks. 2013. Active collaboration in healthcare design: participatory design to develop a dementia care app. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’13), 475–480. https://doi.org/10.1145/2468356.2468440",
      "doi": ""
    },
    {
      "text": "Aijia Soong, Shu Ting Au, Bhone Myint Kyaw, Yin Leng Theng, and Lorainne Tudor Car. 2020. Information needs and information seeking behaviour of people with dementia and their non-professional caregivers: a scoping review. BMC Geriatrics 20, 1: 1–17. https://doi.org/10.1186/s12877-020-1454-y",
      "doi": ""
    },
    {
      "text": "Kevin M Storer, Harini Sampath, and M. Alice Alice Merrick. 2021. “It's Just Everything Outside of the IDE that's the Problem”: Information Seeking by Software Developers with Visual Impairments. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–12. Retrieved December 18, 2021 from https://doi.org/10.1145/3411764.3445090",
      "doi": "10.1145/3411764.3445090"
    },
    {
      "text": "Manuka Stratta, Julia Park, and Cooper deNicola. 2020. Automated Content Warnings for Sensitive Posts. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (CHI EA ’20), 1–8. https://doi.org/10.1145/3334480.3383029",
      "doi": ""
    },
    {
      "text": "Kate Swaffer. 2015. Dementia and Prescribed DisengagementTM. Dementia 14, 1: 3–6. https://doi.org/10.1177/1471301214548136",
      "doi": ""
    },
    {
      "text": "Catherine V. Talbot, Siobhan T. O'Dwyer, Linda Clare, Janet Heaton, and Joel Anderson. 2020. How people with dementia use twitter: A qualitative analysis. Computers in Human Behavior 102: 112–119. https://doi.org/10.1016/j.chb.2019.08.005",
      "doi": "10.1016/j.chb.2019.08.005"
    },
    {
      "text": "Weizhou Tang, Kate Olscamp, Seul Ki Choi, and Daniela B. Friedman. 2017. Alzheimer's Disease in Social Media: Content Analysis of YouTube Videos. Interactive Journal of Medical Research 6, 2: e19. https://doi.org/10.2196/ijmr.8612",
      "doi": ""
    },
    {
      "text": "The Health Research Authority. 2005. Mental Capacity Act. Retrieved June 29, 2021 from https://www.hra.nhs.uk/planning-and-improving-research/policies-standards-legislation/mental-capacity-act/",
      "doi": ""
    },
    {
      "text": "Bronwen Thomas. 2017. Whose Story is it Anyway? Following Everyday Accounts of Living with Dementia on Social Media. Style 51, 3: 357–373.",
      "doi": ""
    },
    {
      "text": "Virpi Timonen, Geraldine Foley, and Catherine Conlon. 2018. Challenges When Using Grounded Theory: A Pragmatic Introduction to Doing GT Research. International Journal of Qualitative Methods 17, 1: 1609406918758086. https://doi.org/10.1177/1609406918758086",
      "doi": ""
    },
    {
      "text": "Jeanne Tyrrell, Nathalie Genin, and Michele Myslinski. 2006. Freedom of choice and decision-making in health and social care: Views of older patients with early-stage dementia and their carers. Dementia 5, 4: 479–502. https://doi.org/10.1177/1471301206069915",
      "doi": ""
    },
    {
      "text": "UC Davis Alzheimer's Disease Center. 2002. Policy and Procedures for Assessing Capacity To Consent for Research. Retrieved from https://health.ucdavis.edu/clinicaltrials/StudyTools/Documents/ResearchCapacityPolicy7=02.pdf",
      "doi": ""
    },
    {
      "text": "United Nations. Convention on the Rights of Persons with Disabilities (CRPD). Retrieved October 1, 2020 from https://www.un.org/development/desa/disabilities/convention-on-the-rights-of-persons-with-disabilities.html",
      "doi": ""
    },
    {
      "text": "Rishabh Upadhyay, Gabriella Pasi, and Marco Viviani. 2021. Health Misinformation Detection in Web Content: A Structural-, Content-based, and Context-aware Approach based on Web2Vec. In Proceedings of the Conference on Information Technology for Social Good (GoodIT ’21), 19–24. https://doi.org/10.1145/3462203.3475898",
      "doi": "10.1145/3462203.3475898"
    },
    {
      "text": "US Government: General Services Administration. 2011. Federal Plain Language Guidelines. 118.",
      "doi": ""
    },
    {
      "text": "Krishna Venkatasubramanian, Jeanine L. M. Skorinko, Mariam Kobeissi, Brittany Lewis, Nicole Jutras, Pauline Bosma, John Mullaly, Brian Kelly, Deborah Lloyd, Mariah Freark, and Nancy A. Alterio. 2021. Exploring A Reporting Tool to Empower Individuals with Intellectual and Developmental Disabilities to Self-Report Abuse. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–13. Retrieved November 28, 2021 from https://doi.org/10.1145/3411764.3445150",
      "doi": "10.1145/3411764.3445150"
    },
    {
      "text": "Ruolin Wang, Zixuan Chen, Mingrui Ray Zhang, Zhaoheng Li, Zhixiu Liu, Zihan Dang, Chun Yu, and Xiang “Anthony” Chen. 2021. Revamp: Enhancing Accessible Information Seeking Experience of Online Shopping for Blind or Low Vision Users. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), 1–14. https://doi.org/10.1145/3411764.3445547",
      "doi": ""
    },
    {
      "text": "Daniel Wessel, Ann-Kathrin Kennecke, and Moreen Heine. 2021. WCAG and Dyslexia; Improving the Search Function of Websites for Users With Dyslexia (Without Making It Worse for Everyone Else). In Mensch und Computer 2021 (MuC ’21), 168–179. https://doi.org/10.1145/3473856.3473867",
      "doi": ""
    },
    {
      "text": "Carol Whitlatch. 2017. Meeting the Informational, Educational, and Psychosocial Support Needs of Persons Living With Dementia and Their Family Caregivers. The Gerontologist. https://doi.org/10.1093/geront/gnx162",
      "doi": ""
    },
    {
      "text": "Benjamin K. P. Woo. 2018. An evaluation of YouTube in disseminating dementia knowledge to older Chinese in Britain. International Psychogeriatrics 30, 10: 1575. https://doi.org/10.1017/S1041610218000224",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2019. Dementia. World Health Organization. Retrieved April 2, 2020 from https://www.who.int/news-room/fact-sheets/detail/dementia",
      "doi": ""
    },
    {
      "text": "Keke Wu, Emma Petersen, Tahmina Ahmad, David Burlinson, Shea Tanis, and Danielle Albers Szafir. 2021. Understanding Data Accessibility for People with Intellectual and Developmental Disabilities. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–16. Retrieved December 18, 2021 from https://doi.org/10.1145/3411764.3445743",
      "doi": "10.1145/3411764.3445743"
    },
    {
      "text": "Hannah Zeilig. 2014. Dementia As a Cultural Metaphor. The Gerontologist 54, 2: 258–267. https://doi.org/10.1093/geront/gns203",
      "doi": ""
    },
    {
      "text": "Yan Zhang and Shijie Song. 2020. Older Adults’ Evaluation of the Credibility of Online Health Information. In Proceedings of the 2020 Conference on Human Information Interaction and Retrieval (CHIIR ’20), 358–362. https://doi.org/10.1145/3343413.3377997",
      "doi": "10.1145/3343413.3377997"
    },
    {
      "text": "Xin Zheng, Jamie O. P. Chung, and Benjamin K. P. Woo. 2016. Exploring the Impact of a Culturally Tailored Short Film in Modifying Dementia Stigma Among Chinese Americans: A Pilot Study. Academic Psychiatry: The Journal of the American Association of Directors of Psychiatric Residency Training and the Association for Academic Psychiatry 40, 2: 372–374. https://doi.org/10.1007/s40596-015-0397-7",
      "doi": ""
    },
    {
      "text": "Xin Zheng and Benjamin K. P. Woo. 2017. E-mental health in ethnic minority: A comparison of youtube and talk-based educational workshops in dementia. Asian Journal of Psychiatry 25: 246–248. https://doi.org/10.1016/j.ajp.2016.12.002",
      "doi": ""
    }
  ]
}