{
  "doi": "10.1145/3491102.3502009",
  "title": "To Self-Persuade or be Persuaded: Examining Interventions for Users’ Privacy Setting Selection",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "User adoption of security and privacy (S&P) best practices remains low, despite sustained efforts by researchers and practitioners. Social influence is a proven method for guiding user S&P behavior, though most work has focused on studying peer influence, which is only possible with a known social graph. In a study of 104 Facebook users, we instead demonstrate that crowdsourced S&P suggestions are significantly influential. We also tested how reflective writing affected participants’ S&P decisions, with and without suggestions. With reflective writing, participants were less likely to accept suggestions — both social and Facebook default suggestions. Of particular note, when reflective writing participants were shown the Facebook default suggestion, they not only rejected it but also (unknowingly) configured their settings in accordance with expert recommendations. Our work suggests that both non-personal social influence and reflective writing can positively influence users’ S&P decisions, but have negative interactions.",
  "tags": [
    "Qualitative Methods",
    "Social Proof",
    "Social Influence",
    "Individual Differences",
    "Authority",
    "Quantitative Methods",
    "Decision Making",
    "Surveys",
    "Privacy Behaviors",
    "Privacy",
    "Social Cybersecurity",
    "Reflective Writing"
  ],
  "authors": [
    {
      "name": "Isadora Krsek",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240408",
      "orcid": "missing"
    },
    {
      "name": "Kimi Wenzel",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238735",
      "orcid": "0000-0003-3651-7063"
    },
    {
      "name": "Sauvik Das",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500644254",
      "orcid": "missing"
    },
    {
      "name": "Jason I. Hong",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81408598366/rel-imgonly/81408598366.png",
      "acmid": "81408598366",
      "orcid": "0000-0002-9856-9654"
    },
    {
      "name": "Laura Dabbish",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100650586",
      "orcid": "0000-0001-9489-4188"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisti, Idris Adjerid, Rebecca Balebako, Laura Brandimarte, Lorrie Faith Cranor, Saranga Komanduri, Pedro Giovanni Leon, Norman Sadeh, Florian Schaub, Manya Sleeper, 2017. Nudges for privacy and security: Understanding and assisting users’ choices online. ACM Computing Surveys (CSUR) 50, 3 (2017), 1–41.",
      "doi": "10.1145/3054926"
    },
    {
      "text": "Alessandro Acquisti, Laura Brandimarte, and George Loewenstein. 2015. Privacy and human behavior in the age of information. Science 347, 6221 (2015), 509–514.",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti and Jens Grossklags. 2005. Privacy and rationality in individual decision making. IEEE security & privacy 3, 1 (2005), 26–33.",
      "doi": "10.1109/MSP.2005.22"
    },
    {
      "text": "Elliot Aronson. 1999. The power of self-persuasion.American Psychologist 54, 11 (1999), 875.",
      "doi": ""
    },
    {
      "text": "Sonal Arora, Rajesh Aggarwal, Pramudith Sirimanna, Aidan Moran, Teodor Grantcharov, Roger Kneebone, Nick Sevdalis, and Ara Darzi. 2011. Mental practice enhances surgical technical skills: a randomized controlled study. Annals of surgery 253, 2 (2011), 265–270.",
      "doi": ""
    },
    {
      "text": "Austin S Baldwin, Alexander J Rothman, Mark W Vander Weg, and Alan J Christensen. 2013. Examining causal components and a mediating process underlying self-generated health arguments for exercise and smoking cessation.Health Psychology 32, 12 (2013), 1209.",
      "doi": ""
    },
    {
      "text": "Heenkenda Mudiyanselage Ruwan Jayawickrama Bandara, Mario Fernando, and Md Shahriar Akter. 2018. Is the privacy paradox a matter of psychological distance? An exploratory study of the privacy paradox from a construal level theory perspective. (2018).",
      "doi": ""
    },
    {
      "text": "Brian Barrett. 2016. You Should Go Check Facebook’s New Privacy Settings. Wired (2016). https://www.wired.com/2016/06/go-check-facebooks-new-privacy-settings/",
      "doi": ""
    },
    {
      "text": "Douglas Bates, Martin Mächler, Ben Bolker, and Steve Walker. 2015. Fitting Linear Mixed-Effects Models Using lme4. Journal of Statistical Software 67, 1 (2015), 1–48. https://doi.org/10.18637/jss.v067.i01",
      "doi": ""
    },
    {
      "text": "Adam Beautement, M Angela Sasse, and Mike Wonham. 2008. The compliance budget: managing security behaviour in organisations. In Proceedings of the 2008 New Security Paradigms Workshop. 47–58.",
      "doi": "10.1145/1595676.1595684"
    },
    {
      "text": "Stefan F Bernritter, Iris van Ooijen, and Barbara CN Müller. 2017. Self-persuasion as marketing technique: the role of consumers’ involvement. European Journal of Marketing(2017).",
      "doi": ""
    },
    {
      "text": "Michael S. Bernstein, Eytan Bakshy, Moira Burke, and Brian Karrer. 2013. Quantifying the Invisible Audience in Social Networks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 21–30. https://doi.org/10.1145/2470654.2470658",
      "doi": "10.1145/2470654.2470658"
    },
    {
      "text": "Nick Bilton. 2010. Price of Facebook Privacy? Start Clicking. New York Times CLIX, 55039 (2010), B8 N. https://www.nytimes.com/2010/05/13/technology/personaltech/13basics.html?referer=",
      "doi": ""
    },
    {
      "text": "Robert Bond, Christopher Fariss, Jason Jones, Adam Kramer, Cameron Marlow, Jaime Settle, and James Fowler. 2012. A 61-Million-Person Experiment in Social Influence and Political Mobilization. Nature 489 (09 2012), 295–8. https://doi.org/10.1038/nature11421",
      "doi": ""
    },
    {
      "text": "Bryan L Bonner, Michael R Baumann, and Reeshad S Dalal. 2002. The effects of member expertise on group decision-making and performance. Organizational Behavior and Human Decision Processes 88, 2 (2002), 719–736.",
      "doi": ""
    },
    {
      "text": "Marilynn B Brewer and Ya-Ru Chen. 2007. Where (who) are collectives in collectivism? Toward conceptual clarification of individualism and collectivism.Psychological review 114, 1 (2007), 133.",
      "doi": ""
    },
    {
      "text": "Laura F Bright, Kristen Leah Sussman, and Gary B Wilcox. 2021. Facebook, trust and privacy in an election year: Balancing politics and advertising. Journal of Digital & Social Media Marketing 8, 4 (2021), 332–346.",
      "doi": ""
    },
    {
      "text": "Laura F Bright, Gary B Wilcox, and Hayley Rodriguez. 2019. # DeleteFacebook and the consumer backlash of 2018: How social media fatigue, consumer (mis) trust and privacy concerns shape the new social media reality for consumers. Journal of Digital & Social Media Marketing 7, 2 (2019), 177–188.",
      "doi": ""
    },
    {
      "text": "Moira Burke, Cameron Marlow, and Marilyn Lento. 2009. Feed Me: Motivating Newcomer Contribution in Social Network Sites. CHI 2009. https://doi.org/10.1145/1518701.1518847",
      "doi": "10.1145/1518701.1518847"
    },
    {
      "text": "Karoline Busse, Julia Schäfer, and Matthew Smith. 2019. Replication: No one can hack my mind revisiting a study on expert and non-expert security practices and advice. In Fifteenth Symposium on Usable Privacy and Security ({SOUPS} 2019). 117–136.",
      "doi": ""
    },
    {
      "text": "Nichola Callow, Ross Roberts, Lew Hardy, Dan Jiang, and Martin G Edwards. 2013. Performance improvements from imagery: evidence that internal visual imagery is superior to external visual imagery for slalom performance. Frontiers in human neuroscience 7 (2013), 697.",
      "doi": ""
    },
    {
      "text": "Raquel Castaño, Mita Sujan, Manish Kacker, and Harish Sujan. 2008. Managing consumer uncertainty in the adoption of new products: Temporal distance and mental simulation. Journal of Marketing Research 45, 3 (2008), 320–336.",
      "doi": ""
    },
    {
      "text": "Baiyun Chen and Justin Marcus. 2012. Students’ self-presentation on Facebook: An examination of personality and self-construal factors. Computers in Human Behavior 28, 6 (2012), 2091–2099.",
      "doi": "10.1016/j.chb.2012.06.013"
    },
    {
      "text": "Chee W Chow, Graeme L Harrison, Jill L McKinnon, and Anne Wu. 1999. Cultural influences on informal information sharing in Chinese and Anglo-American organizations: an exploratory study. Accounting, Organizations and Society 24, 7 (1999), 561–582.",
      "doi": ""
    },
    {
      "text": "Robert B Cialdini and Noah J Goldstein. 2004. Social influence: Compliance and conformity. Annu. Rev. Psychol. 55(2004), 591–621.",
      "doi": ""
    },
    {
      "text": "Robert B Cialdini and Lloyd James. 2009. Influence: Science and practice. Vol. 4. Pearson education Boston, MA.",
      "doi": ""
    },
    {
      "text": "Robert B Cialdini, Wilhelmina Wosinska, Daniel W Barrett, Jonathan Butner, and Malgorzata Gornik-Durose. 1999. Compliance with a request in two cultures: The differential influence of social proof and commitment/consistency on collectivists and individualists. Personality and Social Psychology Bulletin 25, 10 (1999), 1242–1253.",
      "doi": ""
    },
    {
      "text": "Scott N Cole, Debbie M Smith, Kathryn Ragan, Robert Suurmond, and Christopher J Armitage. 2021. Synthesizing the effects of mental simulation on behavior change: Systematic review and multilevel meta-analysis. Psychonomic Bulletin & Review(2021), 1–24.",
      "doi": ""
    },
    {
      "text": "Sauvik Das. 2017. Social Cybersecurity: Reshaping Security Through An Empirical Understanding of Human Social Behavior. Ph. D. Dissertation. Carnegie Mellon University.",
      "doi": ""
    },
    {
      "text": "Sauvik Das, Tiffany Hyun-Jin Kim, Laura A Dabbish, and Jason I Hong. 2014. The effect of social influence on security sensitivity. In 10th Symposium On Usable Privacy and Security ({SOUPS} 2014). 143–157.",
      "doi": ""
    },
    {
      "text": "Sauvik Das, Adam DI Kramer, Laura A Dabbish, and Jason I Hong. 2014. Increasing security sensitivity with social proof: A large-scale experimental confirmation. In Proceedings of the 2014 ACM SIGSAC conference on computer and communications security. 739–749.",
      "doi": "10.1145/2660267.2660271"
    },
    {
      "text": "Sauvik Das, Adam D.I. Kramer, Laura A. Dabbish, and Jason I. Hong. 2015. The Role of Social Influence in Security Feature Adoption. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work; Social Computing(Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 1416–1426. https://doi.org/10.1145/2675133.2675225",
      "doi": "10.1145/2675133.2675225"
    },
    {
      "text": "Morton Deutsch and Harold B Gerard. 1955. A study of normative and informational social influences upon individual judgment.The journal of abnormal and social psychology 51, 3(1955), 629.",
      "doi": ""
    },
    {
      "text": "Paul DiGioia and Paul Dourish. 2005. Social navigation as a model for usable security. In Proceedings of the 2005 symposium on Usable privacy and security. 101–108.",
      "doi": "10.1145/1073001.1073011"
    },
    {
      "text": "Nicole B Ellison, Charles Steinfield, and Cliff Lampe. 2007. The benefits of Facebook “friends:” Social capital and college students’ use of online social network sites. Journal of computer-mediated communication 12, 4 (2007), 1143–1168.",
      "doi": ""
    },
    {
      "text": "Pardis Emami Naeini, Martin Degeling, Lujo Bauer, Richard Chow, Lorrie Faith Cranor, Mohammad Reza Haghighat, and Heather Patterson. 2018. The influence of friends and experts on privacy decision making in IoT scenarios. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–26.",
      "doi": "10.1145/3274317"
    },
    {
      "text": "Sindhu Kiranmai Ernala, Moira Burke, Alex Leavitt, and Nicole B Ellison. 2020. How well do people report time spent on Facebook? An evaluation of established survey questions with recommendations. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376435"
    },
    {
      "text": "Jennifer Edson Escalas. 2004. Imagine yourself in the product: Mental simulation, narrative transportation, and persuasion. Journal of advertising 33, 2 (2004), 37–48.",
      "doi": ""
    },
    {
      "text": "Cori Faklaris, Laura A. Dabbish, and Jason I. Hong. 2019. A Self-Report Measure of End-User Security Attitudes (SA-6). In Fifteenth Symposium on Usable Privacy and Security (SOUPS 2019). USENIX Association, Santa Clara, CA. https://www.usenix.org/conference/soups2019/presentation/faklaris",
      "doi": ""
    },
    {
      "text": "Shane Frederick. 2005. Cognitive reflection and decision making. Journal of Economic perspectives 19, 4 (2005), 25–42.",
      "doi": ""
    },
    {
      "text": "Simson Garfinkel and Heather Richter Lipford. 2014. Usable security: History, themes, and challenges. Synthesis Lectures on Information Security, Privacy, and Trust 5, 2(2014), 1–124.",
      "doi": "10.5555/2755205"
    },
    {
      "text": "Hana Habib and Lorrie Cranor. 2019. Website privacy options aren’t much of a choice since they’re hard to find and use. https://theconversation.com/website-privacy-options-arent-much-of-a-choice-since-theyre-hard-to-find-and-use-124631. Accessed: 2020-09-30.",
      "doi": ""
    },
    {
      "text": "Cory Hallam and Gianluca Zanella. 2017. Online self-disclosure: The privacy paradox explained as a temporally discounted balance between concerns and rewards. Computers in Human Behavior 68 (2017), 217–227.",
      "doi": "10.1016/j.chb.2016.11.033"
    },
    {
      "text": "Geert Hofstede and Gerard Hendrik Hofstede. 1984. Culture’s consequences: International differences in work-related values. Vol. 5. sage.",
      "doi": ""
    },
    {
      "text": "Mariea Grubbs Hoy and George Milne. 2010. Gender differences in privacy-related measures for young adult Facebook users. Journal of interactive advertising 10, 2 (2010), 28–45.",
      "doi": ""
    },
    {
      "text": "Philip G Inglesant and M Angela Sasse. 2010. The true cost of unusable password policies: password use in the wild. In Proceedings of the sigchi conference on human factors in computing systems. 383–392.",
      "doi": "10.1145/1753326.1753384"
    },
    {
      "text": "Ruogu Kang. 2015. Incognito Online: Why and How People Hide Their Information. unpublished doctoral dissertation, Carnegie Mellon University (2015).",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Stephanie Brown, Laura Dabbish, and Sara Kiesler. 2014. Privacy attitudes of mechanical turk workers and the us public. In 10th Symposium On Usable Privacy and Security ({SOUPS} 2014). 37–49.",
      "doi": "10.5555/3235838.3235842"
    },
    {
      "text": "Johannes Klumpe, Oliver Francis Koch, and Alexander Benlian. 2020. How pull vs. push information delivery and social proof affect information disclosure in location based services. Electronic Markets 30, 3 (2020), 569–586.",
      "doi": ""
    },
    {
      "text": "Adam D.I. Kramer. 2012. The Spread of Emotion via Facebook. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 767–770. https://doi.org/10.1145/2207676.2207787",
      "doi": "10.1145/2207676.2207787"
    },
    {
      "text": "James M Leonhardt, Todd Pezzuti, and Jae-Eun Namkoong. 2020. We’re not so different: Collectivism increases perceived homophily, trust, and seeking user-generated product information. Journal of Business Research 112 (2020), 160–169.",
      "doi": ""
    },
    {
      "text": "Eden Litt. 2013. Understanding social network site users’ privacy tool use. Computers in Human Behavior 29, 4 (2013), 1649–1656.",
      "doi": "10.1016/j.chb.2013.01.049"
    },
    {
      "text": "Yabing Liu, Krishna P. Gummadi, Balachander Krishnamurthy, and Alan Mislove. 2011. Analyzing Facebook Privacy Settings: User Expectations vs. Reality. In Proceedings of the 2011 ACM SIGCOMM Conference on Internet Measurement Conference (Berlin, Germany) (IMC ’11). Association for Computing Machinery, New York, NY, USA, 61–70. https://doi.org/10.1145/2068816.2068823",
      "doi": "10.1145/2068816.2068823"
    },
    {
      "text": "Jeroen GB Loman, Barbara CN Müller, Arnoud Oude Groote Beverborg, Rick B van Baaren, and Moniek Buijzen. 2018. Self-persuasion on facebook increases alcohol risk perception. Cyberpsychology, Behavior, and Social Networking 21, 11(2018), 672–678.",
      "doi": ""
    },
    {
      "text": "Baozhou Lu, Weiguo Fan, and Mi Zhou. 2016. Social presence, trust, and social commerce purchase intention: An empirical research. Computers in Human Behavior 56 (2016), 225–237.",
      "doi": "10.1016/j.chb.2015.11.057"
    },
    {
      "text": "Michelle Madejski, Maritza Johnson, and Steven M Bellovin. 2012. A study of privacy settings errors in an online social network. In 2012 IEEE International Conference on Pervasive Computing and Communications Workshops. IEEE, 340–345.",
      "doi": ""
    },
    {
      "text": "Albert E Mannes, Jack B Soll, and Richard P Larrick. 2014. The wisdom of select crowds.Journal of personality and social psychology 107, 2(2014), 276.",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and inter-rater reliability in qualitative research: Norms and guidelines for CSCW and HCI practice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Tamir Mendel and Eran Toch. 2017. Susceptibility to social influence of privacy behaviors: Peer versus authoritative sources. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 581–593.",
      "doi": "10.1145/2998181.2998323"
    },
    {
      "text": "Marina Micheli, Elissa M Redmiles, and Eszter Hargittai. 2020. Help wanted: Young adults’ sources of support for questions about digital media. Information, Communication & Society 23, 11 (2020), 1655–1672.",
      "doi": ""
    },
    {
      "text": "Mainack Mondal, Günce Su Yilmaz, Noah Hirsch, Mohammad Taha Khan, Michael Tang, Christopher Tran, Chris Kanich, Blase Ur, and Elena Zheleva. 2019. Moving beyond set-it-and-forget-it privacy settings on social media. In Proceedings of the 2019 ACM SIGSAC Conference on Computer and Communications Security. 991–1008.",
      "doi": "10.1145/3319535.3354202"
    },
    {
      "text": "Brendan Nyhan and Jason Reifler. 2010. When corrections fail: The persistence of political misperceptions. Political Behavior 32, 2 (2010), 303–330.",
      "doi": "10.1007/s11109-010-"
    },
    {
      "text": "Ted O’Donoghue and Matthew Rabin. 2000. The economics of immediate gratification. Journal of behavioral decisión making 13, 2 (2000), 233–250.",
      "doi": ""
    },
    {
      "text": "Hyun Jung Oh and Robert LaRose. 2015. Tell me a story about healthy snacking and I will follow: Comparing the effectiveness of self-generated versus message-aided implementation intentions on promoting healthy snacking habits among college students. Health communication 30, 10 (2015), 962–974.",
      "doi": ""
    },
    {
      "text": "Kenneth Olmstead and Aaron Smith. 2017. Americans and cybersecurity. Pew Research Center 26(2017), 311–327.",
      "doi": ""
    },
    {
      "text": "Kenneth Olmstead and Aaron Smith. 2017. What the public knows about cybersecurity. Pew Research Center 22(2017).",
      "doi": ""
    },
    {
      "text": "Ben Parr. 2011. Facebook’s Big Privacy Changes: An Overview. Mashable (2011). https://mashable.com/archive/facebook-privacy-changes-guide#TMdc0NovxZqX",
      "doi": ""
    },
    {
      "text": "Eyal Peer, Laura Brandimarte, Sonam Samat, and Alessandro Acquisti. 2017. Beyond the Turk: Alternative platforms for crowdsourcing behavioral research. Journal of Experimental Social Psychology 70 (2017), 153–163.",
      "doi": ""
    },
    {
      "text": "Andrew Perrin. 2018. Americans are changing their relationship with Facebook. Pew Research Center 5(2018).",
      "doi": ""
    },
    {
      "text": "Emilee Rader, Rick Wash, and Brandon Brooks. 2012. Stories as informal lessons about security. In Proceedings of the Eighth Symposium on Usable Privacy and Security. 1–17.",
      "doi": "10.1145/2335356.2335364"
    },
    {
      "text": "Tashfiq Rahman, Rohani Rohan, Debajyoti Pal, and Prasert Kanthamanon. 2021. Human Factors in Cybersecurity: A Scoping Review. In The 12th International Conference on Advances in Information Technology. 1–11.",
      "doi": ""
    },
    {
      "text": "Lee Rainie. 2018. Americans’ complicated feelings about social media in an era of privacy concerns. Pew Research Center (2018).",
      "doi": ""
    },
    {
      "text": "Elissa M Redmiles, Sean Kross, and Michelle L Mazurek. 2016. How i learned to be secure: a census-representative survey of security advice sources and behavior. In Proceedings of the 2016 ACM SIGSAC Conference on Computer and Communications Security. 666–677.",
      "doi": "10.1145/2976749.2978307"
    },
    {
      "text": "Elissa M Redmiles, Sean Kross, and Michelle L Mazurek. 2019. How well do my results generalize? comparing security and privacy survey results from mturk, web, and telephone samples. In 2019 IEEE Symposium on Security and Privacy (SP). IEEE, 1326–1343.",
      "doi": ""
    },
    {
      "text": "Elissa M Redmiles, Amelia R Malone, and Michelle L Mazurek. 2016. I think they’re trying to tell me something: Advice sources and selection for digital security. In 2016 IEEE Symposium on Security and Privacy (SP). IEEE, 272–288.",
      "doi": ""
    },
    {
      "text": "Reuters. 2008. Facebook Plans New Privacy Controls. New York Times CLVII, 54254 (2008), C3 N. https://www.nytimes.com/2008/03/19/technology/19facebook.html?fta=y&referer=",
      "doi": ""
    },
    {
      "text": "P Wesley Schultz, Jessica M Nolan, Robert B Cialdini, Noah J Goldstein, and Vladas Griskevicius. 2007. The constructive, destructive, and reconstructive power of social norms. Psychological science 18, 5 (2007), 429–434.",
      "doi": ""
    },
    {
      "text": "Joshana Shibchurn and Xiangbin Yan. 2015. Information disclosure on social networking sites: An intrinsic–extrinsic motivation perspective. Computers in Human Behavior 44 (2015), 103–117.",
      "doi": "10.1016/j.chb.2014.10.059"
    },
    {
      "text": "Manya Sleeper, Rebecca Balebako, Sauvik Das, Amber Lynn McConahy, Jason Wiese, and Lorrie Faith Cranor. 2013. The post that wasn’t: exploring self-censorship on facebook. In Proceedings of the 2013 conference on Computer supported cooperative work. 793–802.",
      "doi": "10.1145/2441776.2441865"
    },
    {
      "text": "Carmen Stavrositu and Jinhee Kim. 2018. Self-Persuasion Through Mobile Applications: Exploring Different Routes to Health Behavioral Change. Cyberpsychology, Behavior, and Social Networking 21, 8(2018), 516–522.",
      "doi": ""
    },
    {
      "text": "Katherine Strater and Heather Richter Lipford. 2008. Strategies and struggles with privacy in an online social networking community. People and Computers XXII Culture, Creativity, Interaction 22 (2008), 111–119.",
      "doi": ""
    },
    {
      "text": "Frederic D Stutzman, Ralph Gross, and Alessandro Acquisti. 2013. Silent listeners: The evolution of privacy and disclosure on Facebook. Journal of privacy and confidentiality 4, 2 (2013), 2.",
      "doi": ""
    },
    {
      "text": "Shelley E Taylor and Sherry K Schneider. 1989. Coping and the simulation of events. Social cognition 7, 2 (1989), 174–194.",
      "doi": ""
    },
    {
      "text": "Anja Thieme, Rob Comber, Julia Miebach, Jack Weeden, Nicole Kraemer, Shaun Lawson, and Patrick Olivier. 2012. ” We’ve bin watching you” designing for reflection and social persuasion to promote sustainable lifestyles. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2337–2346.",
      "doi": "10.1145/2207676.2208394"
    },
    {
      "text": "Melissa C Thomas-Hunt and Katherine W Phillips. 2004. When what you know is not enough: Expertise and gender dynamics in task groups. Personality and Social Psychology Bulletin 30, 12 (2004), 1585–1598.",
      "doi": ""
    },
    {
      "text": "Debora Viana Thompson, Rebecca W. Hamilton, and Petia K. Petrova. 2009. When Mental Simulation Hinders Behavior: The Effects of Process-Oriented Thinking on Decision Difficulty and Performance. Journal of Consumer Research 36, 4 (04 2009), 562–574. https://doi.org/10.1086/599325 arXiv:https://academic.oup.com/jcr/article-pdf/36/4/562/19296650/36-4-562.pdf",
      "doi": ""
    },
    {
      "text": "Yaacov Trope and Nira Liberman. 2010. Construal-level theory of psychological distance.Psychological review 117, 2 (2010), 440.",
      "doi": ""
    },
    {
      "text": "Tsai-Hsuan Tsai, Hsien-Tsung Chang, Ya-Ching Chang, and Yung-Sheng Chang. 2017. Personality disclosure on social network sites: An empirical examination of differences in Facebook usage behavior, profile contents and privacy settings. Computers in Human Behavior 76 (2017), 469–482.",
      "doi": "10.1016/j.chb.2017.08.003"
    },
    {
      "text": "Aggeliki Tsohou, Maria Karyda, and Spyros Kokolakis. 2015. Analyzing the role of cognitive and cultural biases in the internalization of information security policies: Recommendations for information security awareness programs. Computers & security 52(2015), 128–141.",
      "doi": ""
    },
    {
      "text": "Emily A. Vogel and Monica Anderson. 2019. Americans and Digital Knowledge. Pew Research Center (2019).",
      "doi": ""
    },
    {
      "text": "Stanford A Westjohn, Peter Magnusson, George R Franke, and Yi Peng. 2021. EXPRESS: Trust Propensity across Cultures: The Role of Collectivism. Journal of International Marketing(2021), 1069031X211036688.",
      "doi": ""
    },
    {
      "text": "Hu Xie, Elizabeth A Minton, and Lynn R Kahle. 2016. Cake or fruit? Influencing healthy food choice through the interaction of automatic and instructed mental simulation. Marketing Letters 27, 4 (2016), 627–644.",
      "doi": ""
    },
    {
      "text": "Rachid Zeffane. 2020. Gender, individualism–collectivism and individuals’ propensity to trust: A comparative exploratory study. Journal of Management & Organization 26, 4 (2020), 445–459.",
      "doi": ""
    },
    {
      "text": "Min Zhao, Steve Hoeffler, and Gal Zauberman. 2007. Mental simulation and preference consistency over time: The role of process-versus outcome-focused thoughts. Journal of Marketing Research 44, 3 (2007), 379–388.",
      "doi": ""
    }
  ]
}