{
  "doi": "10.1145/3491102.3517732",
  "title": "Capable but Amoral? Comparing AI and Human Expert Collaboration in Ethical Decision Making",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "While artificial intelligence (AI) is increasingly applied for decision-making processes, ethical decisions pose challenges for AI applications. Given that humans cannot always agree on the right thing to do, how would ethical decision-making by AI systems be perceived and how would responsibility be ascribed in human-AI collaboration? In this study, we investigate how the expert type (human vs. AI) and level of expert autonomy (adviser vs. decider) influence trust, perceived responsibility, and reliance. We find that participants consider humans to be more morally trustworthy but less capable than their AI equivalent. This shows in participants’ reliance on AI: AI recommendations and decisions are accepted more often than the human expert’s. However, AI team experts are perceived to be less responsible than humans, while programmers and sellers of AI systems are deemed partially responsible instead.",
  "tags": [
    "Human-AI Collaboration",
    "Ethical AI",
    "Responsibility",
    "Trust"
  ],
  "authors": [
    {
      "name": "Suzanne Tolmeijer",
      "institution": "Department of Informatics, University of Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659508931",
      "orcid": "missing"
    },
    {
      "name": "Markus Christen",
      "institution": "Digital Society Initiative, University of Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659243497",
      "orcid": "missing"
    },
    {
      "name": "Serhiy Kandul",
      "institution": "Digital Society Initiative, University of Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234821",
      "orcid": "missing"
    },
    {
      "name": "Markus Kneer",
      "institution": "Department of Philosophy, University of Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659665913",
      "orcid": "missing"
    },
    {
      "name": "Abraham Bernstein",
      "institution": "Department of Informatics, University of Zurich, Switzerland",
      "img": "/do/10.1145/contrib-81100134628/rel-imgonly/bernstein_1_small.jpg",
      "acmid": "81100134628",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Klauw Abbink and Benedikt Herrmann. 2011. The Moral Costs of Nastiness. Economic Inquiry 49, 2 (2011), 631–633.",
      "doi": ""
    },
    {
      "text": "Ashraf Abdul, Jo Vermeulen, Danding Wang, Brian Y Lim, and Mohan Kankanhalli. 2018. Trends and trajectories for explainable, accountable and intelligible systems: An hci research agenda. In Proceedings of the 2018 CHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 1–18.",
      "doi": "10.1145/3173574.3174156"
    },
    {
      "text": "Nadia Adnan, Shahrina Md Nordin, Mohamad Ariff bin Bahruddin, and Murad Ali. 2018. How trust can drive forward the user acceptance to the technology? In-vehicle technology for autonomous vehicle. Transportation research part A: policy and practice 118 (2018), 819–836.",
      "doi": ""
    },
    {
      "text": "Carlos Alós-Ferrer and Federica Farolfi. 2019. Trust Games and Beyond. Frontiers in Neuroscience 13 (2019), 887.",
      "doi": ""
    },
    {
      "text": "Michael Anderson, Susan Leigh Anderson, and Chris Armen. 2004. Towards machine ethics. In AAAI-04 workshop on agent publishers: theory and practice, San Jose, CA. AAAI Press, Phoenix, Arizona, USA, 2–7.",
      "doi": ""
    },
    {
      "text": "Theo Araujo, Natali Helberger, Sanne Kruikemeier, and Claes H De Vreese. 2020. In AI we trust? Perceptions about automated decision-making by artificial intelligence. AI & SOCIETY 35, 3 (2020), 611–623.",
      "doi": "10.1007/s00146-019-00931-w"
    },
    {
      "text": "Edmond Awad, Sohan Dsouza, Richard Kim, Jonathan Schulz, Joseph Henrich, Azim Shariff, Jean-François Bonnefon, and Iyad Rahwan. 2018. The moral machine experiment. Nature 563, 7729 (2018), 59–64.",
      "doi": ""
    },
    {
      "text": "Annette Baier. 1986. Trust and antitrust. ethics 96, 2 (1986), 231–260.",
      "doi": ""
    },
    {
      "text": "Judith Baker. 1987. Trust and rationality. Pacific philosophical quarterly 68, 1 (1987), 1–13.",
      "doi": ""
    },
    {
      "text": "Gagan Bansal, Besmira Nushi, Ece Kamar, Walter S Lasecki, Daniel S Weld, and Eric Horvitz. 2019. Beyond accuracy: The role of mental models in human-AI team performance. In Proceedings of the AAAI Conference on Human Computation and Crowdsourcing, Vol. 7. The AAAI Press, Palo Alto, California USA, 2–11.",
      "doi": ""
    },
    {
      "text": "BJÖRN BARTLING and URS FISCHBACHER. 2012. Shifting the Blame: On Delegation and Responsibility. The Review of Economic Studies 79, 1 (2012), 67–87.",
      "doi": ""
    },
    {
      "text": "Ghassan F Bati and Vivek K Singh. 2018. “Trust Us” Mobile Phone Use Patterns Can Predict Individual Trust Propensity. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": ""
    },
    {
      "text": "Christopher W Bauman, A Peter McGraw, Daniel M Bartels, and Caleb Warren. 2014. Revisiting external validity: Concerns about trolley problems and other sacrificial dilemmas in moral psychology. Social and Personality Psychology Compass 8, 9 (2014), 536–554.",
      "doi": ""
    },
    {
      "text": "Jeremy Bentham. 1996. The collected works of Jeremy Bentham: An introduction to the principles of morals and legislation. Clarendon Press, Oxford, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Benedikt Berger, Martin Adam, Alexander Rühr, and Alexander Benlian. 2021. Watch Me Improve—Algorithm Aversion and Demonstrating the Ability to Learn. Business & Information Systems Engineering 63, 1 (2021), 55–68.",
      "doi": ""
    },
    {
      "text": "Iris Bohnet, Fiona Greig, Benedikt Herrmann, and Richard Zeckhauser. 2008. Betrayal Aversion: Evidence from Brazil, China, Oman, Switzerland, Turkey, and the United States. American Economic Review 98, 1 (March 2008), 294–310.",
      "doi": ""
    },
    {
      "text": "Iris Bohnet and Richard Zeckhauser. 2004. Trust, risk and betrayal. Journal of Economic Behavior & Organization 55, 4(2004), 467–484.",
      "doi": ""
    },
    {
      "text": "Jean-François Bonnefon, Azim Shariff, and Iyad Rahwan. 2019. The trolley, the bull bar, and why engineers should care about the ethics of autonomous cars [point of view]. Proc. IEEE 107, 3 (2019), 502–504.",
      "doi": ""
    },
    {
      "text": "Jason W Burton, Mari-Klara Stein, and Tina Blegind Jensen. 2020. A systematic review of algorithm aversion in augmented decision making. Journal of Behavioral Decision Making 33, 2 (2020), 220–239.",
      "doi": ""
    },
    {
      "text": "Sidney Callahan. 1988. The role of emotion in ethical decisionmaking. Hastings Center Report 18, 3 (1988), 9–14.",
      "doi": ""
    },
    {
      "text": "Noah Castelo, Maarten W Bos, and Donald R Lehmann. 2019. Task-dependent algorithm aversion. Journal of Marketing Research 56, 5 (2019), 809–825.",
      "doi": ""
    },
    {
      "text": "Danton S Char, Nigam H Shah, and David Magnus. 2018. Implementing machine learning in health care—addressing ethical challenges. The New England journal of medicine 378, 11 (2018), 981.",
      "doi": ""
    },
    {
      "text": "Jin Chen, Cheng Chen, Joseph B. Walther, and S. Shyam Sundar. 2021. Do You Feel Special When an AI Doctor Remembers You? Individuation Effects of AI vs. Human Doctors on User Experience. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 299, 7 pages. https://doi.org/10.1145/3411763.3451735",
      "doi": ""
    },
    {
      "text": "Chun-Wei Chiang and Ming Yin. 2021. You’d Better Stop! Understanding Human Reliance on Machine Learning Models under Covariate Shift. In 13th ACM Web Science Conference 2021. Association for Computing Machinery, New York, NY, USA, 120–129.",
      "doi": "10.1145/3447535.3462487"
    },
    {
      "text": "Markus Christen, Darcia Narvaez, Julaine D Zenk, Michael Villano, Charles R Crowell, and Daniel R Moore. 2021. Trolley dilemma in the sky: Context matters when civilians and cadets make remotely piloted aircraft decisions. PLoS one 16, 3 (2021), e0247273.",
      "doi": ""
    },
    {
      "text": "Dan Conway, Fang Chen, Kun Yu, Jianlong Zhou, and Richard Morris. 2016. Misplaced Trust: A Bias in Human-Machine Trust Attribution–In Contradiction to Learning Theory. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 3035–3041.",
      "doi": "10.1145/2851581.2892433"
    },
    {
      "text": "Mary L Cummings. 2006. Integrating ethics in design through the value-sensitive design approach. Science and engineering ethics 12, 4 (2006), 701–715.",
      "doi": ""
    },
    {
      "text": "Berkeley J Dietvorst, Joseph P Simmons, and Cade Massey. 2015. Algorithm aversion: People erroneously avoid algorithms after seeing them err.Journal of Experimental Psychology: General 144, 1 (2015), 114.",
      "doi": ""
    },
    {
      "text": "Virginia Dignum. 2018. Ethics in artificial intelligence: introduction to the special issue., 3 pages.",
      "doi": ""
    },
    {
      "text": "Steven E Dilsizian and Eliot L Siegel. 2014. Artificial intelligence in medicine and cardiac imaging: harnessing big data and advanced computing to provide personalized medical diagnosis and treatment. Current cardiology reports 16, 1 (2014), 441.",
      "doi": ""
    },
    {
      "text": "Raymond Duch, Wojtek Przepiorka, and Randolph Stevenson. 2015. Responsibility attribution for collective decision makers. American Journal of Political Science 59, 2 (2015), 372–389.",
      "doi": ""
    },
    {
      "text": "Gerd Gigerenzer Eduard Brandstaetter and Ralph Hertwig. 2006. The Priority Heuristic: Making Choices Without Trade-Offs. Psychological Review 113, 2 (2006), 409–462.",
      "doi": ""
    },
    {
      "text": "Ziv Epstein, Sydney Levine, David G Rand, and Iyad Rahwan. 2020. Who gets credit for AI-generated art?Iscience 23, 9 (2020), 101515.",
      "doi": ""
    },
    {
      "text": "Mike Farjam. 2019. On whom would I want to depend; humans or computers?Journal of Economic Psychology 72 (2019), 219–228.",
      "doi": ""
    },
    {
      "text": "Ethan Fast and Eric Horvitz. 2017. Long-term trends in the public perception of artificial intelligence. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 31. The AAAI Press, Palo Alto, California USA, 963–969.",
      "doi": ""
    },
    {
      "text": "Joel E. Fischer, Chris Greenhalgh, Wenchao Jiang, Sarvapali D. Ramchurn, Feng Wu, and Tom Rodden. 2021. In-the-loop or on-the-loop? Interactional arrangements to support team coordination with a planning agent. Concurrency and Computation: Practice and Experience 33, 8(2021), e4082. https://doi.org/10.1002/cpe.4082 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/cpe.4082e4082 cpe.4082.",
      "doi": ""
    },
    {
      "text": "Philippa Foot. 2002. Moral Dilemmas: and other topics in moral philosophy. Clarendon Press, Oxford, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Donelson R Forsyth, Linda E Zyzniewski, and Cheryl A Giammanco. 2002. Responsibility diffusion in cooperative collectives. Personality and Social Psychology Bulletin 28, 1 (2002), 54–65.",
      "doi": ""
    },
    {
      "text": "Thomas Franke, Christiane Attig, and Daniel Wessel. 2019. A personal resource for technology interaction: development and validation of the affinity for technology interaction (ATI) scale. International Journal of Human–Computer Interaction 35, 6(2019), 456–467.",
      "doi": ""
    },
    {
      "text": "Nathan G. Freier, Elia J. Nelson, Amanda Rotondo, and Wai Kay Kong. 2009. The Moral Accountability of a Personified Agent: Young Adults’ Conceptions. Association for Computing Machinery, New York, NY, USA, 4609–4614. https://doi.org/10.1145/1520340.1520708",
      "doi": ""
    },
    {
      "text": "Batya Friedman, Peter Kahn, and Alan Borning. 2002. Value sensitive design: Theory and methods. Technical Report 2-12. University of Washington.",
      "doi": ""
    },
    {
      "text": "Anna-Katharina Frison, Philipp Wintersberger, Andreas Riener, Clemens Schartmüller, Linda Ng Boyle, Erika Miller, and Klemens Weigl. 2019. In UX We Trust: Investigation of Aesthetics and Usability of Driver-Vehicle Interfaces and Their Impact on the Perception of Automated Driving. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3290605.3300374"
    },
    {
      "text": "Felix Gille, Anna Jobin, and Marcello Ienca. 2020. What we talk about when we talk about trust: theory of trust for AI in healthcare. Intelligence-Based Medicine 1 (2020), 100001.",
      "doi": ""
    },
    {
      "text": "Jan Gogoll and Julian F Müller. 2017. Autonomous cars: in favor of a mandatory ethics setting. Science and engineering ethics 23, 3 (2017), 681–700.",
      "doi": ""
    },
    {
      "text": "Jan Gogoll and Matthias Uhl. 2018. Rage against the machine: Automation in the moral domain. Journal of Behavioral and Experimental Economics 74 (2018), 97–103.",
      "doi": ""
    },
    {
      "text": "Katja Grace, John Salvatier, Allan Dafoe, Baobao Zhang, and Owain Evans. 2018. When will AI exceed human performance? Evidence from AI experts. Journal of Artificial Intelligence Research 62 (2018), 729–754.",
      "doi": "10.1613/jair.1.11222"
    },
    {
      "text": "Peter A Graham. 2010. In defense of objectivism about moral obligation. Ethics 121, 1 (2010), 88–115.",
      "doi": ""
    },
    {
      "text": "Nina Grgić-Hlača, Christoph Engel, and Krishna P. Gummadi. 2019. Human Decision Making with Machine Assistance: An Experiment on Bailing and Jailing. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 178 (Nov. 2019), 25 pages. https://doi.org/10.1145/3359280",
      "doi": ""
    },
    {
      "text": "Holger A Haenssle, Christine Fink, Roland Schneiderbauer, Ferdinand Toberer, Timo Buhl, Andreas Blum, A Kalloo, A Ben Hadj Hassen, Luc Thomas, A Enk, 2018. Man against machine: diagnostic performance of a deep learning convolutional neural network for dermoscopic melanoma recognition in comparison to 58 dermatologists. Annals of oncology 29, 8 (2018), 1836–1842.",
      "doi": ""
    },
    {
      "text": "John R. Hamman, George Loewenstein, and Roberto A. Weber. 2010. Self-Interest through Delegation: An Additional Rationale for the Principal-Agent Relationship. The American Economic Review 100, 4 (2010), 1826–1846.",
      "doi": ""
    },
    {
      "text": "Russell Hardin. 1993. The street-level epistemology of trust. Politics & society 21, 4 (1993), 505–529.",
      "doi": ""
    },
    {
      "text": "Gilbert Harman. 1975. Moral relativism defended. The Philosophical Review 84, 1 (1975), 3–22.",
      "doi": ""
    },
    {
      "text": "Katherine Hawley. 2014. Trust, distrust and commitment. Noûs 48, 1 (2014), 1–20.",
      "doi": ""
    },
    {
      "text": "Maria Hedlund and Erik Persson. 2021. Expert responsibility in AI development. Proceedings of the International Conference of Public Policy (ICPP5) 5 (2021), 1–24.",
      "doi": ""
    },
    {
      "text": "Kevin Anthony Hoff and Masooda Bashir. 2015. Trust in automation: Integrating empirical evidence on factors that influence trust. Human factors 57, 3 (2015), 407–434.",
      "doi": ""
    },
    {
      "text": "Charles A. Holt and Susan K. Laury. 2002. Risk Aversion and Incentive Effects. American Economic Review 92, 5 (December 2002), 1644–1655.",
      "doi": ""
    },
    {
      "text": "Richard Holton. 1994. Deciding to trust, coming to believe. Australasian journal of philosophy 72, 1 (1994), 63–76.",
      "doi": ""
    },
    {
      "text": "Joo-Wha Hong and Dmitri Williams. 2019. Racism, responsibility and autonomy in HCI: Testing perceptions of an AI agent. Computers in Human Behavior 100 (2019), 79–84.",
      "doi": "10.1016/j.chb.2019.06.012"
    },
    {
      "text": "Michael Horowitz and Paul Scharre. 2015. An introduction to autonomy in weapon systems. Technical Report. Center for A New American Security.",
      "doi": ""
    },
    {
      "text": "Rasheed Hussain and Sherali Zeadally. 2018. Autonomous cars: Research results, issues, and future challenges. IEEE Communications Surveys & Tutorials 21, 2 (2018), 1275–1313.",
      "doi": ""
    },
    {
      "text": "Alon Jacovi, Ana Marasović, Tim Miller, and Yoav Goldberg. 2021. Formalizing trust in artificial intelligence: Prerequisites, causes and goals of human trust in AI. In Proceedings of the 2021 ACM conference on fairness, accountability, and transparency. Association for Computing Machinery, New York, NY, USA, 624–635.",
      "doi": "10.1145/3442188.3445923"
    },
    {
      "text": "Mohammad Hossein Jarrahi. 2018. Artificial intelligence and the future of work: Human-AI symbiosis in organizational decision making. Business Horizons 61, 4 (2018), 577–586.",
      "doi": ""
    },
    {
      "text": "Anna Jobin, Marcello Ienca, and Effy Vayena. 2019. The global landscape of AI ethics guidelines. Nature Machine Intelligence 1, 9 (2019), 389–399.",
      "doi": ""
    },
    {
      "text": "Deborah G Johnson and Mario Verdicchio. 2019. AI, agency and responsibility: the VW fraud case and beyond. Ai & Society 34, 3 (2019), 639–647.",
      "doi": "10.1007/s00146-017-0781-9"
    },
    {
      "text": "Michael S Josephson and Wes Hanson. 2002. Making ethical decisions. Josephson Institute of ethics Marina del Rey, CA, Los Angeles, CA, USA.",
      "doi": ""
    },
    {
      "text": "Ekaterina Jussupow, Izak Benbasat, and Armin Heinzl. 2020. Why are we Averse towards Algorithms? A Comprehensive Literature Review on Algorithmic Aversion. In Proceedings of the 28th European Conference on Information Systems (ECIS). ECIS, Marrakech, Morocco, 1–16.",
      "doi": ""
    },
    {
      "text": "Guy Kahane, Jim AC Everett, Brian D Earp, Lucius Caviola, Nadira S Faber, Molly J Crockett, and Julian Savulescu. 2018. Beyond sacrificial harm: A two-dimensional model of utilitarian psychology.Psychological Review 125, 2 (2018), 131.",
      "doi": ""
    },
    {
      "text": "Serhiy Kandul and Oliver Kirchkamp. 2018. Do I care if others lie? Current and future effects when lies can be delegated. Journal of Behavioral and Experimental Economics (formerly The Journal of Socio-Economics) 74, C (2018), 70–78.",
      "doi": ""
    },
    {
      "text": "Immanuel Kant. 1785. Groundwork of the metaphysics of morals.Cambridge, Cambridge, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Nikos I Karacapilidis and Costas P Pappis. 1997. A framework for group decision support systems: Combining AI tools and OR techniques. European Journal of Operational Research 103, 2 (1997), 373–388.",
      "doi": ""
    },
    {
      "text": "Aria Khademi and Vasant Honavar. 2020. Algorithmic bias in recidivism prediction: A causal perspective (student abstract). In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 34. The AAAI Press, Palo Alto, California USA, 13839–13840.",
      "doi": ""
    },
    {
      "text": "Lorraine Kisselburgh, Michel Beaudouin-Lafon, Lorrie Cranor, Jonathan Lazar, and Vicki L Hanson. 2020. HCI Ethics, Privacy, Accessibility, and the Environment: A Town Hall Forum on Global Policy Issues. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–6.",
      "doi": "10.1145/3334480.3381067"
    },
    {
      "text": "Jon Kleinberg, Jens Ludwig, Sendhil Mullainathan, and Cass R Sunstein. 2018. Discrimination in the Age of Algorithms. Journal of Legal Analysis 10 (2018), 113–174.",
      "doi": ""
    },
    {
      "text": "Jon Kleinberg, Sendhil Mullainathan, and Manish Raghavan. 2017. Inherent Trade-Offs in the Fair Determination of Risk Scores. In 8th Innovations in Theoretical Computer Science Conference (ITCS 2017)(Leibniz International Proceedings in Informatics (LIPIcs), Vol. 67), Christos H. Papadimitriou (Ed.). Schloss Dagstuhl–Leibniz-Zentrum fuer Informatik, Dagstuhl, Germany, 43:1–43:23.",
      "doi": ""
    },
    {
      "text": "Markus Kneer and Michael T Stuart. 2021. Playing the Blame Game with Robots. In Companion of the 2021 ACM/IEEE International Conference on Human-Robot Interaction. Association for Computing Machinery, New York, NY, United States, 407–411.",
      "doi": ""
    },
    {
      "text": "Rafal Kocielnik, Saleema Amershi, and Paul N. Bennett. 2019. Will You Accept an Imperfect AI? Exploring Designs for Adjusting End-User Expectations of AI Systems. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300641",
      "doi": "10.1145/3290605.3300641"
    },
    {
      "text": "John D Lee and Katrina A See. 2004. Trust in automation: Designing for appropriate reliance. Human factors 46, 1 (2004), 50–80.",
      "doi": ""
    },
    {
      "text": "Min Hun Lee, Daniel P. Siewiorek, Asim Smailagic, Alexandre Bernardino, and Sergi Bermúdez i Badia. 2021. A Human-AI Collaborative Approach for Clinical Decision Making on Rehabilitation Assessment. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 392, 14 pages. https://doi.org/10.1145/3411764.3445472",
      "doi": "10.1145/3411764.3445472"
    },
    {
      "text": "Min Kyung Lee, Nina Grgić-Hlača, Michael Carl Tschantz, Reuben Binns, Adrian Weller, Michelle Carney, and Kori Inkpen. 2020. Human-centered approaches to fair and responsible AI. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–8.",
      "doi": "10.1145/3334480.3375158"
    },
    {
      "text": "Zhuying Li, Yan Wang, Wei Wang, Stefan Greuter, and Florian ’Floyd’ Mueller. 2020. Empowering a Creative City: Engage Citizens in Creating Street Art through Human-AI Collaboration. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3382976",
      "doi": "10.1145/3334480.3382976"
    },
    {
      "text": "Gabriel Lima and Meeyoung Cha. 2020. Descriptive AI Ethics: Collecting and Understanding the Public Opinion, In Ethics in Design Workshop. arXiv preprint arXiv:2101.05957 1, 1–6.",
      "doi": ""
    },
    {
      "text": "Gabriel Lima, Nina Grgić-Hlača, and Meeyoung Cha. 2021. Human Perceptions on Moral Responsibility of AI: A Case Study in AI-Assisted Bail Decision-Making. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–17.",
      "doi": "10.1145/3411764.3445260"
    },
    {
      "text": "Patrick Lin. 2016. Why ethics matters for autonomous cars. Springer, Berlin, Heidelberg, Heidelberg, Germany, 69–85.",
      "doi": ""
    },
    {
      "text": "Jennifer M Logg, Julia A Minson, and Don A Moore. 2019. Algorithm appreciation: People prefer algorithmic to human judgment. Organizational Behavior and Human Decision Processes 151 (2019), 90–103.",
      "doi": ""
    },
    {
      "text": "Michele Loi and Markus Christen. 2019. How to include ethics in machine learning research. ERCIM News 116, 3 (2019), 5.",
      "doi": ""
    },
    {
      "text": "Zhuoran Lu and Ming Yin. 2021. Human Reliance on Machine Learning Models When Performance Feedback is Limited: Heuristics and Risks. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–16.",
      "doi": "10.1145/3411764.3445562"
    },
    {
      "text": "Stefanie M. Faas, Johannes Kraus, Alexander Schoenhals, and Martin Baumann. 2021. Calibrating Pedestrians’ Trust in Automated Vehicles: Does an Intent Display in an External HMI Support Trust Calibration and Safe Crossing Behavior?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–17.",
      "doi": ""
    },
    {
      "text": "John Mackie. 1990. Ethics: Inventing right and wrong. Penguin UK, London, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Bertram F Malle and Daniel Ullman. 2021. A multidimensional conception and measure of human-robot trust. In Trust in Human-Robot Interaction. Elsevier, Amsterdam, the Netherlands, 3–25.",
      "doi": ""
    },
    {
      "text": "Andreas Matthias. 2004. The responsibility gap: Ascribing responsibility for the actions of learning automata. Ethics and information technology 6, 3 (2004), 175–183.",
      "doi": ""
    },
    {
      "text": "Victoria McGeer. 2008. Trust, hope and empowerment. Australasian Journal of Philosophy 86, 2 (2008), 237–254.",
      "doi": ""
    },
    {
      "text": "Ree M Meertens and Rene Lion. 2008. Measuring an individual’s tendency to take risks: the risk propensity scale 1. Journal of Applied Social Psychology 38, 6 (2008), 1506–1520.",
      "doi": ""
    },
    {
      "text": "Ninareh Mehrabi, Fred Morstatter, Nripsuta Saxena, Kristina Lerman, and Aram Galstyan. 2021. A survey on bias and fairness in machine learning. ACM Computing Surveys (CSUR) 54, 6 (2021), 1–35.",
      "doi": "10.1145/3457607"
    },
    {
      "text": "Stephanie M Merritt, Heather Heimbaugh, Jennifer LaChapell, and Deborah Lee. 2013. I trust it, but I don’t know why: Effects of implicit attitudes toward automation on trust in an automated system. Human factors 55, 3 (2013), 520–534.",
      "doi": ""
    },
    {
      "text": "Leila Methnani, Andrea Aler Tubella, Virginia Dignum, and Andreas Theodorou. 2021. Let Me Take Over: Variable Autonomy for Meaningful Human Control. Frontiers in Artificial Intelligence 4 (2021), 133.",
      "doi": ""
    },
    {
      "text": "John Stuart Mill. 1861. 1998. Utilitarianism, edited with an introduction by Roger Crisp. Oxford University Press, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Tim Miller. 2019. Explanation in artificial intelligence: Insights from the social sciences. Artificial intelligence 267 (2019), 1–38.",
      "doi": ""
    },
    {
      "text": "Matteo Monti. 2019. Automated journalism and freedom of information: Ethical and juridical problems related to AI in the press field. Opinio Juris in Comparatione 1 (2019), 2018.",
      "doi": ""
    },
    {
      "text": "Rajatish Mukherjee, Gerdur Jonsdottir, Sandip Sen, and Partha Sarathi. 2001. Movies2go: an online voting based movie recommender system. In Proceedings of the fifth international conference on Autonomous agents, Vol. 5. Association for Computing Machinery, New York, NY, United States, 114–115.",
      "doi": "10.1145/375735.376018"
    },
    {
      "text": "Clifford Mynatt and Steven J Sherman. 1975. Responsibility attribution in groups and individuals: A direct test of the diffusion of responsibility hypothesis.Journal of Personality and Social Psychology 32, 6(1975), 1111.",
      "doi": ""
    },
    {
      "text": "Saeid Nahavandi. 2017. Trusted autonomy between humans and robots: Toward human-on-the-loop in robotics and autonomous systems. IEEE Systems, Man, and Cybernetics Magazine 3, 1 (2017), 10–17.",
      "doi": ""
    },
    {
      "text": "David T. Newman, N. Fast, and Derek Harmon. 2020. When eliminating bias isn’t fair: Algorithmic reductionism and procedural justice in human resource decisions. Organizational Behavior and Human Decision Processes 160 (2020), 149–167.",
      "doi": ""
    },
    {
      "text": "Evangelos Niforatos, Adam Palma, Roman Gluszny, Athanasios Vourvopoulos, and Fotis Liarokapis. 2020. Would You Do It?: Enacting Moral Dilemmas in Virtual Reality for Understanding Ethical Decision-Making. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376788",
      "doi": ""
    },
    {
      "text": "Mahsan Nourani, Chiradeep Roy, Jeremy E Block, Donald R Honeycutt, Tahrima Rahman, Eric Ragan, and Vibhav Gogate. 2021. Anchoring Bias Affects Mental Model Formation and User Reliance in Explainable AI Systems. In 26th International Conference on Intelligent User Interfaces. Association for Computing Machinery, New York, NY, USA, 340–350.",
      "doi": "10.1145/3397481.3450639"
    },
    {
      "text": "International Review of the Red Cross. 2019. Artificial intelligence and machine learning in armed conflict: A human-centred approach. Technical Report 102. ICRC.",
      "doi": ""
    },
    {
      "text": "Independent High-Level Expert Group on Artificial Intelligence. 2020. Ethics Guidelines for Trustworthy AI. Technical Report. Council of Europe.",
      "doi": ""
    },
    {
      "text": "Nora Osmani 2020. The Complexity of Criminal Liability of AI Systems. Masaryk University Journal of Law and Technology 14, 1(2020), 53–82.",
      "doi": ""
    },
    {
      "text": "David Owens. 2017. Trusting a Promise and Other Things. Oxford University Press, Oxford, United Kingdom, 214–29.",
      "doi": ""
    },
    {
      "text": "Hyanghee Park, Daehwan Ahn, Kartik Hosanagar, and Joonhwan Lee. 2021. Human-AI Interaction in Human Resource Management: Understanding Why Employees Resist Algorithmic Evaluation at Workplaces and How to Mitigate Burdens. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 154, 15 pages. https://doi.org/10.1145/3411764.3445304",
      "doi": "10.1145/3411764.3445304"
    },
    {
      "text": "Philip Pettit. 1995. The cunning of trust. Philosophy & Public Affairs 24, 3 (1995), 202–225.",
      "doi": ""
    },
    {
      "text": "Azzurra Pini, Jer Hayes, Connor Upton, and Medb Corcoran. 2019. AI Inspired Recipes: Designing Computationally Creative Food Combos. In CHI EA ’19: Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems(Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312948",
      "doi": "10.1145/3290607.3312948"
    },
    {
      "text": "Marianne Promberger and Jonathan Baron. 2006. Do patients trust computers?Journal of Behavioral Decision Making 19, 5 (2006), 455–468.",
      "doi": ""
    },
    {
      "text": "Martin Ragot, Nicolas Martin, and Salomé Cojean. 2020. Ai-generated vs. human artworks. a perception bias towards artificial intelligence?. In Extended abstracts of the 2020 CHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 1–10.",
      "doi": ""
    },
    {
      "text": "Ilana Ritov and Jonathan Baron. 1992. Status-quo and omission biases. Journal of Risk and Uncertainty 5 (1992), 49–61.",
      "doi": ""
    },
    {
      "text": "Kit T Rodolfa, Hemank Lamba, and Rayid Ghani. 2021. Empirical observation of negligible fairness–accuracy trade-offs in machine learning for public policy. Nature Machine Intelligence 3, 10 (2021), 896–904.",
      "doi": ""
    },
    {
      "text": "Rocío Sánchez-Salmerón, José L Gómez-Urquiza, Luis Albendín-García, María Correa-Rodríguez, María Begoña Martos-Cabrera, Almudena Velando-Soriano, and Nora Suleiman-Martos. 2022. Machine learning methods applied to triage in emergency services: A systematic review. International Emergency Nursing 60 (2022), 101109.",
      "doi": ""
    },
    {
      "text": "Filippo Santoni de Sio and Jeroen Van den Hoven. 2018. Meaningful human control over autonomous systems: A philosophical account. Frontiers in Robotics and AI 5 (2018), 15.",
      "doi": ""
    },
    {
      "text": "Anuschka Schmitt, Thiemo Wambsganss, Matthias Söllner, and Andreas Janson. 2021. Towards a Trust Reliance Paradox? Exploring the Gap Between Perceived Trust in and Reliance on Algorithmic Advice. In International Conference on Information Systems (ICIS), Vol. 1. ICIS, Austin, Texas, 1–17.",
      "doi": ""
    },
    {
      "text": "Donghee Shin. 2021. The effects of explainability and causability on perception, trust, and acceptance: Implications for explainable AI. International Journal of Human-Computer Studies 146 (2021), 102551.",
      "doi": ""
    },
    {
      "text": "Matthias Söllner, Axel Hoffmann, Holger Hoffmann, and Jan Marco Leimeister. 2012. How to use behavioral research insights on trust for HCI system design. In CHI’12 Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1703–1708.",
      "doi": ""
    },
    {
      "text": "Mark Spranca, Elisa Minsk, and Jonathan Baron. 1991. Omission and commission in judgment and choice. Journal of Experimental Social Psychology 27, 1 (1991), 76–105. https://doi.org/10.1016/0022-1031(91)90011-T",
      "doi": ""
    },
    {
      "text": "S Shyam Sundar. 2008. The MAIN model: A heuristic approach to understanding technology effects on credibility. MacArthur Foundation Digital Media and Learning Initiative, Chicago, IL, USA.",
      "doi": ""
    },
    {
      "text": "S Shyam Sundar and Jinyoung Kim. 2019. Machine heuristic: When we trust computers more than humans with our personal information. In Proceedings of the 2019 CHI Conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 1–9.",
      "doi": "10.1145/3290605.3300768"
    },
    {
      "text": "S Shyam Sundar, Jinyoung Kim, Mary Beth Rosson, and Maria D Molina. 2020. Online privacy heuristics that predict information disclosure. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": "10.1145/3313831.3376854"
    },
    {
      "text": "Steven C Sutherland, Casper Harteveld, and Michael E Young. 2015. The role of environmental predictability and costs in relying on automation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2535–2544.",
      "doi": "10.1145/2702123.2702609"
    },
    {
      "text": "the Committee of Ministers of the Council of Europe. 2020. Recommendation CM/Rec(2020)1 of the Committee of Ministers to member States on the human rights impacts of algorithmic systems. Technical Report. Council of Europe.",
      "doi": ""
    },
    {
      "text": "Thomas Theodoridis, Vassilios Solachidis, Kosmas Dimitropoulos, Lazaros Gymnopoulos, and Petros Daras. 2019. A survey on AI nutrition recommender systems. In Proceedings of the 12th ACM International Conference on PErvasive Technologies Related to Assistive Environments. Association for Computing Machinery, New York, NY, United States, 540–546.",
      "doi": "10.1145/3316782.3322760"
    },
    {
      "text": "Judith Jarvis Thomson. 1976. Killing, letting die, and the trolley problem. The Monist 59, 2 (1976), 204–217.",
      "doi": ""
    },
    {
      "text": "Neil Thurman, Judith Moeller, Natali Helberger, and Damian Trilling. 2019. My friends, editors, algorithms, and I: Examining audience attitudes to news selection. Digital Journalism 7, 4 (2019), 447–469.",
      "doi": ""
    },
    {
      "text": "Daniel W Tigard. 2021. Responsible AI and moral responsibility: a common appreciation. AI and Ethics 1, 2 (2021), 113–117.",
      "doi": ""
    },
    {
      "text": "Peter M Todd and Gerd Gigerenzer. 2000. Précis of simple heuristics that make us smart. Behavioral and brain sciences 23, 5 (2000), 727–741.",
      "doi": ""
    },
    {
      "text": "Suzanne Tolmeijer, Ujwal Gadiraju, Ramya Ghantasala, Akshit Gupta, and Abraham Bernstein. 2021. Second Chance for a First Impression? Trust Development in Intelligent System Interaction. In Proceedings of the 29th ACM Conference on User Modeling, Adaptation and Personalization. Association for Computing Machinery, New York, NY, USA, 77–87.",
      "doi": "10.1145/3450613.3456817"
    },
    {
      "text": "Suzanne Tolmeijer, Markus Kneer, Cristina Sarasua, Markus Christen, and Abraham Bernstein. 2020. Implementations in machine ethics: a survey. ACM Computing Surveys (CSUR) 53, 6 (2020), 1–38.",
      "doi": "10.1145/3419633"
    },
    {
      "text": "Amos Tversky and Daniel Kahneman. 1992. Advances in prospect theory: Cumulative representation of uncertainty. Journal of Risk and Uncertainty 5 (1992), 297–323.",
      "doi": ""
    },
    {
      "text": "Kailas Vodrahalli, Tobias Gerstenberg, and James Zou. 2021. Do Humans Trust Advice More if it Comes from AI? An Analysis of Human-AI Interactions. CoRR abs/2107.07015(2021), 1–34. arxiv:2107.07015https://arxiv.org/abs/2107.07015",
      "doi": ""
    },
    {
      "text": "Michael A Wallach, Nathan Kogan, and Daryl J Bem. 1964. Diffusion of responsibility and level of risk taking in groups.The Journal of Abnormal and Social Psychology 68, 3(1964), 263.",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Elizabeth Churchill, Pattie Maes, Xiangmin Fan, Ben Shneiderman, Yuanchun Shi, and Qianying Wang. 2020. From human-human collaboration to Human-AI collaboration: Designing AI systems that can work together with people. In Extended abstracts of the 2020 CHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 1–6.",
      "doi": ""
    },
    {
      "text": "Danding Wang, Qian Yang, Ashraf Abdul, and Brian Y. Lim. 2019. Designing Theory-Driven User-Centric Explainable AI. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300831",
      "doi": ""
    },
    {
      "text": "Ori Weisel and Shaul Shalvi. 2015. The collaborative roots of corruption. Proceedings of the National Academy of Sciences 112, 34(2015), 10651–10656.",
      "doi": ""
    },
    {
      "text": "Anja Wölker and Thomas E Powell. 2021. Algorithms in the newsroom? News readers’ perceived credibility and selection of automated journalism. Journalism 22, 1 (2021), 86–103.",
      "doi": ""
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, Carolyn Rosé, and John Zimmerman. 2020. Re-Examining Whether, Why, and How Human-AI Interaction Is Uniquely Difficult to Design. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376301",
      "doi": "10.1145/3313831.3376301"
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, and John Zimmerman. 2019. Unremarkable AI: Fitting Intelligent Decision Support into Critical, Clinical Decision-Making Processes. Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300468",
      "doi": "10.1145/3290605.3300468"
    },
    {
      "text": "Karen Yeung. 2020. Recommendation of the council on artificial intelligence (oecd). International Legal Materials 59, 1 (2020), 27–34.",
      "doi": ""
    },
    {
      "text": "Scot D. Yoder. 1998. The Nature of Ethical Expertise. The Hastings Center Report 28, 6 (1998), 11–19. http://www.jstor.org/stable/3528262",
      "doi": ""
    },
    {
      "text": "Qiaoning Zhang, X Jessie Yang, and Lionel Peter Robert. 2020. Expectations and trust in automated vehicles. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–9.",
      "doi": "10.1145/3334480.3382986"
    },
    {
      "text": "Yunfeng Zhang, Rachel KE Bellamy, Moninder Singh, and Q Vera Liao. 2020. Introduction to AI Fairness. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–4.",
      "doi": "10.1145/3334480.3375059"
    }
  ]
}