{
  "doi": "10.1145/3491102.3501975",
  "title": "Understanding User Experiences Across VR Walking-in-place Locomotion Methods",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2022,
  "badges": [],
  "abstract": "Navigating large-scale virtual spaces is a major challenge in Virtual Reality (VR) applications due to real-world spatial limitations. Walking-in-place (WIP) locomotion solutions may provide a natural approach for VR use cases that require locomotion to share similar qualities with walking in real-life. However, there is limited knowledge on the range of experiences across common WIP methods to inform the design of usable WIP solutions using consumer-accessible components. This paper contributes to this knowledge via a user study with 40 participants that experienced several easy-to-setup WIP methods in a VR commuting simulation. A nuanced understanding of cybersickness and exertion relationships and walking affordances based on different tracker setups were among the findings derived from a corroborated analysis of think-aloud, interview, and observational data, supplemented with self-reports of VR sickness, presence and flow. Practical design insights were then constructed along the dimensions of cybersickness, affordances, space and user interfaces.",
  "authors": [
    {
      "name": "Chek Tien Tan",
      "institution": "Centre for Immersification, Singapore Institute of Technology, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240087",
      "orcid": "missing"
    },
    {
      "name": "Leon Cewei Foo",
      "institution": "Centre for Immersification, Singapore Institute of Technology, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239623",
      "orcid": "missing"
    },
    {
      "name": "Adriel Yeo",
      "institution": "Centre for Immersification, Singapore Institute of Technology, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234250",
      "orcid": "missing"
    },
    {
      "name": "Jeannie Su Ann Lee",
      "institution": "Centre for Immersification, Singapore Institute of Technology, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320491861",
      "orcid": "missing"
    },
    {
      "name": "Edmund Wan",
      "institution": "Centre for Immersification, Singapore Institute of Technology, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239498",
      "orcid": "missing"
    },
    {
      "name": "Xiao-Feng Kenan Kok",
      "institution": "CoLEAD, Singapore Institute of Technology, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237934",
      "orcid": "missing"
    },
    {
      "name": "Megani Rajendran",
      "institution": "Centre for Immersification, Singapore Institute of Technology, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237345",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Yangyi Ang, Puteri Suhaiza Sulaiman, Rahmita Wirza O.K. Rahmat, and Noris Mohd Norowi. 2019. Swing-In-Place (SIP): A Less Fatigue Walking-in-Place Method with Side-Viewing Functionality for Mobile Virtual Reality. IEEE Access 7(2019), 183985–183995.",
      "doi": ""
    },
    {
      "text": "Aperium. 2021. Aperium Reality – K-01 Pod. https://aperiumreality.com/index.php/en/K01/",
      "doi": ""
    },
    {
      "text": "Costas Boletsis. 2017. The New Era of Virtual Reality Locomotion: A Systematic Literature Review of Techniques and a Proposed Typology. Multimodal Technologies and Interaction 1, 4 (2017).",
      "doi": ""
    },
    {
      "text": "Costas Boletsis, Jarl Erik Cedergren, and Marco Porta. 2019. VR Locomotion in the New Era of Virtual Reality: An Empirical Comparison of Prevalent Techniques. Adv. in Hum.-Comp. Int. 2019 (Jan 2019), 15 pages.",
      "doi": "10.1155/2019/7420781"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis. (2012).",
      "doi": ""
    },
    {
      "text": "Luís Bruno, Maurício Sousa, Alfredo Ferreira, João Madeiras Pereira, and Joaquim Jorge. 2017. Hip-directed walking-in-place using a single depth camera. International Journal of Human Computer Studies 105, May 2016(2017), 1–11.",
      "doi": ""
    },
    {
      "text": "Heni Cherni, Natacha Métayer, and Nicolas Souliman. 2020. Literature review of locomotion techniques in virtual reality. International Journal of Virtual Reality 20 (Mar 2020), 1–20.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1990. Flow: The Psychology of Optimal Experience. P. S. Series, Vol. 54. Harper & Row, New York, NY, USA. 303 pages.",
      "doi": ""
    },
    {
      "text": "Massimiliano Di Luca, Hasti Seifi, Simon Egan, and Mar Gonzalez-Franco. 2021. Locomotion Vault: The Extra Mile in Analyzing VR Locomotion Techniques. In Proc. CHI ’21. ACM, New York, NY, USA, Article 128, 10 pages.",
      "doi": "10.1145/3411764.3445319"
    },
    {
      "text": "Stefan Engeser and Falko Rheinberg. 2008. Flow, performance and moderators of challenge-skill balance. Motivation and Emotion 32, 3 (2008), 158–172.",
      "doi": ""
    },
    {
      "text": "Inan Evin, Toni Pesola, Maximus D. Kaos, Tuukka M. Takala, and Perttu Hämäläinen. 2020. 3PP-R: Enabling Natural Movement in 3rd Person Virtual Reality. In Proc. CHI PLAY ’20 (Virtual Event, Canada). ACM, New York, NY, USA, 438–449.",
      "doi": "10.1145/3410404.3414239"
    },
    {
      "text": "Jeff Feasel, Mary C. Whitton, and Jeremy D. Wendt. 2008. LLCM-WIP: Low-latency, continuous-motion walking-in-place. In Proc. IEEE 3DUI 2008. IEEE Comput. Soc, New Jersey, United States, 97–104.",
      "doi": "10.1109/3DUI.2008.4476598"
    },
    {
      "text": "Jann Philipp Freiwald, Oscar Ariza, Omar Janeh, and Frank Steinicke. 2020. Walking by Cycling: A Novel In-Place Locomotion User Interface for Seated Virtual Reality Experiences. In Proc. CHI ’20. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3313831.3376574"
    },
    {
      "text": "Julian Frommel, Sven Sonntag, and Michael Weber. 2017. Effects of Controller-Based Locomotion on Player Experience in a Virtual Reality Exploration Game. In Proc. FDG ’17. ACM, New York, NY, USA.",
      "doi": "10.1145/3102071.3102082"
    },
    {
      "text": "Cyberith GmbH. 2021. Virtual Reality Locomotion - Cyberith Virtualizer VR Treadmills. https://www.cyberith.com/",
      "doi": ""
    },
    {
      "text": "Nathan Navarro Griffin and Eelke Folmer. 2019. Out-of-Body Locomotion: Vectionless Navigation with a Continuous Avatar Representation. In Proc. VRST ’19 (Parramatta, NSW, Australia). ACM, New York, NY, USA, Article 1, 8 pages.",
      "doi": "10.1145/3359996.3364243"
    },
    {
      "text": "Emilie Guy, Parinya Punpongsanon, Daisuke Iwai, Kosuke Sato, and Tamy Boubekeur. 2015. LazyNav: 3D ground navigation with non-critical body parts. In Proc. IEEE 3DUI 2015. IEEE, New York, NY, USA, 43–50.",
      "doi": ""
    },
    {
      "text": "Carrie Heeter. 1992. Being There: The Subjective Experience of Presence. Presence: Teleoper. Virtual Environ. 1, 2 (May 1992), 262–271.",
      "doi": ""
    },
    {
      "text": "Thang Hoang, Thuc Nguyen, Chuyen Luong, Son Do, and Deokjai Choi. 2013. Adaptive cross-device gait recognition using a mobile accelerometer. Journal of Information Processing Systems 9, 2 (2013), 333–348.",
      "doi": ""
    },
    {
      "text": "Julian Horsey. 2021. SlimeVR full 360 degree virtual reality body tracker. https://github.com/SlimeVR/SlimeVR-OpenVR-Driver",
      "doi": ""
    },
    {
      "text": "HTC. 2020. HTC SteamVR Base Station 2 About Page. https://www.vive.com/eu/support/vive-pro/category_howto/about-the-base-stations.html",
      "doi": ""
    },
    {
      "text": "HTC. 2020. HTC Vive Pro Official Product Page. https://www.vive.com/eu/product/vive-pro/",
      "doi": ""
    },
    {
      "text": "HTC. 2021. HTC Vive Tracker Official Product Page.",
      "doi": ""
    },
    {
      "text": "Infinadeck. 2021. The Only True Omnidirectional Treadmill | Infinadeck. https://www.infinadeck.com/",
      "doi": ""
    },
    {
      "text": "Susan A Jackson and Herbert W Marsh. 1996. Development and validation of a scale to measure optimal experience: The Flow State Scale. Journal of sport and exercise psychology 18, 1 (1996), 17–35.",
      "doi": ""
    },
    {
      "text": "Keller. 2017. ElectricNightOwl ArmSwinger Locomotion Library. https://github.com/ElectricNightOwl/ArmSwinger",
      "doi": ""
    },
    {
      "text": "Robert S. Kennedy, Norman E. Lane, Kevin S. Berbaum, and Michael G. Lilienthal. 1993. Simulator Sickness Questionnaire: An Enhanced Method for Quantifying Simulator Sickness. The International Journal of Aviation Psychology (1993).",
      "doi": ""
    },
    {
      "text": "Hyun K. Kim, Jaehyun Park, Yeongcheol Choi, and Mungyeong Choe. 2018. Virtual reality sickness questionnaire (VRSQ): Motion sickness measurement index in a virtual reality environment. Applied Ergonomics (2018).",
      "doi": ""
    },
    {
      "text": "Woojoo Kim and Shuping Xiong. 2021. User-defined walking-in-place gestures for VR locomotion. International Journal of Human Computer Studies 152, December 2020(2021), 102648.",
      "doi": ""
    },
    {
      "text": "Julian Kreimeier, Daniela Ullmann, Harald Kipke, and Timo Götzelmann. 2020. Initial Evaluation of Different Types of Virtual Reality Locomotion Towards a Pedestrian Simulator for Urban and Transportation Planning. In Proc. CHI EA ’20(Honolulu, HI, USA). ACM, New York, NY, USA, 1–6.",
      "doi": "10.1145/3334480.3382958"
    },
    {
      "text": "Juyoung Lee, Sang Ahn, and Jae-In Hwang. 2018. A walking-in-place method for virtual reality using position and orientation tracking. Sensors 18, 9 (2018), 2832.",
      "doi": ""
    },
    {
      "text": "Gerard Llorach, Alun Evans, and Josep Blat. 2014. Simulator Sickness and Presence Using HMDs: Comparing Use of a Game Controller and a Position Estimation System. In Proc. VRST ’14. ACM, New York, NY, USA, 137–140.",
      "doi": "10.1145/2671015.2671120"
    },
    {
      "text": "Denys J. C. Matthies, Felix M. Manke, Franz Müller, Charalampia Makri, Christoph Anthes, and Dieter Kranzlmüller. 2014. VR-Stepper: A Do-It-Yourself Game Interface For Locomotion In Virtual Environments. (2014). arxiv:1407.3948",
      "doi": ""
    },
    {
      "text": "Morgan McCullough, Hong Xu, Joel Michelson, Matthew Jackoski, Wyatt Pease, William Cobb, William Kalescky, Joshua Ladd, and Betsy Williams. 2015. Myo arm: swinging to explore a VE. In Proc. SIGGRAPH Symposium on Applied Perception ’15. ACM, New York, NY, USA, 107–113.",
      "doi": "10.1145/2804408.2804416"
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and inter-rater reliability in qualitative research: Norms and guidelines for CSCW and HCI practice. In Proc. ACM on Hum.-Comp. Interact. ’19, Vol. 3. ACM, New York, NY, USA.",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Mary L McHugh. 2012. Interrater reliability: the kappa statistic. Biochemia medica 22, 3 (2012), 276–282.",
      "doi": ""
    },
    {
      "text": "Adrian K T Ng, Leith K Y Chan, and Henry Y K Lau. 2020. A study of cybersickness and sensory conflict theory using a motion-coupled virtual reality system. Displays 61(2020), 101922.",
      "doi": ""
    },
    {
      "text": "N C Nilsson, S Serafin, M H Laursen, K S Pedersen, E Sikström, and R Nordahl. 2013. Tapping-In-Place: Increasing the naturalness of immersive walking-in-place locomotion through novel gestural input. In IEEE 3DUI 2013. IEEE Comput. Soc, New Jersey, United States, 31–38.",
      "doi": ""
    },
    {
      "text": "Yun Suen Pai and Kai Kunze. 2017. Armswing: Using Arm Swings for Accessible and Immersive Navigation in AR/VR Spaces. In Proc. MUM ’17. ACM, New York, NY, USA, 189–198.",
      "doi": "10.1145/3152832.3152864"
    },
    {
      "text": "Jaeheung Park. 2008. Synthesis of natural arm swing motion in human bipedal walking. Journal of Biomechanics 41, 7 (2008), 1417–1426.",
      "doi": ""
    },
    {
      "text": "Yi Hao Peng, Carolyn Yu, Shi Hong Liu, Chung Wei Wang, Paul Taele, Neng Hao Yu, and Mike Y. Chen. 2020. WalkingVibe: Reducing Virtual Reality Sickness and Improving Realism while Walking in VR using Unobtrusive Head-mounted Vibrotactile Feedback. In Proc. CHI ’20. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3313831.3376847"
    },
    {
      "text": "Falko Rheinberg, Regina Vollmeyer, and Stefan Engeser. 2003. Assessment of flow experiences. Diagnostik von Motivation und Selbstkonzept (Tests und Trends – Jahrbuch der pädagogisch-psychologischen Diagnostik - Band 2) (2003), 261–279.",
      "doi": ""
    },
    {
      "text": "Thomas W Schubert. 2003. The sense of presence in virtual environments:. Zeitschrift für Medienpsychologie 15, 2 (2003), 69–71.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Anthony Steed, and Martin Usoh. 1995. The Virtual Treadmill: A Naturalistic Metaphor for Navigation in Immersive Virtual Environments. In Proc. Virtual Environments ’95, Martin Göbel (Ed.). Springer Vienna, Vienna, 135–148.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Martin Usoh, and Anthony Steed. 1995. Taking Steps: The Influence of a Walking Technique on Presence in Virtual Reality. ACM TOCHI 2, 3 (Sep 1995), 201–219.",
      "doi": "10.1145/210079.210084"
    },
    {
      "text": "SpaceWalkerVR. 2021. Home - SpaceWalkerVR. http://www.spacewalkervr.com/",
      "doi": ""
    },
    {
      "text": "Fangmin Sun, Chenfei Mao, Xiaomao Fan, and Ye Li. 2019. Accelerometer-Based Speed-Adaptive Gait Authentication Method for Wearable IoT Devices. IEEE Internet of Things Journal 6, 1 (2019), 820–830.",
      "doi": ""
    },
    {
      "text": "James N Templeman, Patricia S Denbrook, and Linda E Sibert. 1999. Virtual Locomotion: Walking in Place through Virtual Environments. Presence: Teleoperators and Virtual Environments 8, 6(1999), 598–617.",
      "doi": "10.1162/105474699566512"
    },
    {
      "text": "James N. Templeman, Patricia S. Denbrook, and Linda E. Sibert. 1999. Virtual locomotion: Walking in place through virtual environments. Presence: Teleoperators and Virtual Environments 8, 6(1999), 598–617.",
      "doi": "10.1162/105474699566512"
    },
    {
      "text": "Sam Tregillus and Eelke Folmer. 2016. VR-STEP: Walking-in-Place Using Inertial Sensing for Hands Free Navigation in Mobile VR Environments. In Proc. CHI ’16. ACM, New York, NY, USA, 1250–1255.",
      "doi": "10.1145/2858036.2858084"
    },
    {
      "text": "Unity. 2020. Unity Official Page. https://unity.com/",
      "doi": ""
    },
    {
      "text": "Valve Corporation. 2021. SteamVR Official Page. https://store.steampowered.com/steamvr",
      "doi": ""
    },
    {
      "text": "Virtuix. 2021. Omni by Virtuix - The leading and most popular VR motion platform. https://www.virtuix.com/",
      "doi": ""
    },
    {
      "text": "Julius von Willich, Martin Schmitz, Florian Müller, Daniel Schmitt, and Max Mühlhäuser. 2020. Podoportation: Foot-Based Locomotion in Virtual Reality. In Proc. CHI ’20. ACM, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376626"
    },
    {
      "text": "KAT VR. 2021. KAT VR Official Site - Virtual Reality Locomotion Technologies – KAT VR. https://www.kat-vr.com/",
      "doi": ""
    },
    {
      "text": "Jeremy D. Wendt, Mary C. Whitton, and Frederick P. Brooks. 2010. GUD WIP: Gait-understanding-driven walking-in-place. In Proc. IEEE VR 2010. IEEE, New York, NY, USA, 51–58.",
      "doi": "10.1109/VR.2010.5444812"
    },
    {
      "text": "Katie Wickens. 2021. Swedish teen’s start-up brings us the most affordable VR full-body tracking ever. https://www.pcgamer.com/swedish-teens-start-up-brings-us-the-most-affordable-vr-full-body-tracking-ever/",
      "doi": ""
    },
    {
      "text": "Preston Tunnell Wilson, William Kalescky, Ansel MacLaughlin, and Betsy Williams. 2016. VR Locomotion: Walking>Walking in Place>Arm swinging. In Proc. VRCAI 2016. ACM, New York, NY, USA.",
      "doi": "10.1145/3013971.3014010"
    },
    {
      "text": "Preston Tunnell Wilson, Kevin Nguyen, Alyssa Harris, and Betsy Williams. 2014. Walking in place using the Microsoft Kinect to explore a large VE. In Proc. VRCAI 2014. ACM, New York, NY, USA, 27–33.",
      "doi": "10.1145/2670473.2670492"
    }
  ]
}