{
  "doi": "10.1145/3491102.3501834",
  "title": "Feeling Proud, Feeling Embarrassed: Experiences of Low-income Women with Crowd Work",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "Women’s economic empowerment is central to gender equality. However, work opportunities available to low-income women in patriarchal societies are infrequent. While crowd work has the potential to increase labor participation of such women, much remains unknown about their engagement with crowd work and the resultant opportunities and tensions. To fill this gap, we critically examined the adoption and use of a crowd work platform by low-income women in India. Through a qualitative study, we found that women faced tremendous challenges, for example, in seeking permission from family members to do crowd work, lack of family support and encouragement, and often working in unfavorable environments where they had to hide their work lives. While crowd work took a toll on their physical and emotional wellbeing, it also led to increased confidence, agency, and autonomy. We discuss ways to reduce frictions and tensions in participation of low-income women on crowd work platforms.",
  "authors": [
    {
      "name": "Rama Adithya Varanasi",
      "institution": "Information Science, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659188025",
      "orcid": "0000-0003-4485-6663"
    },
    {
      "name": "Divya Siddarth",
      "institution": "Microsoft, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659455583",
      "orcid": "missing"
    },
    {
      "name": "Vivek Seshadri",
      "institution": "Microsoft Research India, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659520200",
      "orcid": "missing"
    },
    {
      "name": "Kalika Bali",
      "institution": "Microsoft Research Lab India, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309504424",
      "orcid": "missing"
    },
    {
      "name": "Aditya Vashistha",
      "institution": "Information Science, Cornell University, United States",
      "img": "/do/10.1145/contrib-81474703745/rel-imgonly/aditya-vashistha_2_orig.jpg",
      "acmid": "81474703745",
      "orcid": "0000-0001-5693-3326"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. The invisible door: Three barriers limiting women’s access to work. https://blogs.worldbank.org/jobs/invisible-door-three-barriers-limiting-women-s-access-work",
      "doi": ""
    },
    {
      "text": "[n.d.]. Overview: In South Asia, COVID-19 deepens gender disparities. https://asiapacific.unwomen.org/en/news-and-events/stories/2021/07/covid-19-deepens-gender-disparities.",
      "doi": ""
    },
    {
      "text": "[n.d.]. Pursuing Women’s Economic Empowerment. https://www.imf.org/en/Publications/Policy-Papers/Issues/2018/05/31/pp053118pursuing-womens-economic-empowerment.",
      "doi": ""
    },
    {
      "text": "2018-02-03. Bridging the gender gap: Mobile access and usage in low- and middle-income countries. https://www.gsma.com/mobilefordevelopment/programmes/connected-women/bridging-gender-gap.",
      "doi": ""
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md. Romael Haque, Jay Chen, and Nicola Dell. 2017. Digital Privacy Challenges with Shared Mobile Phone Use in Bangladesh. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (Dec. 2017), 1–20. https://doi.org/10.1145/3134652",
      "doi": "10.1145/3134652"
    },
    {
      "text": "Ali Alkhatib, Michael S. Bernstein, and Margaret Levi. 2017. Examining Crowd Work and Gig Work Through The Historical Lens of Piecework. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver Colorado USA, 4599–4616. https://doi.org/10.1145/3025453.3025974",
      "doi": "10.1145/3025453.3025974"
    },
    {
      "text": "Ira Anjali Anwar, Joyojeet Pal, and Julie Hui. 2021. Watched, but Moving: Platformization of Beauty Work and Its Gendered Mechanisms of Control. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3 (Jan. 2021), 1–20. https://doi.org/10.1145/3432949",
      "doi": "10.1145/3432949"
    },
    {
      "text": "Ellen Balka and Ina Wagner. 2021. A Historical View of Studies of Women’s Work. Computer Supported Cooperative Work (CSCW) 30, 2 (April 2021), 251–305. https://doi.org/10.1007/s10606-020-09387-9",
      "doi": "10.1007/s10606-020-09387-9"
    },
    {
      "text": "World Bank. [n.d.]. South Asia Women in the Workforce Week. https://www.worldbank.org/en/events/2020/02/18/south-asia-women-in-the-workforce-week.",
      "doi": ""
    },
    {
      "text": "World Bank. 2018. Missed Opportunities: The High Cost of Not Educating Girls. https://www.worldbank.org/en/topic/education/publication/missed-opportunities-the-high-cost-of-not-educating-girls/. [Online; accessed 09-Sep-2021].",
      "doi": ""
    },
    {
      "text": "Abdullah H Baqui, Shams El-Arifeen, Gary L Darmstadt, Saifuddin Ahmed, Emma K Williams, Habibur R Seraji, Ishtiaq Mannan, Syed M Rahman, Rasheduzzaman Shah, Samir K Saha, 2008. Effect of community-based newborn-care intervention package implemented through two service-delivery strategies in Sylhet district, Bangladesh: a cluster-randomised controlled trial. The lancet 371, 9628 (2008), 1936–1944.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’10). Association for Computing Machinery, Atlanta, Georgia, USA, 1301–1310. https://doi.org/10.1145/1753326.1753521",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a Feminist HCI Methodology: Social Science, Feminism, and HCI. Association for Computing Machinery, New York, NY, USA, 675–684. https://doi.org/10.1145/1978942.1979041",
      "doi": ""
    },
    {
      "text": "Robin Brewer, Meredith Ringel Morris, and Anne Marie Piper. 2016. ”Why Would Anybody Do This?”: Understanding Older Adults’ Motivations and Challenges in Crowd Work. Association for Computing Machinery, New York, NY, USA, 2246–2257. https://doi.org/10.1145/2858036.2858198",
      "doi": ""
    },
    {
      "text": "Robin Brewer, Meredith Ringel Morris, and Anne Marie Piper. 2016. ”Why Would Anybody Do This?”: Understanding Older Adults’ Motivations and Challenges in Crowd Work. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 2246–2257. https://doi.org/10.1145/2858036.2858198",
      "doi": "10.1145/2858036.2858198"
    },
    {
      "text": "Brant R Burleson. 2008. What counts as effective emotional support? Explorations of individual and situational differences. Studies in applied interpersonal communication (2008), 207–227. https://dx.doi.org/10.4135/9781412990301.n10",
      "doi": ""
    },
    {
      "text": "Shiney Chakraborty. 2020. COVID-19 and women informal sector workers in India. Economic & Political Weekly 55, 35 (2020), 17–21.",
      "doi": ""
    },
    {
      "text": "Manu Chopra, Indrani Medhi Thies, Joyojeet Pal, Colin Scott, William Thies, and Vivek Seshadri. 2019. Exploring Crowdsourced Work in Low-Resource Settings. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–13. https://doi.org/10.1145/3290605.3300611",
      "doi": "10.1145/3290605.3300611"
    },
    {
      "text": "Luigina Ciolfi and Eleanor Lockley. 2018. From Work to Life and Back Again: Examining the Digitally-Mediated Work/Life Practices of a Group of Knowledge Workers. Computer Supported Cooperative Work (CSCW) 27, 3-6 (Dec. 2018), 803–839. https://doi.org/10.1007/s10606-018-9315-3",
      "doi": "10.1007/s10606-018-9315-3"
    },
    {
      "text": "Victoria Clarke and Virginia Braun. 2014. Thematic analysis. In Encyclopedia of critical psychology. Springer, 1947–1952. https://doi.org/10.1007/978-1-4614-5583-7_311",
      "doi": ""
    },
    {
      "text": "John W. Creswell and Dana L. Miller. 2000. Determining Validity in Qualitative Inquiry. Theory Into Practice 39, 3 (2000), 124–130. https://doi.org/10.1207/s15430421tip3903_2",
      "doi": ""
    },
    {
      "text": "Valerio De Stefano. 2015. The rise of the just-in-time workforce: On-demand work, crowdwork, and labor protection in the gig-economy. Comp. Lab. L. & Pol’y J. 37 (2015), 471.",
      "doi": ""
    },
    {
      "text": "Edward L Deci, Anja H Olafsen, and Richard M Ryan. 2017. Self-determination theory in work organizations: The state of a science. Annual review of organizational psychology and organizational behavior 4 (2017), 19–43. https://doi.org/10.1146/annurev-orgpsych-032516-113108",
      "doi": ""
    },
    {
      "text": "Djellel Difallah, Elena Filatova, and Panos Ipeirotis. 2018. Demographics and Dynamics of Mechanical Turk Workers(WSDM ’18). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3159652.3159661",
      "doi": "10.1145/3159652.3159661"
    },
    {
      "text": "Djellel Difallah, Elena Filatova, and Panos Ipeirotis. 2018. Demographics and Dynamics of Mechanical Turk Workers. In Proceedings of the Eleventh ACM International Conference on Web Search and Data Mining(WSDM ’18). Association for Computing Machinery, New York, NY, USA, 135–143. https://doi.org/10.1145/3159652.3159661",
      "doi": "10.1145/3159652.3159661"
    },
    {
      "text": "Djellel Difallah, Elena Filatova, and Panos Ipeirotis. 2018. Demographics and Dynamics of Mechanical Turk Workers. In Proceedings of the Eleventh ACM International Conference on Web Search and Data Mining. ACM, Marina Del Rey CA USA, 135–143. https://doi.org/10.1145/3159652.3159661",
      "doi": "10.1145/3159652.3159661"
    },
    {
      "text": "Djellel Eddine Difallah, Michele Catasta, Gianluca Demartini, Panagiotis G. Ipeirotis, and Philippe Cudré-Mauroux. 2015. The Dynamics of Micro-Task Crowdsourcing: The Case of Amazon MTurk. In Proceedings of the 24th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, Florence Italy, 238–247. https://doi.org/10.1145/2736277.2741685",
      "doi": "10.1145/2736277.2741685"
    },
    {
      "text": "Leslie L. Dodson, S. Revi Sterling, and John K. Bennett. 2013. Minding the Gaps: Cultural, Technical and Gender-Based Barriers to Mobile Use in Oral-Language Berber Communities in Morocco. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers - Volume 1. ACM, Cape Town South Africa, 79–88. https://doi.org/10.1145/2516604.2516626",
      "doi": "10.1145/2516604.2516626"
    },
    {
      "text": "Esther Duflo. 2012. Women Empowerment and Economic Development. Journal of Economic Literature 50, 4 (December 2012), 1051–79. https://doi.org/10.1257/jel.50.4.1051",
      "doi": ""
    },
    {
      "text": "Nathan Eagle. 2009. Txteagle: Mobile Crowdsourcing. In Internationalization, Design and Global Development(Lecture Notes in Computer Science), Nuray Aykin (Ed.). Springer, Berlin, Heidelberg, 447–456. https://doi.org/10.1007/978-3-642-02767-3_50",
      "doi": ""
    },
    {
      "text": "Eureka Foong and Elizabeth Gerber. 2021. Understanding Gender Differences in Pricing Strategies in Online Labor Marketplaces. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–16. https://doi.org/10.1145/3411764.3445636",
      "doi": "10.1145/3411764.3445636"
    },
    {
      "text": "Eureka Foong, Nicholas Vincent, Brent Hecht, and Elizabeth M. Gerber. 2018. Women (Still) Ask For Less: Gender Differences in Hourly Rate in an Online Labor Marketplace. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (Nov. 2018), 1–21. https://doi.org/10.1145/3274322",
      "doi": "10.1145/3274322"
    },
    {
      "text": "F. Fukuyama. 1996. Trust: The Social Virtues and the Creation of Prosperity. Free Press.",
      "doi": ""
    },
    {
      "text": "Ujwal Gadiraju, Alessandro Checco, Neha Gupta, and Gianluca Demartini. 2017. Modus Operandi of Crowd Workers: The Invisible Role of Microtask Work Environments. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (Sept. 2017), 1–29. https://doi.org/10.1145/3130914",
      "doi": "10.1145/3130914"
    },
    {
      "text": "Aakash Gautam, Chandani Shrestha, and Deborah Tatar. 2019. Beyond Saving: A Case for Agency-First Approach against Domestic Violence. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development (Ahmedabad, India) (ICTD ’19). Association for Computing Machinery, New York, NY, USA, Article 51, 5 pages. https://doi.org/10.1145/3287098.3287147",
      "doi": "10.1145/3287098.3287147"
    },
    {
      "text": "Laetitia Gauvin, Michele Tizzoni, Simone Piaggesi, Andrew Young, Natalia Adler, Stefaan Verhulst, Leo Ferres, and Ciro Cattuto. 2020. Gender Gaps in Urban Mobility. Humanities and Social Sciences Communications 7, 1 (Dec. 2020), 11. https://doi.org/10.1057/s41599-020-0500-x",
      "doi": ""
    },
    {
      "text": "Breda Gray, Luigina Ciolfi, and Aparecido Fabiano Pinatti de Carvalho. 2020. Made to Work: Mobilising Contemporary Worklives (first ed.). Routledge, Abingdon, Oxon ; New York, NY : Routledge, 2020. |. https://doi.org/10.4324/9780429023958",
      "doi": ""
    },
    {
      "text": "Mary L. Gray and Siddharth Suri. 2019. Ghost Work: How to Stop Silicon Valley from Building a New Global Underclass(illustrated edition ed.). Mariner Books.",
      "doi": ""
    },
    {
      "text": "Mary L. Gray, Siddharth Suri, Syed Shoaib Ali, and Deepti Kulkarni. 2016. The Crowd is a Collaborative Network. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing(CSCW ’16). Association for Computing Machinery, New York, NY, USA, 134–147. https://doi.org/10.1145/2818048.2819942",
      "doi": "10.1145/2818048.2819942"
    },
    {
      "text": "Aakar Gupta, William Thies, Edward Cutrell, and Ravin Balakrishnan. 2012. mClerk: Enabling Mobile Crowdsourcing in Developing Regions. In Proceedings of the 2012 ACM Annual Conference on Human Factors in Computing Systems - CHI ’12. ACM Press, Austin, Texas, USA, 1843. https://doi.org/10.1145/2207676.2208320",
      "doi": "10.1145/2207676.2208320"
    },
    {
      "text": "Shruti Gupta. 2020. Gendered Gigs: Understanding the Gig Economy in New Delhi from a Gendered Perspective. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development. ACM, Guayaquil Ecuador, 1–10. https://doi.org/10.1145/3392561.3394635",
      "doi": "10.1145/3392561.3394635"
    },
    {
      "text": "Anikó Hannák, Claudia Wagner, David Garcia, Alan Mislove, Markus Strohmaier, and Christo Wilson. 2017. Bias in Online Freelance Marketplaces: Evidence from TaskRabbit and Fiverr. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, Portland Oregon USA, 1914–1933. https://doi.org/10.1145/2998181.2998327",
      "doi": "10.1145/2998181.2998327"
    },
    {
      "text": "Jasmine Hentschel, Syed Ishtiaque Ahmed, Faheem Hussain, Nova Ahmed, and Neha Kumar. 2017. Working with Women in ICTD. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development (Lahore, Pakistan) (ICTD ’17). Association for Computing Machinery, New York, NY, USA, Article 20, 5 pages. https://doi.org/10.1145/3136560.3136585",
      "doi": "10.1145/3136560.3136585"
    },
    {
      "text": "Matthias Hirth, Tobias Hoßfeld, and Phuoc Tran-Gia. 2011. Anatomy of a Crowdsourcing Platform - Using the Example of Microworkers.Com. In 2011 Fifth International Conference on Innovative Mobile and Internet Services in Ubiquitous Computing. 322–329. https://doi.org/10.1109/IMIS.2011.89",
      "doi": "10.1109/IMIS.2011.89"
    },
    {
      "text": "Debra Howcroft and Birgitta Bergvall-Kåreborn. 2019. A Typology of Crowdwork Platforms. Work, Employment and Society 33, 1 (Feb. 2019), 21–38. https://doi.org/10.1177/0950017018760136",
      "doi": ""
    },
    {
      "text": "Julie Hui, Nefer Ra Barber, Wendy Casey, Suzanne Cleage, Danny C. Dolley, Frances Worthy, Kentaro Toyama, and Tawanna R. Dillahunt. 2020. Community Collectives: Low-Tech Social Support for Digitally-Engaged Entrepreneurship. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–15. https://doi.org/10.1145/3313831.3376363",
      "doi": "10.1145/3313831.3376363"
    },
    {
      "text": "Samia Ibtasam, Lubna Razaq, Haider W. Anwar, Hamid Mehmood, Kushal Shah, Jennifer Webster, Neha Kumar, and Richard Anderson. 2018. Knowledge, Access, and Decision-Making: Women’s Financial Inclusion In Pakistan. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies. ACM, Menlo Park and San Jose CA USA, 1–12. https://doi.org/10.1145/3209811.3209819",
      "doi": "10.1145/3209811.3209819"
    },
    {
      "text": "Samia Ibtasam, Lubna Razaq, Maryam Ayub, Jennifer R. Webster, Syed Ishtiaque Ahmed, and Richard Anderson. 2019. ”My Cousin Bought the Phone for Me. I Never Go to Mobile Shops.”: The Role of Family in Women’s Technological Inclusion in Islamic Culture. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 1–33. https://doi.org/10.1145/3359148",
      "doi": "10.1145/3359148"
    },
    {
      "text": "OXFAM India. 2021. Inequality Report 2021: India’s Unequal Healthcare Story. https://d1ns4ht6ytuzzo.cloudfront.net/oxfamdata/oxfamdatapublic/2021-07/India%20Inequality%20Report%202021_single%20lo.pdf?nTTJ4toC1_AjHL2eLoVFRJyAAAgTqHqG. [Online; accessed 09-Sep-2021].",
      "doi": ""
    },
    {
      "text": "Lilly C. Irani and M. Six Silberman. 2013. Turkopticon: Interrupting Worker Invisibility in Amazon Mechanical Turk. Association for Computing Machinery, New York, NY, USA, 611–620. https://doi.org/10.1145/2470654.2470742",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Asiya Islam. 2021. “Two Hours Extra for Working from Home”: Reporting on Gender, Space, and Time from the Covid-field of Delhi, India. Gender, Work & Organization (Jan. 2021), gwao.12617. https://doi.org/10.1111/gwao.12617",
      "doi": ""
    },
    {
      "text": "Azra Ismail and Neha Kumar. 2019. Empowerment on the Margins: The Online Experiences of Community Health Workers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–15. https://doi.org/10.1145/3290605.3300329",
      "doi": "10.1145/3290605.3300329"
    },
    {
      "text": "Farnaz Jahanbakhsh, Justin Cranshaw, Scott Counts, Walter S. Lasecki, and Kori Inkpen. 2020. An Experimental Study of Bias in Platform Worker Ratings: The Role of Performance Quality and Gender. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–13. https://doi.org/10.1145/3313831.3376860",
      "doi": "10.1145/3313831.3376860"
    },
    {
      "text": "Pranjal Jain, Rama Adithya Varanasi, and Nicola Dell. 2021. “Who is protecting us? No one!” Vulnerabilities Experienced by Low-Income Indian Merchants Using Digital Payments. In ACM SIGCAS Conference on Computing and Sustainable Societies (COMPASS) (COMPASS ’21), June 28-July 2, 2021, Virtual Event, Australia(COMPASS ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3460112.3471961",
      "doi": "10.1145/3460112.3471961"
    },
    {
      "text": "Pratik Joshi, Christain Barnes, Sebastin Santy, Simran Khanuja, Sanket Shah, Anirudh Srinivasan, Satwik Bhattamishra, Sunayana Sitaram, Monojit Choudhury, and Kalika Bali. 2019. Unsung Challenges of Building and Deploying Language Technologies for Low Resource Language Communities. arXiv:1912.03457 [cs] (Dec. 2019). arxiv:1912.03457 [cs]",
      "doi": ""
    },
    {
      "text": "Bansari Kamdar. 2020. Women Left Behind: India’s Falling Female Labor Participation. https://doi.org/10.1145/1926180.1926195. [Online; accessed 09-Sep-2021].",
      "doi": ""
    },
    {
      "text": "Shashank Khanna, Aishwarya Ratan, James Davis, and William Thies. 2010. Evaluating and Improving the Usability of Mechanical Turk for Low-Income Workers in India. In Proceedings of the First ACM Symposium on Computing for Development(ACM DEV ’10). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/1926180.1926195",
      "doi": "10.1145/1926180.1926195"
    },
    {
      "text": "Anand Kulkarni, Philipp Gutheim, Prayag Narula, David Rolnitzky, Tapan Parikh, and Björn Hartmann. 2012. MobileWorks: Designing for Quality in a Managed Crowdsourcing Architecture. IEEE Internet Computing 16, 5 (2012), 28–35. https://doi.org/10.1109/MIC.2012.72",
      "doi": "10.1109/MIC.2012.72"
    },
    {
      "text": "Neha Kumar, Naveena Karusala, Azra Ismail, and Anupriya Tuli. 2020. Taking the Long, Holistic, and Intersectional View to Women’s Wellbeing. ACM Trans. Comput.-Hum. Interact. 27, 4, Article 23 (July 2020), 32 pages. https://doi.org/10.1145/3397159",
      "doi": "10.1145/3397159"
    },
    {
      "text": "Catherine Penny Hinson Langford, Juanita Bowsher, Joseph P Maloney, and Patricia P Lillis. 1997. Social support: a conceptual analysis. Journal of advanced nursing 25, 1 (1997), 95–100. https://doi.org/10.1046/j.1365-2648.1997.1997025095.x",
      "doi": ""
    },
    {
      "text": "Anant Maringanti. 2009. Urban Pulse—Urbanizing Microfinance: Examples from India. Urban geography 30, 7 (2009), 685–693.",
      "doi": ""
    },
    {
      "text": "Anita Mehrotra, Ashley Nguyen, Joshua Blumenstock, and Viraj Mohan. 2012. Differences in Phone Use between Men and Women: Quantitative Evidence from Rwanda. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development - ICTD ’12. ACM Press, Atlanta, Georgia, 297. https://doi.org/10.1145/2160673.2160710",
      "doi": "10.1145/2160673.2160710"
    },
    {
      "text": "Helene Molinier, Angela Rong Chen, and Emilie Skogvang. 2019. Innovation for Gender Equality. Report. 16 pages.",
      "doi": ""
    },
    {
      "text": "Preeti Mudliar. 2018. Public WiFi Is for Men and Mobile Internet Is for Women: Interrogating Politics of Space and Gender around WiFi Hotspots. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (Nov. 2018), 1–24. https://doi.org/10.1145/3274395",
      "doi": "10.1145/3274395"
    },
    {
      "text": "Tuheena Mukherjee, P Vigneswara Ilavarasan, and Arpan K Kar. 2019. Digital Literacy Training, Impact & Moderating Role of Perceived Value among Unemployed Women in India. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development (Ahmedabad, India) (ICTD ’19). Association for Computing Machinery, New York, NY, USA, Article 22, 4 pages. https://doi.org/10.1145/3287098.3291932",
      "doi": "10.1145/3287098.3291932"
    },
    {
      "text": "Savanthi Murthy, Karthik S. Bhat, Sauvik Das, and Neha Kumar. 2021. Individually Vulnerable, Collectively Safe: The Security and Privacy Practices of Households with Older Adults. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1 (April 2021), 1–24. https://doi.org/10.1145/3449212",
      "doi": "10.1145/3449212"
    },
    {
      "text": "Prayag Narula, Philipp Gutheim, David Rolnitzky, Anand Kulkarni, and Björn Hartmann. 2011. MobileWorks: A Mobile Crowdsourcing Platform for Workers at the Bottom of the Pyramid. In Workshops at the Twenty-Fifth AAAI Conference on Artificial Intelligence.",
      "doi": ""
    },
    {
      "text": "Purusottam Nayak and Bidisha Mahanta. 2008. Women Empowerment in India. SSRN Electronic Journal(2008). https://doi.org/10.2139/ssrn.1320071",
      "doi": ""
    },
    {
      "text": "N. Neetha. 2021. Crisis After Crisis: The Pandemic and Women’s Work. The Indian Economic Journal 69, 3 (2021), 425–440. https://doi.org/10.1177/00194662211013234",
      "doi": ""
    },
    {
      "text": "Thi Thao Duyen T. Nguyen, Thomas Garncarz, Felicia Ng, Laura A. Dabbish, and Steven P. Dow. 2017. Fruitful Feedback: Positive Affective Language and Source Anonymity Improve Critique Reception and Work Outcomes. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1024–1034. https://doi.org/10.1145/2998181.2998319",
      "doi": "10.1145/2998181.2998319"
    },
    {
      "text": "Kweku Opoku-Agyemang, Bhaumik Shah, and Tapan S. Parikh. 2017. Scaling Up Peer Education with Farmers in India. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development(Lahore, Pakistan) (ICTD ’17). Association for Computing Machinery, New York, NY, USA, Article 15, 10 pages. https://doi.org/10.1145/3136560.3136567",
      "doi": "10.1145/3136560.3136567"
    },
    {
      "text": "Subadra Panchanadeswaran and Catherine Koverola. 2005. The voices of battered women in India. Violence against women 11, 6 (2005), 736–758. https://doi.org/10.1177/1077801205276088",
      "doi": ""
    },
    {
      "text": "Hawra Rabaan, Alyson L. Young, and Lynn Dombrowski. 2021. Daughters of Men: Saudi Women’s Sociotechnical Agency Practices in Addressing Domestic Abuse. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3 (Jan. 2021), 1–31. https://doi.org/10.1145/3432923",
      "doi": "10.1145/3432923"
    },
    {
      "text": "Shan M Randhawa, Tallal Ahmad, Jay Chen, and Agha Ali Raza. 2021. Karamad: A Voice-Based Crowdsourcing Platform for Underserved Populations. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–15. https://doi.org/10.1145/3411764.3445417",
      "doi": "10.1145/3411764.3445417"
    },
    {
      "text": "Noopur Raval and Joyojeet Pal. 2019. Making a ”Pro”: ’Professionalism’ after Platforms in Beauty-Work. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 1–17. https://doi.org/10.1145/3359277",
      "doi": "10.1145/3359277"
    },
    {
      "text": "Rahul Sambaraju. 2020. “I Would Have Taken This to My Grave, Like Most Women”: Reporting Sexual Harassment during the# MeToo movement in India. Journal of Social Issues 76, 3 (2020), 603–631. https://doi.org/10.1111/josi.12391",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Garen Checkley, Amna Batool, Nova Ahmed, David Nemer, Laura Sanely Gaytán-Lugo, Tara Matthews, Sunny Consolvo, and Elizabeth Churchil. 2018. ”Privacy Is Not for Me, It’s for Those Rich Women”: Performative Privacy Practices on Mobile Phones by Women in South Asia. In Proceedings of the Fourteenth USENIX Conference on Usable Privacy and Security(SOUPS ’18). USENIX Association, USA, 127–142.",
      "doi": ""
    },
    {
      "text": "Helen Schneider, Dickson Okello, and Uta Lehmann. 2016. The global pendulum swing towards community health workers in low-and middle-income countries: a scoping review of trends, geographical distribution and programmatic orientations, 2005 to 2014. Human resources for health 14, 1 (2016), 65.",
      "doi": ""
    },
    {
      "text": "Kerry Scott, SW Beckham, Margaret Gross, George Pariyo, Krishna D Rao, Giorgio Cometto, and Henry B Perry. 2018. What do we know about community-based health worker programs? A systematic review of existing reviews on community health workers. Human resources for health 16, 1 (2018), 39.",
      "doi": ""
    },
    {
      "text": "Bhavani Seetharaman, Joyojeet Pal, and Julie Hui. 2021. Delivery Work and the Experience of Social Isolation. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 64 (April 2021), 17 pages. https://doi.org/10.1145/3449138",
      "doi": "10.1145/3449138"
    },
    {
      "text": "Alana Semuels. 2018. The Internet Is Enabling a New Kind of Poorly Paid Hell. https://www.theatlantic.com/business/archive/2018/01/amazon-mechanical-turk/551192/ Section: Business.",
      "doi": ""
    },
    {
      "text": "Reetu Sharma, Premila Webster, and Sanghita Bhattacharyya. 2014. Factors affecting the performance of community health workers in India: a multi-stakeholder perspective. Global Health Action 7, 1 (2014), 25352. https://doi.org/10.3402/gha.v7.25352 PMID: 28672447.",
      "doi": ""
    },
    {
      "text": "Mario Luis Small. 2009. How many cases do I need?’ On science and the logic of case selection in field-based research. Ethnography 10, 1 (2009), 5–38. https://doi.org/10.1177/1466138108099586",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star and Anselm Strauss. 1999. Layers of silence, arenas of voice: The ecology of visible and invisible work. Computer supported cooperative work (CSCW) 8, 1 (1999), 9–30. https://doi.org/10.1023/A:1008651105359",
      "doi": "10.1023/A%3A1008651105359"
    },
    {
      "text": "Sharifa Sultana, François Guimbretière, Phoebe Sengers, and Nicola Dell. 2018. Design Within a Patriarchal Society: Opportunities and Challenges in Designing for Rural Women in Bangladesh. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC Canada, 1–13. https://doi.org/10.1145/3173574.3174110",
      "doi": "10.1145/3173574.3174110"
    },
    {
      "text": "Ranjula Bali Swain and Fan Yang Wallentin. 2009. Does microfinance empower women? Evidence from self-help groups in India. International review of applied economics 23, 5 (2009), 541–556. https://doi.org/10.1080/02692170903007540",
      "doi": ""
    },
    {
      "text": "Monideepa Tarafdar, Cary L Cooper, and Jean-François Stich. 2019. The technostress trifecta-techno eustress, techno distress and design: Theoretical directions and an agenda for research. Information Systems Journal 29, 1 (2019), 6–42.",
      "doi": ""
    },
    {
      "text": "Stefan Timmermans and Iddo Tavory. 2012. Theory Construction in Qualitative Research: From Grounded Theory to Abductive Analysis. Sociological Theory 30, 3 (Sept. 2012), 167–186. https://doi.org/10.1177/0735275112457914",
      "doi": ""
    },
    {
      "text": "C Toxtli, S Suri, and Saiph Savage. 2021. Quantifying the Invisible Labor in Crowd Work. Computer supported cooperative work CSCW(2021).",
      "doi": ""
    },
    {
      "text": "Kentaro Toyama. 2011. Technology as Amplifier in International Development. In Proceedings of the 2011 IConference (Seattle, Washington, USA) (iConference ’11). Association for Computing Machinery, New York, NY, USA, 75–82. https://doi.org/10.1145/1940761.1940772",
      "doi": "10.1145/1940761.1940772"
    },
    {
      "text": "Anupriya Tuli, Shaan Chopra, Pushpendra Singh, and Neha Kumar. 2020. Menstrual (Im)Mobilities and Safe Spaces. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376653",
      "doi": ""
    },
    {
      "text": "Stephen Uzor, Jason T. Jacques, John J Dudley, and Per Ola Kristensson. 2021. Investigating the Accessibility of Crowdwork Tasks on Mechanical Turk. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–14. https://doi.org/10.1145/3411764.3445291",
      "doi": "10.1145/3411764.3445291"
    },
    {
      "text": "Rama Adithya Varanasi, René F. Kizilcec, Aditya Vashistha, and Nicola Dell. 2021. Investigating Technostress Among Teachers in Low-Income Indian Schools. Proc. ACM Hum.-Comput. Interact.CSCW, Article 340 (Oct. 2021). https://doi.org/10.1145/3476081",
      "doi": "10.1145/3476081"
    },
    {
      "text": "Aditya Vashistha, Richard Anderson, and Shrirang Mare. 2018. Examining Security and Privacy Research in Developing Regions. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies. ACM, Menlo Park and San Jose CA USA, 1–14. https://doi.org/10.1145/3209811.3209818",
      "doi": "10.1145/3209811.3209818"
    },
    {
      "text": "Aditya Vashistha, Abhinav Garg, and Richard Anderson. 2019. ReCall: Crowdsourcing on Basic Phones to Financially Sustain Voice Forums. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–13. https://doi.org/10.1145/3290605.3300399",
      "doi": "10.1145/3290605.3300399"
    },
    {
      "text": "Aditya Vashistha, Pooja Sethi, and Richard Anderson. 2017. Respeak: A Voice-Based, Crowd-Powered Speech Transcription System. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 1855–1866. https://doi.org/10.1145/3025453.3025640",
      "doi": "10.1145/3025453.3025640"
    },
    {
      "text": "Aditya Vashistha, Pooja Sethi, and Richard Anderson. 2018. BSpeak: An Accessible Voice-Based Crowdsourcing Marketplace for Low-Income Blind People. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173631",
      "doi": "10.1145/3173574.3173631"
    },
    {
      "text": "Juliet Webster. 2016. Microworkers of the Gig Economy: Separate and Precarious. New Labor Forum 25, 3 (Sept. 2016), 56–64. https://doi.org/10.1177/1095796016661511 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Natasha A. Webster and Qian Zhang. 2020. Careers Delivered from the Kitchen? Immigrant Women Small-Scale Entrepreneurs Working in the Growing Nordic Platform Economy. NORA - Nordic Journal of Feminist and Gender Research 28, 2 (April 2020), 113–125. https://doi.org/10.1080/08038740.2020.1714725",
      "doi": ""
    },
    {
      "text": "Alex J Wood, Mark Graham, Vili Lehdonvirta, and Isis Hjorth. 2019. Good Gig, Bad Gig: Autonomy and Algorithmic Control in the Global Gig Economy. Work, Employment and Society 33, 1 (Feb. 2019), 56–75. https://doi.org/10.1177/0950017018785616 Publisher: SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Kathryn Zyskowski, Meredith Ringel Morris, Jeffrey P. Bigham, Mary L. Gray, and Shaun K. Kane. 2015. Accessible Crowdwork?: Understanding the Value in and Challenge of Microtask Employment for People with Disabilities. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, Vancouver BC Canada, 1682–1693. https://doi.org/10.1145/2675133.2675158",
      "doi": "10.1145/2675133.2675158"
    }
  ]
}