{
  "doi": "10.1145/3491102.3517545",
  "title": "Distracting Moments in Videoconferencing: A Look Back at the Pandemic Period",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-21",
  "year": 2022,
  "badges": [],
  "abstract": "The COVID-19 pandemic has forced workers around the world to switch their working paradigms from on-site to video-mediated communication. Despite the advantages of videoconferencing, diverse circumstances have prevented people from focusing on their work. One of the most typical problems they face is that various surrounding factors distract them during their meetings. This study focuses on conditions in which remote workers are distracted by factors that disturb, interrupt, or restrict them during their meetings. We aim to explore the various problem situations and user needs. To understand users’ pain points and needs, focus group interviews and participatory design workshops were conducted to learn about participants’ troubled working experiences over the past two years and the solutions they expected. Our study provides a unified framework of distracting factors by which to understand causes of poor user experience and reveals valuable implications to improve videoconferencing experiences.",
  "tags": [
    "Distraction",
    "Videoconferencing",
    "User experience",
    "Remote work"
  ],
  "authors": [
    {
      "name": "Minha Lee",
      "institution": "Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702543",
      "orcid": "0000-0003-2460-3810"
    },
    {
      "name": "Wonyoung Park",
      "institution": "Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659760838",
      "orcid": "missing"
    },
    {
      "name": "Sunok Lee",
      "institution": "Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367308",
      "orcid": "0000-0002-8518-7315"
    },
    {
      "name": "Sangsu Lee",
      "institution": "Industrial Design, KAIST, Korea, Republic of",
      "img": "/do/10.1145/contrib-81416594796/rel-imgonly/profile.jpg",
      "acmid": "81416594796",
      "orcid": "0000-0002-3793-6801"
    }
  ],
  "references": [
    {
      "text": "Ivana Acocella. 2012. The focus groups in social research: advantages and disadvantages. Quality & Quantity 46, 4 (2012), 1125–1136.",
      "doi": ""
    },
    {
      "text": "Tammy D Allen, Timothy D Golden, and Kristen M Shockley. 2015. How effective is telecommuting? Assessing the status of our scientific findings. Psychological science in the public interest 16, 2 (2015), 40–68.",
      "doi": ""
    },
    {
      "text": "Barry Arons. 1992. A review of the cocktail party effect. Journal of the American Voice I/O Society 12, 7 (1992), 35–50.",
      "doi": ""
    },
    {
      "text": "Stephen R Barley and Gideon Kunda. 2011. Gurus, hired guns, and warm bodies. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "James Calderhead. 1981. Stimulated recall: A method for research on teaching. British journal of educational psychology 51, 2 (1981), 211–217.",
      "doi": ""
    },
    {
      "text": "Zhilong Chen, Hancheng Cao, Yuting Deng, Xuan Gao, Jinghua Piao, Fengli Xu, Yu Zhang, and Yong Li. 2021. Learning from Home: A Mixed-Methods Analysis of Live Streaming Based Remote Education Experience in Chinese Colleges during the COVID-19 Pandemic. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445428"
    },
    {
      "text": "Nik Ed Chmiel. 2008. An introduction to work and organizational psychology: a European perspective. Blackwell Publishing.",
      "doi": ""
    },
    {
      "text": "Haena Cho, Hyeonjeong Im, Sunok Lee, and Sangsu Lee. 2021. “I want more than” User-generated Icons for Better Video-mediated Communications on the Collaborative Design Process. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": ""
    },
    {
      "text": "Jeremy R Cooperstock, Koichiro Tanikoshi, and William Buxton. 1995. Turning Your Video Monitor into a Virtual Window. In IEEE Pacific Rim Conference on Communications, Computers, and Signal Processing. Proceedings. IEEE, 308–310.",
      "doi": ""
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2014. Basics of qualitative research: Techniques and procedures for developing grounded theory. Sage publications.",
      "doi": ""
    },
    {
      "text": "Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A diary study of task switching and interruptions. In Proceedings of the SIGCHI conference on Human factors in computing systems. 175–182.",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Dahyar Daraba, Hillman Wirawan, Rudi Salam, and Muhammad Faisal. 2021. Working from home during the corona pandemic: Investigating the role of authentic leadership, psychological capital, and gender on employee performance. Cogent Business & Management 8, 1 (2021), 1885573.",
      "doi": ""
    },
    {
      "text": "Daantje Derks, Arnold B Bakker, Pascale Peters, and Pauline van Wingerden. 2016. Work-related smartphone use, work–family conflict and family role performance: The role of segmentation preference. Human relations 69, 5 (2016), 1045–1068.",
      "doi": ""
    },
    {
      "text": "Drew Desilver. 2020. Working from home was a luxury for the relatively affluent before coronavirus—Not any more. In World Economic Forum, Vol. 21.",
      "doi": ""
    },
    {
      "text": "Jennifer DeWitt and Jonathan Osborne. 2010. Recollections of Exhibits: Stimulated-recall interviews with primary school children about science centre visits. International Journal of Science Education 32, 10 (2010), 1365–1388.",
      "doi": ""
    },
    {
      "text": "Dimitrina Dimitrova. 2003. Controlling teleworkers: supervision and flexibility revisited. New Technology, Work and Employment 18, 3 (2003), 181–195.",
      "doi": ""
    },
    {
      "text": "Kathryn L Fonner and Lara C Stache. 2012. All in a day’s work, at home: Teleworkers’ management of micro role transitions and the work–home boundary. New Technology, Work and Employment 27, 3 (2012), 242–257.",
      "doi": ""
    },
    {
      "text": "Gather.Town. Accessed 2021. Website of Gather.Town. https://www.gather.town.",
      "doi": ""
    },
    {
      "text": "Graham R Gibbs. 2007. Thematic coding and categorizing. Analyzing qualitative data 703 (2007), 38–56.",
      "doi": ""
    },
    {
      "text": "Cristina B Gibson and Susan G Cohen. 2003. Virtual teams that work: Creating conditions for virtual team effectiveness. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Timothy D Golden. 2012. Altering the effects of work and family conflict on exhaustion: Telework during traditional and nontraditional work hours. Journal of Business and Psychology 27, 3 (2012), 255–269.",
      "doi": ""
    },
    {
      "text": "Christine A Grant, Louise M Wallace, and Peter C Spurgeon. 2013. An exploration of the psychological factors affecting remote e-worker’s job effectiveness, well-being and work-life balance. Employee Relations (2013).",
      "doi": ""
    },
    {
      "text": "Jörg Hauber, Holger Regenbrecht, Mark Billinghurst, and Andy Cockburn. 2006. Spatiality in videoconferencing: trade-offs between efficiency and social presence. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work. 413–422.",
      "doi": "10.1145/642611.642702"
    },
    {
      "text": "Robert D Hisrich and Michael P Peters. 1982. Focus groups: an innovative marketing research technique.Hospital & health services administration 27, 4 (1982), 8–21.",
      "doi": ""
    },
    {
      "text": "Bradley J Hufford, Robert L Glueckauf, and Patrick M Webb. 1999. Home-based, interactive videoconferencing for adolescents with epilepsy and their families.Rehabilitation Psychology 44, 2 (1999), 176.",
      "doi": ""
    },
    {
      "text": "Snap Inc.Accessed 2021. Snap Camera. https://snapcamera.snapchat.com/.",
      "doi": ""
    },
    {
      "text": "Shamsi T Iqbal and Eric Horvitz. 2007. Disruption and recovery of computing tasks: field study, analysis, and directions. In Proceedings of the SIGCHI conference on Human factors in computing systems. 677–686.",
      "doi": "10.1145/1240624.1240730"
    },
    {
      "text": "E Jeffrey Hill, Joseph G Grzywacz, Sarah Allen, Victoria L Blanchard, Christina Matz-Costa, Sandee Shulkin, and Marcie Pitt-Catsouphes. 2008. Defining and conceptualizing workplace flexibility. Community, Work and Family 11, 2 (2008), 149–163.",
      "doi": ""
    },
    {
      "text": "Aparna Joshi, David A Bloom, Amy Spencer, Kara Gaetke-Udager, and Richard H Cohan. 2020. Video interviewing: a review and recommendations for implementation in the era of COVID-19 and beyond. Academic radiology 27, 9 (2020), 1316–1322.",
      "doi": ""
    },
    {
      "text": "Sasa Junuzovic, Kori Inkpen, Rajesh Hegde, and Zhengyou Zhang. 2011. Towards ideal window layouts for multi-party, gaze-aware desktop videoconferencing. (2011).",
      "doi": ""
    },
    {
      "text": "Matthew K. Miller, Martin Johannes Dechant, and Regan L. Mandryk. 2021. Meeting You, Seeing Me: The Role of Social Anxiety, Visual Feedback, and Interface Layout in a Get-to-Know-You Task via Video Chat.. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": ""
    },
    {
      "text": "Demetrios Karis, Daniel Wildman, and Amir Mané. 2016. Improving remote collaboration with video conferencing and video portals. Human–Computer Interaction 31, 1 (2016), 1–58.",
      "doi": ""
    },
    {
      "text": "Clare Kelliher and Deirdre Anderson. 2010. Doing more with less? Flexible working practices and the intensification of work. Human relations 63, 1 (2010), 83–106.",
      "doi": ""
    },
    {
      "text": "Katja Kerman, Christian Korunka, and Sara Tement. 2021. Work and home boundary violations during the COVID-19 pandemic: The role of segmentation preferences and unfinished tasks. Applied Psychology (2021).",
      "doi": ""
    },
    {
      "text": "Kathrin Kirchner, Christine Ipsen, and John Paulin Hansen. 2021. COVID-19 leadership challenges in knowledge work. Knowledge Management Research & Practice(2021), 1–8.",
      "doi": ""
    },
    {
      "text": "Kevin M Kniffin, Jayanth Narayanan, Frederik Anseel, John Antonakis, Susan P Ashford, Arnold B Bakker, Peter Bamberger, Hari Bapuji, Devasheesh P Bhave, Virginia K Choi, 2021. COVID-19 and the workplace: Implications, issues, and insights for future research and action.American Psychologist 76, 1 (2021), 63.",
      "doi": ""
    },
    {
      "text": "Benjamin Koehne, Patrick C Shih, and Judith S Olson. 2012. Remote and alone: coping with being the remote member on the team. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. 1257–1266.",
      "doi": "10.1145/2145204.2145393"
    },
    {
      "text": "Lucas Kohnke and Benjamin Luke Moorhouse. 2020. Facilitating synchronous online language learning through Zoom. RELC Journal (2020), 0033688220937235.",
      "doi": ""
    },
    {
      "text": "Udo Konradt, Guido Hertel, and Renate Schmook. 2003. Quality of management by objectives, task-related stressors, and non-task-related stressors as predictors of stress and job satisfaction among teleworkers. European Journal of Work and Organizational Psychology 12, 1(2003), 61–79.",
      "doi": ""
    },
    {
      "text": "Myron W Krueger, Thomas Gionfriddo, and Katrin Hinrichsen. 1985. VIDEOPLACE—an artificial reality. In Proceedings of the SIGCHI conference on Human factors in computing systems. 35–40.",
      "doi": "10.1145/317456.317463"
    },
    {
      "text": "Richard A Krueger. 2014. Focus groups: A practical guide for applied research. Sage publications.",
      "doi": ""
    },
    {
      "text": "Andrea Kysely, Brian Bishop, Robert Kane, Maryanne Cheng, Mia De Palma, and Rosanna Rooney. 2020. Expectations and experiences of couples receiving therapy through videoconferencing: A qualitative study. Frontiers in psychology 10 (2020), 2992.",
      "doi": ""
    },
    {
      "text": "Celine Latulipe. 2021. A CS1 Team-Based Learning Space in Gather. Town. In Proceedings of the 52nd ACM Technical Symposium on Computer Science Education. 1245–1245.",
      "doi": "10.1145/3408877.3439587"
    },
    {
      "text": "Jaemyung Lee, Wonyoung Park, and Sangsu Lee. 2021. Discovering the Design Challenges of Autonomous Vehicles through Exploring Scenarios via an Immersive Design Workshop. In Designing Interactive Systems Conference 2021. 322–338.",
      "doi": "10.1145/3461778.3462119"
    },
    {
      "text": "Shao-Kang Lo. 2008. The nonverbal communication functions of emoticons in computer-mediated communication. Cyberpsychology & behavior 11, 5 (2008), 595–597.",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Shamsi Iqbal, and Mary Czerwinski. 2017. How blocking distractions affects workplace focus and productivity. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers. 928–934.",
      "doi": "10.1145/3123024.3124558"
    },
    {
      "text": "A Mazzi. 1996. Alternative office structures for telecommuters. In Proceedings of Telecommuting’96 Conference.",
      "doi": ""
    },
    {
      "text": "Sanjeev Mehrotra, Wei-ge Chen, Zhengyou Zhang, and Philip A Chou. 2011. Realistic audio in immersive video conferencing. In 2011 IEEE International Conference on Multimedia and Expo. IEEE, 1–4.",
      "doi": "10.1109/ICME.2011.6012065"
    },
    {
      "text": "David E Morrison and David E Morrison. 1998. The search for a method: Focus groups and the development of mass communication research. Indiana University Press.",
      "doi": ""
    },
    {
      "text": "Katja Neureiter, Martin Murer, Verena Fuchsberger, and Manfred Tscheligi. 2013. Hand and eyes: how eye contact is linked to gestures in video conferencing. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. 127–132.",
      "doi": ""
    },
    {
      "text": "Gary M Olson and Judith S Olson. 2000. Distance matters. Human–computer interaction 15, 2-3 (2000), 139–178.",
      "doi": ""
    },
    {
      "text": "Kate Power. 2020. The COVID-19 pandemic has increased the care burden of women and families. Sustainability: Science, Practice and Policy 16, 1 (2020), 67–73.",
      "doi": ""
    },
    {
      "text": "Victoria Claire Rowe. 2009. Using video-stimulated recall as a basis for interviews: Some experiences from the field. Music education research 11, 4 (2009), 425–437.",
      "doi": ""
    },
    {
      "text": "Joshua S Rubinstein, David E Meyer, and Jeffrey E Evans. 2001. Executive control of cognitive processes in task switching.Journal of experimental psychology: human perception and performance 27, 4(2001), 763.",
      "doi": ""
    },
    {
      "text": "Anna Rudnicka, Joseph W Newbold, Dave Cook, Marta E Cecchinato, Sandy Gould, and AL Cox. 2020. Eworklife: Developing effective strategies for remote working during the COVID-19 pandemic. In Eworklife: developing effective strategies for remote working during the COVID-19 pandemic. The New Future of Work Online Symposium.",
      "doi": ""
    },
    {
      "text": "Banu Saatçi, Kaya Akyüz, Sean Rintel, and Clemens Nylandsted Klokmose. 2020. (Re) Configuring Hybrid Meetings: Moving from User-Centered Design to Meeting-Centered Design. Computer Supported Cooperative Work (CSCW) 29, 6 (2020), 769–794.",
      "doi": "10.1007/s10606-020-09385-x"
    },
    {
      "text": "Banu Saatçi, Roman Rädle, Sean Rintel, Kenton O’Hara, and Clemens Nylandsted Klokmose. 2019. Hybrid Meetings in the Modern Workplace: Stories of Success and Failure. In International Conference on Collaboration and Technology. Springer, 45–61.",
      "doi": ""
    },
    {
      "text": "In-geon Shin, Jin-min Seok, and Youn-kyung Lim. 2018. Too close and crowded: understanding stress on mobile instant messengers based on proxemics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": ""
    },
    {
      "text": "Tiago FAC Sigahi, Bruno C Kawasaki, Ivan Bolis, and Sandra N Morioka. 2021. A systematic review on the impacts of Covid-19 on work: Contributions and a path forward from the perspectives of ergonomics and psychodynamics of work. Human Factors and Ergonomics in Manufacturing & Service Industries (2021).",
      "doi": ""
    },
    {
      "text": "Ravinder Singh and Soumya Awasthi. 2020. Updated Comparative Analysis on Video Conferencing Platforms-Zoom, Google Meet, Microsoft Teams, WebEx Teams and GoToMeetings. EasyChair: The World for Scientists(2020), 1–9.",
      "doi": ""
    },
    {
      "text": "Anya Skatova, Ben Bedwell, Victoria Shipp, Yitong Huang, Alexandra Young, Tom Rodden, and Emma Bertenshaw. 2016. The role of ICT in office work breaks. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 3049–3060.",
      "doi": "10.1145/2858036.2858443"
    },
    {
      "text": "Klaas-Jan Stol, Paul Ralph, and Brian Fitzgerald. 2016. Grounded theory in software engineering research: a critical review and guidelines. In Proceedings of the 38th International Conference on Software Engineering. 120–131.",
      "doi": "10.1145/2884781.2884833"
    },
    {
      "text": "Na Sun, Xiying Wang, and Mary Beth Rosson. 2019. How Do Distance Learners Connect?. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300662"
    },
    {
      "text": "Maxim Sytch, Lindred Greer, 2020. Is your organization ready for permanent WFH?https://hbr. org/2020/08/is-your-organization-ready-for-permanent-wfh? ab= at_articlepage_relatedarticles_horizontal_slot1® istration= success (2020).",
      "doi": ""
    },
    {
      "text": "Amy Tan and Ahmet M Kondoz. 2008. Barriers to virtual collaboration. In CHI’08 Extended Abstracts on Human Factors in Computing Systems. 2045–2052.",
      "doi": ""
    },
    {
      "text": "Lennox Thomas, Julia MacMillan, Emilly McColl, C Hale, and S Bond. 1995. Comparison of focus group and individual interview methodology in examining patient satisfaction with nursing care. Social Sciences in Health 1, 4 (1995), 206–220.",
      "doi": ""
    },
    {
      "text": "Mariana Toniolo-Barrios and Leyland Pitt. 2021. Mindfulness and the challenges of working from home in times of crisis. Business horizons 64, 2 (2021), 189–197.",
      "doi": ""
    },
    {
      "text": "Lena Waizenegger, Brad McKenna, Wenjie Cai, and Taino Bendz. 2020. An affordance perspective of team collaboration and enforced working from home during COVID-19. European Journal of Information Systems 29, 4 (2020), 429–442.",
      "doi": ""
    },
    {
      "text": "Bin Wang, Yukun Liu, Jing Qian, and Sharon K Parker. 2021. Achieving effective remote working during the COVID-19 pandemic: A work design perspective. Applied psychology 70, 1 (2021), 16–59.",
      "doi": ""
    },
    {
      "text": "Nicole Yankelovich, William Walker, Patricia Roberts, Mike Wessler, Jonathan Kaplan, and Joe Provino. 2004. Meeting central: making distributed meetings more effective. In Proceedings of the 2004 ACM conference on Computer supported cooperative work. 419–428.",
      "doi": "10.1145/1031607.1031678"
    },
    {
      "text": "MinYoung Yoo, William Odom, and Arne Berger. 2021. Understanding Everyday Experiences of Reminiscence for People with Blindness: Practices, Tensions and Probing New Design Possibilities. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3411764.3445212"
    },
    {
      "text": "Rui Zhou, Jasmine Hentschel, and Neha Kumar. 2017. Goodbye text, hello emoji: Mobile communication on WeChat in China. In Proceedings of the 2017 CHI conference on human factors in computing systems. 748–759.",
      "doi": "10.1145/3025453.3025800"
    },
    {
      "text": "Zoom. Accessed 2021. Release notes for September 1, 2020. https://support.zoom.us/hc/en-us/articles/360048388632-New-Updates-for-September-1-2020.",
      "doi": ""
    },
    {
      "text": "Zoom. Accessed 2021. Zoom Virtual Background system requirements. https://support.zoom.us/hc/en-us/articles/360043484511.",
      "doi": ""
    }
  ]
}