{
  "doi": "10.1145/3491102.3517599",
  "title": "Expressive Auditory Gestures in a Voice-Based Pedagogical Agent",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2022,
  "badges": [],
  "abstract": "In this paper, we explore how expressive auditory gestures added to the speech of a pedagogical agent influence the human-agent relationship and learning outcomes. In a between-subjects experiment, 41 participants assumed the role of a tutor to teach a voice-based agent. The agent used either: expressive interjections (e.g.,“yay”, “hmm”, “oh”), brief expressive musical executions, or no auditory gestures at all (control condition), throughout the interaction. Overall, the results indicate that both gestures can positively affect the interaction, but in particular, interjections can significantly increase feelings of emotional rapport with the agent and enhance motivation in learners. The implications of our findings are discussed as our work adds to the understanding of conversational agent design and can be useful for education as well as other domains in which dialogue systems are used.",
  "authors": [
    {
      "name": "Jessy Ceha",
      "institution": "School of Computer Science, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366811",
      "orcid": "missing"
    },
    {
      "name": "Edith Law",
      "institution": "School of Computer Science, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659130921",
      "orcid": "0000-0002-7540-075X"
    }
  ],
  "references": [
    {
      "text": "Jaime C. Acosta and Nigel G. Ward. 2011. Achieving Rapport with Turn-by-Turn, User-Responsive Emotional Coloring. Speech Commun. 53, 9–10 (nov 2011), 1137–1148. https://doi.org/10.1016/j.specom.2010.11.006",
      "doi": "10.1016/j.specom.2010.11.006"
    },
    {
      "text": "Alan Agresti. 2010. Analysis of ordinal categorical data: Second Edition. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "James L. Alty, Dimitrios Rigas, and Paul Vickers. 2005. Music and speech in auditory interfaces: When is one mode more appropriate than another?. In International Conference on Auditory Display. 351–357.",
      "doi": ""
    },
    {
      "text": "Amazon. 2021. Speechcons (Interjections). https://developer.amazon.com/en-US/docs/alexa/custom-skills/speechcon-reference-interjections.html",
      "doi": ""
    },
    {
      "text": "Matthew P. Aylett, Yolanda Vazquez-Alvarez, and Skaiste Butkute. 2020. Creating Robot Personality: Effects of Mixing Speech and Semantic Free Utterances. In Companion of the 2020 ACM/IEEE International Conference on Human-Robot Interaction(Cambridge, United Kingdom) (HRI ’20). Association for Computing Machinery, New York, NY, USA, 110–112. https://doi.org/10.1145/3371382.3378330",
      "doi": "10.1145/3371382.3378330"
    },
    {
      "text": "Amy L. Baylor. 2011. The design of motivational agents and avatars. Educational Technology Research and Development 59, 2(2011), 291–300. https://doi.org/10.1007/s11423-011-9196-3",
      "doi": ""
    },
    {
      "text": "Amy L. Baylor and Soyoung Kim. 2009. Designing nonverbal communication for pedagogical agents: When less is more. Computers in Human Behavior 25, 2 (2009), 450–457. https://doi.org/10.1016/j.chb.2008.10.008",
      "doi": "10.1016/j.chb.2008.10.008"
    },
    {
      "text": "Pascal Belin, Robert J. Zatorre, and Pierre Ahad. 2002. Human temporal-lobe response to vocal sounds. Cognitive Brain Research 13, 1 (2002), 17–26. https://doi.org/10.1016/S0926-6410(01)00084-2",
      "doi": ""
    },
    {
      "text": "Aleksandra Cerekovic, Oya Aran, and Daniel Gatica-Perez. 2014. How do you like your virtual agent?: Human-agent interaction experience through nonverbal features and personality traits. In Park H.S., Salah A.A., Lee Y.J., Morency LP., Sheikh Y., Cucchiara R. (eds) Human Behavior Understanding. HBU 2014, Vol. 8749, Lecture Notes in Computer Science. Springer, Cham. https://doi.org/10.1007/978-3-319-11839-0_1",
      "doi": ""
    },
    {
      "text": "Aleksandra Cerekovic, Oya Aran, and Daniel Gatica-Perez. 2017. Rapport with Virtual Agents: What Do Human Social Cues and Personality Explain?IEEE Transactions on Affective Computing 8, 3 (2017), 382–395. https://doi.org/10.1109/TAFFC.2016.2545650",
      "doi": ""
    },
    {
      "text": "Catherine C. Chase, Doris B. Chin, Marily A. Oppezzo, and Daniel L. Schwartz. 2009. Teachable agents and the protégé effect: Increasing the effort towards learning. Journal of Science Education and Technology 18, 4 (2009), 334–352. https://doi.org/10.1007/s10956-009-9180-4",
      "doi": ""
    },
    {
      "text": "Richard E. Clark and Sunhee Choi. 2005. Five design principles for experiments on the effects of animated pedagogical agents. Journal of Educational Computing Research 32, 3 (2005), 209–225. https://doi.org/10.2190/7LRM-3BR2-44GW-9QQY",
      "doi": ""
    },
    {
      "text": "Michelle Cohn, Chun-Yen Chen, and Zhou Yu. 2019. A Large-Scale User Study of an Alexa Prize Chatbot: Effect of TTS Dynamism on Perceived Quality of Social Dialog. In Proceedings of the 20th Annual SIGdial Meeting on Discourse and Dialogue. Association for Computational Linguistics, Stockholm, Sweden, 293–306. https://doi.org/10.18653/v1/W19-5935",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 1985. Intrinsic motivation and self-determination in human behavior. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Pieter M. A. Desmet, Martijn H. Vastenburg, and Natalia Romero. 2016. Mood measurement with Pick-A-Mood: review of current methods and design of a pictorial self-report scale. Journal of Design Research 14, 3 (2016), 241–279.",
      "doi": ""
    },
    {
      "text": "David Duran. 2017. Learning-by-teaching. Evidence and implications as a pedagogical mechanism. Innovations in Education and Teaching International 54, 5(2017), 476–484. https://doi.org/10.1080/14703297.2016.1156011",
      "doi": ""
    },
    {
      "text": "Laura Ferreri and Laura Verga. 2016. Benefits of music on verbal learning and memory: How and when does it work?Music Perception: An Interdisciplinary Journal 34, 2 (2016), 167–182. https://www.jstor.org/stable/10.2307/26417442",
      "doi": ""
    },
    {
      "text": "Brandi N. Frisby. 2019. The influence of emotional contagion on student perceptions of instructor rapport, emotional support, emotion work, valence, and cognitive learning. Communication Studies 70, 4 (2019), 492–506. https://doi.org/10.1080/10510974.2019.1622584",
      "doi": ""
    },
    {
      "text": "Jonathan Gratch, Ning Wang, Jillian Gerten, Edward Fast, and Robin Duffy. 2007. Creating Rapport with Virtual Agents. In Proceedings of the 7th International Conference on Intelligent Virtual Agents (Paris, France) (IVA ’07). Springer-Verlag, Berlin, Heidelberg, 125–138. https://doi.org/10.1007/978-3-540-74997-4_12",
      "doi": "10.1007/978-3-540-74997-4_12"
    },
    {
      "text": "Ivan Gris Sepulveda. 2015. Physical engagement as a way to increase emotional rapport in interactions with embodied conversational agents. Ph.D. Dissertation. The University of Texas at El Paso.",
      "doi": ""
    },
    {
      "text": "Agneta Gulz, Magnus Haake, and Annika Silvervarg. 2011. Extending a Teachable Agent with a Social Conversation Module: Effects on Student Experiences and Learning. In Proceedings of the 15th International Conference on Artificial Intelligence in Education (Auckland, New Zealand) (AIED’11). Springer-Verlag, Berlin, Heidelberg, 106–114.",
      "doi": ""
    },
    {
      "text": "Agneta Gulz, Annika Silvervarg, and Björn Sjödén. 2010. Design for Off-Task Interaction - Rethinking Pedagogy in Technology Enhanced Learning. In Proceedings of the 2010 10th IEEE International Conference on Advanced Learning Technologies(ICALT ’10). IEEE Computer Society, USA, 204–206. https://doi.org/10.1109/ICALT.2010.63",
      "doi": "10.1109/ICALT.2010.63"
    },
    {
      "text": "Jiaxiong Hu, Yun Huang, Xiaozhu Hu, and Yingqing Xu. 2021. Enhancing the Perceived Emotional Intelligence of Conversational Agents through Acoustic Cues. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411763.3451660",
      "doi": ""
    },
    {
      "text": "Eun-Sook Jee, Yong-Jeon Jeong, Chong Hui Kim, and Hisato Kobayashi. 2010. Sound design for emotion and intention expression of socially interactive robots. Intelligent Service Robotics 3 (2010), 199–206. https://doi.org/10.1007/s11370-010-0070-7",
      "doi": ""
    },
    {
      "text": "Eun-Sook Jee, Chong Hui Kim, Soon-Young Park, and Kyung-Won Lee. 2007. Composition of Musical Sound Expressing an Emotion of Robot Based on Musical Factors. In RO-MAN 2007 - The 16th IEEE International Symposium on Robot and Human Interactive Communication. 637–641. https://doi.org/10.1109/ROMAN.2007.4415161",
      "doi": ""
    },
    {
      "text": "Eun-Sook Jee, Soon-Young Park, Chong Hui Kim, and Hisato Kobayashi. 2009. Composition of musical sound to express robot’s emotion with intensity and synchronized expression with robot’s behavior. In RO-MAN 2009 - The 18th IEEE International Symposium on Robot and Human Interactive Communication. 369–374. https://doi.org/10.1109/ROMAN.2009.5326258",
      "doi": ""
    },
    {
      "text": "Patrik N Juslin and Petri Laukka. 2003. Communication of emotions in vocal expression and music performance: Different channels, same code?Psychological bulletin 129, 5 (2003), 770.",
      "doi": ""
    },
    {
      "text": "Patrik N. Juslin and Petri Laukka. 2004. Expression, Perception, and Induction of Musical Emotions: A Review and a Questionnaire Study of Everyday Listening. Journal of New Music Research 33, 3 (2004), 217–238. https://doi.org/: 10.1080/0929821042000317813",
      "doi": ""
    },
    {
      "text": "Kurt Kraiger, J. Kevin Ford, and Eduardo Salas. 1993. Application of cognitive, skill-based, and affective theories of learning outcomes to new methods of training evaluation.Journal of Applied Psychology 78, 2 (1993), 311–328. https://doi.org/10.1037//0021-9010.78.2.311",
      "doi": ""
    },
    {
      "text": "David R. Krathwohl, Benjamin S. Bloom, and Bertram B Masia. 1964. Taxonomy of educational objectives, Handbook II: Affective domain. David McKay Company, Inc.",
      "doi": ""
    },
    {
      "text": "Jong-Eun Roselyn Lee, Clifford Nass, Scott Brenner Brave, Yasunori Morishima, Hiroshi Nakajima, and Ryota Yamada. 2007. The case for caring colearners: The effects of a computer-mediated colearner agent on trust and learning. Journal of Communication 57 (2007), 183–204. https://doi.org/10.1111/j.1460-2466.2007.00339.x",
      "doi": ""
    },
    {
      "text": "Krittaya Leelawong and Gautam Biswas. 2008. Designing Learning by Teaching Agents: The Betty’s Brain System. International Journal of Artificial Intelligence in Education 18, 3 (aug 2008), 181–208.",
      "doi": ""
    },
    {
      "text": "James Lester, Karl Branting, and Bradford Mott. 2004. Conversational agents. In The Practical Handbook of Internet Computing. Chapman & Hall CRC, London.",
      "doi": ""
    },
    {
      "text": "Tze Wei Liew, Nor Azan Mat Zin, and Noraidah Sahari. 2017. Exploring the Affective, Motivational and Cognitive Effects of Pedagogical Agent Enthusiasm in a Multimedia Learning Environment. Human-Centric Computing and Information Sciences 7, 1, Article 89 (dec 2017), 21 pages. https://doi.org/10.1186/s13673-017-0089-2",
      "doi": ""
    },
    {
      "text": "Nichola Lubold, Erin Walker, and Heather Pon-Barry. 2016. Effects of Voice-Adaptation and Social Dialogue on Perceptions of a Robotic Learning Companion. In The 11th ACM/IEEE International Conference on Human Robot Interaction (Christchurch, New Zealand) (HRI ‘16). IEEE Press, 255–262. https://doi.org/10.1109/HRI.2016.7451760",
      "doi": ""
    },
    {
      "text": "Nichola Lubold, Erin Walker, and Heather Pon-Barry. 2021. Effects of adapting to user pitch on rapport perception, behavior, and state with a social robotic learning companion. User Modeling and User-Adapted Interaction 31, 1 (2021), 35–73. https://doi.org/10.1007/s11257-020-09267-3",
      "doi": "10.1007/s11257-020-09267-3"
    },
    {
      "text": "Nicola Mammarella, Beth Fairfield, and Cesare Cornoldi. 2007. Does music enhance cognitive performance in healthy older adults? The Vivaldi effect. Aging Clinical and Experimental Research 19, 5 (2007), 394–399. https://doi.org/10.1007/BF03324720",
      "doi": ""
    },
    {
      "text": "Dominic W. Massaro. 2006. Embodied agents in language learning for children with language challenges. In Miesenberger K., Klaus J., Zagler W.L., Karshmer A.I. (eds) Computers Helping People with Special Needs. ICCHP 2006., Vol. 4061, Lecture Notes in Computer Science.Springer, Berlin, Heidelberg. https://doi.org/10.1007/11788713_118",
      "doi": ""
    },
    {
      "text": "Dominic W. Massaro, Ying Liu, Trevor H. Chen, and Charles Perfetti. 2006. A multilingual embodied conversational agent for tutoring speech and language learning. In Proceedings of the Ninth International Conference on Spoken Language Processing (Interspeech 2006 - ICSLP, September, Pittsburgh, PA). Universität Bonn, Bonn, Germany, 825–828.",
      "doi": ""
    },
    {
      "text": "David Maulsby, Saul Greenberg, and Richard Mander. 1993. Prototyping an Intelligent Agent through Wizard of Oz. In Proceedings of the INTERACT ‘93 and CHI ‘93 Conference on Human Factors in Computing Systems (Amsterdam, The Netherlands) (CHI ’93). Association for Computing Machinery, New York, NY, USA, 277–284. https://doi.org/10.1145/169059.169215",
      "doi": "10.1145/169059.169215"
    },
    {
      "text": "Peter McCullagh and J.A. Nelder. 1989. Generalized Linear Models. 2nd Ed.Chapman & Hall, London.",
      "doi": ""
    },
    {
      "text": "Michael Neff, Yingying Wang, Rob Abbott, and Marilyn Walker. 2010. Evaluating the effect of gesture and language on personality perception in conversational agents. In Allbeck J., Badler N., Bickmore T., Pelachaud C., Safonova A. (eds) Intelligent Virtual Agents. IVA 2010. Lecture Notes in Computer Science, Vol. 6356. Springer, Berlin, Heidelberg. https://doi.org/10.1007/978-3-642-15892-6_24",
      "doi": ""
    },
    {
      "text": "Andreea Niculescu, Betsy van Dijk, Anton Nijholt, Haizhou Li, and Swee Lan See. 2013. Making Social Robots More Attractive: The Effects of Voice Pitch, Humor and Empathy. International Journal of Social Robotics 5, 2 (2013), 171–191. https://doi.org/10.1007/s12369-012-0171-x",
      "doi": ""
    },
    {
      "text": "David Novick and Iván Gris. 2014. Building rapport between human and ECA: A pilot study. In Kurosu M. (eds) Human-Computer Interaction. Advanced Interaction Modalities and Techniques. HCI 2014. Lecture Notes in Computer Science, Vol. 8511. Springer, Cham. https://doi.org/10.1007/978-3-319-07230-2_45",
      "doi": ""
    },
    {
      "text": "Benjamin D. Nye, Arthur C. Graesser, and Xiangen Hu. 2014. AutoTutor and family: A review of 17 years of natural language tutoring. International Journal of Artificial Intelligence in Education 24 (2014), 427–469. https://doi.org/10.1007/s40593-014-0029-5",
      "doi": ""
    },
    {
      "text": "Amy Ogan, Samantha Finkelstein, Elijah Mayfield, Claudia D’Adamo, Noboru Matsuda, and Justine Cassell. 2012. ”Oh Dear Stacy!”: Social Interaction, Elaboration, and Learning with Teachable Agents. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ‘12). Association for Computing Machinery, New York, NY, USA, 39–48. https://doi.org/10.1145/2207676.2207684",
      "doi": "10.1145/2207676.2207684"
    },
    {
      "text": "Amy Ogan, Samantha Finkelstein, Erin Walker, Ryan Carlson, and Justine Cassell. 2012. Rudeness and Rapport: Insults and Learning Gains in Peer Tutoring. In Proceedings of the 11th International Conference on Intelligent Tutoring Systems (Chania, Crete, Greece) (ITS’12). Springer-Verlag, Berlin, Heidelberg, 11–21. https://doi.org/10.1007/978-3-642-30950-2_2",
      "doi": "10.1007/978-3-642-30950-2_2"
    },
    {
      "text": "Sébastien Paquette, Isabelle Peretz, and Pascal Belin. 2013. The “Musical Emotional Bursts”: a validated set of musical affect bursts to investigate auditory affective processing. Frontiers in Psychology 4, 509 (2013). https://doi.org/10.3389/fpsyg.2013.00509",
      "doi": ""
    },
    {
      "text": "Aditi Ramachandran, Chien-Ming Huang, Edward Gartland, and Brian Scassellati. 2018. Thinking Aloud with a Tutoring Robot to Enhance Learning. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction (Chicago, IL, USA) (HRI ‘18). Association for Computing Machinery, New York, NY, USA, 59–68. https://doi.org/10.1145/3171221.3171250",
      "doi": "10.1145/3171221.3171250"
    },
    {
      "text": "Rod D. Roscoe and Michelene T.H. Chi. 2007. Understanding tutor learning: Knowledge-building and knowledge-telling in peer tutors’ explanations and questions. Review of Educational Research 77, 4 (2007), 534–574.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2000. Intrinsic and extrinsic motivations: Classic definitions and new directions. Contemporary Educational Psychology 25, 1 (2000), 54–67. https://doi.org/10.1006/ceps.1999.1020",
      "doi": ""
    },
    {
      "text": "Martin Saerbeck, Tom Schut, Christoph Bartneck, and Maddy D. Janse. 2010. Expressive Robots in Education: Varying the Degree of Social Supportive Behavior of a Robotic Tutor. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ‘10). Association for Computing Machinery, New York, NY, USA, 1613–1622. https://doi.org/10.1145/1753326.1753567",
      "doi": "10.1145/1753326.1753567"
    },
    {
      "text": "Yuko Sasa and Véronique Auberge. 2014. Socio-affective interactions between a companion robot and elderly in a Smart Home context: prosody as the main vector of the ”socio-affective glue”. Speech Prosody 7(2014). https://doi.org/10.21437/SpeechProsody.2014-5",
      "doi": ""
    },
    {
      "text": "E. Glenn Schellenberg and Michael W. Weiss. 2013. Music and cognitive abilities. In The psychology of music, Diana Deutsch (Ed.). Elsevier Academic Press, 499–550. https://doi.org/10.1016/B978-0-12-381460-9.00012-2",
      "doi": ""
    },
    {
      "text": "Klaus R. Scherer. 1994. Affect Bursts. In Emotions: Essays on Emotion Theory, Joseph A. Sergeant Stephanie H. M. van Goozen, Nanne E. van de Poll (Ed.). Psychology Press, 175–208.",
      "doi": ""
    },
    {
      "text": "Michael Schmitz, Benedict C.O.F. Fehringer, and Mert Akbal. 2015. Expressing Emotions With Synthetic Affect Bursts. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (London, United Kingdom) (CHI PLAY ‘15). Association for Computing Machinery, New York, NY, USA, 91–95. https://doi.org/10.1145/2793107.2793139",
      "doi": "10.1145/2793107.2793139"
    },
    {
      "text": "Dale H. Schunk. 1991. Self-efficacy and academic motivation. Educational Psychologist 26, 3-4 (1991), 207–231.",
      "doi": ""
    },
    {
      "text": "Betty Tärning, Agneta Gulz, Magnus Haake, 2019. Instructing a teachable agent with low or high self-efficacy–does similarity attract?International Journal of Artificial Intelligence in Education 29, 1(2019), 89–121. https://doi.org/10.1007/s40593-018-0167-2",
      "doi": ""
    },
    {
      "text": "Linda Tickle-Degnen and Robert Rosenthal. 1990. The nature of rapport and its nonverbal correlates. Psychological Inquiry 1, 4 (1990), 285–293. https://doi.org/10.1207/s15327965pli0104_1",
      "doi": ""
    },
    {
      "text": "Pamela S. Tsang and Velma L. Velazquez. 1996. Diagnosticity and multidimensional subjective workload ratings. Ergonomics 39, 3 (1996), 358–381. https://doi.org/10.1080/00140139608964470",
      "doi": ""
    },
    {
      "text": "Robert J. Vallerand, Luc G. Pelletier, Marc R. Blais, Nathalie M. Briere, Caroline Senecal, and Evelyne F. Vallieres. 1992. The Academic Motivation Scale: A measure of intrinsic, extrinsic, and amotivation in education. Educational and Psychological Measurement 52, 4 (1992), 1003–1017. https://doi.org/10.1177/0013164492052004025",
      "doi": ""
    },
    {
      "text": "Michelle M.E. Van Pinxteren, Mark Pluymaekers, and Jos G.A.M. Lemmink. 2020. Human-like communication in conversational agents: a literature review and research agenda. Journal of Service Management 31, 2 (2020), 203–225. https://doi.org/10.1108/JOSM-06-2019-0175",
      "doi": ""
    },
    {
      "text": "Paul Vickers and James L. Alty. 2002. Using music to communicate computing information. Interacting with Computers 14, 5 (2002), 435–456. https://doi.org/10.1016/S0953-5438(02)00003-6",
      "doi": ""
    },
    {
      "text": "Symeon P. Vlachopoulos and Costas I. Karageorghis. 2005. Interaction of external, introjected, and identified regulation with intrinsic motivation in exercise: relationships with exercise enjoyment. Journal of Applied Biobehavioral Research 10, 2 (2005), 113–132. https://doi.org/10.1111/j.1751-9861.2005.tb00007.x",
      "doi": ""
    },
    {
      "text": "Wayne Ward, Ronald Cole, Daniel Bolaños, Cindy Buchenroth-Martin, Edward Svirsky, Sarel Van Vuuren, Timothy Weston, Jing Zheng, and Lee Becker. 2011. My Science Tutor: A Conversational Multimedia Virtual Tutor for Elementary School Science. ACM Transactions on Speech and Language Processing 7, 4 (2011), 1–29. https://doi.org/10.1145/1998384.1998392",
      "doi": "10.1145/1998384.1998392"
    },
    {
      "text": "Selma Yilmazyildiz, David Henderickx, Bram Vanderborght, Werner Verhelst, Eric Soetens, and Dirk Lefeber. 2013. Multi-modal emotion expression for affective human-robot interaction. In Proceedings of the Workshop on Affective Social Speech Signals (WASSS 2013), Grenoble, France.",
      "doi": ""
    },
    {
      "text": "Selma Yilmazyildiz, Robin Read, Tony Belpeame, and Werner Verhelst. 2016. Review of semantic-free utterances in social human–robot interaction. International Journal of Human-Computer Interaction 32, 1(2016), 63–85. https://doi.org/10.1080/10447318.2015.1093856",
      "doi": ""
    },
    {
      "text": "Jason C. Yip, Kiley Sobel, Xin Gao, Allison Marie Hishikawa, Alexis Lim, Laura Meng, Romaine Flor Ofiana, Justin Park, and Alexis Hiniker. 2019. Laughing is Scary, but Farting is Cute: A Conceptual Model of Children’s Perspectives of Creepy Technologies. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ‘19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300303",
      "doi": "10.1145/3290605.3300303"
    }
  ]
}