{
  "doi": "10.1145/3491102.3501841",
  "title": "HAExplorer: Understanding Interdependent Biomechanical Motions with Interactive Helical Axes",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "The helical axis is a common tool used in biomechanical modeling to parameterize the motion of rigid objects. It encodes an object’s rotation around and translation along a unique axis. Visualizations of helical axes have helped to make kinematic data tangible. However, the analysis process often remains tedious, especially if complex motions are examined. We identify multiple key challenges: the absence of interactive tools for the computation and handling of helical axes, visual clutter in axis representations, and a lack of contextualization. We solve these issues by providing the first generalized framework for kinematic analysis with helical axes. Axis sets can be computed on-demand, interactively filtered, and explored in multiple coordinated views. We iteratively developed and evaluated the HAExplorer with active biomechanics researchers. Our results show that the techniques we introduce open up the possibility to analyze non-planar, compound, and interdependent motion data.",
  "tags": [
    "helical axis",
    "contextualization",
    "focus and context",
    "biomechanics",
    "screw axis",
    "coordinated views"
  ],
  "authors": [
    {
      "name": "Pepe Eulzer",
      "institution": "Department of Computer Science, Friedrich-Schiller University of Jena, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240248",
      "orcid": "missing"
    },
    {
      "name": "Robert Rockenfeller",
      "institution": "Institute for Mathematics, University of Koblenz-Landau, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660177633",
      "orcid": "missing"
    },
    {
      "name": "Kai Lawonn",
      "institution": "Department of Computer Science, Friedrich-Schiller University of Jena, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87658814657",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ameet Aiyangar, Liying Zheng, William Anderst, and Xudong Zhang. 2017. Instantaneous Centers of Rotation for Lumbar Segmental Extension in Vivo. J. Biomech. 52(2017), 113–121. https://doi.org/10.1016/j.jbiomech.2016.12.021",
      "doi": ""
    },
    {
      "text": "Oluwalogbon O Akinnola, Vasiliki Vardakastani, and Angela E Kedgley. 2020. The effect of planar constraint on the definition of the wrist axes of rotation. J. Biomech. 113(2020), 110083. https://doi.org/10.1016/j.jbiomech.2020.110083",
      "doi": ""
    },
    {
      "text": "Feras Alsultan, Corrado Cescon, Alessandro Marco De Nunzio, Marco Barbero, Nicola R Heneghan, Alison Rushton, and Deborah Falla. 2019. Variability of the helical axis during active cervical movements in people with chronic neck pain. Clinic. Biomech. 62(2019), 50–57.",
      "doi": ""
    },
    {
      "text": "Myroslav Bachynskyi, Antti Oulasvirta, Gregorio Palmas, and Tino Weinkauf. 2014. Is motion capture-based biomechanical simulation valid for hci studies?: study and implications. In Proceedings of the 2014 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 3215–3224. https://doi.org/10.1145/2556288.2557027",
      "doi": "10.1145/2556288.2557027"
    },
    {
      "text": "Myroslav Bachynskyi, Gregorio Palmas, Antti Oulasvirta, Jürgen Steimle, and Tino Weinkauf. 2015. Performance and Ergonomics of Touch Surfaces: A Comparative Study using Biomechanical Simulation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, 1817–1826. https://doi.org/10.1145/2702123.2702607",
      "doi": "10.1145/2702123.2702607"
    },
    {
      "text": "Marco Barbero, Deborah Falla, Ron Clijsen, Filippo Ghirlanda, Alessandro Schneebeli, Markus J Ernst, and Corrado Cescon. 2017. Can parameters of the helical axis be measured reliably during active cervical movements?Musculoskeletal Science and Practice 27 (2017), 150–154. https://doi.org/10.1016/j.math.2016.10.008",
      "doi": ""
    },
    {
      "text": "Sabine Bauer and Dietrich Paulus. 2017. Computational Simulation as an Innovative Approach in Personalized Medicine. In Innovations in Spinal Deformities and Postural Disorders, Josette Bettany-Saltikov and Sanja Schreiber (Eds.). IntechOpen, London. https://doi.org/10.5772/intechopen.68835",
      "doi": ""
    },
    {
      "text": "Emily L Bishop, Jessica C Küpper, Ingrid R Fjeld, Gregor Kuntze, and Janet L Ronsky. 2018. Error reduction in the finite helical axis for knee kinematics. Computer Methods in Biomechanics and Biomedical Engineering 21, 2(2018), 186–193. https://doi.org/10.1080/10255842.2018.1435780",
      "doi": ""
    },
    {
      "text": "Rita Borgo, Johannes Kehrer, David HS Chung, Eamonn Maguire, Robert S Laramee, Helwig Hauser, Matthew Ward, and Min Chen. 2013. Glyph-based visualization: Foundations, Design Guidelines, Techniques and Applications. In Eurographics - State of the Art Reports, M. Sbert and L. Szirmay-Kalos (Eds.). The Eurographics Association, Geneva, 39–63. https://doi.org/10.2312/conf/EG2013/stars/039-063",
      "doi": ""
    },
    {
      "text": "Anton E. Bowden, Heather L. Guerin, Marta L. Villarraga, Avinash G. Patwardhan, and Jorge A. Ochoa. 2008. Quality of Motion Considerations in Numerical Analysis of Motion Restoring Implants of the Spine. Clinical Biomechanics 23, 5 (2008), 536–544. https://doi.org/10.1016/j.clinbiomech.2007.12.010",
      "doi": ""
    },
    {
      "text": "Elizabeth L Brainerd, David B Baier, Stephen M Gatesy, Tyson L Hedrick, Keith A Metzger, Susannah L Gilbert, and Joseph J Crisco. 2010. X-Ray Reconstruction of Moving Morphology (XROMM): Precision, Accuracy and Applications in Comparative Biomechanics Research. Journal of Experimental Zoology Part A: Ecological Genetics and Physiology 313, 5 (2010), 262–279. https://doi.org/10.1002/jez.589",
      "doi": ""
    },
    {
      "text": "Cynthia A. Brewer. 2021. ColorBrewer. Pennsylvania State University. Retrieved August 27, 2021 from https://colorbrewer2.org/",
      "doi": ""
    },
    {
      "text": "Kelly Caine. 2016. Local Standards for Sample Size at CHI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 981–992. https://doi.org/10.1145/2858036.2858498",
      "doi": "10.1145/2858036.2858498"
    },
    {
      "text": "Luke Campagnola. 2021. pyqtgraph. PyQtGraph. Retrieved August 27, 2021 from https://www.pyqtgraph.org/",
      "doi": ""
    },
    {
      "text": "Corrado Cescon, Marco Barbero, Marco Conti, Francesco Bozzetti, and Jeremy Lewis. 2019. Helical axis analysis to quantify humeral kinematics during shoulder rotation. Int. Biomech. 6, 1 (2019), 1–8. https://doi.org/10.1080/23335432.2019.1597642",
      "doi": ""
    },
    {
      "text": "Corrado Cescon, Erik Cattrysse, and Marco Barbero. 2014. Methodological Analysis of Finite Helical Axis Behavior in Cervical Kinematics. Journal of Electromyography and Kinesiology 24, 5 (2014), 628–635. https://doi.org/10.1016/j.jelekin.2014.05.004",
      "doi": ""
    },
    {
      "text": "Noshaba Cheema, Laura A. Frey-Law, Kourosh Naderi, Jaakko Lehtinen, Philipp Slusallek, and Perttu Hämäläinen. 2020. Predicting Mid-Air Interaction Movements and Fatigue Using Deep Reinforcement Learning. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 13 pages. https://doi.org/10.1145/3313831.3376701",
      "doi": "10.1145/3313831.3376701"
    },
    {
      "text": "Joseph J Crisco, James C Coburn, Douglas C Moore, Edward Akelman, Arnold-Peter C Weiss, and Scott W Wolfe. 2005. In Vivo Radiocarpal Kinematics and the Dart Thrower’s Motion. JBJS 87, 12 (2005), 2729–2740. https://doi.org/10.2106/JBJS.D.03058",
      "doi": ""
    },
    {
      "text": "Helmut Doleisch. 2007. SimVis: Interactive visual analysis of large and time-dependent 3D simulation data. In Winter Simulation Conference, Shane G Henderson, Bahar Biller, Ming hua Hsieh, and John Shortle (Eds.). IEEE, Washington, DC, 712–20. https://doi.org/10.1109/WSC.2007.4419665",
      "doi": ""
    },
    {
      "text": "Helmut Doleisch, Michael Mayer, Martin Gasser, Roland Wanker, and Helwig Hauser. 2004. Case Study: Visual Analysis of Complex, Time-Dependent Simulation Results of a Diesel Exhaust System. In VisSym. IEEE, Konstanz, Germany, 91–96.",
      "doi": ""
    },
    {
      "text": "Pierre-Michel Dugailly, Stéphane Sobczak, Victor Sholukha, Serge Van Sint Jan, Patrick Salvia, Véronique Feipel, and Marcel Rooze. 2010. In vitro 3D-Kinematics of the Upper Cervical Spine: Helical Axis and Simulation for Axial Rotation and Flexion Extension. Surg. Radiol. Anat. 32, 2 (2010), 141–151. https://doi.org/10.1007/s00276-009-0556-1",
      "doi": ""
    },
    {
      "text": "Arin M Ellingson, Vishal Yelisetti, Craig A Schulz, Gert Bronfort, Joseph Downing, Daniel F Keefe, and David J Nuckley. 2013. Instantaneous Helical Axis Methodology to Identify Aberrant Neck Motion. Clinic. Biomech. 28, 7 (2013), 731–735. https://doi.org/10.1016/j.clinbiomech.2013.07.006",
      "doi": ""
    },
    {
      "text": "Pepe Eulzer, Sabine Bauer, Francis Kilian, and Kai Lawonn. 2020. Visualization of Human Spine Biomechanics for Spinal Surgery. IEEE Trans. Vis. Comput. Graph. 27, 2 (2020), 700–710. https://doi.org/10.1109/TVCG.2020.3030388",
      "doi": ""
    },
    {
      "text": "Pepe Eulzer, Sandy Engelhardt, Nils Lichtenberg, Raffaele De Simone, and Kai Lawonn. 2019. Temporal Views of Flattened Mitral Valve Geometries. IEEE Trans. Vis. Comput. Graph. 26, 1 (2019), 971–980.",
      "doi": ""
    },
    {
      "text": "Pepe Eulzer, Monique Meuschke, Carsten M Klingner, and Kai Lawonn. 2021. Visualizing Carotid Blood Flow Simulations for Stroke Prevention. Comput. Graph. Forum 40, 3 (2021), 435–446. https://doi.org/10.1111/cgf.14319",
      "doi": ""
    },
    {
      "text": "Eveline S. Graf and Darren J. Stefanyshyn. 2012. The Shifting of the Torsion Axis of the Foot During the Stance Phase of Lateral Cutting Movements. Jo. of Biomech. 45, 15 (2012), 2680–2683. https://doi.org/10.1016/j.jbiomech.2012.08.025",
      "doi": ""
    },
    {
      "text": "Laura L Greaves, Carolyn Van Toen, Angela Melnyk, Lynn Koenig, Qingan Zhu, Stephen Tredwell, Kishore Mulpuri, and Peter A Cripton. 2009. Pediatric and Adult Three-Dimensional Cervical Spine Kinematics. Spine 34, 16 (2009), 1650–1657. https://doi.org/10.1097/BRS.0b013e3181ab65c6",
      "doi": ""
    },
    {
      "text": "Helena Grip, Gunnevi Sundelin, Björn Gerdle, and J. Stefan Karlsson. 2008. Cervical Helical Axis Characteristics and its Center of Rotation during Active Head and Upper Arm Movements — Comparisons of Whiplash-Associated Disorders, non-Specific Neck Pain and Asymptomatic Individuals. J. of Biomech. 41, 13 (2008), 2799–2805. https://doi.org/10.1016/j.jbiomech.2008.07.005",
      "doi": ""
    },
    {
      "text": "Helena Grip, Eva Tengman, and Charlotte K Häger. 2015. Dynamic knee stability estimated by finite helical axis methods during functional performance approximately twenty years after anterior cruciate ligament injury. J. Biomech. 48, 10 (2015), 1906–1914. https://doi.org/10.1016/j.jbiomech.2015.04.016",
      "doi": ""
    },
    {
      "text": "Takahiro Ishii, Yoshihiro Mukai, Noboru Hosono, Hironobu Sakaura, Yoshikazu Nakajima, Yoshinobu Sato, Kazuomi Sugamoto, and Hideki Yoshikawa. 2004. Kinematics of the Upper Cervical Spine in Rotation: in Vivo Three-Dimensional Analysis. Spine 29, 7 (2004), E139–E144. https://doi.org/10.1097/01.BRS.0000116998.55056.3C",
      "doi": ""
    },
    {
      "text": "Sujin Jang, Wolfgang Stuerzlinger, Satyajit Ambike, and Karthik Ramani. 2017. Modeling Cumulative Arm Fatigue in Mid-Air Interaction Based on Perceived Exertion and Kinetics of Arm Motion. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 3328–3339. https://doi.org/10.1145/3025453.3025523",
      "doi": "10.1145/3025453.3025523"
    },
    {
      "text": "Wolfgang Kabsch. 1976. A solution for the best rotation to relate two sets of vectors. Acta Crystallographica Section A 32, 5 (1976), 922–923. https://doi.org/10.1107/S0567739476001873",
      "doi": ""
    },
    {
      "text": "Daniel F Keefe, Marcus Ewert, William Ribarsky, and Remco Chang. 2009. Interactive coordinated multiple-view visualization of biomechanical motion data. IEEE Trans. Vis. Comput. Graph. 15, 6 (2009), 1383–1390. https://doi.org/10.1109/TVCG.2009.152",
      "doi": "10.1109/TVCG.2009.152"
    },
    {
      "text": "Daniel F Keefe, Trevor M O’Brien, David B Baier, Stephen M Gatesy, Elizabeth L Brainerd, and David H Laidlaw. 2008. Exploratory Visualization of Animal Kinematics using Instantaneous Helical Axes. Comput. Graph. Forum 27, 3 (2008), 863–870. https://doi.org/10.1111/j.1467-8659.2008.01218.x",
      "doi": "10.1111/j.1467-8659.2008.01218.x"
    },
    {
      "text": "Kyungyoon Kim, John V Carlis, and Daniel F Keefe. 2017. Comparison techniques utilized in spatial 3D and 4D data visualizations: A survey and future directions. Computers & Graphics 67(2017), 138–147.",
      "doi": "10.1016/j.cag.2017.05.005"
    },
    {
      "text": "Peter R Krekel, Charl P Botha, Edward R Valstar, Paul W de Bruin, Piet M Rozing, and Frits H Post. 2006. Interactive simulation and comparative visualisation of the bone-determined range of motion of the human shoulder. In Simulation und Visualisierung. SCS Publishing House e.V., Erlangen, Germany, 275–288.",
      "doi": ""
    },
    {
      "text": "Peter R. Krekel, Edward R. Valstar, Jurriaan H. De Groot, Frits H. Post, Rob G. H. H. Nelissen, and Charl P. Botha. 2010. Visual Analysis of Multi-Joint Kinematic Data. Comput. Graph. Forum 29(2010), 1123–1132.",
      "doi": "10.1111/j.1467-8659.2009.01681.x"
    },
    {
      "text": "Kai Lawonn and Bernhard Preim. 2016. Feature Lines for Illustrating Medical Surface Models: Mathematical Background and Survey. Springer, Cham, Chapter Visualization in Medicine and Life Sciences III, 93–132. https://doi.org/10.1007/978-3-319-24523-2_5",
      "doi": ""
    },
    {
      "text": "Kai Lawonn, Ivan Viola, Bernhard Preim, and Tobias Isenberg. 2018. A Survey of Surface-Based Illustrative Rendering for Visualization. Comput. Graph. Forum 37, 6 (2018), 205–234. https://doi.org/10.1111/cgf.13322",
      "doi": ""
    },
    {
      "text": "Mats Lind, Geoffrey P. Bingham, and Camilla Forsell. 2003. Metric 3D Structure in Visualizations. Information Visualization 2, 1 (2003), 51–57. https://doi.org/10.1057/palgrave.ivs.9500038",
      "doi": "10.1057/palgrave.ivs.9500038"
    },
    {
      "text": "Monique Meuschke, Samuel Voß, Oliver Beuing, Bernhard Preim, and Kai Lawonn. 2017. Combined Visualization of Vessel Deformation and Hemodynamics in Cerebral Aneurysms. IEEE Trans. Vis. Comput. Graph. 23(1) (2017), 761–770. https://doi.org/10.1109/TVCG.2016.2598795",
      "doi": "10.1109/TVCG.2016.2598795"
    },
    {
      "text": "M. Meuschke, S. Voß, O. Beuing, B. Preim, and K. Lawonn. 2017. Glyph-Based Comparative Stress Tensor Visualization in Cerebral Aneurysms. Comput. Graph. Forum 36, 3 (June 2017), 99–108. https://doi.org/10.1111/cgf.13171",
      "doi": ""
    },
    {
      "text": "Christina A Niosi, Qingan A Zhu, Derek C Wilson, Ory Keynan, David R Wilson, and Thomas R Oxland. 2006. Biomechanical Characterization of the Three-Dimensional Kinematic Behaviour of the Dynesys Dynamic Stabilization System: an in Vitro Study. European Spine Journal 15, 6 (2006), 913–922. https://doi.org/10.1007/s00586-005-0948-9",
      "doi": ""
    },
    {
      "text": "Gregorio Palmas, Myroslav Bachynskyi, Antti Oulasvirta, Hans-Peter Seidel, and Tina Weinkauf. 2014. MovExp: A versatile visualization tool for human-computer interaction studies with 3D performance and biomechanical data. IEEE Trans. Vis. Comput. Graph. 20, 12 (2014), 2359–2368. https://doi.org/10.1109/TVCG.2014.2346311",
      "doi": ""
    },
    {
      "text": "Tian-Xia Qiu, Ee-Chon Teo, Kim-Kheng Lee, Hong-Wan Ng, and Kai Yang. 2003. Validation of T10-T11 Finite Element Model and Determination of Instantaneous Axes of Rotations in Three Anatomical Planes. Spine 28, 24 (2003), 2694–2699. https://doi.org/10.1097/01.BRS.0000101424.24198.AC",
      "doi": ""
    },
    {
      "text": "Fabian Rengier, Amit Mehndiratta, Hendrik Von Tengg-Kobligk, Christian M Zechmann, Roland Unterhinninghofen, H-U Kauczor, and Frederik L Giesel. 2010. 3D printing based on imaging data: review of medical applications. International Journal of Computer Assisted Radiology and Surgery 5, 4(2010), 335–341. https://doi.org/10.1007/s11548-010-0476-x 2010",
      "doi": ""
    },
    {
      "text": "Jonathan C Roberts. 2007. State of the Art: Coordinated & Multiple Views in Exploratory Visualization. In Fifth International Conference on Coordinated and Multiple Views in Exploratory Visualization, Gennady Andrienko, Jonathan C Roberts, and Chris Weaver (Eds.). IEEE, Zurich, Switzerland, 61–71. https://doi.org/10.1109/CMV.2007.20",
      "doi": "10.1109/CMV.2007.20"
    },
    {
      "text": "George Robertson, Roland Fernandez, Danyel Fisher, Bongshin Lee, and John Stasko. 2008. Effectiveness of Animation in Trend Visualization. IEEE Trans. Vis. Comput. Graph. 14, 6 (2008), 1325–1332. https://doi.org/10.1109/TVCG.2008.125",
      "doi": "10.1109/TVCG.2008.125"
    },
    {
      "text": "Robert Rockenfeller, Maria Hammer, Julia Riede, Syn Schmitt, and Kai Lawonn. 2021. Intuitive Assessment of Modeled Lumbar Spinal Motion by Clustering and Visualization of Finite Helical Axes. Computers in Biology and Medicine 135 (2021), 104528. https://doi.org/10.1016/j.compbiomed.2021.104528",
      "doi": "10.1016/j.compbiomed.2021.104528"
    },
    {
      "text": "Timo Ropinski, Steffen Oeltze, and Bernhard Preim. 2011. Survey of glyph-based visualization techniques for spatial multivariate medical data. Computers & Graphics 35, 2 (2011), 392–401. https://doi.org/10.1016/j.cag.2011.01.011",
      "doi": "10.1016/j.cag.2011.01.011"
    },
    {
      "text": "David Schroeder, Fedor Korsakov, Carissa Mai-Ping Knipe, Lauren Thorson, Arin M Ellingson, David Nuckley, John Carlis, and Daniel F Keefe. 2014. Trend-Centric Motion Visualization: Designing and Applying a new Strategy for Analyzing Scientific Motion Collections. IEEE Trans. Vis. Comput. Graph. 20, 12 (2014), 2644–2653. https://doi.org/10.1109/TVCG.2014.2346451",
      "doi": ""
    },
    {
      "text": "Hassan Serhan, Devdatt Mhatre, Henri Defossez, and Christopher M. Bono. 2011. Motion-Preserving Technologies for Degenerative Lumbar Spine: The Past, Present, and Future Horizons. SAS Journal 5, 3 (2011), 75–89. https://doi.org/10.1016/j.esas.2011.05.001",
      "doi": ""
    },
    {
      "text": "Inge Söderkvist and Per-Åke Wedin. 1993. Determining the Movements of the Skeleton using Well-Configured Markers. J. Biomech. 26, 12 (1993), 1473–1477. https://doi.org/10.1016/0021-9290(93)90098-Y",
      "doi": ""
    },
    {
      "text": "C. W. Spoor and F. E. Veldpaus. 1980. Rigid Body Motion Calculated from Spatial Co-Ordinates of Markers. J. Biomech. 13(1980), 391–393.",
      "doi": ""
    },
    {
      "text": "Federico Temporiti, Roberta Furone, Corrado Cescon, Marco Barbero, and Roberto Gatti. 2019. Dispersion of helical axes during shoulder movements in young and elderly subjects. J. Biomech. 88(2019), 72–77. https://doi.org/10.1016/j.jbiomech.2019.03.018",
      "doi": ""
    },
    {
      "text": "Ricardo Manuel Millán Vaquero, Alexander Vais, Sean Dean Lynch, Jan Rzepecki, Karl-Ingo Friese, Christof Hurschler, and Franz-Erich Wolter. 2016. Helical Axis Data Visualization and Analysis of the Knee Joint Articulation. J. Biomech. Eng. 138, 9 (2016), 9 pages. https://doi.org/10.1115/1.4034005",
      "doi": ""
    },
    {
      "text": "Francesca E Wade, Lauren J Hickox, and Stephen J Piazza. 2020. Achilles tendon moment arms are similar when computed using a single fixed axis versus a moving instantaneous helical axis. J. Biomech. 109(2020), 109907. https://doi.org/10.1016/j.jbiomech.2020.109907",
      "doi": ""
    }
  ]
}