{
  "doi": "10.1145/3491102.3517677",
  "title": "Virtual Transcendent Dream: Empowering People through Embodied Flying in Virtual Reality",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "Flying dreams have the potential to evoke a feeling of empowerment (or self-efficacy, confidence in our ability to succeed) and self-transcendent experience (STE), which have been shown to contribute to an individual’s overall well-being. However, these exceptional dreaming experiences remain difficult to induce at will. Inspired by the potential of Virtual Reality (VR) to support profound emotional experiences, we explored if a VR flying interface with more embodied self-motion cues could contribute to the benefits associated with flying dreams (i.e., STE and empowerment). Our results indicated that a flying interface with more self-motion cues indeed better supported STE and empowerment. We derived several design considerations: obscurity, extraordinary light and supportive setting. Our results contribute to the discourse around design guidelines for self-transcendence and empowerment in VR, which may further be applied to the improvement of mental well-being.",
  "authors": [
    {
      "name": "Pinyao Liu",
      "institution": "School of Interactive Art & Technology, Simon Fraser University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235392",
      "orcid": "missing"
    },
    {
      "name": "Ekaterina R. Stepanova",
      "institution": "School of Interactive Arts and Technology, Simon Fraser University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658740496",
      "orcid": "0000-0002-1983-1512"
    },
    {
      "name": "Alexandra Kitson",
      "institution": "Interactive Arts & Technology, Simon Fraser University, Canada",
      "img": "/do/10.1145/contrib-99658739432/rel-imgonly/img_2107.jpg",
      "acmid": "99658739432",
      "orcid": "missing"
    },
    {
      "name": "Thecla Schiphorst",
      "institution": "School of Interactive Arts and Technology, Simon Fraser University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409594757",
      "orcid": "missing"
    },
    {
      "name": "Bernhard E. Riecke",
      "institution": "School of Interactive Arts + Technology (SIAT), Simon Fraser University, Canada",
      "img": "/do/10.1145/contrib-81100113270/rel-imgonly/bernhardriecke-hikingstawamuschief_small.jpg",
      "acmid": "81100113270",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ashu Adhikari, Abraham M. Hashemian, Thinh Nguyen-Vo, Ernst Kruijff, Markus von der Heyde, and Bernhard E. Riecke. 2021. Lean to Fly: Leaning-Based Embodied Flying can Improve Performance and User Experience in 3D Navigation. Frontiers in Virtual Reality 2 (2021), 1–20. https://doi.org/10.3389/frvir.2021.730334",
      "doi": ""
    },
    {
      "text": "Arthur Aron, Elaine N. Aron, and Danny Smollan. 1992. Inclusion of Other in the Self Scale and the structure of interpersonal closeness. Journal of Personality and Social Psychology 63, 4(1992), 596–612. https://doi.org/10.1037/0022-3514.63.4.596",
      "doi": ""
    },
    {
      "text": "Domna Banakou, Sameer Kishore, and Mel Slater. 2018. Virtually Being Einstein Results in an Improvement in Cognitive Task Performance and a Decrease in Age Bias. Frontiers in Psychology 9 (2018), 9–17. https://doi.org/10.3389/fpsyg.2018.00917",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1978. Self-efficacy: Toward a unifying theory of behavioral change. Advances in Behaviour Research and Therapy 1, 4 (Jan 1978), 139–161. https://doi.org/10.1016/0146-6402(78)90002-4",
      "doi": ""
    },
    {
      "text": "Deirdre Barrett. 1991. Flying dreams and lucidity: An empirical study of their relationship. Dreaming 1 (Jun 1991), 129–134. https://doi.org/10.1037/h0094325",
      "doi": ""
    },
    {
      "text": "Kenan Bektaş, Tyler Thrash, Mark A. van Raai, Patrik Künzler, and Richard Hahnloser. 2021. The systematic evaluation of an embodied control interface for virtual reality. PloS One 16, 12 (2021), e0259977. https://doi.org/10.1371/journal.pone.0259977",
      "doi": ""
    },
    {
      "text": "Costas Boletsis and Jarl Erik Cedergren. 2019. VR Locomotion in the New Era of Virtual Reality: An Empirical Comparison of Prevalent Techniques. Advances in Human-Computer Interaction 2019 (Apr 2019), e7420781. https://doi.org/10.1155/2019/7420781",
      "doi": ""
    },
    {
      "text": "Doug Bowman, Sabine Coquillart, Bernd Froehlich, Michitaka Hirose, Yoshifumi Kitamura, Kiyoshi Kiyokawa, and Wolfgang Stuerzlinger. 2008. 3D User Interfaces: New Directions and Perspectives. IEEE computer graphics and applications 28 (Nov 2008), 20–36. https://doi.org/10.1109/MCG.2008.109",
      "doi": ""
    },
    {
      "text": "Elizabeth Anne Buie. 2018. Exploring techno-spirituality: Design strategies for transcendent user experiences.",
      "doi": ""
    },
    {
      "text": "Kelly Bulkeley. 1995. Spiritual dreaming: a cross-cultural and historical journey. Paulist Press, New York.",
      "doi": ""
    },
    {
      "text": "Michelle Carr, Adam Haar, Judith Amores, Pedro Lopes, Guillermo Bernal, Tomás Vega, Oscar Rosello, Abhinandan Jain, and Pattie Maes. 2020. Dream engineering: Simulating worlds through sensory stimulation. Consciousness and Cognition 83 (Aug. 2020), 102–115. https://doi.org/10.1016/j.concog.2020.102955",
      "doi": ""
    },
    {
      "text": "Gilad Chen, Stanley M. Gully, and Dov Eden. 2001. Validation of a New General Self-Efficacy Scale. Organizational Research Methods 4, 1 (Jan 2001), 62–83. https://doi.org/10.1177/109442810141004",
      "doi": ""
    },
    {
      "text": "Alice Chirico, Francesco Ferrise, Lorenzo Cordella, and Andrea Gaggioli. 2018. Designing awe in virtual reality: An experimental study. Frontiers in psychology 8 (2018), 23–51.",
      "doi": ""
    },
    {
      "text": "Alice Chirico and Andrea Gaggioli. 2019. When Virtual Feels Real: Comparing Emotional Responses and Presence in Virtual and Natural Environments. Cyberpsychology, Behavior and Social Networking 22, 3 (Mar 2019), 220–226. https://doi.org/10.1089/cyber.2018.0393",
      "doi": ""
    },
    {
      "text": "Jay A. Conger and Rabindra N. Kanungo. 1988. The Empowerment Process: Integrating Theory and Practice. The Academy of Management Review 13, 3 (1988), 471–482. https://doi.org/10.2307/258093",
      "doi": ""
    },
    {
      "text": "Frederik van Eeden. 1913. Proceedings of the Society for Psychical Research. Vol. 26. Society for Psychical Research, London, 431–461.",
      "doi": ""
    },
    {
      "text": "Laura Ermi and Frans Mäyrä. 2005. Fundamental components of the gameplay experience: Analysing immersion. In DIGRA. DIGRA, Vancouver, Canada, 1–17.",
      "doi": ""
    },
    {
      "text": "Barbara L. Fredrickson, Michele M. Tugade, Christian E. Waugh, and Gregory R. Larkin. 2003. What good are positive emotions in crises? A prospective study of resilience and emotions following the terrorist attacks on the United States on September 11th, 2001. Journal of Personality and Social Psychology 84, 2 (Feb 2003), 365–376. https://doi.org/10.1037//0022-3514.84.2.365",
      "doi": ""
    },
    {
      "text": "Andrea Gaggioli, Alice Chirico, Stefano Triberti, and Giuseppe Riva. 2016. Transformative interactions: designing positive technologies to foster self-transcendence and meaning. Annual Review of Cybertherapy and Telemedicine 14 (2016), 169–175.",
      "doi": ""
    },
    {
      "text": "David R. Glowacki, Mark D. Wonnacott, Rachel Freire, Becca R. Glowacki, Ella M. Gale, James E. Pike, Tiu de Haan, Mike Chatziapostolou, and Oussama Metatla. 2020. Isness: Using Multi-Person VR to Design Peak Mystical Type Experiences Comparable to Psychedelics. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–14. https://doi.org/10.1145/3313831.3376649",
      "doi": "10.1145/3313831.3376649"
    },
    {
      "text": "Jarrod Gott, Leonore Bovy, Emma Peters, Sofia Tzioridou, Stefano Meo, Çağatay Demirel, Mahdad Jafarzadeh Esfahani, Pedro Reis Oliveira, Thomas Houweling, Alessandro Orticoni, Anke Rademaker, Diede Booltink, Rathiga Varatheeswaran, Carmen van Hooijdonk, Mahmoud Chaabou, Anastasia Mangiaruga, Erik van den Berge, Frederik D. Weber, Simone Ritter, and Martin Dresler. 2021. Virtual reality training of lucid dreaming. Philosophical Transactions of the Royal Society B: Biological Sciences 376, 1817 (Feb 2021), 201–217. https://doi.org/10.1098/rstb.2019.0697",
      "doi": ""
    },
    {
      "text": "Rinpoche Khenpo Tsultrim Gyamtso. 2001. Progressive stages of meditation on emptiness. Zhyisil Chokyi Ghatsal Publications, Auckland, N.Z.",
      "doi": ""
    },
    {
      "text": "Adam W. Hanley, Yoshio Nakamura, and Eric L. Garland. 2018. The Nondual Awareness Dimensional Assessment (NADA): New tools to assess nondual traits and states of consciousness occurring within and beyond the context of meditation. Psychological Assessment 30, 12 (Dec 2018), 1625–1639. https://doi.org/10.1037/pas0000615",
      "doi": ""
    },
    {
      "text": "L. Harris, M. Jenkin, and D.C. Zikovitz. 1999. Vestibular cues and virtual environments: choosing the magnitude of the vestibular cue. In Proceedings IEEE Virtual Reality (Cat. No. 99CB36316). IEEE, Houston, TX, USA, 229–236. https://doi.org/10.1109/VR.1999.756956",
      "doi": ""
    },
    {
      "text": "Abraham M. Hashemian, Matin Lotfaliei, Ashu Adhikari, Ernst Kruijff, and Bernhard E. Riecke. 2022. HeadJoystick: Improving Flying in VR Using a Novel Leaning-Based Interface. IEEE Transactions on Visualization and Computer Graphics 28, 4 (Apr 2022), 1792–1809. https://doi.org/10.1109/TVCG.2020.3025084",
      "doi": ""
    },
    {
      "text": "Harry T. Hunt. 1989. The multiplicity of dreams: memory, imagination, and consciousness. Yale University Press, New Haven.",
      "doi": ""
    },
    {
      "text": "C. G. JUNG. 1966. Collected Works of C.G. Jung, Volume 15: Spirit in Man, Art, And Literature. Princeton University Press, Princeton. http://www.jstor.org/stable/j.ctt5hhr2c",
      "doi": ""
    },
    {
      "text": "Dacher Keltner and Jonathan Haidt. 2003. Approaching awe, a moral, spiritual, and aesthetic emotion. Cognition and Emotion 17, 2 (Jan 2003), 297–314. https://doi.org/10.1080/02699930302297",
      "doi": ""
    },
    {
      "text": "Robert S Kennedy, Norman E Lane, Kevin S Berbaum, and Michael G Lilienthal. 1993. Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. The international journal of aviation psychology 3, 3 (1993), 203–220.",
      "doi": ""
    },
    {
      "text": "Konstantina Kilteni, Raphaela Groten, and Mel Slater. 2012. The Sense of Embodiment in Virtual Reality. Presence: Teleoperators and Virtual Environments 21, 4 (Nov 2012), 373–387. https://doi.org/10.1162/PRES_a_00124",
      "doi": "10.1162/PRES_a_00124"
    },
    {
      "text": "Alexandra Kitson, Alice Chirico, Andrea Gaggioli, and Bernhard E. Riecke. 2020. A Review on Research and Evaluation Methods for Investigating Self-Transcendence. Frontiers in Psychology 11 (2020), 1–27. https://doi.org/10.3389/fpsyg.2020.547687",
      "doi": ""
    },
    {
      "text": "Alexandra Kitson, Steve DiPaola, and Bernhard E. Riecke. 2019. Lucid Loop: A Virtual Deep Learning Biofeedback System for Lucid Dreaming Practice. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–6. https://doi.org/10.1145/3290607.3312952",
      "doi": ""
    },
    {
      "text": "Alexandra Kitson, Abraham M. Hashemian, Ekaterina R. Stepanova, Ernst Kruijff, and Bernhard E. Riecke. 2017. Comparing leaning-based motion cueing interfaces for virtual reality locomotion. In 2017 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, Los Angeles, CA, USA, 73–82. https://doi.org/10.1109/3DUI.2017.7893320",
      "doi": ""
    },
    {
      "text": "Alexandra Kitson and Bernhard E. Riecke. 2018. Can Lucid Dreaming Research Guide Self-Transcendent Experience Design in Virtual Reality?. In 2018 IEEE Workshop on Augmented and Virtual Realities for Good (VAR4Good). IEEE, Reutlingen, 1–4. https://doi.org/10.1109/VAR4GOOD.2018.8576889",
      "doi": ""
    },
    {
      "text": "Alexandra Kitson, Thecla Schiphorst, and Bernhard E. Riecke. 2018. Are You Dreaming?: A Phenomenological Study on Understanding Lucid Dreams as a Tool for Introspection in Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–12. https://doi.org/10.1145/3173574.3173917",
      "doi": "10.1145/3173574.3173917"
    },
    {
      "text": "Alexandra Kitson, Ekaterina R. Stepanova, Ivan A. Aguilar, Natasha Wainwright, and Bernhard E. Riecke. 2020. Designing Mind(set) and Setting for Profound Emotional Experiences in Virtual Reality. In Proceedings of the 2020 ACM Designing Interactive Systems Conference(DIS ’20). Association for Computing Machinery, New York, NY, USA, 655–668. https://doi.org/10.1145/3357236.3395560",
      "doi": "10.1145/3357236.3395560"
    },
    {
      "text": "Ernst Kruijff, Alexander Marquardt, Christina Trepkowski, Robert W Lindeman, Andre Hinkenjann, Jens Maiero, and Bernhard E Riecke. 2016. On your feet! Enhancing vection in leaning-based interfaces through multisensory stimuli. In Proceedings of the 2016 Symposium on Spatial User Interaction. ACM, NY, USA, 149–158.",
      "doi": "10.1145/2983310.2985759"
    },
    {
      "text": "E. Kruijff and B. Riecke. 2017. Navigation interfaces for virtual reality and gaming: Theory and practice. In VR. IEEE, Los Angeles, CA, USA, 433–434. https://doi.org/10.1109/VR.2017.7892362",
      "doi": ""
    },
    {
      "text": "Don Kuiken. 1995. Dreams and feeling realization.Dreaming 5, 3 (1995), 129–157. https://doi.org/10.1037/h0094431 129.",
      "doi": ""
    },
    {
      "text": "Don Kuiken. 2015. The contrasting effects of nightmares, existential dreams, and transcendent dreams.Routledge/Taylor & Francis Group, New York, NY, US, 174–187.",
      "doi": ""
    },
    {
      "text": "Don Kuiken, Ming-Ni Lee, Tracy Eng, and Terry Singh. 2006. The influence of impactful dreams on self-perceptual depth and spiritual transformation. Dreaming 16 (Dec 2006), 258–279. https://doi.org/10.1037/1053-0797.16.4.258",
      "doi": ""
    },
    {
      "text": "Dominik Käser, Evan Parker, and Matthias Bühlmann. 2016. Bringing Google earth to virtual reality. In ACM SIGGRAPH 2016 Talks(SIGGRAPH ’16). Association for Computing Machinery, New York, NY, USA, 1. https://doi.org/10.1145/2897839.2927441",
      "doi": "10.1145/2897839.2927441"
    },
    {
      "text": "Ben Lawson. 2014. Motion Sickness Symptomatology and Origins. Vol. 20143245. CRC Press, Florida, US, 531–600. http://www.crcnetbase.com/doi/abs/10.1201/b17360-29 ch 23.",
      "doi": ""
    },
    {
      "text": "Timothy Leary, Ralph Metzner, and Richard Alpert. 1971. The psychedelic experience : a manual based on the ’Tibetan book of the dead’. Academy Editions London (7 Holland St., W.8), N.Y. 94 pages.",
      "doi": ""
    },
    {
      "text": "Margaret Diane LeCompte and Jean J Schensul. 1999. Designing and conducting ethnographic research. Vol. 1. Rowman Altamira, Lanham, Maryland.",
      "doi": ""
    },
    {
      "text": "Jing-Jing Li, Kai Dou, Yu-Jie Wang, and Yan-Gang Nie. 2019. Why awe promotes prosocial behaviors? The mediating effects of future time perspective and self-transcendence meaning of life. Frontiers in psychology 10 (2019), 1–17.",
      "doi": ""
    },
    {
      "text": "Valerie Lander McCarthy, Lynne A Hall, Timothy N Crawford, and Jennifer Connelly. 2018. Facilitating self-transcendence: an intervention to enhance well-being in late life. Western journal of nursing research 40, 6 (2018), 854–873.",
      "doi": ""
    },
    {
      "text": "Claire Mitchell. 2019. An exploration of the unassisted gravity dream. European Journal for Qualitative Research in Psychotherapy 9 (Jun 2019), 60–71.",
      "doi": ""
    },
    {
      "text": "Lorelli S. Nowell, Jill M. Norris, Deborah E. White, and Nancy J. Moules. 2017. Thematic Analysis: Striving to Meet the Trustworthiness Criteria. International Journal of Qualitative Methods 16, 1 (Dec 2017), 1609406917733847. https://doi.org/10.1177/1609406917733847",
      "doi": ""
    },
    {
      "text": "Walter N. Pahnke and William A. Richards. 1966. Implications of LSD and experimental mysticism. Journal of Religion and Health 5, 3 (Jul 1966), 175–208. https://doi.org/10.1007/BF01532646",
      "doi": ""
    },
    {
      "text": "Randy Pausch, Jon Snoddy, Robert Taylor, Scott Watson, and Eric Haseltine. 1996. Disney’s Aladdin: first steps toward storytelling in virtual reality. In Proceedings of the 23rd annual conference on Computer graphics and interactive techniques(SIGGRAPH ’96). Association for Computing Machinery, New York, NY, USA, 193–203. https://doi.org/10.1145/237170.237257",
      "doi": "10.1145/237170.237257"
    },
    {
      "text": "Claudia Picard-Deland, Maude Pastor, Elizaveta Solomonova, Tyna Paquette, and Tore Nielsen. 2020. Flying dreams stimulated by an immersive virtual reality task. Consciousness and Cognition 83 (Aug. 2020), 102958. https://doi.org/10.1016/j.concog.2020.102958",
      "doi": ""
    },
    {
      "text": "José J Pizarro, Nekane Basabe, Itziar Fernández, Pilar Carrera, Pedro Apodaca, Carlos I Man Ging, Olaia Cusi, and Darío Páez. 2021. Self-transcendent emotions and their social effects: Awe, elevation and Kama Muta promote a human identification and motivations to help others. Frontiers in psychology 12 (2021), 1–17.",
      "doi": ""
    },
    {
      "text": "Denise Quesnel and Bernhard E Riecke. 2017. Awestruck: natural interaction with virtual reality on eliciting awe. In 2017 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, Los Angeles, CA, USA, 205–206.",
      "doi": ""
    },
    {
      "text": "Denise Quesnel and Bernhard E. Riecke. 2018. Are You Awed Yet? How Virtual Reality Gives Us Awe and Goose Bumps. Frontiers in Psychology 9 (2018), 1–22. https://doi.org/10.3389/fpsyg.2018.02158",
      "doi": ""
    },
    {
      "text": "Denise Quesnel, Ekaterina R Stepanova, Ivan A Aguilar, Patrick Pennefather, and Bernhard E Riecke. 2018. Creating AWE: artistic and scientific practices in research-based design for exploring a profound immersive installation. In 2018 IEEE Games, Entertainment, Media Conference (GEM). IEEE, Galway, Ireland, 1–207.",
      "doi": ""
    },
    {
      "text": "Max Rheiner. 2014. Birdly an attempt to fly. In ACM SIGGRAPH 2014 Emerging Technologies(SIGGRAPH ’14). Association for Computing Machinery, New York, NY, USA, 1. https://doi.org/10.1145/2614066.2614101",
      "doi": "10.1145/2614066.2614101"
    },
    {
      "text": "Bernhard E. Riecke. 2006. Simple user-generated motion cueing can enhance self-motion perception (Vection) in virtual reality. In Proceedings of the ACM symposium on Virtual reality software and technology(VRST ’06). Association for Computing Machinery, New York, NY, USA, 104–107. https://doi.org/10.1145/1180495.1180517",
      "doi": "10.1145/1180495.1180517"
    },
    {
      "text": "B. E. Riecke. 2011. Compelling Self-Motion Through Virtual Environments Without Actual Self-Motion – Using Self-Motion Illusions (”Vection”) to Improve User Experience in VR. In J. Kim (Ed.). In Virtual Reality, Jae-Jin Kim (Ed.). InTech, London, 149–176. http://www.intechopen.com/articles/show/title/compelling-self-motion-through-virtual-environments-without-actual-self-motion-using-self-motion-ill doi: 10.5772/553.",
      "doi": ""
    },
    {
      "text": "Bernhard E. Riecke. 2017. Could Virtual Reality Make us More Human?https://youtu.be/cMGOftEi4UU",
      "doi": ""
    },
    {
      "text": "Bernhard E. Riecke and Daniel Feuereissen. 2012. To move or not to move: can active control and user-driven motion cueing enhance self-motion perception (“vection”) in virtual reality?. In Proceedings of the ACM Symposium on Applied Perception(SAP ’12). Association for Computing Machinery, New York, NY, USA, 17–24. https://doi.org/10.1145/2338676.2338680",
      "doi": ""
    },
    {
      "text": "Bernhard E. Riecke and Jörg Schulte-Pelkum. 2015. An Integrative Approach to Presence and Self-Motion Perception Research. In Immersed in Media: Telepresence Theory, Measurement and Technology, Frank Biocca, Jonathan Freeman, Wijnand IJsselsteijn, Matthew Lombard, and Rachel Jones Schaevitz (Eds.). Springer. doi: 10.1007/978-3-319-10190-3_9, New York, 187–235. doi: 10.1007/978-3-319-10190-3_9.",
      "doi": ""
    },
    {
      "text": "Robin S. Rosenberg, Shawnee L. Baughman, and Jeremy N. Bailenson. 2013. Virtual Superheroes: Using Superpowers in Virtual Reality to Encourage Prosocial Behavior. PLOS ONE 8, 1 (Jan 2013), e55003. https://doi.org/10.1371/journal.pone.0055003",
      "doi": ""
    },
    {
      "text": "Nathan Arthur Semertzidis, Betty Sargeant, Justin Dwyer, Florian Floyd Mueller, and Fabio Zambetta. 2019. Towards Understanding the Design of Positive Pre-sleep Through a Neurofeedback Artistic Experience. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–14. https://doi.org/10.1145/3290605.3300804",
      "doi": "10.1145/3290605.3300804"
    },
    {
      "text": "Erik Sikström, Amalia de Götzen, and S. Serafin. 2015. Wings and flying in immersive VR — Controller type, sound effects and experienced ownership and agency. 2015 IEEE Virtual Reality (VR) 2 (2015), 281–282. https://doi.org/10.1109/VR.2015.7223405",
      "doi": ""
    },
    {
      "text": "Jennifer E Stellar, Amie M Gordon, Paul K Piff, Daniel Cordaro, Craig L Anderson, Yang Bai, Laura A Maruskin, and Dacher Keltner. 2017. Self-transcendent emotions and their social functions: Compassion, gratitude, and awe bind us to others through prosociality. Emotion Review 9, 3 (2017), 200–207.",
      "doi": ""
    },
    {
      "text": "Ekaterina R. Stepanova, Denise Quesnel, and Bernhard E. Riecke. 2019. Space—A Virtual Frontier: How to Design and Evaluate a Virtual Reality Experience of the Overview Effect. Frontiers in Digital Humanities 6 (April 2019), 7. https://doi.org/10.3389/fdigh.2019.00007",
      "doi": ""
    },
    {
      "text": "Ekaterina R. Stepanova, Denise Quesnel, and Bernhard E. Riecke. 2019. Understanding AWE: Can a Virtual Journey, Inspired by the Overview Effect, Lead to an Increased Sense of Interconnectedness?Frontiers in Digital Humanities 6 (2019), 1–21. https://doi.org/10.3389/fdigh.2019.00009",
      "doi": ""
    },
    {
      "text": "Keisuke Suzuki, Warrick Roseboom, David J. Schwartzman, and Anil K. Seth. 2017. A Deep-Dream Virtual Reality Platform for Studying Altered Perceptual Phenomenology. Scientific Reports 7, 1 (Nov. 2017), 15982. https://doi.org/10.1038/s41598-017-16316-2 Number: 1 Publisher: Nature Publishing Group.",
      "doi": ""
    },
    {
      "text": "Xin Tong, Alexandra Kitson, Mahsoo Salimi, Dave Fracchia, Diane Gromala, and Bernhard E. Riecke. 2016. Exploring embodied experience of flying in a virtual reality game with kinect. In 2016 IEEE International Workshop on Mixed Reality Art (MRA). IEEE, Greenville, SC, USA, 5–6. https://doi.org/10.1109/MIXRA.2016.7858996",
      "doi": ""
    },
    {
      "text": "Jay Vidyarthi and Bernhard Riecke. 2014. Interactively Mediating Experiences of Mindfulness Meditation. International Journal of Human-Computer Studies 72 (Aug 2014), 674–688. https://doi.org/10.1016/j.ijhcs.2014.01.006",
      "doi": "10.1016/j.ijhcs.2014.01.006"
    },
    {
      "text": "Frank White. 1998. The overview effect: Space exploration and human evolution. AIAA, Reston, Virginia, USA.",
      "doi": ""
    },
    {
      "text": "David B Yaden, Johannes C Eichstaedt, and John D Medaglia. 2018. The future of technology in positive psychology: methodological advances in the science of well-being. Frontiers in psychology 9 (2018), 962.",
      "doi": ""
    },
    {
      "text": "David Bryce Yaden, Jonathan Haidt, Ralph W. Hood, David R. Vago, and Andrew B. Newberg. 2017. The Varieties of Self-Transcendent Experience. Review of General Psychology 21, 2 (Jun 2017), 143–160. https://doi.org/10.1037/gpr0000102",
      "doi": ""
    },
    {
      "text": "David B Yaden, Jonathan Iwry, Kelley J Slack, Johannes C Eichstaedt, Yukun Zhao, George E Vaillant, and Andrew B Newberg. 2016. The overview effect: awe and self-transcendent experience in space flight.Psychology of Consciousness: Theory, Research, and Practice 3, 1(2016), 1.",
      "doi": ""
    },
    {
      "text": "David B. Yaden, Scott Barry Kaufman, Elizabeth Hyde, Alice Chirico, Andrea Gaggioli, Jia Wei Zhang, and Dacher Keltner. 2019. The development of the Awe Experience Scale (AWE-S): A multifactorial measure for a complex emotion. The Journal of Positive Psychology 14, 4 (Jul 2019), 474–488. https://doi.org/10.1080/17439760.2018.1484940",
      "doi": ""
    },
    {
      "text": "Yaying Zhang, Bernhard E. Riecke, Thecla Schiphorst, and Carman Neustaedter. 2019. Perch to Fly: Embodied Virtual Reality Flying Locomotion with a Flexible Perching Stance. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, San Diego CA USA, 253–264. https://doi.org/10.1145/3322276.3322357",
      "doi": "10.1145/3322276.3322357"
    },
    {
      "text": "Daniel Zielasko and Bernhard E. Riecke. 2021. To Sit or Not to Sit in VR: Analyzing Influences and (Dis)Advantages of Posture and Embodied Interaction. Computers 10, 6 (June 2021), 1–20. https://doi.org/10.3390/computers10060073 Number: 6 Publisher: Multidisciplinary Digital Publishing Institute.",
      "doi": ""
    }
  ]
}