{
  "doi": "10.1145/3491102.3517655",
  "title": "A Conversational Approach for Modifying Service Mashups in IoT Environments",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "Existing conversational approaches for Internet of Things (IoT) service mashup do not support modification because of the usability challenge, although it is common for users to modify the service mashups in IoT environments. To support the modification of IoT service mashups through conversational interfaces in a usable manner, we propose the conversational mashup modification agent (CoMMA). Users can modify IoT service mashups using CoMMA through natural language conversations. CoMMA has a two-step mashup modification interaction, an implicature-based localization step, and a modification step with a disambiguation strategy. The localization step allows users to easily search for a mashup by vocalizing their expressions in the environment. The modification step supports users to modify mashups by speaking simple modification commands. We conducted a user study and the results show that CoMMA is as effective as visual approaches in terms of task completion time and perceived task workload for modifying IoT service mashups.",
  "authors": [
    {
      "name": "Sanghoon Kim",
      "institution": "School of Computing, Korea Advanced Institute of Science and Technology (KAIST), Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237975",
      "orcid": "missing"
    },
    {
      "name": "In-Young Ko",
      "institution": "School of Computing, Korea Advanced Institute of Science and Technology (KAIST), Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100500303",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amazon. 2020. Create Alexa Routines for Smart Devices. Retrieved August 31, 2020 from https://www.amazon.com/gp/help/customer/display.html?nodeId=202200080",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for human-AI interaction. In Conference on Human Factors in Computing Systems - Proceedings. Association for Computing Machinery.",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Tawfiq Ammari, Jofish Kaye, Janice Y Tsai, and Frank Bentley. 2019. Music, Search, and IoT: How People (Really) Use Voice Assistants. ACM Transactions on Computer-Human Interaction (TOCHI) 26, 3(2019), 1–28.",
      "doi": "10.1145/3311956"
    },
    {
      "text": "Matthew P Aylett, Per Ola Kristensson, Steve Whittaker, and Yolanda Vazquez-Alvarez. 2014. None of a CHInd: Relationship Counselling for HCI and Speech Technology. In CHI’14 Extended Abstracts on Human Factors in Computing Systems. ACM, 749–760.",
      "doi": ""
    },
    {
      "text": "Frank Bentley, Chris Luvogt, Max Silverman, Rushani Wirasinghe, Brooke White, and Danielle Lottridge. 2018. Understanding the Long-Term Use of Smart Speaker Assistants. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 3 (2018), 91.",
      "doi": "10.1145/3264901"
    },
    {
      "text": "Marwa Boulakbech, Nizar Messai, Yacine Sam, Mohammad Hammoudeh, 2017. IoT Mashups: From IoT Big Data to IoT Big Service. In Proceedings of the International Conference on Future Networks and Distributed Systems. ACM, 20.",
      "doi": "10.1145/3102304.3102324"
    },
    {
      "text": "Dave Braines, Nick O’leary, Anna Thomas, Daniel Harborne, Alun Preece, and Will Webberley. 2017. Conversational Homes: A Uniform Natural Language Approach for Collaboration Among Humans and Devices. International Journal on Advances in Intelligent Systems 10, 3(2017), 223–237.",
      "doi": ""
    },
    {
      "text": "Dave Braines, Nick O’Leary, Anna Thomas, Daniel Harborne, Alun David Preece, and William M Webberley. 2017. Conversational Homes: A Uniform Natural Language Approach for Collaboration Among Humans and Devices. International Journal on Advances in Intelligent Systems 10, 3/4(2017), 223–237.",
      "doi": ""
    },
    {
      "text": "Julia Brich, Marcel Walch, Michael Rietzler, Michael Weber, and Florian Schaub. 2017. Exploring End User Programming Needs in Home Automation. ACM Transactions on Computer-Human Interaction 24, 2 (may 2017), 1–35.",
      "doi": "10.1145/3057858"
    },
    {
      "text": "John Brooke. 1996. SUS: a ‘quick and dirty’ usability. Usability Evaluation in Industry(1996), 189.",
      "doi": ""
    },
    {
      "text": "Rodney A Brooks. 1997. The Intelligent Room Project. In Proceedings Second International Conference on Cognitive Technology Humanizing the Information Age. IEEE, 271–278.",
      "doi": ""
    },
    {
      "text": "A.J. Bernheim Brush, Bongshin Lee, Ratul Mahajan, Sharad Agarwal, Stefan Saroiu, and Colin Dixon. 2011. Home Automation in the Wild: Challenges and Opportunities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 2115–2124.",
      "doi": "10.1145/1978942.1979249"
    },
    {
      "text": "Giovanni Campagna, Rakesh Ramesh, Silei Xu, Michael Fischer, and Monica S Lam. 2017. Almond: The Architecture of an Open, Crowdsourced, Privacy-Preserving, Programmable Virtual Assistant. In Proceedings of the 26th International Conference on World Wide Web. 341–350.",
      "doi": "10.1145/3038912.3052562"
    },
    {
      "text": "Yoonjeong Cha, Jincheul Jang, Younghyun Hong, and Mun Yong Yi. 2019. “Jack-of-All-Trades”: A Thematic Analysis of Conversational Agents in Multi-Device Collaboration Contexts. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3290607.3313045"
    },
    {
      "text": "Leigh Clark, Nadia Pantidi, Orla Cooney, Philip Doyle, Diego Garaialde, Justin Edwards, Brendan Spillane, Emer Gilmartin, Christine Murad, Cosmin Munteanu, Vincent Wade, and Benjamin R. Cowan. 2019. What Makes a Good Conversation? Challenges in Designing Truly Conversational Agents. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": "10.1145/3290605.3300705"
    },
    {
      "text": "Michael Coen, Luke Weisman, Kavita Thomas, and Marion Groh. 2000. A Context Sensitive Natural Language Modality for an Intelligent Room. In Proceedings of International Workshop on Managing Interactions in Smart Environments. Springer, 68–79.",
      "doi": ""
    },
    {
      "text": "Fulvio Corno, Luigi De Russis, and Alberto Monge Roffarello. 2017. A High-Level Approach Towards End User Development in the IoT. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA ’17. ACM Press, New York, New York, USA, 1546–1552.",
      "doi": "10.1145/3027063.3053157"
    },
    {
      "text": "Fulvio Corno, Luigi De Russis, and Alberto Monge Roffarello. 2020. HeyTAP: Bridging the Gaps Between Users’ Needs and Technology in IF-THEN Rules via Conversation. In Proceedings of the International Conference on Advanced Visual Interfaces. ACM, New York, NY, USA, 1–9.",
      "doi": "10.1145/3399715.3399905"
    },
    {
      "text": "Anind K Dey, Timothy Sohn, Sara Streng, and Justin Kodama. 2006. iCAP: Interactive Prototyping of Context-Aware Applications. In International Conference on Pervasive Computing. Springer, 254–271.",
      "doi": "10.1007/11748625_16"
    },
    {
      "text": "Giuseppe Ghiani, Marco Manca, Fabio Paternò, and Carmen Santoro. 2017. Personalization of Context-Dependent Applications Through Trigger-Action Rules. ACM Transactions on Computer-Human Interaction (TOCHI) 24, 2(2017), 1–33.",
      "doi": "10.1145/3057861"
    },
    {
      "text": "Google. 2020. Plan your day – Set up & manage Routines. Retrieved August 31, 2020 from https://support.google.com/googlenest/answer/7029585?co=GENIE.Platform%3DAndroid&hl=en",
      "doi": ""
    },
    {
      "text": "Herbert P Grice. 1975. Logic and conversation. Syntax and Semantics 3(1975), 41–58.",
      "doi": ""
    },
    {
      "text": "Dominique Guinard and Vlad Trifa. 2009. Towards the Web of Things : Web Mashups for Embedded Devices. In Workshop on Mashups, Enterprise Mashups and Lightweight Composition on the Web (MEM 2009). 1–8.",
      "doi": ""
    },
    {
      "text": "Dominique Guinard, Vlad Trifa, Stamatis Karnouskos, Patrik Spiess, and Domnic Savio. 2010. Interacting with the SOA-Based Internet of Things: Discovery, Query, Selection, and On-Demand Provisioning of Web Services. IEEE Transactions on Services Computing 3, 3 (2010), 223–235.",
      "doi": "10.1109/TSC.2010.3"
    },
    {
      "text": "Sandra G. Hart. 2006. Nasa-Task Load Index (NASA-TLX); 20 Years Later. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50, 9 (Oct 2006), 904–908.",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Advances in psychology. Vol. 52. Elsevier, 139–183.",
      "doi": ""
    },
    {
      "text": "Justin Huang and Maya Cakmak. 2015. Supporting Mental Model Accuracy in Trigger-Action Programming. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing(Osaka, Japan) (UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 215–225.",
      "doi": "10.1145/2750858.2805830"
    },
    {
      "text": "Ting-Hao Kenneth Huang, Amos Azaria, and Jeffrey P. Bigham. 2016. InstructableCrowd: Creating IF-THEN Rules via Conversations with the Crowd. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA ’16. ACM Press, New York, New York, USA, 1555–1562.",
      "doi": "10.1145/2851581.2892502"
    },
    {
      "text": "Janggwan Im, Seonghoon Kim, and Daeyoung Kim. 2013. IoT Mashup as a Service: Cloud-Based Mashup Service for the Internet of Things. In Proceedings of the 2013 IEEE International Conference on Services Computing. 462–469.",
      "doi": "10.1109/SCC.2013.68"
    },
    {
      "text": "Pranav Khadpe, Ranjay Krishna, Li Fei-Fei, Jeffrey T. Hancock, and Michael S. Bernstein. 2020. Conceptual Metaphors Impact Perceptions of Human-AI Collaboration. Proc. ACM Hum.-Comput. Interact. 4, CSCW2, Article 163 (oct 2020), 26 pages.",
      "doi": "10.1145/3415234"
    },
    {
      "text": "In-Young Ko, Han-Gyu Ko, Angel Jimenez Molina, and Jung-Hyun Kwon. 2016. SoIoT: Toward A User-Centric IoT-Based Service Framework. ACM Transactions on Internet Technology (TOIT) 16, 2 (2016), 8.",
      "doi": "10.1145/2835492"
    },
    {
      "text": "André Sousa Lago, João Pedro Dias, and Hugo Sereno Ferreira. 2020. Conversational Interface for Managing Non-trivial Internet-of-Things Systems. In International Conference on Computational Science. Springer, 384–397.",
      "doi": ""
    },
    {
      "text": "Josephine Lau, Benjamin Zimmerman, and Florian Schaub. 2018. Alexa, Are You Listening? Privacy Perceptions, Concerns and Privacy-Seeking Behaviors with Smart Speakers. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 102 (Nov. 2018), 31 pages.",
      "doi": "10.1145/3274371"
    },
    {
      "text": "Minha Lee. 2020. Speech Acts Redux: Beyond Request-Response Interactions. In Proceedings of the 2nd Conference on Conversational User Interfaces(CUI ’20). Association for Computing Machinery, New York, NY, USA, Article 13, 10 pages.",
      "doi": "10.1145/3405755.3406124"
    },
    {
      "text": "Toby Jia-Jun Li, Marissa Radensky, Justin Jia, Kirielle Singarajah, Tom M. Mitchell, and Brad A. Myers. 2019. PUMICE: A Multi-Modal Agent that Learns Concepts and Conditionals from Natural Language and Demonstrations. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 577–589.",
      "doi": "10.1145/3332165.3347899"
    },
    {
      "text": "Henry Lieberman, Hugo Liu, Push Singh, and Barbara Barry. 2004. Beating Common Sense into Interactive Applications. AI Magazine 25, 4 (2004), 63.",
      "doi": ""
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. ”Like Having a Really Bad PA”: The Gulf between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 5286–5297.",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Sarah Mennicken and Elaine M Huang. 2012. Hacking the Natural Habitat: An In-the-Wild Study of Smart Homes, Their Development, and the People Who Live in Them. In Pervasive Computing: 10th International Conference, Pervasive 2012, Newcastle, UK, June 18-22, 2012. Proceedings, Vol. 7319. Springer, 143.",
      "doi": "10.1007/978-3-642-31205-2_10"
    },
    {
      "text": "Xianghang Mi, Feng Qian, Ying Zhang, and XiaoFeng Wang. 2017. An Empirical Characterization of IFTTT: Ecosystem, Usage, and Performance. In Proceedings of the 2017 Internet Measurement Conference. ACM, New York, NY, USA, 398–404.",
      "doi": "10.1145/3131365.3131369"
    },
    {
      "text": "George Miller. 1956. The Magical Number Seven, Plus or Minus Two: Some Limits on Our Capacity for Processing Information. The Psychological Review 63 (1956), 81–97.",
      "doi": ""
    },
    {
      "text": "Sumaira S Minhas, Pedro Sampaio, and Nikolay Mehandjiev. 2012. A Framework for the Evaluation of Mashup Tools. In Proceedings of the 2012 IEEE Ninth International Conference on Services Computing. 431–438.",
      "doi": "10.1109/SCC.2012.19"
    },
    {
      "text": "Christine Murad, Cosmin Munteanu, Leigh Clark, and Benjamin R Cowan. 2018. Design Guidelines for Hands-Free Speech Interaction. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct. ACM, 269–276.",
      "doi": "10.1145/3236112.3236149"
    },
    {
      "text": "Chelsea Myers, Anushay Furqan, Jessica Nebolsky, Karina Caro, and Jichen Zhu. 2018. Patterns for How Users Overcome Obstacles in Voice User Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 1–7.",
      "doi": "10.1145/3173574.3173580"
    },
    {
      "text": "Mahda Noura, Sebastian Heil, and Martin Gaedke. 2018. GrOWTH: Goal-Oriented End User Development for Web of Things Devices. In International Conference on Web Engineering. Springer, 358–365.",
      "doi": ""
    },
    {
      "text": "Dave Randall. 2003. Living Inside a Smart Home: A Case Study. In Inside the Smart Home. Springer-Verlag, London, 227–246.",
      "doi": ""
    },
    {
      "text": "Luigi De Russis and Alberto Monge Roffarello. 2020. Personalizing IoT Ecosystems via Voice. In Proceedings of the 1st International Workshop on Empowering People in Dealing with Internet of Things Ecosystems co-located with International Conference on Advanced Visual Interfaces (EMPATHY@AVI 2020)(CEUR Workshop Proceedings, Vol. 2702). 37–40.",
      "doi": ""
    },
    {
      "text": "Samsung. 2020. Create an Automation. Retrieved August 31, 2020 from https://smartthings.developer.samsung.com/docs/smartapps/automation.html",
      "doi": ""
    },
    {
      "text": "Andrea Scarantino. 2017. How to Do Things with Emotional Expressions: The Theory of Affective Pragmatics. Psychological Inquiry 28, 2-3 (2017), 165–185.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2000. The Limits of Speech Recognition. Commun. ACM 43, 9 (2000), 63–65.",
      "doi": "10.1145/348941.348990"
    },
    {
      "text": "Blase Ur, Elyse McManus, Melwyn Pak Yong Ho, and Michael L. Littman. 2014. Practical Trigger-Action Programming in the Smart Home Blase. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14. ACM Press, New York, New York, USA, 803–812.",
      "doi": "10.1145/2556288.2557420"
    },
    {
      "text": "Marcel Walch, Michael Rietzler, Julia Greim, Florian Schaub, Björn Wiedersheim, and Michael Weber. 2013. homeBLOX: Making Home Automation Usable. In Proceedings of the 2013 ACM conference on Pervasive and ubiquitous computing adjunct publication - UbiComp ’13 Adjunct. ACM Press, 295–298.",
      "doi": "10.1145/2494091.2494182"
    },
    {
      "text": "Jong-bum Woo and Youn-kyung Lim. 2015. User Experience in Do-It-Yourself-Style Smart Homes. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing(Osaka, Japan) (UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 779–790.",
      "doi": ""
    },
    {
      "text": "Nicole Yankelovich, Gina-Anne Levow, and Matt Marx. 1995. Designing SpeechActs: Issues in Speech User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM Press/Addison-Wesley Publishing Co., 369–376.",
      "doi": "10.1145/223904.223952"
    },
    {
      "text": "Liping Zhao, Pericles Loucopoulos, Evangelia Kavakli, and Keletso J Letsholo. 2019. User Studies on End-User Service Composition: A Literature Review and a Design Framework. ACM Transactions on the Web (TWEB) 13, 3 (2019), 15.",
      "doi": ""
    }
  ]
}