{
  "doi": "10.1145/3491102.3502096",
  "title": "HydroMod : Constructive Modules for Prototyping Hydraulic Physical Interfaces",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "In recent years, actuators that handle fluids such as gases and liquids have been attracting attention for their applications in soft robots and shape-changing interfaces. In the field of HCI, there have been various inflatable prototyping tools that utilize air control, however, very few tools for liquid control have been developed. In this study, we propose HydroMod, new constructive modules that can easily generate liquid flow and programmatically control liquid flow, with the aim of lowering the barrier to entry for prototyping with liquids. HydroMod consists of palm-sized small modules, which can generate liquid flow with the electrohydrodynamics (EHD) phenomenon by simply connecting the modules. Moreover, users can configure and control the flow path by simply recombining the modules. In this paper, we propose the design of the modules, evaluate the performance of HydroMod as a fluid system, and also show the possible application scenarios of fluid prototyping using this system.",
  "tags": [
    "Toolkit",
    "Electrohydrodynamics",
    "Programmable Materials",
    "Prototyping",
    "Wearables",
    "Fluid Interface"
  ],
  "authors": [
    {
      "name": "Takafumi Morita",
      "institution": "The University of Tokyo, Japan",
      "img": "/do/10.1145/contrib-99660237673/rel-imgonly/morita_profile2-1_compressed.jpg",
      "acmid": "99660237673",
      "orcid": "0000-0002-8470-5352"
    },
    {
      "name": "Yu Kuwajima",
      "institution": "Smart Materials Lab., Shibaura Institute of Technology, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660184711",
      "orcid": "0000-0003-0971-0060"
    },
    {
      "name": "Ayato Minaminosono",
      "institution": "Smart Materials Lab., Shibaura Institution of Technology, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236444",
      "orcid": "0000-0002-0717-3727"
    },
    {
      "name": "Shingo Maeda",
      "institution": "Smart Materials Lab., Shibaura Institute of Technology, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659803619",
      "orcid": "0000-0002-9814-4533"
    },
    {
      "name": "Yasuaki Kakehi",
      "institution": "The University of Tokyo, Japan",
      "img": "/do/10.1145/contrib-81100527572/rel-imgonly/kakehiyasuaki.jpg",
      "acmid": "81100527572",
      "orcid": "0000-0003-4063-9944"
    }
  ],
  "references": [
    {
      "text": "[1] Programmable Air.2021. Retrieved August 27, 2021 from https://www.programmableair.com/.",
      "doi": ""
    },
    {
      "text": "[2] Arduino.2021. Retrieved August 27, 2021 from www.arduino.cc./.",
      "doi": ""
    },
    {
      "text": "P. Atten and J. Seyed-Yagoobi. 2003. Electrohydrodynamically induced dielectric liquid flow through pure conduction in point/plane geometry. IEEE Transactions on Dielectrics and Electrical Insulation 10, 1(2003), 27–36. https://doi.org/10.1109/TDEI.2003.1176555",
      "doi": ""
    },
    {
      "text": "Yoseph Bar-Cohen, T Xue, Mohsen Shahinpoor, Joycelyn S Harrison, and Joseph G Smith. 1998. Low-mass muscle actuators using electroactive polymers (EAP). In Smart Structures and Materials 1998: Smart Materials Technologies, Vol. 3324. International Society for Optics and Photonics, 218–223.",
      "doi": ""
    },
    {
      "text": "Ayah Bdeir and Ted Ullrich. 2010. Electronics as Material: LittleBits. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (Funchal, Portugal) (TEI ’11). Association for Computing Machinery, New York, NY, USA, 341–344. https://doi.org/10.1145/1935701.1935781",
      "doi": "10.1145/1935701.1935781"
    },
    {
      "text": "Vito Cacucciolo, Hiroyuki Nabae, Koichi Suzumori, and Herbert Shea. 2020. Electrically-Driven Soft Fluidic Actuators Combining Stretchable Pumps With Thin McKibben Muscles. Frontiers in Robotics and AI 6 (2020), 146. https://doi.org/10.3389/frobt.2019.00146",
      "doi": ""
    },
    {
      "text": "Vito Cacucciolo, Jun Shintake, Yu Kuwajima, Shingo Maeda, Dario Floreano, and Herbert Shea. 2019. Stretchable pumps for soft machines. Nature 572, 7770 (2019), 516–519. https://doi.org/10.1038/s41586-019-1479-6",
      "doi": ""
    },
    {
      "text": "J Darabi and K Ekula. 2003. Development of a chip-integrated micro cooling device. Microelectronics Journal 34, 11 (2003), 1067–1074. https://doi.org/10.1016/j.mejo.2003.09.010",
      "doi": ""
    },
    {
      "text": "Alexandra Delazio, Ken Nakagaki, Roberta L. Klatzky, Scott E. Hudson, Jill Fain Lehman, and Alanson P. Sample. 2018. Force Jacket: Pneumatically-Actuated Jacket for Embodied Haptic Experiences. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173894",
      "doi": "10.1145/3173574.3173894"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. InFORM: Dynamic Physical Affordances and Constraints through Shape and Object Actuation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 417–426. https://doi.org/10.1145/2501988.2502032",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Juri Fujii, Takuya Matsunobu, and Yasuaki Kakehi. 2018. COLORISE: Shape- and Color-Changing Pixels with Inflatable Elastomers and Interactions. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (Stockholm, Sweden) (TEI ’18). Association for Computing Machinery, New York, NY, USA, 199–204. https://doi.org/10.1145/3173225.3173228",
      "doi": "10.1145/3173225.3173228"
    },
    {
      "text": "Juri Fujii, Satoshi Nakamaru, and Yasuaki Kakehi. 2021. LayerPump: Rapid Prototyping of Functional 3D Objects with Built-in Electrohydrodynamics Pumps Based on Layered Plates. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction (Salzburg, Austria) (TEI ’21). Association for Computing Machinery, New York, NY, USA, Article 48, 7 pages. https://doi.org/10.1145/3430524.3442453",
      "doi": "10.1145/3430524.3442453"
    },
    {
      "text": "Emmanouil D Fylladitakis, Michael P Theodoridis, and Antonios X Moronis. 2014. Review on the history, research, and applications of electrohydrodynamics. IEEE Transactions on Plasma Science 42, 2 (2014), 358–375.",
      "doi": ""
    },
    {
      "text": "M Garrad, Gabor Soter, AT Conn, Helmut Hauser, and Jonathan Rossiter. 2019. A soft matter computer for soft robots. Science Robotics 4, 33 (2019).",
      "doi": ""
    },
    {
      "text": "Julian Goldman and Victoria Manganiello. 2020. Computer1.0. Retrieved August 27, 2021 from https://vimeo.com/22390871/.",
      "doi": ""
    },
    {
      "text": "Teng Han, Fraser Anderson, Pourang Irani, and Tovi Grossman. 2018. HydroRing: Supporting Mixed Reality Haptics Using Liquid Flow. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 913–925. https://doi.org/10.1145/3242587.3242667",
      "doi": "10.1145/3242587.3242667"
    },
    {
      "text": "Felix Heibeck, Basheer Tome, Clark Della Silva, and Hiroshi Ishii. 2015. UniMorph: Fabricating Thin Film Composites for Shape-Changing Interfaces. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology(Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 233–242. https://doi.org/10.1145/2807442.2807472",
      "doi": "10.1145/2807442.2807472"
    },
    {
      "text": "Donal Holland, Colette Abah, Marielena Velasco Enriquez, Maxwell Herman, Gareth Bennett, Emir Vela, and Conor Walsh. 2017. The Soft Robotics Toolkit: Strategies for Overcoming Obstacles to the Wide Dissemination of Soft-Robotic Hardware. IEEE Robotics & Automation Magazine PP (02 2017), 1–1. https://doi.org/10.1109/MRA.2016.2639067",
      "doi": ""
    },
    {
      "text": "Yuki Inoue, Yuichi Itoh, and Takao Onoye. 2018. TuVe: A Flexible Display with a Tube. In SIGGRAPH Asia 2018 Emerging Technologies (Tokyo, Japan) (SA ’18). Association for Computing Machinery, New York, NY, USA, Article 16, 2 pages. https://doi.org/10.1145/3275476.3275487",
      "doi": "10.1145/3275476.3275487"
    },
    {
      "text": "Majeed Kazemitabaar, Jason McPeak, Alexander Jiao, Liang He, Thomas Outing, and Jon E. Froehlich. 2017. MakerWear: A Tangible Approach to Interactive Wearable Creation for Children. Association for Computing Machinery, New York, NY, USA, 133–145. https://doi.org/10.1145/3025453.3025887",
      "doi": "10.1145/3025453.3025887"
    },
    {
      "text": "Yu Kuwajima, Hiroki Shigemune, Vito Cacucciolo, Matteo Cianchetti, Cecilia Laschi, and Shingo Maeda. 2017. Active suction cup actuated by ElectroHydroDynamics phenomenon. IEEE International Conference on Intelligent Robots and Systems 2017-Septe, September (2017), 470–475. https://doi.org/10.1109/IROS.2017.8202195",
      "doi": "10.1109/IROS.2017.8202195"
    },
    {
      "text": "Mannu Lambrichts, Jose Maria Tijerina, and Raf Ramakers. 2020. SoftMod: A Soft Modular Plug-and-Play Kit for Prototyping Electronic Systems. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction (Sydney NSW, Australia) (TEI ’20). Association for Computing Machinery, New York, NY, USA, 287–298. https://doi.org/10.1145/3374920.3374950",
      "doi": "10.1145/3374920.3374950"
    },
    {
      "text": "Cecilia Laschi. 2017. Octobot - A robot octopus points the way to soft robotics. IEEE Spectrum 54, 3 (2017), 38–43. https://doi.org/10.1109/MSPEC.2017.7864755",
      "doi": "10.1109/MSPEC.2017.7864755"
    },
    {
      "text": "Yuhu Liu, Satoshi Nishikawa, Young ah Seong, Ryuma Niiyama, and Yasuo Kuniyoshi. 2021. ThermoCaress: A Wearable Haptic Device with Illusory Moving Thermal Stimulation. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445777",
      "doi": "10.1145/3411764.3445777"
    },
    {
      "text": "[25] Makeblock.2021. Retrieved August 27, 2021 from https://www.makeblock.com/.",
      "doi": ""
    },
    {
      "text": "[26] Mbed.2021. Retrieved August 27, 2021 from https://os.mbed.com/.",
      "doi": ""
    },
    {
      "text": "[27] MESH.2021. Retrieved August 27, 2021 from https://meshprj.com/en/.",
      "doi": ""
    },
    {
      "text": "[28] Lego Mindstorms.2021. Retrieved August 27, 2021 from https://www.lego.com/en-us/themes/mindstorms/.",
      "doi": ""
    },
    {
      "text": "Hila Mor, Ken Nakagaki, Yu Tianyu, Benjamin Harvey Miller, Yichen Jia, and Hiroshi Ishii. 2020. Prototyping Interactive Fluidic Mechanisms. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction (Sydney NSW, Australia) (TEI ’20). Association for Computing Machinery, New York, NY, USA, 881–884. https://doi.org/10.1145/3374920.3374967",
      "doi": "10.1145/3374920.3374967"
    },
    {
      "text": "Hila Mor, Tianyu Yu, Ken Nakagaki, Benjamin Harvey Miller, Yichen Jia, and Hiroshi Ishii. 2020. Venous Materials: Towards Interactive Fluidic Mechanisms. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376129",
      "doi": "10.1145/3313831.3376129"
    },
    {
      "text": "Ken Nakagaki, Daniel Fitzgerald, Zhiyao (John) Ma, Luke Vink, Daniel Levine, and Hiroshi Ishii. 2019. InFORCE: Bi-Directional ‘Force’ Shape Display for Haptic Interaction. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (Tempe, Arizona, USA) (TEI ’19). Association for Computing Machinery, New York, NY, USA, 615–623. https://doi.org/10.1145/3294109.3295621",
      "doi": "10.1145/3294109.3295621"
    },
    {
      "text": "Kenichi Nakahara, Koya Narumi, Ryuma Niiyama, and Yoshihiro Kawahara. 2017. Electric phase-change actuator with inkjet printed flexible circuit for printable and integrated robot prototyping. In 2017 IEEE International Conference on Robotics and Automation (ICRA). 1856–1863. https://doi.org/10.1109/ICRA.2017.7989217",
      "doi": "10.1109/ICRA.2017.7989217"
    },
    {
      "text": "Ryosuke Nakayama, Ryo Suzuki, Satoshi Nakamaru, Ryuma Niiyama, Yoshihiro Kawahara, and Yasuaki Kakehi. 2019. MorphIO: Entirely Soft Sensing and Actuation Modules for Programming Shape Changes through Tangible Interaction. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 975–986. https://doi.org/10.1145/3322276.3322337",
      "doi": "10.1145/3322276.3322337"
    },
    {
      "text": "Ryuma Niiyama, Daniela Rus, and Sangbae Kim. 2014. Pouch Motors: Printable/inflatable soft actuators for robotics. In 2014 IEEE International Conference on Robotics and Automation (ICRA). 6332–6337. https://doi.org/10.1109/ICRA.2014.6907793",
      "doi": ""
    },
    {
      "text": "Ryuma Niiyama, Xu Sun, Cynthia Sung, Byoungkwon An, Daniela Rus, and Sangbae Kim. 2015. Pouch Motors: Printable Soft Actuators Integrated with Computational Design. Soft Robotics 2 (05 2015), 150508072946000. https://doi.org/10.1089/soro.2014.0023",
      "doi": ""
    },
    {
      "text": "Jifei Ou, Felix Heibeck, and Hiroshi Ishii. 2016. TEI 2016 Studio: Inflated Curiosity. In Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (Eindhoven, Netherlands) (TEI ’16). Association for Computing Machinery, New York, NY, USA, 766–769. https://doi.org/10.1145/2839462.2854119",
      "doi": "10.1145/2839462.2854119"
    },
    {
      "text": "Ahmed Ould El Moctar, Nadine Aubry, and John Batton. 2003. Electro-hydrodynamic micro-fluidic mixer. Lab on a Chip 3, 4 (2003), 273–280. https://doi.org/10.1039/b306868b",
      "doi": ""
    },
    {
      "text": "Ron Pelrine, Roy Kornbluh, Qibing Pei, and Jose Joseph. 2000. High-speed electrically actuated elastomers with strain greater than 100%. Science 287, 5454 (2000), 836–839.",
      "doi": ""
    },
    {
      "text": "[39] Raspberry Pi.2021. Retrieved August 27, 2021 from www.raspberrypi.org./.",
      "doi": ""
    },
    {
      "text": "William F. Pickard. 1963. Ion Drag Pumping. I. Theory. Journal of Applied Physics 34, 2 (1963), 246–250. https://doi.org/10.1063/1.1702592",
      "doi": ""
    },
    {
      "text": "William F. Pickard. 1963. Ion Drag Pumping. II. Experiment. Journal of Applied Physics 34, 2 (1963), 251–258. https://doi.org/10.1063/1.1702593",
      "doi": ""
    },
    {
      "text": "[42] Pneuduino.2021. Retrieved August 27, 2021 from https://pneuduino.org/.",
      "doi": ""
    },
    {
      "text": "Julius Popp. 2011. Bit.Flow. Retrieved August 27, 2021 from https://vimeo.com/22390871/.",
      "doi": ""
    },
    {
      "text": "Axel Richter and Hermann Sandmaier. 1990. An electrohydrodynamic micropump. In IEEE Proceedings on Micro Electro Mechanical Systems, An Investigation of Micro Structures, Sensors, Actuators, Machines and Robots.IEEE, New York, NY, USA, 99–104.",
      "doi": ""
    },
    {
      "text": "Tasuku Sato, Yoko Yamanishi, Vito Cacucciolo, Yu Kuwajima, Hiroki Shigemune, Matteo Cianchetti, Cecilia Laschi, and Shingo Maeda. 2017. Electrohydrodynamic conduction pump with asymmetrical electrode structures in the microchannels. Chemistry Letters 46, 7 (2017), 950–952.",
      "doi": ""
    },
    {
      "text": "Eric Schweikardt and Mark D. Gross. 2006. RoBlocks: A Robotic Construction Kit for Mathematics and Science Education. In Proceedings of the 8th International Conference on Multimodal Interfaces (Banff, Alberta, Canada) (ICMI ’06). Association for Computing Machinery, New York, NY, USA, 72–75. https://doi.org/10.1145/1180995.1181010",
      "doi": "10.1145/1180995.1181010"
    },
    {
      "text": "[47] Scratch.2021. Retrieved August 27, 2021 from https://scratch.mit.edu.",
      "doi": ""
    },
    {
      "text": "Yumeta Seki, Yu Kuwajima, Hiroki Shigemune, Yuhei Yamada, and Shingo Maeda. 2020. Optimization of the electrode arrangement and reliable fabrication of flexible ehd pumps. Journal of Robotics and Mechatronics 32, 5 (2020), 939–946.",
      "doi": ""
    },
    {
      "text": "Ali Shtarbanov. 2021. FlowIO Development Platform – the Pneumatic “Raspberry Pi” for Soft Robotics. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411763.3451513",
      "doi": "10.1145/3411763.3451513"
    },
    {
      "text": "Gabor Soter, Martin Garrad, Andrew Conn, Helmut Hauser, and Jonathan Rossiter. 2019. Skinflow: A soft robotic skin based on fluidic transmission. In IEEE International Conference on Soft Robotics (RoboSoft) 2019. Institute of Electrical and Electronics Engineers (IEEE), United States, 355–360. https://doi.org/10.1109/ROBOSOFT.2019.8722744 2019 IEEE International Conference on Soft Robotics, RoboSoft 2019 ; Conference date: 14-04-2019 Through 18-04-2019.",
      "doi": ""
    },
    {
      "text": "Wei Sun, Yanjun Chen, Simon Zhan, Teng Han, Feng Tian, Hongan Wang, and Xing-Dong Yang. 2021. RElectrode: A Reconfigurable Electrode For Multi-Purpose Sensing Based on Microfluidics. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445652",
      "doi": "10.1145/3411764.3445652"
    },
    {
      "text": "[52] Toio.2021. Retrieved August 27, 2021 from https://toio.io/.",
      "doi": ""
    },
    {
      "text": "Michael Wehner, Ryan Truby, Daniel Fitzgerald, Bobak Mosadegh, George Whitesides, Jennifer Lewis, and Robert Wood. 2016. An integrated design and fabrication strategy for entirely soft, autonomous robots. Nature 536 (08 2016), 451–455. https://doi.org/10.1038/nature19100",
      "doi": ""
    },
    {
      "text": "George M. Whitesides. 2006. The origins and the future of microfluidics. Nature 442(2006), 368–373. https://doi.org/10.1038/nature05058",
      "doi": ""
    },
    {
      "text": "Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: Pneumatically Actuated Soft Composite Materials for Shape Changing Interfaces. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 13–22. https://doi.org/10.1145/2501988.2502037",
      "doi": "10.1145/2501988.2502037"
    },
    {
      "text": "Dong Hyun Yoon, Hironobu Sato, Asahi Nakahara, Tetsushi Sekiguchi, Satoshi Konishi, and Shuichi Shoji. 2014. Development of an electrohydrodynamic ion-drag micropump using three-dimensional carbon micromesh electrodes. Journal of Micromechanics and Microengineering 24, 9 (jul 2014), 095003. https://doi.org/10.1088/0960-1317/24/9/095003",
      "doi": ""
    },
    {
      "text": "Shigeo Yoshida, Yuqian Sun, and Hideaki Kuzuoka. 2020. PoCoPo: Handheld Pin-Based Shape Display for Haptic Rendering in Virtual Reality. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376358",
      "doi": ""
    }
  ]
}