{
  "doi": "10.1145/3491102.3517530",
  "title": "Negative Emotions, Positive Outcomes? Exploring the Communication of Negativity in Serious Data Stories",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "Recent work has highlighted that emotion is key to the user experience with data stories. However, limited attention has been paid to negative emotions specifically. This work investigates the outcomes of negative emotions in the context of serious data stories and examines how they can be augmented by design methods from the perspectives of both storytellers and viewers. First, we conducted a workshop with 9 data story experts to understand the possible benefits of eliciting negative emotions in serious data stories and 19 potential design methods that contribute to negative emotions. Based on the findings from the workshop, we then conducted a lab study with 35 participants to explore the outcomes of eliciting negative emotions as well as the effectiveness of the design methods. The results indicated that negative emotions mainly facilitated contemplative experiences and long-term memory. Besides, the design methods showed varied effectiveness in augmenting negative emotions and being recalled.",
  "authors": [
    {
      "name": "Xingyu Lan",
      "institution": "Intelligent Big Data Visualization Lab, Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700963",
      "orcid": "missing"
    },
    {
      "name": "Yanqiu Wu",
      "institution": "Intelligent Big Data Visualization Lab, Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238643",
      "orcid": "missing"
    },
    {
      "name": "Yang Shi",
      "institution": "Intelligent Big Data Visualization Lab, Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556666156",
      "orcid": "missing"
    },
    {
      "name": "Qing Chen",
      "institution": "Intelligent Big Data Visualization Lab, Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659751949",
      "orcid": "missing"
    },
    {
      "name": "Nan Cao",
      "institution": "Intelligent Big Data Visualization Lab, Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320488328",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Basak Alper, Nathalie Henry Riche, Fanny Chevalier, Jeremy Boy, and Metin Sezgin. 2017. Visualization literacy at elementary school. In Proceedings of the 2017 CHI conference on human factors in computing systems. 5485–5497.",
      "doi": "10.1145/3025453.3025877"
    },
    {
      "text": "Fereshteh Amini, Nathalie Henry Riche, Bongshin Lee, Christophe Hurter, and Pourang Irani. 2015. Understanding data videos: Looking at narrative visualization through the cinematography lens. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1459–1468.",
      "doi": "10.1145/2702123.2702431"
    },
    {
      "text": "Cary L Anderson and Anthony C Robinson. 2021. Affective congruence in visualization design: influences on reading categorical maps. IEEE Transactions on Visualization and Computer Graphics (2021).",
      "doi": ""
    },
    {
      "text": "Joel Aronoff. 2006. How we recognize angry and happy emotion in people, places, and things. Cross-Cultural Research 40, 1 (2006), 83–105.",
      "doi": ""
    },
    {
      "text": "Benjamin Bach, Moritz Stefaner, Jeremy Boy, Steven Drucker, Lyn Bartram, Jo Wood, Paolo Ciuccarelli, Yuri Engelhardt, Ulrike Koeppen, and Barbara Tversky. 2018. Narrative design patterns for data-driven storytelling. In Data-driven storytelling. CRC Press, Boca Raton, FL, US, 107–133.",
      "doi": ""
    },
    {
      "text": "Lyn Bartram, Abhisekh Patra, and Maureen Stone. 2017. Affective color in visualization. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1364–1374.",
      "doi": "10.1145/3025453.3026041"
    },
    {
      "text": "Anne Bartsch. 2012. Emotional gratification in entertainment experience. Why viewers of movies and television series find it rewarding to experience emotions. Media Psychology 15, 3 (2012), 267–302.",
      "doi": ""
    },
    {
      "text": "Anne Bartsch and Tilo Hartmann. 2017. The role of cognitive and affective challenge in entertainment experience. Communication Research 44, 1 (2017), 29–53.",
      "doi": ""
    },
    {
      "text": "Anne Bartsch, Anja Kalch, and Mary Beth Oliver. 2014. Moved to think: The role of emotional media experiences in stimulating reflective thoughts.Journal of Media Psychology: Theories, Methods, and Applications 26, 3(2014), 125.",
      "doi": ""
    },
    {
      "text": "Scott Bateman, Regan L Mandryk, Carl Gutwin, Aaron Genest, David McDine, and Christopher Brooks. 2010. Useful junk? The effects of visual embellishment on comprehension and memorability of charts. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2573–2582.",
      "doi": ""
    },
    {
      "text": "BBC. 2020. Coronavirus: How can we imagine the scale of Covid’s death toll?https://www.bbc.co.uk/news/resources/idt-7464500a-6368-4029-aa41-ab94e0ee09fb.",
      "doi": ""
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall, and Tom Rodden. 2012. Uncomfortable interactions. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2005–2014.",
      "doi": "10.1145/2207676.2208347"
    },
    {
      "text": "Bloomberg. 2021. CEO Pay Ratio. https://www.bloomberg.com/graphics/ceo-pay-ratio/.",
      "doi": ""
    },
    {
      "text": "Julia Ayumi Bopp, Elisa D Mekler, and Klaus Opwis. 2016. Negative emotion, positive experience? Emotionally moving moments in digital games. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2996–3006.",
      "doi": ""
    },
    {
      "text": "Julia Ayumi Bopp, Klaus Opwis, and Elisa D Mekler. 2018. “An Odd Kind of Pleasure” Differentiating Emotional Challenge in Digital Games. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": ""
    },
    {
      "text": "Jeremy Boy, Anshul Vikram Pandey, John Emerson, Margaret Satterthwaite, Oded Nov, and Enrico Bertini. 2017. Showing people behind data: Does anthropomorphizing visualizations elicit more empathy for human rights data?. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 5462–5474.",
      "doi": "10.1145/3025453.3025512"
    },
    {
      "text": "Margaret M Bradley and Peter J Lang. 1994. Measuring emotion: the self-assessment manikin and the semantic differential. Journal of Behavior Therapy and Experimental Psychiatry 25, 1(1994), 49–59.",
      "doi": "10.1016/0005-7916%2894%2990063-9"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "James Brown, Kathrin Gerling, Patrick Dickinson, and Ben Kirman. 2015. Dead fun: uncomfortable interactions in a virtual reality game for coffins. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. ACM, New York, NY, USA, 475–480.",
      "doi": "10.1145/2793107.2810307"
    },
    {
      "text": "Buzzfeed. 2021. One Year, 500,000 Deaths. https://www.buzzfeednews.com/article/peteraldhous/covid19-update-deaths-victims-america-half-million.",
      "doi": ""
    },
    {
      "text": "Alberto Cairo. 2013. U.S. Gun Deaths and the Challenge of Uncertainty. http://www.peachpit.com/articles/article.aspx?p=2036558.",
      "doi": ""
    },
    {
      "text": "Alberto Cairo. 2019. How charts lie: Getting smarter about visual information. WW Norton & Company.",
      "doi": ""
    },
    {
      "text": "CarniDC. 2021. What does 425,000 Covid deaths sound like?https://twitter.com/CarniDC/status/1356267830560366595.",
      "doi": ""
    },
    {
      "text": "Sheelagh Carpendale, Nicholas Diakopoulos, Nathalie Henry Riche, and Christophe Hurter. 2016. Data-Driven Storytelling Dagstuhl Seminar. https://www.dagstuhl.de/no_cache/en/program/calendar/semhp/?semnr=16061.",
      "doi": ""
    },
    {
      "text": "Johns Hopkins Coronavirus Resource Center. 2020. COVID-19 Dashboard. https://coronavirus.jhu.edu/map.html.",
      "doi": ""
    },
    {
      "text": "Fanny Chevalier, Romain Vuillemot, and Guia Gali. 2013. Using concrete scales: A practical framework for effective visual depiction of complex measures. IEEE Transactions on Visualization and Computer Graphics 19, 12(2013), 2426–2435.",
      "doi": "10.1109/TVCG.2013.210"
    },
    {
      "text": "The Ocean Cleanup. 2021. River Plastic Emissions to the World’s Oceans. https://theoceancleanup.com/sources.",
      "doi": ""
    },
    {
      "text": "Michael Correll. 2019. Ethical dimensions of visualization research. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300418"
    },
    {
      "text": "Andy Cotgreave. 2014. Iraq’s Bloody Toll: control your message with title, colour and orientation. https://gravyanecdote.com/uncategorized/should-you-trust-a-data-visualisation/.",
      "doi": ""
    },
    {
      "text": "Evandro Damiao. 2018. One LGBT+ person is killed every day in Brazil. https://www.informationisbeautifulawards.com/showcase/3176-one-lgbt-person-is-killed-every-day-in-brazil.",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos, Funda Kivran-Swaine, and Mor Naaman. 2011. Playable data: characterizing the design space of game-y infographics. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1717–1726.",
      "doi": "10.1145/1978942.1979193"
    },
    {
      "text": "Catherine D’ignazio and Lauren F Klein. 2020. Data feminism. MIT press, Cambridge, MA, US.",
      "doi": ""
    },
    {
      "text": "Ana Figueiras. 2014. How to tell stories using visualization. In International Conference on Information Visualisation. IEEE, New York, NY, USA, 18–26.",
      "doi": ""
    },
    {
      "text": "Francis Gagnon. 2021. 500,000 dots is too many. https://chezvoila.com/blog/500k/.",
      "doi": ""
    },
    {
      "text": "Katerina Gorkovenko, Daniel J Burnett, James K Thorp, Daniel Richards, and Dave Murray-Rust. 2020. Exploring the future of data-driven product design. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376560"
    },
    {
      "text": "Chad Phoenix Rose Gowler and Ioanna Iacovides. 2019. ”Horror, guilt and shame”–Uncomfortable Experiences in Digital Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. ACM, New York, NY, USA, 325–337.",
      "doi": "10.1145/3311350.3347179"
    },
    {
      "text": "John Grippe. 2020. The Project Behind a Front Page Full of Names. https://www.nytimes.com/2020/05/23/reader-center/coronavirus-new-york-times-front-page.html.",
      "doi": ""
    },
    {
      "text": "James J Gross and Robert W Levenson. 1995. Emotion elicitation using films. Cognition & Emotion 9, 1 (1995), 87–108.",
      "doi": ""
    },
    {
      "text": "The Guardian. 2021. Beneath the Blue: Dive Into a Dazzling Ocean Under Threat. https://www.theguardian.com/environment/ng-interactive/2021/feb/23/beneath-the-blue-dive-into-a-dazzling-ocean-under-threat-interactive.",
      "doi": ""
    },
    {
      "text": "Kyle Wm Hall, Anthony Kouroupis, Anastasia Bezerianos, Danielle Albers Szafir, and Christopher Collins. 2021. Professional differences: A comparative study of visualization task performance and spatial ability across disciplines. IEEE Transactions on Visualization and Computer Graphics (2021).",
      "doi": ""
    },
    {
      "text": "Neil Halloran. 2016. The Fallen of World War II. https://www.youtube.com/watch?v=DwKPFT-RioU.",
      "doi": ""
    },
    {
      "text": "Lane Harrison, Drew Skau, Steven Franconeri, Aidong Lu, and Remco Chang. 2013. Influencing visual judgment through affective priming. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2949–2958.",
      "doi": "10.1145/2470654.2481410"
    },
    {
      "text": "Jeremy Heyer, Nirmal Kumar Raveendranath, and Khairi Reda. 2020. Pushing the (visual) narrative: the effects of prior knowledge elicitation in provocative topics. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376887"
    },
    {
      "text": "David C Howell. 2012. Statistical methods for psychology. Cengage Learning.",
      "doi": ""
    },
    {
      "text": "Jessica Hullman, Steven Drucker, Nathalie Henry Riche, Bongshin Lee, Danyel Fisher, and Eytan Adar. 2013. A deeper understanding of sequence in narrative visualization. IEEE Transactions on Visualization and Computer Graphics 19, 12(2013), 2406–2415.",
      "doi": "10.1109/TVCG.2013.119"
    },
    {
      "text": "Ya-Hsin Hung and Paul Parsons. 2018. Affective engagement for communicative visualization: quick and easy evaluation using survey instruments. In Proceedings of the IEEE Conference on Information Visualization, CommVis Workshop. IEEE, Berlin, Germany.",
      "doi": ""
    },
    {
      "text": "Ioanna Iacovides and Anna L Cox. 2015. Moving beyond fun: Evaluating serious experience in digital games. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2245–2254.",
      "doi": "10.1145/2702123.2702204"
    },
    {
      "text": "Connie Hanzhang Jin. 2021. COMIC: For My Job, I Check Death Tolls From COVID. Why Am I Numb To The Numbers?https://www.npr.org/sections/goatsandsoda/2021/04/25/987208356/comic-how-i-cope-with-pandemic-numbness.",
      "doi": ""
    },
    {
      "text": "Kantar. 2012. Information is Beautiful Awards. https://www.informationisbeautifulawards.com/showcase?page=1&type=awards.",
      "doi": ""
    },
    {
      "text": "Todd B Kashdan and Robert Biswas-Diener. 2014. The upside of your dark side: Why being your whole self–not just your” good” self–drives success and fulfillment. Penguin, London, UK.",
      "doi": ""
    },
    {
      "text": "Ai Kawakami, Kiyoshi Furukawa, Kentaro Katahira, and Kazuo Okanoya. 2013. Sad music induces pleasant emotion. Frontiers in Psychology 4 (2013), 311.",
      "doi": ""
    },
    {
      "text": "Helen Kennedy and Rosemary Lucy Hill. 2018. The feeling of numbers: Emotions in everyday engagements with data and their visualisation. Sociology 52, 4 (2018), 830–848.",
      "doi": ""
    },
    {
      "text": "Ethan Kerzner, Sarah Goodwin, Jason Dykes, Sara Jones, and Miriah Meyer. 2018. A framework for creative visualization-opportunities workshops. IEEE Transactions on Visualization and Computer Graphics 25, 1(2018), 748–758.",
      "doi": "10.1109/TVCG.2018.2865241"
    },
    {
      "text": "Ha-Kyung Kong, Zhicheng Liu, and Karrie Karahalios. 2018. Frames and slants in titles of visualizations on controversial topics. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3173574.3174012"
    },
    {
      "text": "Robert Kosara and Jock Mackinlay. 2013. Storytelling: The next step for visualization. Computer 46, 5 (2013), 44–50.",
      "doi": "10.1109/MC.2013.36"
    },
    {
      "text": "Richard A Krueger. 2014. Focus groups: A practical guide for applied research. Sage publications, Thousand Oaks, CA, US.",
      "doi": ""
    },
    {
      "text": "Richard A Krueger and Mary Anne Casey. 2002. Designing and conducting focus group interviews.",
      "doi": ""
    },
    {
      "text": "Xingyu Lan, Yang Shi, Yanqiu Wu, Xiaohan Jiao, and Nan Cao. 2021. Kineticharts: Augmenting Affective Expressiveness of Charts in Data Stories with Animation Design. IEEE Transactions on Visualization and Computer Graphics 28, 1(2021), 933–943.",
      "doi": "10.1109/TVCG.2021.3114775"
    },
    {
      "text": "Xingyu Lan, Yang Shi, Yueyao Zhang, and Nan Cao. 2021. Smile or Scowl Looking at Infographic Design Through the Affective Lens. IEEE Transactions on Visualization and Computer Graphics 27, 6(2021), 2796–2807.",
      "doi": ""
    },
    {
      "text": "Xingyu Lan, Xinyue Xu, and Nan Cao. 2021. Understanding Narrative Linearity for Telling Expressive Time-Oriented Stories. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–13.",
      "doi": "10.1145/3411764.3445344"
    },
    {
      "text": "Jason Lankow, Josh Ritchie, and Ross Crooks. 2012. Infographics: The power of visual storytelling. John Wiley & Sons, Hoboken, NJ, US.",
      "doi": ""
    },
    {
      "text": "Bongshin Lee, Nathalie Henry Riche, Petra Isenberg, and Sheelagh Carpendale. 2015. More than telling a story: Transforming data into visually shared stories. IEEE Transactions on Visualization and Computer Graphics 35, 5(2015), 84–90.",
      "doi": "10.1109/MCG.2015.99"
    },
    {
      "text": "Phoebe Lin and Jessica Van Brummelen. 2021. Engaging Teachers to Co-Design Integrated AI Curriculum for K-12 Classrooms. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3411764.3445377"
    },
    {
      "text": "Artur Lugmayr, Erkki Sutinen, Jarkko Suhonen, Carolina Islas Sedano, Helmut Hlavacs, and Calkin Suero Montero. 2017. Serious storytelling–a first definition and review. Multimedia Tools and Applications 76, 14 (2017), 15707–15733.",
      "doi": "10.1007/s11042-016-3865-5"
    },
    {
      "text": "Google Lupa. 2020. What if all Covid‑19 deaths in Brazil happened in your neighborhood?https://piaui.folha.uol.com.br/lupa/epicentro/en/.",
      "doi": ""
    },
    {
      "text": "Giorgia Lupi. n.d.. Imaging Mental Health in America. https://www.rand.org/about/nextgen/art-plus-data/giorgia-lupi/imaging-mental-health-in-america.html.",
      "doi": ""
    },
    {
      "text": "Joseph B Lyons and Tamera R Schneider. 2005. The influence of emotional intelligence on performance. Personality and individual differences 39, 4 (2005), 693–703.",
      "doi": ""
    },
    {
      "text": "Dan McCarey. 2019. Sepsin. http://sepsin.danmccarey.com/.",
      "doi": ""
    },
    {
      "text": "Michael Meder, Amon Rapp, Till Plumbaum, and Frank Hopfgartner. 2017. Data-driven gamification design. In Proceedings of the International Academic Mindtrek Conference. ACM, New York, NY, USA, 255–258.",
      "doi": "10.1145/3131085.3131116"
    },
    {
      "text": "Elisa D Mekler, Ioanna Iacovides, and Julia Ayumi Bopp. 2018. ” A Game that Makes You Question...” Exploring the Role of Reflection for the Player Experience. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. ACM, New York, NY, USA, 315–327.",
      "doi": ""
    },
    {
      "text": "Markus Montola. 2014. The positive negative experience in extreme role-playing. In The Foundation Stone of Nordic Larp. Knutpunkt, Toptryk Grafisk, Denmark, 153–167.",
      "doi": ""
    },
    {
      "text": "Luiz Morais, Yvonne Jansen, Nazareno Andrade, and Pierre Dragicevic. 2021. Can Anthropographics Promote Prosociality? A Review and Large-Sample Study. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–18.",
      "doi": "10.1145/3411764.3445637"
    },
    {
      "text": "NEXO. 2020. O cálculo de uma tragédia. https://www.nexojornal.com.br/especial/2020/08/08/100-mil-mortes-no-Brasil-o-c%C3%A1lculo-de-uma-trag%C3%A9dia.",
      "doi": ""
    },
    {
      "text": "Mary Beth Oliver and Anne Bartsch. 2010. Appreciation as audience response: Exploring entertainment gratifications beyond hedonism. Human Communication Research 36, 1 (2010), 53–81.",
      "doi": ""
    },
    {
      "text": "Mary Beth Oliver and Arthur A Raney. 2011. Entertainment as pleasurable and meaningful: Identifying hedonic and eudaimonic motivations for entertainment consumption. Journal of Communication 61, 5 (2011), 984–1004.",
      "doi": ""
    },
    {
      "text": "Anshul Vikram Pandey, Anjali Manivannan, Oded Nov, Margaret Satterthwaite, and Enrico Bertini. 2014. The persuasive power of data visualization. IEEE Transactions on Visualization and Computer Graphics 20, 12(2014), 2211–2220.",
      "doi": ""
    },
    {
      "text": "The Paper. 2019. 53027 Messages in the Internet Tree Hole: The Self-Help and Mutual Assistance of Desperate People. https://www.thepaper.cn/newsDetail_forward_4315606.",
      "doi": ""
    },
    {
      "text": "The Paper. 2020. one Million Deaths: How Covid Triggers a Global Tragedy. http://h5.thepaper.cn/html/zt/2020/09/ybw/index.html.",
      "doi": ""
    },
    {
      "text": "Deokgun Park, Steven M Drucker, Roland Fernandez, and Niklas Elmqvist. 2017. Atom: A grammar for unit visualizations. IEEE Transactions on Visualization and Computer Graphics 24, 12(2017), 3032–3043.",
      "doi": ""
    },
    {
      "text": "Evan M Peck, Sofia E Ayuso, and Omar El-Etr. 2019. Data is personal: Attitudes and perceptions of data visualization in rural pennsylvania. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3290605.3300474"
    },
    {
      "text": "Xiaolan Peng, Jin Huang, Alena Denisova, Hui Chen, Feng Tian, and Hongan Wang. 2020. A palette of deepened emotions: exploring emotional challenge in virtual reality games. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–13.",
      "doi": "10.1145/3313831.3376221"
    },
    {
      "text": "Periscopic. 2021. Lifelines: a pandemic undertow. https://lifelines.periscopic.com/.",
      "doi": ""
    },
    {
      "text": "Periscopic. n.d.. U.S. Gun Deaths. https://guns.periscopic.com/.",
      "doi": ""
    },
    {
      "text": "Washington Post. 2014. Do you know Africa?https://www.washingtonpost.com/wp-srv/special/world/do-you-know-africa/.",
      "doi": ""
    },
    {
      "text": "Washington Post. 2021. 500,000 dead, a number almost too large to grasp. https://www.washingtonpost.com/nation/interactive/2021/500000-covid-deaths-visualized/.",
      "doi": ""
    },
    {
      "text": "ProPublica. 2013. HeartSaver: An Experimental News Game. https://projects.propublica.org/graphics/heartsaver.",
      "doi": ""
    },
    {
      "text": "ProPublica. 2017. Lost Mothers. https://www.propublica.org/article/lost-mothers-maternal-health-died-childbirth-pregnancy.",
      "doi": ""
    },
    {
      "text": "Reuters. 2018. In Africa, A Virus Spreads. https://graphics.reuters.com/HEALTH-EBOLA-CONGO/010081G62NR/index.html.",
      "doi": ""
    },
    {
      "text": "Reuters. 2018. Oil spilled at sea. http://fingfx.thomsonreuters.com/gfx/rngs/OIL-SPILLS/010060SL1GQ/index.html.",
      "doi": ""
    },
    {
      "text": "Reuters. 2019. Drowning in Plastic. https://graphics.reuters.com/ENVIRONMENT-PLASTIC/0100B275155/index.html.",
      "doi": ""
    },
    {
      "text": "Reuters. 2021. The pace of death. https://graphics.reuters.com/HEALTH-CORONAVIRUS/DEATHS/xlbpgobgapq/index.html.",
      "doi": ""
    },
    {
      "text": "Bahador Saket, Alex Endert, and John Stasko. 2016. Beyond usability and performance: A review of user experience-focused evaluations in visualization. In Proceedings of the Workshop on Beyond Time and Errors on Novel Evaluation Methods for Visualization. ACM, New York, NY, USA, 133–142.",
      "doi": "10.1145/2993901.2993903"
    },
    {
      "text": "Simon Scarr. n.d.. Iraq’s Bloody Toll. http://www.simonscarr.com/iraqs-bloody-toll/.",
      "doi": ""
    },
    {
      "text": "Holger Schramm and Werner Wirth. 2010. Exploring the paradox of sad-film enjoyment: The role of multiple appraisals and meta-appraisals. Poetics 38, 3 (2010), 319–335.",
      "doi": ""
    },
    {
      "text": "SCMP. 2020. How the coronavirus spread in Hong Kong. https://multimedia.scmp.com/culture/article/SCMP-printed-graphics-memory/lonelyGraphics/202004A256.html.",
      "doi": ""
    },
    {
      "text": "Edward Segel and Jeffrey Heer. 2010. Narrative visualization: Telling stories with data. IEEE Transactions on Visualization and Computer Graphics 16, 6(2010), 1139–1148.",
      "doi": "10.1109/TVCG.2010.179"
    },
    {
      "text": "Claude Elwood Shannon. 1948. A mathematical theory of communication. The Bell System Technical Journal 27, 3 (1948), 379–423.",
      "doi": ""
    },
    {
      "text": "Danqing Shi, Fuling Sun, Xinyue Xu, Xingyu Lan, David Gotz, and Nan Cao. 2021. AutoClips: An Automatic Approach to Video Generation from Data Facts. In Computer Graphics Forum, Vol. 40. Wiley Online Library, 495–505.",
      "doi": ""
    },
    {
      "text": "Danqing Shi, Xinyue Xu, Fuling Sun, Yang Shi, and Nan Cao. 2020. Calliope: Automatic visual data story generation from a spreadsheet. IEEE Transactions on Visualization and Computer Graphics 27, 2(2020), 453–463.",
      "doi": ""
    },
    {
      "text": "Yang Shi, Xingyu Lan, Jingwen Li, Zhaorui Li, and Nan Cao. 2021. Communicating with Motion: A Design Space for Animated Visual Narratives in Data Videos. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–13.",
      "doi": "10.1145/3411764.3445337"
    },
    {
      "text": "Stephen Osserman Shirley Wu. 2020. People of the Pandemic. https://peopleofthepandemicgame.com/.",
      "doi": ""
    },
    {
      "text": "Samuel Sinyangwe. 2021. Mapping Police Violence. https://mappingpoliceviolence.org/.",
      "doi": ""
    },
    {
      "text": "David Sprague and Melanie Tory. 2012. Exploring how and why people use visualizations in casual contexts: Modeling user goals and regulated motivations. Information Visualization 11, 2 (2012), 106–123.",
      "doi": "10.1177/1473871611433710"
    },
    {
      "text": "Charles D Stolper, Bongshin Lee, Nathalie Henry Riche, and John Stasko. 2016. Emerging and recurring data-driven storytelling techniques: Analysis of a curated collection of recent stories. Technical Report MSR-TR-2016-14. Microsoft.",
      "doi": ""
    },
    {
      "text": "Sigma team. 2020. Sigma Awards. https://sigmaawards.org/.",
      "doi": ""
    },
    {
      "text": "New York Times. 2019. Are You Rich? This Income-Rank Quiz Might Change How You See Yourself. https://www.nytimes.com/interactive/2019/08/01/upshot/are-you-rich.html.",
      "doi": ""
    },
    {
      "text": "New York Times. 2020. How Bad Is Unemployment? ‘Literally Off the Charts’. https://www.nytimes.com/interactive/2020/05/08/business/economy/april-jobs-report.html.",
      "doi": ""
    },
    {
      "text": "New York Times. 2020. How the Virus Won. https://www.nytimes.com/interactive/2020/us/coronavirus-spread.html?smid=tw-nytimes&smtyp=cur.",
      "doi": ""
    },
    {
      "text": "New York Times. 2020. An Incalculable Loss. https://www.nytimes.com/interactive/2020/05/24/us/us-coronavirus-deaths-100000.html.",
      "doi": ""
    },
    {
      "text": "New York Times. 2021. On the Front Page, a Wall of Grief. https://www.nytimes.com/2021/02/21/insider/covid-500k-front-page.html, https://www.nytimes.com/interactive/2021/01/27/us/us-coronavirus-deaths-rate.html.",
      "doi": ""
    },
    {
      "text": "Patricia Valdez and Albert Mehrabian. 1994. Effects of color on emotions.Journal of Experimental Psychology: General 123, 4 (1994), 394.",
      "doi": ""
    },
    {
      "text": "Vox. 2021. Who has died from Covid-19 in the US?https://www.vox.com/22252693/covid-19-deaths-us-who-died.",
      "doi": ""
    },
    {
      "text": "Yun Wang, Adrien Segal, Roberta Klatzky, Daniel F Keefe, Petra Isenberg, Jörn Hurtienne, Eva Hornecker, Tim Dwyer, and Stephen Barrass. 2019. An emotional response to the value of visualization. IEEE Computer Graphics and Applications 39, 5 (2019), 8–17.",
      "doi": "10.1109/MCG.2019.2923483"
    },
    {
      "text": "Zezhong Wang, Shunming Wang, Matteo Farinella, Dave Murray-Rust, Nathalie Henry Riche, and Benjamin Bach. 2019. Comparing effectiveness and engagement of data comics and infographics. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3290605.3300483"
    },
    {
      "text": "David Watson, Lee Anna Clark, and Auke Tellegen. 1988. Development and validation of brief measures of positive and negative affect: the PANAS scales.Journal of Personality and Social Psychology 54, 6(1988), 1063.",
      "doi": ""
    },
    {
      "text": "Wordstream. n.d.. Do You Know Who’s Watching You?https://visual.ly/community/Infographics/technology/do-you-know-whos-watching-you.",
      "doi": ""
    },
    {
      "text": "Leni Yang, Xian Xu, XingYu Lan, Ziyan Liu, Shunan Guo, Yang Shi, Huamin Qu, and Nan Cao. 2021. A Design Space for Applying the Freytag’s Pyramid Structure to Data Stories. IEEE Transactions on Visualization and Computer Graphics 28, 1(2021), 922–932.",
      "doi": "10.1109/TVCG.2021.3114774"
    },
    {
      "text": "Dolf Zillmann, James B Weaver, Norbert Mundorf, and Charles F Aust. 1986. Effects of an opposite-gender companion’s affect to horror on distress, delight, and attraction.Journal of Personality and Social Psychology 51, 3(1986), 586–594.",
      "doi": ""
    }
  ]
}