{
  "doi": "10.1145/3491102.3517638",
  "title": "The Digital Landscape of Nudging: A Systematic Literature Review of Empirical Research on Digital Nudges",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "Research output related to digital nudging has increased ten-fold over the last five years. Nudging in the digital realm differs from its analog counterpart in important ways. For instance, online, choice architectures can be interconnected and personalized using real time data. In the face of this development, it is crucial to understand the current state of the literature and to map out possible research gaps. This paper addresses this issue and provides a systematic review of empirical studies where digital nudges have been evaluated. The systematic review covers 73 peer-reviewed papers containing 109 separate studies where 231 digital nudges have been evaluated. Our results lead to nine open research questions to be addressed in the future by the research community.",
  "authors": [
    {
      "name": "Kristoffer Bergram",
      "institution": "Institute of Information Management, University of Neuchâtel, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234968",
      "orcid": "0000-0002-2576-0159"
    },
    {
      "name": "Marija Djokovic",
      "institution": "Institute of Information Management, University of Neuchâtel, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237876",
      "orcid": "missing"
    },
    {
      "name": "Valéry Bezençon",
      "institution": "Institute of Management, University of Neuchâtel, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233198",
      "orcid": "0000-0002-1670-3179"
    },
    {
      "name": "Adrian Holzer",
      "institution": "Institute of Information Management, University of Neuchâtel, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81300146901",
      "orcid": "0000-0001-7946-1552"
    }
  ],
  "references": [
    {
      "text": "Olga Abramova. 2020. What’s in a name: Examining discrimination on sharing platforms and its possible remedies. In Proceedings of ECIS’20. AIS, Marrakech, Marocco, 1–17.",
      "doi": ""
    },
    {
      "text": "Martin Adam and Mario Pecorelli. 2018. Recommendations in augmented reality applications – The effect of customer reviews and seller recommendations on purchase in¬tention and product selection. In Proceedings of ECIS’18. AIS, Portsmouth, UK, 1–19.",
      "doi": ""
    },
    {
      "text": "Martin Adam, Jonas Toutaoui, Nicolas Pfeuffer, and Oliver Hinz. 2019. Investment decisions with robo-advisors: the role of anthropomorphism and personalized anchors in recommendations. In Proceedings of ECIS’19. AIS, Stockholm & Uppsala, Sweden, 1–18.",
      "doi": ""
    },
    {
      "text": "Martin Adam, Michael Wessel, and Alexander Benlian. 2019. Of early birds and phantoms: how sold-out discounts impact entrepreneurial success in reward-based crowdfunding. Review of Managerial Science 13, 3 (2019), 545–560.",
      "doi": ""
    },
    {
      "text": "Mark Alfano, Amir Ebrahimi Fard, J Adam Carter, Peter Clutton, and Colin Klein. 2021. Technologically scaffolded atypical cognition: The case of YouTube’s recommender system. Synthese 199,   (2021), 835–858.",
      "doi": ""
    },
    {
      "text": "Evangelia Anagnostopoulou, Jasna Urbančič, Efthimios Bothos, Babis Magoutas, Luka Bradesko, Johann Schrammel, and Gregoris Mentzas. 2020. From mobility patterns to behavioural change: leveraging travel behaviour and personality profiles to nudge for sustainable transportation. Journal of Intelligent Information Systems 54,   (2020), 1–22.",
      "doi": ""
    },
    {
      "text": "Simge Andı and Jesper Akesson. 2020. Nudging Away False News: Evidence from a Social Norms Experiment. Digital Journalism 9:1(2020), 106–125.",
      "doi": ""
    },
    {
      "text": "Mark A Andor, Andreas Gerster, and Stephan Sommer. 2020. Consumer inattention, heuristic thinking and the role of energy labels. The Energy Journal 41, 1 (2020), 83–112.",
      "doi": ""
    },
    {
      "text": "Marzia Antenore, Giovanna Leone, Alessandro Panconesi, and Erisa Terolli. 2018. Together we buy, alone I quit: some experimental studies of online persuaders. In Proceedings of DTUC’18. ACM, Paris, France, 1–4.",
      "doi": "10.1145/3240117.3240119"
    },
    {
      "text": "Armenak Antinyan, Gergely Horváth, and Mofei Jia. 2020. Curbing the consumption of positional goods: Behavioral interventions versus taxation. Journal of Economic Behavior & Organization 179 (2020), 1–21.",
      "doi": ""
    },
    {
      "text": "Sandra Bammert, Ulrich Matthias König, Maximilian Roeglinger, and Tabitha Wruck. 2020. Exploring potentials of digital nudging for business processes. Business Process Management Journal 26 (2020), 1329–1347.",
      "doi": ""
    },
    {
      "text": "Adrien Barton and Till Grüne-Yanoff. 2015. From libertarian paternalism to nudging—and beyond. Review of Philosophy and psychology 6, 3 (2015), 341–359.",
      "doi": ""
    },
    {
      "text": "Adam Beddoe, Romana Burgess, Lucian Carp, James Foster, Adam Fox, Leechay Moran, Peter Bennett, and Daniel Bennett. 2020. Disruptabottle: Encouraging Hydration with an Overflowing Bottle. In Proceedings of CHI’20 Extended Abstracts. ACM, Honolulu, HI, USA, 1–7.",
      "doi": "10.1145/3334480.3382959"
    },
    {
      "text": "Michelle Berger, Chiara Müller, and Niclas Nüske. 2020. Digital Nudging in Online Grocery Stores–Towards Ecologically Sustainable Nutrition. In Proceedings of ICIS’20. AIS, Hyderabad, India, 1–17.",
      "doi": ""
    },
    {
      "text": "Kristoffer Bergram, Valéry Bezençon, Paul Maingot, Tony Gjerlufsen, and Adrian Holzer. 2020. Digital Nudges for Privacy Awareness: From consent to informed consent?. In Proceedings of ECIS’20. AIS, Marrakech, Marocco, 1–16.",
      "doi": ""
    },
    {
      "text": "Robert Bixler and Sidney D’Mello. 2016. Automatic gaze-based user-independent detection of mind wandering during computerized reading. User Modeling and User-Adapted Interaction 26, 1 (2016), 33–68.",
      "doi": "10.1007/s11257-015-9167-1"
    },
    {
      "text": "Ivan Boskovic-Pavkovic, Isabella Seeber, and Ronald Maier. 2019. How Digital Nudges Affect Consideration Set Size and Perceived Cognitive Effort in Idea Convergence of Open Innovation Contests. In Proceedings of HICSS’19. ScholarSpace, Maui, HI, USA, 4415–4424.",
      "doi": ""
    },
    {
      "text": "Guglielmo Briscese and Cameron Tan. 2018. Applying Behavioural Insights to Labour Markets. Report. The Behavioural Insights Team.",
      "doi": ""
    },
    {
      "text": "Jan vom Brocke, Alexander Simons, Bjoern Niehaves, Bjorn Niehaves, Kai Reimer, Ralf Plattfaut, and Anne Cleven. 2009. Reconstructing the giant: On the importance of rigour in documenting the literature search process. In Proceedings of ECIS’09. AIS, Verona, Italy, 1–12.",
      "doi": ""
    },
    {
      "text": "Christina L Brown and Aradhna Krishna. 2004. The skeptical shopper: A metacognitive account for the effects of default options on choice. Journal of consumer research 31, 3 (2004), 529–539.",
      "doi": ""
    },
    {
      "text": "Michael G Brown, James J Schiltz, Holly Derry, and Caitlin Holman. 2019. Implementing online personalized social comparison nudges in a web-enabled coaching system. The Internet and Higher Education 43, 1 (2019), 100691.",
      "doi": ""
    },
    {
      "text": "Christoph Buck, Simone Burster, and Torsten Eymann. 2018. An Experiment Series on App Information Privacy Concerns. In Proceedings of ECIS’18. AIS, Portsmouth, UK, 1–18.",
      "doi": ""
    },
    {
      "text": "Ana Caraban, Evangelos Karapanos, Daniel Gonçalves, and Pedro Campos. 2019. 23 Ways to Nudge: A Review of Technology-Mediated Nudging in Human-Computer Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland, UK, 1–15.",
      "doi": "10.1145/3290605.3300733"
    },
    {
      "text": "Abhijnan Chakraborty, Nuno Mota, Asia J Biega, Krishna P Gummadi, and Hoda Heidari. 2019. On the impact of choice architectures on inequality in online donation platforms. In Proceedings of WWW ’19. ACM, San Francisco, CA, USA, 2623–2629.",
      "doi": "10.1145/3308558.3313663"
    },
    {
      "text": "Yan Chen, Shuyuan Deng, Dong-Heon Kwak, Ahmed Elnoshokaty, and Jiao Wu. 2019. A multi-appeal model of persuasion for online petition success: A linguistic cue-based approach. Journal of the Association for Information Systems 20, 2 (2019), 105–131.",
      "doi": ""
    },
    {
      "text": "Yohan Chon, Elmurod Talipov, Hyojeong Shin, and Hojung Cha. 2011. Mobility prediction-based smartphone energy optimization for everyday location monitoring. In Proceedings of SenSys ’11. ACM, Seattle, WA, USA, 82–95.",
      "doi": "10.1145/2070942.2070952"
    },
    {
      "text": "Robert B Cialdini. 2001. Influence. Pearson Education, Boston, MA, USA.",
      "doi": ""
    },
    {
      "text": "Robert B Cialdini and Noah J Goldstein. 2004. Social influence: Compliance and conformity. Annu. Rev. Psychol. 55(2004), 591–621.",
      "doi": ""
    },
    {
      "text": "Thomas M Connolly, Elizabeth A Boyle, Ewan MacArthur, Thomas Hainey, and James M Boyle. 2012. A systematic literature review of empirical evidence on computer games and serious games. Computers & education 59, 2 (2012), 661–686.",
      "doi": ""
    },
    {
      "text": "Francis Joseph Costello, Jin Ho Yun, and Kun Chang Lee. 2020. A NeuroIS Investigation of the Effects of a Digital Dark Nudge. In NeuroIS Retreat. Springer Nature, Cham, Switzerland, 64–70.",
      "doi": ""
    },
    {
      "text": "Alan R Dennis, Lingyao Yuan, Xuan Feng, Eric Webb, and Christine J Hsieh. 2020. Digital Nudging: Numeric and Semantic Priming in E-Commerce. Journal of Management Information Systems 37, 1 (2020), 39–65.",
      "doi": ""
    },
    {
      "text": "Blake M DiCosola and Gina Neff. 2020. Using Social Comparisons to Facilitate Healthier Choices in Online Grocery Shopping Contexts. In Proceedings of CHI’20 Extended Abstracts. ACM, Honolulu, HI, USA, 1–8.",
      "doi": "10.1145/3334480.3382877"
    },
    {
      "text": "Dominic DiFranzo and Kristine Gloria-Garcia. 2017. Filter bubbles and fake news. XRDS: Crossroads, The ACM Magazine for Students 23, 3 (2017), 32–35.",
      "doi": "10.1145/3055153"
    },
    {
      "text": "Nicolás E Dìaz Ferreyra, Tobias Kroll, Esma Aïmeur, Stefan Stieglitz, and Maritta Heisel. 2020. Preventative Nudges: Introducing Risk Cues for Supporting Online Self-Disclosure Decisions. Information(Switzerland) 11, 8 (2020), 399.",
      "doi": ""
    },
    {
      "text": "Iñigo Torres Uribe Echebarría, Syed Anas Imtiaz, Mingxu Peng, and Esther Rodriguez-Villegas. 2017. Monitoring smoking behaviour using a wearable acoustic sensor. In 39th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). IEEE, Jeju, South Korea, 4459–4462.",
      "doi": ""
    },
    {
      "text": "William Eggers, Mike Turley, Bruce Chew, Rae Jeneanne, Jason Manstof, and Stine Degnegaard. 2020. Government Trends 2020 report. Technical Report. Deloitte.",
      "doi": ""
    },
    {
      "text": "Robert Epstein and Ronald E Robertson. 2015. The search engine manipulation effect (SEME) and its possible impact on the outcomes of elections. Proceedings of the National Academy of Sciences 112, 33(2015), E4512–E4521.",
      "doi": ""
    },
    {
      "text": "Sally Fincher, Janet Finlay, Sharon Greene, Lauretta Jones, Paul Matchen, John Thomas, and Pedro J Molina. 2003. Perspectives on HCI patterns: concepts and tools. In Proceedings of CHI’03 Extended Abstracts. ACM, Fort Lauderdale, FL, USA, 1044–1045.",
      "doi": "10.1145/765891.766140"
    },
    {
      "text": "Brian J Fogg and Jason Hreha. 2010. Behavior wizard: A method for matching target behaviors with solutions. In Proceedings of PERSUASIVE’10. Springer, Copenhagen, Denmark, 117–131.",
      "doi": "10.1007/978-3-642-13226-1_13"
    },
    {
      "text": "Ashley M Fox, Edmund C Stazyk, and Wenhui Feng. 2020. Administrative easing: Rule reduction and medicaid enrollment. Public Administration Review 80, 1 (2020), 104–117.",
      "doi": ""
    },
    {
      "text": "Marko Gasparic and Francesco Ricci. 2020. IDE Interaction Support With Command Recommender Systems. IEEE Access 8(2020), 19256–19270.",
      "doi": ""
    },
    {
      "text": "Michele J Gelfand, Lisa H Nishii, and Jana L Raver. 2006. On the nature and importance of cultural tightness-looseness. Journal of applied psychology 91, 6 (2006), 1225–1244.",
      "doi": ""
    },
    {
      "text": "Cristina Gena, Pierluigi Grillo, Antonio Lieto, Claudio Mattutino, and Fabiana Vernero. 2019. When Personalization Is Not an Option: An In-The-Wild Study on Persuasive News Recommendation. Information (Switzerland) 10, 10 (2019), 300.",
      "doi": ""
    },
    {
      "text": "Henner Gimpel, Sebastian Heger, Julia Kasper, and Ricarda Schäfer. 2020. The Power of Related Articles–Improving Fake News Detection on Social Media Platforms. In Proceedings of HCISS’20. ScholarSpace, Maui, HI, USA, 6063–6072.",
      "doi": ""
    },
    {
      "text": "Aleksander Gisvold and Esben Aarseth. 2014. Using Gamification and Tangible User Interfaces to Treat Asthmatic Children. Technical Report. Institutt for datateknikk og informasjonsvitenskap.",
      "doi": ""
    },
    {
      "text": "Noah J Goldstein, Robert B Cialdini, and Vladas Griskevicius. 2008. A room with a viewpoint: Using social norms to motivate environmental conservation in hotels. Journal of consumer Research 35, 3 (2008), 472–482.",
      "doi": ""
    },
    {
      "text": "Juho Hamari, Jonna Koivisto, and Harri Sarsa. 2014. Does gamification work?–A literature review of empirical studies on gamification. In Proceedings of HICSS’14. IEEE, Waikoloa, HI, USA, 3025–3034.",
      "doi": "10.1109/HICSS.2014.377"
    },
    {
      "text": "Pelle Guldborg Hansen. 2016. The definition of nudge and libertarian paternalism: Does the hand fit the glove?European Journal of Risk Regulation 7, 1 (2016), 155–174.",
      "doi": ""
    },
    {
      "text": "Pelle Guldborg Hansen and Andreas Maaløe Jespersen. 2013. Nudge and the manipulation of choice: A framework for the responsible use of the nudge approach to behaviour change in public policy. European Journal of Risk Regulation 4, 1 (2013), 3–28.",
      "doi": ""
    },
    {
      "text": "Daniel M Hausman and Brynn Welch. 2010. Debate: To nudge or not to nudge. Journal of Political Philosophy 18, 1 (2010), 123–136.",
      "doi": ""
    },
    {
      "text": "Christopher Henkel, Anna-Raissa Seidler, Johann Kranz, and Marina Fiedler. 2019. How to nudge pro-environmental behaviour: An experimental study. In Proceedings of ECIS’19. AIS, Stockholm and Uppsala, Sweden.",
      "doi": ""
    },
    {
      "text": "Alex Hern. (February 2014). Why Google has 200m reasons to put engineers over designers. Website. Retrieved April 5, 2021 from: https://www.theguardian.com/technology/2014/feb/05/why-google-engineers-designers.",
      "doi": ""
    },
    {
      "text": "Christin Hoffmann and Kirsten Thommes. 2020. Can digital feedback increase employee performance and energy efficiency in firms? Evidence from a field experiment. Journal of Economic Behavior & Organization 180 (2020), 49–65.",
      "doi": ""
    },
    {
      "text": "Geert Hofstede. 2001. Culture’s consequences: Comparing values, behaviors, institutions and organizations across nations. Sage publications, Thousand Oaks, CA, USA.",
      "doi": ""
    },
    {
      "text": "Adrian Holzer, Bruno Kocher, Samuel Bendahan, Isabelle Vonèche Cardia, Jorge Mazuze, and Denis Gillet. 2020. Gamifying knowledge sharing in humanitarian organisations: a design science journey. European Journal of Information Systems 29, 2 (2020), 153–171.",
      "doi": ""
    },
    {
      "text": "Ni Huang, Peiyu Chen, Yili Hong, and Shinyi Wu. 2018. Digital nudging for online social sharing: Evidence from a randomized field experiment. In Proceedings of HICSS’18. AIS, Waikoloa Village, HI, USA, 1483–1491.",
      "doi": ""
    },
    {
      "text": "Julian Huber, Dominik Jung, Elisabeth Schaule, and Christof Weinhardt. 2019. Goal framing in smart charging-increasing BEV users’ charging flexibility with digital nudges. In Proceedings of ECIS’19. AIS, Stockholm and Uppsala, Sweden, 1–16.",
      "doi": ""
    },
    {
      "text": "Dennis Hummel and Alexander Maedche. 2019. How effective is nudging? A quantitative review on the effect sizes and limits of empirical nudging studies. Journal of Behavioral and Experimental Economics 80 (2019), 47–58.",
      "doi": ""
    },
    {
      "text": "Rohan Hundia, Aditya Vijayvargiya, and Aaron Quigley. 2020. Closed loop feedback nudges using nerve stimulation. In Proceedings of SIGCHI on EICS’20. ACM, Honolulu, HI, USA, 1–6.",
      "doi": "10.1145/3393672.3398642"
    },
    {
      "text": "Moritz Ingendahl, Dennis Hummel, Alexander Maedche, and Tobias Vogel. 2020. Who can be nudged? Examining nudging effectiveness in the context of need for cognition and need for uniqueness. Journal of Consumer Behaviour 20 (2020), 324–336.",
      "doi": ""
    },
    {
      "text": "Mathias Jesse and Dietmar Jannach. 2021. Digital nudging with recommender systems: Survey and future directions. Computers in Human Behavior Reports 3 (2021), 1–14.",
      "doi": ""
    },
    {
      "text": "Eric J Johnson and Daniel Goldstein. 2003. Do defaults save lives?Science 302, 5649 (2003), 1338–1339.",
      "doi": ""
    },
    {
      "text": "Dominik Jung and Christof Weinhardt. 2018. Robo-advisors and financial decision inertia: How choice architecture helps to reduce inertia in financial planning tools. In Proceedings of ICIS’18. AIS, San Francisco, CA, USA.",
      "doi": ""
    },
    {
      "text": "Shipi Kankane, Carlina DiRusso, and Christen Buckley. 2018. Can We Nudge Users Toward Better Password Management? An Initial Study. In Proceedings of CHI’18 Extended Abstracts. ACM, Montreal, QC, Canada, 1–6.",
      "doi": ""
    },
    {
      "text": "Indrani Karmakar and Jane Webster. 2018. Personalization of an Environmental Message: Developing a Measure. In Proceedings of ICIS’18. AIS, San Francisco, CA, USA, 1–9.",
      "doi": ""
    },
    {
      "text": "Katarzyna Katner and Radu Jianu. 2019. The Effectiveness of Nudging in Commercial Settings and Impact on User Trust. In Proceedings of CHI’19 Extended Abstracts. ACM, Glasgow, Scotland, UK, 1–6.",
      "doi": "10.1145/3290607.3313065"
    },
    {
      "text": "Antino Kim and Alan R Dennis. 2019. Says who? The effects of presentation format and source rating on fake news in social media.MIS Quarterly 43, 3 (2019).",
      "doi": ""
    },
    {
      "text": "Antino Kim, Patricia L Moravec, and Alan R Dennis. 2019. Combating fake news on social media with source ratings: the effects of user and expert reputation ratings. Journal of Management Information Systems 36, 3 (2019), 931–968.",
      "doi": ""
    },
    {
      "text": "Jaejeung Kim, Joonyoung Park, Hyunsoo Lee, Minsam Ko, and Uichin Lee. 2019. LocknType: Lockout task intervention for discouraging smartphone app use. In Proceedings of the 2019 CHI conference on human factors in computing systems. ACM, Glasgow, Scotland, UK, 1–12.",
      "doi": "10.1145/3290605.3300927"
    },
    {
      "text": "Brent Kitchens, Steven L Johnson, and Peter Gray. 2020. Understanding Echo Chambers and Filter Bubbles: The Impact of Social Media on Diversification and Partisan Shifts in News Consumption. MIS Quarterly 44, 4 (2020), 1619–1650.",
      "doi": ""
    },
    {
      "text": "Agnieszka Kitkowska, Yefim Shulman, Leonardo A Martucci, and Erik Wästlund. 2020. Psychological effects and their role in online privacy interactions: A review. IEEE Access 8(2020), 21236–21260.",
      "doi": ""
    },
    {
      "text": "Adam DI Kramer, Jamie E Guillory, and Jeffrey T Hancock. 2014. Experimental evidence of massive-scale emotional contagion through social networks. Proceedings of the National Academy of Sciences 111, 24(2014), 8788–8790.",
      "doi": ""
    },
    {
      "text": "Martin Kretzer and Alexander Maedche. 2018. Designing social nudges for enterprise recommendation agents: An investigation in the business intelligence systems context. Journal of the Association for Information Systems 19, 12 (2018), 1145–1186.",
      "doi": ""
    },
    {
      "text": "Tobias Kroll, Ute Paukstadt, Kseniya Kreidermann, and Milad Mirbabaie. 2019. Nudging people to save energy in smart homes with social norms and self-commitment. In Proceedings of ECIS’19. AIS, Stockholm and Uppsala, Sweden, 1–10.",
      "doi": ""
    },
    {
      "text": "Tobias Kroll and Stefan Stieglitz. 2019. Digital nudging and privacy: improving decisions about self-disclosure in social networks. Behaviour & Information Technology 40:1 (2019), 1–19.",
      "doi": ""
    },
    {
      "text": "Leonhard K Lades and Liam Delaney. 2020. Nudge FORGOOD. Behavioural Public Policy 6, 1 (2020), 75–94.",
      "doi": ""
    },
    {
      "text": "Tim-Benjamin Lembcke, Nils Engelbrecht, Alfred Benedikt Brendel, Bernd Herrenkind, and Lutz M Kolbe. 2019. Towards a Unified Understanding of Digital Nudging by Addressing its Analog Roots. In Proceedings of PACIS’19. AIS, Xi’an, China, 1–14.",
      "doi": ""
    },
    {
      "text": "Tim-Benjamin Lembcke, Nils Engelbrecht, Mathias Willnat, and Sascha Lichtenberg. 2020. Behavioral Design in Online Supermarkets: How Virtual Shopping Cart Functions Impact Sustainable Consumption. In Proceedings of AMCIS’20. AIS, Salt Lake City, UT, USA, 1–10.",
      "doi": ""
    },
    {
      "text": "Yijing Li, Wenjie Fan, Fei Liu, Eric TK Lim, Yong Liu, and Chee-Wee Tan. 2018. Exploring the Nudging and Counter-Nudging Effects of Campaign Updates in Crowdfunding. In Proceedings of PACIS’18. AIS, Yokohama, Japan, 1–8.",
      "doi": ""
    },
    {
      "text": "Alessandro Liberati, Douglas G Altman, Jennifer Tetzlaff, Cynthia Mulrow, Peter C Gøtzsche, John PA Ioannidis, Mike Clarke, Philip J Devereaux, Jos Kleijnen, and David Moher. 2009. The PRISMA statement for reporting systematic reviews and meta-analyses of studies that evaluate health care interventions: explanation and elaboration. Journal of clinical epidemiology 62, 10 (2009), e1–e34.",
      "doi": ""
    },
    {
      "text": "Shouwang Lu, Gong Gordon Chen, and Kanliang Wang. 2020. Overt or covert? Effect of different digital nudging on consumers’ customization choices. Nankai Business Review International 12, 1 (2020), 56–74.",
      "doi": ""
    },
    {
      "text": "Thomas Mejtoft, Charlotte Ristiniemi, Ulrik Söderström, and Eva Mårell-Olsson. 2019. User experience design and digital nudging in a decision making process. In Proceedings of Bled eConference’19. University of Maribor Press, AIS, Bled, Slovenia, 427–442.",
      "doi": ""
    },
    {
      "text": "Christian Meske, Ireti Amojo, and Peter Mohr. 2020. Digital Nudging to Increase Usage of Charity Features on E-Commerce Platforms. In Proceedings of International Conference on Wirtschaftsinformatik. AIS, Potsdam, Germany, 1203–1218.",
      "doi": ""
    },
    {
      "text": "Christian Meske and Tobias Potthoff. 2017. The DINU-model–a process model for the design of nudges. In Proceedings of ECIS’17. AIS, Guimarães, Portugal, 1–11.",
      "doi": ""
    },
    {
      "text": "Riccardo Miotto, Matteo Danieletto, Jerome R Scelza, Brian A Kidd, and Joel T Dudley. 2018. Reflecting health: smart mirrors for personalized medicine. NPJ digital medicine 1, 1 (2018), 1–7.",
      "doi": ""
    },
    {
      "text": "T. Mirsch, C. Lehrer, and R. Jung. 2017. Digital nudging: Altering user behavior in digital environments. In Proceedings of International Conference on Wirtschaftsinformatik. AIS, St.Gallen, Switzerland, 634–648.",
      "doi": ""
    },
    {
      "text": "David Moher, Alessandro Liberati, Jennifer Tetzlaff, Douglas G Altman, Prisma Group, 2009. Preferred reporting items for systematic reviews and meta-analyses: the PRISMA statement. PLoS Medicine 6, 7 (2009), e1000097.",
      "doi": ""
    },
    {
      "text": "Nuno Mota, Abhijnan Chakraborty, Asia J Biega, Krishna P Gummadi, and Hoda Heidari. 2020. On the Desiderata for Online Altruism: Nudging for Equitable Donations. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–21.",
      "doi": "10.1145/3415197"
    },
    {
      "text": "Jonathan A Obar and Anne Oeldorf-Hirsch. 2020. The biggest lie on the internet: Ignoring the privacy policies and terms of service policies of social networking services. Information, Communication & Society 23, 1 (2020), 128–147.",
      "doi": ""
    },
    {
      "text": "Fabian Okeke, Michael Sobolev, Nicola Dell, and Deborah Estrin. 2018. Good vibrations: can a digital nudge reduce digital overload?. In Proceedings of MobileHCI’18. ACM, Barcelona, Spain, 1–12.",
      "doi": "10.1145/3229434.3229463"
    },
    {
      "text": "Daniel M Oppenheimer, Robyn A LeBoeuf, and Noel T Brewer. 2008. Anchors aweigh: A demonstration of cross-modality anchoring and magnitude priming. Cognition 106, 1 (2008), 13–26.",
      "doi": ""
    },
    {
      "text": "Daphna Oyserman. 2006. High power, low power, and equality: Culture beyond individualism and collectivism. Journal of Consumer Psychology 16, 4 (2006), 352–356.",
      "doi": ""
    },
    {
      "text": "Eyal Peer, Serge Egelman, Marian Harbach, Nathan Malkin, Arunesh Mathur, and Alisa Frik. 2020. Nudge me right: Personalizing online security nudges to people’s decision-making styles. Computers in Human Behavior 109 (2020), 106347.",
      "doi": ""
    },
    {
      "text": "Antonio Gualberto Pereira and Luís Eduardo Afonso. 2019. Automatic enrollment and employer match: an experiment with the choice of pension plans. Revista de Gestão 27, 3 (2019), 281–299.",
      "doi": ""
    },
    {
      "text": "Michel Tuan Pham. 2013. The seven sins of consumer psychology. Journal of Consumer Psychology 23, 4 (2013), 411–423.",
      "doi": ""
    },
    {
      "text": "Gabriele Piccoli, Marcin Łukasz Bartosiak, Biagio Palese, and Joaquin Rodriguez. 2020. Designing scalability in required in-class introductory college courses. Information & Management 57, 8 (2020), 103263.",
      "doi": ""
    },
    {
      "text": "Martin Poniatowski and Jürgen Neumann. 2020. Getting Personal with Review Systems–Analyzing the Influence of Personality Traits on the Relationship between Review Templates and Reviewing Behavior. In Proceedings of ECIS’20 Research-in-Progress Papers. AIS, Marrakech, Morocco, 1–11.",
      "doi": ""
    },
    {
      "text": "Aarathi Prasad and Asia Quinones. 2020. Digital Overload Warnings-“The Right Amount of Shame”?. In Proceedings of International Conference on Human-Computer Interaction. Springer, Copenhagen, Denmark, 117–134.",
      "doi": "10.1007/978-3-030-49065-2_9"
    },
    {
      "text": "Aditya Kumar Purohit, Louis Barclay, and Adrian Holzer. 2020. Designing for Digital Detox: Making Social Media Less Addictive with Digital Nudges. In Proceedings of CHI’20 Extended Abstracts. ACM, Honolulu, HI, USA, 1–9.",
      "doi": "10.1145/3334480.3382810"
    },
    {
      "text": "Aditya Kumar Purohit and Adrian Holzer. 2019. Functional digital nudges: Identifying optimal timing for effective behavior change. In Proceedings of CHI’19 Extended Abstracts. ACM, Glasgow, Scotland, UK, 1–6.",
      "doi": "10.1145/3290607.3312876"
    },
    {
      "text": "Paul Resnick, R Kelly Garrett, Travis Kriplean, Sean A Munson, and Natalie Jomini Stroud. 2013. Bursting your (filter) bubble: strategies for promoting diverse exposure. In Proceedings of CSCW’13. ACM, San Antonio, TX, USA, 95–100.",
      "doi": "10.1145/2441955.2441981"
    },
    {
      "text": "Manoel Horta Ribeiro, Raphael Ottoni, Robert West, Virgílio AF Almeida, and Wagner Meira Jr. 2020. Auditing radicalization pathways on YouTube. In Proceedings of FAT* ’20. ACM, Barcelona, Spain, 131–141.",
      "doi": "10.1145/3351095.3372879"
    },
    {
      "text": "Sebastien Richoz, Lin Wang, Philip Birch, and Daniel Roggen. 2020. Transportation mode recognition fusing wearable motion, sound, and vision sensors. IEEE Sensors Journal 20, 16 (2020), 9314–9328.",
      "doi": ""
    },
    {
      "text": "Annamina Rieder, U Yeliz Eseryel, Christiane Lehrer, and Reinhard Jung. 2021. Why Users Comply with Wearables: The Role of Contextual Self-Efficacy in Behavioral Change. International Journal of Human-Computer Interaction 37, 3(2021), 281–294.",
      "doi": ""
    },
    {
      "text": "Johnny Rodgers and Lyn Bartram. 2011. Exploring ambient and artistic visualization for residential energy use feedback. IEEE transactions on visualization and computer graphics 17, 12(2011), 2489–2497.",
      "doi": "10.1109/TVCG.2011.196"
    },
    {
      "text": "Joaquin Rodriguez, Gabriele Piccoli, and Marcin Bartosiak. 2019. Nudging the classroom: Designing a socio-technical artifact to reduce academic procrastination. In Proceedings of HICSS’19. ScholarSpace, Maui, HI, USA, 4405–4414.",
      "doi": ""
    },
    {
      "text": "Arden Rowell. 2017. Once and Future Nudges. Missouri Law Review 82(2017), 1–18.",
      "doi": ""
    },
    {
      "text": "Guillaume Saint-Jacques, Amir Sepehri, Nicole Li, and Igor Perisic. (March 2020). Building inclusive products through A/B testing. Website. Retrieved March 9, 2021 from: https://engineering.linkedin.com/blog/2020/building-inclusive-products-through-a-b-testing.",
      "doi": ""
    },
    {
      "text": "Renata Santiago Walser, Isabella Seeber, and Ronald Maier. 2019. Designing a Digital Nudge for Convergence: The Role of Decomposition of Information Load for Decision Making and Choice Accuracy. AIS Transactions on Human-Computer Interaction 11, 3(2019), 179–207.",
      "doi": ""
    },
    {
      "text": "Raphael Schilling, Stephan Aier, and Robert Winter. 2019. Designing an Artifact for Informal Control in Enterprise Architecture Management. In Proceedings of ICIS’19. AIS, Munich, Germany, 1–17.",
      "doi": ""
    },
    {
      "text": "Christoph Schneider, Markus Weinmann, and Jan Vom Brocke. 2018. Digital nudging: guiding online user choices through interface design. Commun. ACM 61, 7 (2018), 67–73.",
      "doi": "10.1145/3213765"
    },
    {
      "text": "David Schneider, Johannes Klumpe, Martin Adam, and Alexander Benlian. 2019. Nudging users into digital service solutions. Electronic Markets 30, 4 (2019), 863–881.",
      "doi": ""
    },
    {
      "text": "David Schneider, Sebastian Lins, Tillmann Grupp, Alexander Benlian, and Ali Sunyaev. 2017. Nudging users into online verification: the case of carsharing platforms. In Proceedings of ICIS’17. AIS, Seoul, South Korea, 1–20.",
      "doi": ""
    },
    {
      "text": "Sofia Schöbel, Torben Barev, Andreas Janson, Felix Hupfeld, and Jan Marco Leimeister. 2020. Understanding User Preferences of Digital Privacy Nudges–A Best-Worst Scaling Approach. In Proceedings of HICSS’20. ScholarSpace, Maui, HI, USA, 3918–3927.",
      "doi": ""
    },
    {
      "text": "Charlotte Schöning, Christian Matt, and Thomas Hess. 2019. Personalised nudging for more data disclosure? On the adaption of data usage policies format to cognitive styles. In Proceedings of HICSS’19. ScholarSpace, Maui, HI, USA, 4395–4404.",
      "doi": ""
    },
    {
      "text": "Tim Schrills, Mourad Zoubir, Jacob Stahl, Katharina Drozniak, and Thomas Franke. 2020. Good Boy Here or Bad Boy Far Away?. In Proceedings of International Conference on Human-Computer Interaction. Springer, Copenhagen, Denmark, 398–411.",
      "doi": "10.1007/978-3-030-49183-3_31"
    },
    {
      "text": "Avijit Sengupta, Anol Bhattacherjee, and Kaushik Dutta. 2020. Information Technology Interventions in Cardiac Rehabilitation: A Theory Driven Approach. In Proceedings of ICIS’20. AIS, Hyderabad, India, 1–17.",
      "doi": ""
    },
    {
      "text": "Alexander J Stewart, Mohsen Mosleh, Marina Diakonova, Antonio A Arechar, David G Rand, and Joshua B Plotkin. 2019. Information gerrymandering and undemocratic decisions. Nature 573, 7772 (2019), 117–121.",
      "doi": ""
    },
    {
      "text": "Carola Stryja and Gerhard Satzger. 2019. Digital nudging to overcome cognitive resistance in innovation adoption decisions. The Service Industries Journal 39, 15–16 (2019), 1123–1139.",
      "doi": ""
    },
    {
      "text": "Carola Stryja, Gerhard Satzger, and Verena Dorner. 2017. A decision support system design to overcome resistance towards sustainable innovations. In Proceedings of ECIS’17 Research-in-Progress Papers. AIS, Guimarães, Portugal, 2885–2895.",
      "doi": ""
    },
    {
      "text": "Tianshu Sun, Siva Viswanathan, Ni Huang, and Elena Zheleva. 2019. Designing Promotional Incentive to Embrace Social Sharing: Evidence from Field and Lab Experiments. In Proceedings of ICIS’19. AIS, Munich, Germany, 1–17.",
      "doi": ""
    },
    {
      "text": "Cass R Sunstein. 2014. Nudging: a very short guide. Journal of Consumer Policy 37, 4 (2014), 583–588.",
      "doi": ""
    },
    {
      "text": "Cass R Sunstein. 2015. The ethics of nudging. Yale Journal on Regulation 32, 2 (2015), 413–450.",
      "doi": ""
    },
    {
      "text": "Cass R Sunstein. 2015. Nudges, agency, and abstraction: A reply to critics. Review of Philosophy and Psychology 6, 3 (2015), 511–529.",
      "doi": ""
    },
    {
      "text": "Nadine Székely, Markus Weinmann, and Jan vom Brocke. 2016. Nudging People To Pay Co2 Offsets–The Effect of Anchors in Flight Booking Processes. In Proceedings of ECIS’16 Research-in-Progress Papers. AIS, Istanbul, Turkey, 1–10.",
      "doi": ""
    },
    {
      "text": "Philipp Terres, Johannes Klumpe, Dominik Jung, and Oliver Koch. 2019. Digital Nudges for User Onboarding: Turning Visitors into Users. In Proceedings of ECIS’19. AIS, Stockholm and Uppsala, Sweden, 1–16.",
      "doi": ""
    },
    {
      "text": "Timm Teubner and Antje Graul. 2020. Only one room left! How scarcity cues affect booking intentions on hospitality platforms. Electronic Commerce Research and Applications 39 (2020), 100910.",
      "doi": "10.1016/j.elerap.2019.100910"
    },
    {
      "text": "Richard H. Thaler. 2018. Nudge, not sludge. Science 631, 6401 (2018), 431.",
      "doi": ""
    },
    {
      "text": "Richard H Thaler and Cass R Sunstein. 2008. Nudge: Improving decisions about health, wealth, and happiness. Yale University Press, New Haven, CT, USA.",
      "doi": ""
    },
    {
      "text": "Richard H Thaler, Cass R Sunstein, and John P Balz. 2013. Choice architecture. In The behavioral foundations of public policy. Princeton University Press, Princeton, NJ, USA, 428–439.",
      "doi": ""
    },
    {
      "text": "Vincent W-S Tseng, Matthew L Lee, Laurent Denoue, and Daniel Avrahami. 2019. Overcoming distractions during transitions from break to work using a conversational website-blocking system. In Proceedings of CHI’19. ACM, Glasgow, Scotland, UK, 1–13.",
      "doi": "10.1145/3290605.3300697"
    },
    {
      "text": "Christine Utz, Martin Degeling, Sascha Fahl, Florian Schaub, and Thorsten Holz. 2019. (Un)informed consent: Studying gdpr consent notices in the field. In Proceedings of CCS’19. ACM, London, UK, 973–990.",
      "doi": "10.1145/3319535.3354212"
    },
    {
      "text": "Andre Calero Valdez, Martina Ziefle, and Michael Sedlmair. 2017. Priming and anchoring effects in visualization. IEEE transactions on visualization and computer graphics 24, 1(2017), 584–594.",
      "doi": ""
    },
    {
      "text": "Maxim van Oldenbeek, Till J Winkler, Julie Buhl-Wiggers, and Daniel Hardt. 2019. Nudging in Blended Learning: Evaluation of Email-based progress feedback in a Flipped-Classroom Information Systems Course. In Proceedings of ECIS’19. AIS, Stockholm and Uppsala, Sweden, 1–15.",
      "doi": ""
    },
    {
      "text": "Christian von der Weth, Ashraf Abdul, Shaojing Fan, and Mohan Kankanhalli. 2020. Helping Users Tackle Algorithmic Threats on Social Media: A Multimedia Research Agenda. In Proceedings of MM’20. ACM, Seattle, WA, USA, 4425–4434.",
      "doi": "10.1145/3394171.3414692"
    },
    {
      "text": "Soroush Vosoughi, Deb Roy, and Sinan Aral. 2018. The spread of true and false news online. Science 359, 6380 (2018), 1146–1151.",
      "doi": ""
    },
    {
      "text": "Jane Webster and Richard T Watson. 2002. Analyzing the past to prepare for the future: Writing a literature review. MIS quarterly 26, 2 (2002), 13–23.",
      "doi": ""
    },
    {
      "text": "Markus Weinmann, Christoph Schneider, and Jan vom Brocke. 2016. Digital nudging. Business & Information Systems Engineering 58, 6 (2016), 433–436.",
      "doi": ""
    },
    {
      "text": "Michael Wessel, Martin Adam, and Alexander Benlian. 2019. The impact of sold-out early birds on option selection in reward-based crowdfunding. Decision Support Systems 117 (2019), 48–61.",
      "doi": ""
    },
    {
      "text": "Arnold Wibmer, Frederik M Wiedmann, Isabella Seeber, and Ronald Maier. 2019. Why less is more: An eye tracking study on idea presentation and attribute attendance in idea selection. In Proceedings of ECIS’19. AIS, Stockholm and Uppsala, Sweden, 1–14.",
      "doi": ""
    }
  ]
}