{
  "doi": "10.1145/3491102.3501846",
  "title": "Uncovering Instructors’ Diverse Practices and Perceptions: A Field Deployment of a Customization-Sharing Platform that Supports Course Management",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "Instructors regularly learn and customize various feature-rich software applications to meet their unique classroom needs. Although instructors often prefer social help from colleagues to navigate this complex and time-consuming learning process, it can be difficult for them to locate relevant task-specific customizations, a challenge only exacerbated by the transition to online teaching due to COVID-19. To mitigate this, we explored how instructors could use an example-based customization sharing platform to discover, try, and appropriate their colleagues’ customizations within a learning management system (LMS). Our field deployment study revealed diverse ways that ten instructors from different backgrounds used customization sharing features to streamline their workflows, improve their LMS feature awareness, and explore new possibilities for designing their courses to match student expectations. Our findings provide new knowledge about customization sharing practices, highlighting the complex interplay of expertise, software learnability, domain-specific workflows, and social perceptions.",
  "authors": [
    {
      "name": "Laton Vermette",
      "institution": "Simon Fraser University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658728518",
      "orcid": "missing"
    },
    {
      "name": "Kavana Ramesh",
      "institution": "Simon Fraser University, Canada",
      "img": "/do/10.1145/contrib-99659731934/rel-imgonly/kavanar_photo.jpeg",
      "acmid": "99659731934",
      "orcid": "missing"
    },
    {
      "name": "Joanna McGrenere",
      "institution": "Computer Science, University of British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232506",
      "orcid": "missing"
    },
    {
      "name": "Parmit K Chilana",
      "institution": "Computing Science, Simon Fraser University, Canada",
      "img": "/do/10.1145/contrib-81416609224/rel-imgonly/parmit2015linkedin.jpg",
      "acmid": "81416609224",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Pengcheng An, Saskia Bakker, and Berry Eggen. 2017. FeetForward: On Blending New Classroom Technologies into Secondary School Teachers’ Routines. In Human-Computer Interaction - INTERACT 2017. Vol. 10514. Springer International Publishing, Cham, 327–347. https://doi.org/10.1007/978-3-319-67684-5_20",
      "doi": ""
    },
    {
      "text": "Pengcheng An, Kenneth Holstein, Bernice d’Anjou, Berry Eggen, and Saskia Bakker. 2020. The TA Framework: Designing Real-time Teaching Augmentation for K-12 Classrooms. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3313831.3376277"
    },
    {
      "text": "Yun-Jo An and Charles Reigeluth. 2011. Creating Technology-Enhanced, Learner-Centered Classrooms: K–12 Teachers’ Beliefs, Perceptions, Barriers, and Support Needs. Journal of Digital Learning in Teacher Education 28, 2 (Dec. 2011), 54–62. https://doi.org/10.1080/21532974.2011.10784681",
      "doi": ""
    },
    {
      "text": "Nikola Banovic, Fanny Chevalier, Tovi Grossman, and George Fitzmaurice. 2012. Triggering Triggers and Burying Barriers to Customizing Software. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 2717–2726. https://doi.org/10.1145/2207676.2208666",
      "doi": "10.1145/2207676.2208666"
    },
    {
      "text": "Richard Bentley and Paul Dourish. 1995. Medium versus mechanism: Supporting collaboration through customisation. In Proceedings of the Fourth European Conference on Computer-Supported Cooperative Work ECSCW’95. Springer, 133–148.",
      "doi": ""
    },
    {
      "text": "Jonathan Bergmann and Aaron Sams. 2012. Flip Your Classroom: Reach Every Student in Every Class Every Day. International Society for Technology in Education.",
      "doi": ""
    },
    {
      "text": "Grégory Bourguin, Arnaud Lewandowski, and Myriam Lewkowicz. 2012. ShareXP: An Eclipse plug-in for expertise sharing among developers. MCCSIS (2012), 137.",
      "doi": ""
    },
    {
      "text": "Joel Brandt, Mira Dontcheva, Marcos Weskamp, and Scott R. Klemmer. 2010. Example-Centric Programming: Integrating Web Search into the Development Environment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 513–522. https://doi.org/10.1145/1753326.1753402",
      "doi": "10.1145/1753326.1753402"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis. In APA handbook of research methods in psychology, Vol 2: Research designs: Quantitative, qualitative, neuropsychological, and biological.American Psychological Association, 57–71. https://doi.org/10.1037/13620-004",
      "doi": ""
    },
    {
      "text": "Andrea Bunt. 2007. Mixed-initiative support for customizing graphical user interfaces. Ph.D. Dissertation. University of British Columbia.",
      "doi": ""
    },
    {
      "text": "Andrea Bunt, Joanna McGrenere, and Cristina Conati. 2007. Understanding the utility of rationale in a mixed-initiative system for GUI customization. In International Conference on User Modeling. Springer, 147–156.",
      "doi": "10.1007/978-3-540-73078-1_18"
    },
    {
      "text": "Weiqin Chen, Norun C Sanderson, Anna Nichshyk, Way Kiat Bong, and Siri Kessel. 2021. Usability of Learning Management Systems for Instructors–The Case of Canvas. In International Conference on Human-Computer Interaction. Springer, 210–223.",
      "doi": "10.1007/978-3-030-77889-7_14"
    },
    {
      "text": "Sebastian Draxler and Gunnar Stevens. 2011. Supporting the Collaborative Appropriation of an Open Software Ecosystem. Computer Supported Cooperative Work (CSCW) 20, 4 (2011), 403–448.",
      "doi": "10.1007/s10606-011-9148-9"
    },
    {
      "text": "Sebastian Draxler, Gunnar Stevens, Martin Stein, Alexander Boden, and David Randall. 2012. Supporting the Social Context of Technology Appropriation: On a Synthesis of Sharing Tools and Tool Knowledge. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2835–2844. https://doi.org/10.1145/2207676.2208687",
      "doi": "10.1145/2207676.2208687"
    },
    {
      "text": "Line Dubé, Anne Bourhis, and Réal Jacob. 2005. The impact of structuring characteristics on the launching of virtual communities of practice. Journal of Organizational Change Management(2005).",
      "doi": ""
    },
    {
      "text": "Peggy A. Ertmer and Anne T. Ottenbreit-Leftwich. 2010. Teacher Technology Change: How Knowledge, Confidence, Beliefs, and Culture Intersect. Journal of Research on Technology in Education 42, 3 (March 2010), 255–284. https://doi.org/10.1080/15391523.2010.10782551",
      "doi": ""
    },
    {
      "text": "Leah Findlater and Joanna McGrenere. 2004. A comparison of static, adaptive, and adaptable menus. Conference on Human Factors in Computing Systems - Proceedings, 89–96. https://doi.org/10.1145/985692.985704",
      "doi": "10.1145/985692.985704"
    },
    {
      "text": "Leah Findlater and Joanna McGrenere. 2010. Beyond performance: Feature awareness in personalized interfaces. International Journal of Human-Computer Studies 68, 3 (2010), 121–137.",
      "doi": "10.1016/j.ijhcs.2009.10.002"
    },
    {
      "text": "Alicen Flosi and Kakoli Bandyopadhyay. 2009. An empirical investigation into factors relating to the use of course management software by post-secondary faculty. International Journal of Business Information Systems 4, 6 (2009), 597–621.",
      "doi": "10.1504/IJBIS.2009.026694"
    },
    {
      "text": "Krzysztof Z. Gajos, Jacob O. Wobbrock, and Daniel S. Weld. 2008. Improving the Performance of Motor-Impaired Users with Automatically-Generated, Ability-Based Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 1257–1266. https://doi.org/10.1145/1357054.1357250",
      "doi": "10.1145/1357054.1357250"
    },
    {
      "text": "Cynthia Gautreau. 2011. Motivational factors affecting the integration of a learning management system by faculty.Journal of Educators Online 8, 1 (2011), n1.",
      "doi": ""
    },
    {
      "text": "Alyssa Glass, Deborah L McGuinness, and Michael Wolverton. 2008. Toward establishing trust in adaptive agents. In Proceedings of the 13th international conference on Intelligent user interfaces. 227–236.",
      "doi": "10.1145/1378773.1378804"
    },
    {
      "text": "Lynette Molstad Gorder. 2008. A Study of Teacher Perceptions of Instructional Technology Integration in the Classroom. Delta Pi Epsilon Journal 50, 2 (2008), 63–76.",
      "doi": ""
    },
    {
      "text": "Christian Greiffenhagen. 2012. Making rounds: The routine work of the teacher during collaborative learning with computers. International Journal of Computer-Supported Collaborative Learning 7, 1 (March 2012), 11–42. https://doi.org/10.1007/s11412-011-9134-8",
      "doi": ""
    },
    {
      "text": "Mona Haraty and Joanna McGrenere. 2016. Designing for Advanced Personalization in Personal Task Management. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). Association for Computing Machinery, New York, NY, USA, 239–250. https://doi.org/10.1145/2901790.2901805",
      "doi": "10.1145/2901790.2901805"
    },
    {
      "text": "Mona Haraty, Joanna McGrenere, and Andrea Bunt. 2017. Online Customization Sharing Ecosystems: Components, Roles, and Motivations. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 2359–2371. https://doi.org/10.1145/2998181.2998289",
      "doi": "10.1145/2998181.2998289"
    },
    {
      "text": "Björn Hartmann, Leslie Wu, Kevin Collins, and Scott R. Klemmer. 2007. Programming by a Sample: Rapidly Creating Web Applications with d.Mix. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology(Newport, Rhode Island, USA) (UIST ’07). Association for Computing Machinery, New York, NY, USA, 241–250. https://doi.org/10.1145/1294211.1294254",
      "doi": "10.1145/1294211.1294254"
    },
    {
      "text": "Instructure, Inc.2021. Canvas LMS | Learning Management System | Instructure. https://www.instructure.com/canvas/",
      "doi": ""
    },
    {
      "text": "Instructure, Inc.2021. Canvas Release: Direct Share. https://community.canvaslms.com/t5/Canvas-Releases-Board/Canvas-Release-Direct-Share-2020-01-18/td-p/262055",
      "doi": ""
    },
    {
      "text": "Instructure, Inc.2021. What is Canvas Commons?https://community.canvaslms.com/t5/Canvas-Commons/What-is-Canvas-Commons/ta-p/1788",
      "doi": ""
    },
    {
      "text": "Young Ju Joo, Kyu Yon Lim, and Nam Hee Kim. 2016. The effects of secondary teachers’ technostress on the intention to use technology in South Korea. Computers & Education 95 (2016), 114–122. https://doi.org/10.1016/j.compedu.2015.12.004",
      "doi": "10.1016/j.compedu.2015.12.004"
    },
    {
      "text": "Anjali Khurana, Parsa Alamzadeh, and Parmit K Chilana. 2021. ChatrEx: Designing Explainable Chatbot Interfaces for Enhancing Usefulness, Transparency, and Trust. In 2021 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). IEEE.",
      "doi": ""
    },
    {
      "text": "Rock Leung, Charlotte Tang, Shathel Haddad, Joanna Mcgrenere, Peter Graf, and Vilia Ingriany. 2012. How Older Adults Learn to Use Mobile Devices: Survey and Field Investigations. ACM Trans. Access. Comput. 4, 3, Article 11 (Dec. 2012), 33 pages. https://doi.org/10.1145/2399193.2399195",
      "doi": "10.1145/2399193.2399195"
    },
    {
      "text": "Wendy E. Mackay. 1990. Patterns of Sharing Customizable Software. In Proceedings of the 1990 ACM Conference on Computer-Supported Cooperative Work (Los Angeles, California, USA) (CSCW ’90). Association for Computing Machinery, New York, NY, USA, 209–221. https://doi.org/10.1145/99332.99356",
      "doi": "10.1145/99332.99356"
    },
    {
      "text": "Wendy E. Mackay. 1991. Triggers and barriers to customizing software. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI ‘91. ACM Press, New Orleans, Louisiana, United States, 153–160. https://doi.org/10.1145/108844.108867",
      "doi": "10.1145/108844.108867"
    },
    {
      "text": "Sampada S. Marathe. 2007. If you build it, they will come-Or will they? Need for uniqueness and need for control as psychological predictors of customization.. In Proc. of the Annual Conference of the International Communication Association, ICA.",
      "doi": ""
    },
    {
      "text": "Sampada S. Marathe. 2009. Investigating the Psychology of Task-Based and Presentation-Based UI Customization. In CHI ’09 Extended Abstracts on Human Factors in Computing Systems (Boston, MA, USA) (CHI EA ’09). Association for Computing Machinery, New York, NY, USA, 3129–3132. https://doi.org/10.1145/1520340.1520444",
      "doi": ""
    },
    {
      "text": "Florence Martin, Drew Polly, Shanna Coles, and Chuang Wang. 2020. Examining higher education faculty use of current digital technologies: Importance, competence, and motivation.International Journal of Teaching and Learning in Higher Education 32, 1(2020), 73–86.",
      "doi": ""
    },
    {
      "text": "Joanna McGrenere. 2002. The design and evaluation of multiple interfaces: A solution for complex software. Ph.D. Dissertation. University of Toronto, Canada.",
      "doi": ""
    },
    {
      "text": "Naomi Miyake and Donald A. Norman. 1979. To ask a question, one must know enough to know what is not known. Journal of Verbal Learning and Verbal Behavior 18, 3 (1979), 357–364. https://doi.org/10.1016/S0022-5371(79)90200-7",
      "doi": ""
    },
    {
      "text": "Blair Nonnecke and Jenny Preece. 2000. Lurker demographics: Counting the silent. In Proceedings of the SIGCHI conference on Human factors in computing systems. 73–80.",
      "doi": "10.1145/332040.332409"
    },
    {
      "text": "Reinhard Oppermann and Helmut Simm. 1994. Adaptability: User-initiated individualization. In Adaptive user support. Routledge, 14–66.",
      "doi": ""
    },
    {
      "text": "Hasan Özgür. 2020. Relationships between teachers’ technostress, technological pedagogical content knowledge (TPACK), school support and demographic variables: A structural equation modeling. Computers in Human Behavior 112 (2020). https://doi.org/10.1016/j.chb.2020.106468",
      "doi": ""
    },
    {
      "text": "Antoine Ponsard and Joanna McGrenere. 2016. Anchored Customization: Anchoring Settings to the Application Interface to Afford Customization. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 4154–4165. https://doi.org/10.1145/2858036.2858129",
      "doi": "10.1145/2858036.2858129"
    },
    {
      "text": "Susan M. Printy. 2008. Leadership for Teacher Learning: A Community of Practice Perspective. Educational Administration Quarterly 44, 2 (April 2008), 187–226. https://doi.org/10.1177/0013161X07312958",
      "doi": ""
    },
    {
      "text": "Kavana Ramesh, Laton Vermette, and Parmit K. Chilana. 2021. Setting up, Troubleshooting, and Innovating on the Delivery of Online Instruction: A Case Study of an LMS Q&A Forum. In Proceedings of the Eighth ACM Conference on Learning @ Scale. Association for Computing Machinery, New York, NY, USA, 59–67. https://doi.org/10.1145/3430895.3460133",
      "doi": "10.1145/3430895.3460133"
    },
    {
      "text": "Paul Resnick, Neophytos Iacovou, Mitesh Suchak, Peter Bergstrom, and John Riedl. 1994. GroupLens: An Open Architecture for Collaborative Filtering of Netnews. In Proceedings of the 1994 ACM Conference on Computer Supported Cooperative Work (Chapel Hill, North Carolina, USA) (CSCW ’94). Association for Computing Machinery, New York, NY, USA, 175–186. https://doi.org/10.1145/192844.192905",
      "doi": "10.1145/192844.192905"
    },
    {
      "text": "Michael B. Twidale. 2005. Over the Shoulder Learning: Supporting Brief Informal Learning. Computer Supported Cooperative Work 14, 6 (Dec. 2005), 505–547. https://doi.org/10.1007/s10606-005-9007-7",
      "doi": "10.1007/s10606-005-9007-7"
    },
    {
      "text": "Laton Vermette, Shruti Dembla, April Y. Wang, Joanna McGrenere, and Parmit K. Chilana. 2017. Social CheatSheet: An Interactive Community-Curated Information Overlay for Web Applications. Proceedings of the ACM on Human-Computer Interaction 1, CSCW, Article 102 (Dec. 2017), 19 pages. https://doi.org/10.1145/3134737",
      "doi": "10.1145/3134737"
    },
    {
      "text": "Laton Vermette, Joanna McGrenere, Colin Birge, Adam Kelly, and Parmit K. Chilana. 2019. Freedom to Personalize My Digital Classroom: Understanding Teachers’ Practices and Motivations. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland UK) (CHI ’19). Association for Computing Machinery, New York, NY, USA, Article 318, 14 pages. https://doi.org/10.1145/3290605.3300548",
      "doi": "10.1145/3290605.3300548"
    },
    {
      "text": "Laton Vermette, Joanna McGrenere, and Parmit K. Chilana. 2020. Peek-through Customization: Example-Based In-Context Sharing for Learning Management Systems. In Proceedings of the 2020 ACM Designing Interactive Systems Conference(DIS ‘20). Association for Computing Machinery, New York, NY, USA, 1155–1167. https://doi.org/10.1145/3357236.3395507",
      "doi": "10.1145/3357236.3395507"
    },
    {
      "text": "Etienne Wenger. 1999. Communities of practice: Learning, meaning, and identity. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Robert K Yin. 1981. The case study as a serious research strategy. Knowledge 3, 1 (1981), 97–114. https://doi.org/10.1177/107554708100300106",
      "doi": ""
    },
    {
      "text": "Yong Zhao, Kevin Pugh, Stephen Sheldon, and Joe L. Byers. 2002. Conditions for Classroom Technology Innovations. Teachers College Record 104, 3 (2002), 482–515.",
      "doi": ""
    }
  ]
}