{
  "doi": "10.1145/3491102.3517464",
  "title": "RMS: Removing Barriers to Analyze the Availability and Surge Pricing of Ridesharing Services",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "Ridesharing services do not make data of their availability (supply, utilization, idle time, and idle distance) and surge pricing publicly available. It limits the opportunities to study the spatiotemporal trends of the availability and surge pricing of these services. Only a few research studies conducted in North America analyzed these features for only Uber and Lyft. Despite the interesting observations, the results of prior works are not generalizable or reproducible because: i) the datasets collected in previous publications are spatiotemporally sensitive, i.e., previous works do not represent the current availability and surge pricing of ridesharing services in different parts of the world; and ii) the analyses presented in previous works are limited in scope (in terms of countries and ridesharing services they studied). Hence, prior works are not generally applicable to ridesharing services operating in different countries.  This paper addresses the issue of ridesharing-data unavailability by presenting Ridesharing Measurement Suite (RMS). RMS removes the barrier of entry for analyzing the availability and surge pricing of ridesharing services for ridesharing users, researchers from various scientific domains, and regulators. RMS continuously collects the data of the availability and surge pricing of ridesharing services. It exposes real-time data of these services through i) graphical user interfaces and ii) public APIs to assist various stakeholders of these services and simplify the data collection and analysis process for future ridesharing research studies. To signify the utility of RMS, we deployed RMS to collect and analyze the availability and surge pricing data of 10 ridesharing services operating in nine countries for eight weeks in pre and during pandemic periods. Using the data collected and analyzed by RMS, we identify that previous articles miscalculated the utilization of ridesharing services as they did not count in the vehicles driving in multiple categories of the same service. We observe that during COVID-19, the supply of ridesharing services decreased by 54%, utilization of available vehicles increased by 6%, and a 5 × increase in the surge frequency of services. We also find that surge occurs in a small geographical region, and its intensity reduces by 50% in about 0.5 miles away from the location of a surge. We present several other interesting observations on ridesharing services’ availability and surge pricing.",
  "tags": [
    "Ridesharing services",
    "Gig economy",
    "Uber",
    "COVID 19",
    "Surge"
  ],
  "authors": [
    {
      "name": "Hassan Ali Khan",
      "institution": "Computers Science Department, North Carolina State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660206550",
      "orcid": "missing"
    },
    {
      "name": "Hassan Iqbal",
      "institution": "North Carolina State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659139425",
      "orcid": "missing"
    },
    {
      "name": "Muhammad Shahzad",
      "institution": "Department of Computer Science, North Carolina State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384604994",
      "orcid": "missing"
    },
    {
      "name": "Guoliang Jin",
      "institution": "Department of Computer Science, North Carolina State University, United States",
      "img": "/do/10.1145/contrib-81470644031/rel-imgonly/headshot.jpg",
      "acmid": "81470644031",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jacob Benesty. 2019. Pearson Correlation Coefficient. Wikipedia. Retrieved (August 28, 2021) from https://en.wikipedia.org/wiki/Pearson_correlation_coefficient",
      "doi": ""
    },
    {
      "text": "Shannon Bond. 2020. Lyft Lays Off Nearly 1,000 Employees As Virus Saps Demand For Rides. NPR. Retrieved (August 28, 2021) from https://www.npr.org/sections/coronavirus-live-updates/2020/04/29/847904818/lyft-lays-off-nearly-1-000-employees-as-virus-saps-demand-for-rides",
      "doi": ""
    },
    {
      "text": "Anne Elizabeth Brown. 2018. Ridehail revolution: Ridehail travel and equity in Los Angeles. Ph.D. Dissertation. UCLA.",
      "doi": ""
    },
    {
      "text": "Michael Bustle. 2022. GEARS in North Carolina - Global Training Initiative. https://gti.ncsu.edu/gears/. (Accessed on 02/19/2022).",
      "doi": ""
    },
    {
      "text": "Juan Camilo Castillo, Dan Knoepfle, and Glen Weyl. 2017. Surge Pricing Solves the Wild Goose Chase. In Proceedings of the 2017 ACM Conference on Economics and Computation (Cambridge, Massachusetts, USA) (EC ’17). Association for Computing Machinery, New York, NY, USA, 241–242. https://doi.org/10.1145/3033274.3085098",
      "doi": "10.1145/3033274.3085098"
    },
    {
      "text": "Brian Caulfield. 2009. Estimating the environmental benefits of ride-sharing: A case study of Dublin. Transportation Research Part D: Transport and Environment 14, 7(2009), 527–531.",
      "doi": ""
    },
    {
      "text": "Le Chen, Alan Mislove, and Christo Wilson. 2015. Peeking Beneath the Hood of Uber. In Proceedings of the 2015 Internet Measurement Conference (Tokyo, Japan) (IMC ’15). Association for Computing Machinery, New York, NY, USA, 495–508. https://doi.org/10.1145/2815675.2815681",
      "doi": "10.1145/2815675.2815681"
    },
    {
      "text": "Blerim Cici, Athina Markopoulou, Enrique Frias-Martinez, and Nikolaos Laoutaris. 2014. Assessing the Potential of Ride-Sharing Using Mobile and Social Data: A Tale of Four Cities. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Seattle, Washington) (UbiComp ’14). Association for Computing Machinery, New York, NY, USA, 201–211. https://doi.org/10.1145/2632048.2632055",
      "doi": "10.1145/2632048.2632055"
    },
    {
      "text": "Bryna Corcoran. 2019. Lyft National Statistics 2019. Lyft. Retrieved (August 28, 2021) from https://www.lyftimpact.com/stats/national",
      "doi": ""
    },
    {
      "text": "Judd Cramer and Alan B Krueger. 2016. Disruptive change in the taxi business: The case of Uber. American Economic Review 106, 5 (2016), 177–82.",
      "doi": ""
    },
    {
      "text": "Tawanna R. Dillahunt, Vaishnav Kameswaran, Linfeng Li, and Tanya Rosenblat. 2017. Uncovering the Values and Constraints of Real-Time Ridesharing for Low-Resource Populations. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 2757–2769. https://doi.org/10.1145/3025453.3025470",
      "doi": "10.1145/3025453.3025470"
    },
    {
      "text": "Erica Fink. 2014. Uber threatens drivers: Do not work for Lyft. CNN. Retrieved August 26, 2021 from https://ride.guru/lounge/p/what-is-the-average-trip-distance-for-an-uber-or-lyft-ride",
      "doi": ""
    },
    {
      "text": "Tasneem France. 2019. Capetown Bus Service Schedules. MyCiti. Retrieved (August 28, 2021) from www.myciti.org.za",
      "doi": ""
    },
    {
      "text": "Yanbo Ge, Christopher R Knittel, Don MacKenzie, and Stephen Zoepf. 2016. Racial and gender discrimination in transportation network companies. Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "Suiming Guo, Chao Chen, Jingyuan Wang, Yaxiao Liu, Ke Xu, and Dah Ming Chiu. 2018. Dynamic Price Prediction in Ride-on-Demand Service with Multi-Source Urban Data. In Proceedings of the 15th EAI International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services (New York, NY, USA) (MobiQuitous ’18). Association for Computing Machinery, New York, NY, USA, 412–421. https://doi.org/10.1145/3286978.3286992",
      "doi": "10.1145/3286978.3286992"
    },
    {
      "text": "Suiming Guo, Chao Chen, Jingyuan Wang, Yaxiao Liu, Ke Xu, and Dah Ming Chiu. 2020. Fine-grained dynamic price prediction in ride-on-demand services: Models and evaluations. Mobile Networks and Applications 25, 2 (2020), 505–520.",
      "doi": "10.1007/s11036-019-01308-5"
    },
    {
      "text": "Snigdha Gutha. 2017. Analyzing the Effect of Weather on Uber Ridership. SAS. https://support.sas.com/resources/papers/proceedings17/1260-2017.pdf(Accessed on 07/15/2021).",
      "doi": ""
    },
    {
      "text": "Steve Hawk. 2018. What an Economist Is Learning by Driving for Uber. Stanford. https://www.gsb.stanford.edu/insights/what-economist-learning-driving-uber",
      "doi": ""
    },
    {
      "text": "Andrew Hawkins. 2018. Lyft hits a major milestone of 1 billion trips. The Verge. Retrieved (August 28, 2021) from https://www.theverge.com/2018/9/18/17871514/lyft-milestone-one-billion-trips-rides",
      "doi": ""
    },
    {
      "text": "Andrew J. Hawkins. 2020. Uber lays off 3,000 more employees in latest round of COVID-19-inspired cuts. The Verge. Retrieved (August 28, 2021) from https://www.theverge.com/2020/5/18/21262337/uber-layoff-3000-employees-covid-19-coronavirus",
      "doi": ""
    },
    {
      "text": "Alejandro Henao. 2017. Impacts of Ridesourcing-Lyft and Uber-on Transportation Including VMT. Mode Replacement, Parking, and Travel Behavior 7, 3 (2017), 201–211.",
      "doi": ""
    },
    {
      "text": "Alex Hern. 2017. Uber denies misleading passengers with ’phantom cars’ in its app. Business Insider. Retrieved (August 28, 2021) from https://www.businessinsider.com/uber-denies-misleading-passengers-with-phantom-cars-in-its-app-2015-7",
      "doi": ""
    },
    {
      "text": "Charles G. Hill, Maren Haag, Alannah Oleson, Chris Mendez, Nicola Marsden, Anita Sarma, and Margaret Burnett. 2017. Gender-Inclusiveness Personas vs. Stereotyping: Can We Have It Both Ways?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6658–6671. https://doi.org/10.1145/3025453.3025609",
      "doi": "10.1145/3025453.3025609"
    },
    {
      "text": "Hyeonjun Hwang. 2016. Measuring the Benefits of Ridesharing Services to Urban Travelers. growth 29, 2 (2016), 2.",
      "doi": ""
    },
    {
      "text": "Shan Jiang, Le Chen, Alan Mislove, and Christo Wilson. 2018. On Ridesharing Competition and Accessibility: Evidence from Uber, Lyft, and Taxi. In Proceedings of the 2018 World Wide Web Conference (Lyon, France) (WWW ’18). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, CHE, 863–872. https://doi.org/10.1145/3178876.3186134",
      "doi": "10.1145/3178876.3186134"
    },
    {
      "text": "Anto Joseph. 2018. frida-android-hooks. Frida Hooks. Retrieved (August 28, 2021) from https://github.com/antojoseph/frida-android-hooks",
      "doi": ""
    },
    {
      "text": "Joseph Kasera, Jacki O’Neill, and Nicola J Bidwell. 2016. Sociality, Tempo & Flow: Learning from Namibian Ridesharing. In Proceedings of the First African Conference on Human Computer Interaction. ACM New York, USA, New York, USA, 36–47.",
      "doi": "10.1145/2998581.2998582"
    },
    {
      "text": "Hassan Ali Khan. 2021. Graph plotting scripts used in this paper.NC State University. Retrieved (August 28, 2021) from https://github.com/rmsstudydata/graphScripts",
      "doi": ""
    },
    {
      "text": "Hassan Ali Khan. 2021. Program to consume the APIs of RMS. NC State University. Retrieved (August 28, 2021) from https://github.com/rmsstudydata/graphScripts/tree/main/RMS-Tool%20Data%20Collection%20Scripts/ML%20Scripts",
      "doi": ""
    },
    {
      "text": "Hassan Ali Khan. 2021. Ridesharing Measurement Tool -APIs. NC State University. Retrieved (August 28, 2021) from https://rmstool.com/api",
      "doi": ""
    },
    {
      "text": "Hassan Ali Khan. 2021. Ridesharing Measurement Tool -GUI.NC State University. Retrieved (August 28, 2021) from https://rmstool.com",
      "doi": ""
    },
    {
      "text": "Brenton J Malin and Curry Chandler. 2016. Free to work anxiously: Splintering precarity among drivers for Uber and Lyft. Communication, Culture & Critique 10, 2 (2016), 382–400.",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Elizabeth D Mynatt, and David R Kaufman. 2006. Investigating health management practices of individuals with diabetes. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM New York, NY, USA, =New York, NY, USA, 927–936.",
      "doi": "10.1145/1124772.1124910"
    },
    {
      "text": "A MARGHALL. 2018. Dying to know Uber’s secrets, data-hungry cities get creative. Wired 3, 09 (2018), 2018.",
      "doi": ""
    },
    {
      "text": "Lawrence Mishel. 2019. Uber and the labor market. Uber. Retrieved (August 28, 2021) from https://www.epi.org/publication/uber-and-the-labor-market-uber-drivers-compensation-wages-and-the-scale-of-uber-and-the-gig-economy",
      "doi": ""
    },
    {
      "text": "Big Nox. 2021. NoxPlayer - Free Android Emulator on PC and Mac. Nox. (Accessed on 09/09/2021).",
      "doi": ""
    },
    {
      "text": "Anna Offenwanger, Alan John Milligan, Minsuk Chang, Julia Bullard, and Dongwook Yoon. 2021. Diagnosing bias in the gender representation of HCI research participants: how it happens and where we are. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM New York, NY, USA, New York, NY, USA, 1–18.",
      "doi": "10.1145/3411764.3445383"
    },
    {
      "text": "Ben Popper. 2014. Introduction to Bayesian Statistics. The Verge. Retrieved (August 28, 2021) from https://www.theverge.com/2014/2/26/5445210/in-san-diego-uber-kept-drivers-off-the-road-to-encourage-surge",
      "doi": ""
    },
    {
      "text": "Lisa Rayle, Susan A Shaheen, Nelson Chan, Danielle Dai, and Robert Cervero. 2014. App-based, on-demand ride services: comparing taxi and ridesourcing trips and user characteristics in San Francisco. Technical Report. Citeseer.",
      "doi": ""
    },
    {
      "text": "Charles S.2021. Bulk Mobile number use for Phone verification by receive SMS online, help verify bulk accounts. Get SMS Code. (Accessed on 12/16/2021).",
      "doi": ""
    },
    {
      "text": "Sara Silverstein. 2014. A recent study shows that ride sharing is cheaper than taxicab in 21 largest cities in the United States.Business Insider. (Accessed on 12/16/2021).",
      "doi": ""
    },
    {
      "text": "Benjamin Snyder. 2017. Uber denies there are ‘phantom’ cars in its app. Fortune. Retrieved (August 28, 2021) from https://fortune.com/2015/07/30/uber-phantom-cars/",
      "doi": ""
    },
    {
      "text": "Sudeep Srivastav. 2020. Uber Statistics (2019-2020 Updated). Appinventiv. Retrieved (August 28, 2021) from https://appinventiv.com/blog/uber-statistics/#A27",
      "doi": ""
    },
    {
      "text": "Ippei Takahashi. 2018. What is the average trip distance for an Uber or Lyft Ride?Ride Guru. Retrieved (August 28, 2021) from https://ride.guru/lounge/p/what-is-the-average-trip-distance-for-an-uber-or-lyft-ride",
      "doi": ""
    },
    {
      "text": "Ye Tian Tian, Jian Sun Sun, He Dong Dong, and Guoyang Qin Qin. 2020. Quantifying the Impact of Rainfall on Taxi Hailing and Operation. Journal of Advanced Transportation 14, 7 (2020), 201–211.",
      "doi": ""
    },
    {
      "text": "Karl von Randow. 2019. Charles Proxy. Charles. Retrieved (August 28, 2021) from https://www.charlesproxy.com",
      "doi": ""
    },
    {
      "text": "Mihaela Vorvoreanu, Lingyi Zhang, Yun-Han Huang, Claudia Hilderbrand, Zoe Steine-Hanson, and Margaret Burnett. 2019. From Gender Biases to Gender-Inclusive Design: An Empirical Investigation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300283",
      "doi": "10.1145/3290605.3300283"
    },
    {
      "text": "Itay Wein. 2020. How much does Gett Taxi cost?Gett. https://gett.com/uk/faq/user-faqs/getting-started/how-much-does-gett-taxi-cost",
      "doi": ""
    },
    {
      "text": "Tim Wheatcroft. 2019. Certify Ride Hailing Report: Uber and Lyft Achieve Record Popularity. Boston News. Retrieved (August 28, 2021) from https://www.boston.com/news/business/2016/06/28/uber-data-boston-wants",
      "doi": ""
    },
    {
      "text": "Hamid Zaeri. 2016. SSLUnpinning Xposed. Xposed Framework. Retrieved (August 28, 2021) from https://github.com/ac-pm/SSLUnpinning_Xposed",
      "doi": ""
    }
  ]
}