{
  "doi": "10.1145/3491102.3517613",
  "title": "A Large-Scale Measurement of Cybercrime Against Individuals",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-41",
  "year": 2022,
  "badges": [],
  "abstract": "We know surprisingly little about the prevalence and severity of cybercrime in the U.S. Yet, in order to prioritize the development and distribution of advice and technology to protect end users, we require empirical evidence regarding cybercrime. Measuring crime, including cybercrime, is a challenging problem that relies on a combination of direct crime reports to the government – which have known issues of under-reporting – and assessment via carefully-designed self-report surveys. We report on the first large-scale, nationally representative academic survey (n=11,953) of consumer cybercrime experiences in the U.S. Our analysis answers four research questions: (1) What is the prevalence and (2) the monetary impact of these cybercrimes we measure in the U.S.?, (3) Do inequities exist in victimization?, and (4) Can we improve cybercrime measurement by leveraging social-reporting techniques used to measure physical crime? Our analysis also offers insight toward improving future measurement of cybercrime and protecting users.",
  "authors": [
    {
      "name": "Casey Breen",
      "institution": "University of California, Berkeley, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238889",
      "orcid": "missing"
    },
    {
      "name": "Cormac Herley",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81323490981",
      "orcid": "missing"
    },
    {
      "name": "Elissa M. Redmiles",
      "institution": "Max Planck Institute for Software Systems, Germany",
      "img": "/do/10.1145/contrib-87258829257/rel-imgonly/2017headshot.jpg",
      "acmid": "87258829257",
      "orcid": "0000-0003-3930-8128"
    }
  ],
  "references": [
    {
      "text": "T Almeida. 2007. Gartner Survey Shows Phishing Attacks Escalated in 2007/More than $3 Billion Lost to These Attacks. Technical Report N/A. Gartner. N/A pages.",
      "doi": ""
    },
    {
      "text": "Teresa Almeida, Rob Comber, and Madeline Balaam. 2016. HCI and Intimate Care as an Agenda for Change in Women’s Health. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 2599–2611. https://doi.org/10.1145/2858036.2858187",
      "doi": "10.1145/2858036.2858187"
    },
    {
      "text": "Nazanin Andalibi. 2020. Disclosure, Privacy, and Stigma on Social Media: Examining Non-Disclosure of Distressing Experiences. ACM transactions on computer-human interaction (TOCHI) 27, 3(2020), 1–43.",
      "doi": ""
    },
    {
      "text": "Keith B Anderson. 2019. Mass-Market Consumer Fraud in the United States: A 2017 Update. Technical Report. Federal Trade Commission.",
      "doi": ""
    },
    {
      "text": "Ross Anderson, Chris Barton, Rainer Boehme, Richard Clayton, Carlos Ganan, Tom Grasso, Michael Levi, Tyler Moore, and Marie Vasek. 2019. Measuring the Changing Cost of Cybercrime. In Workshop on the Economics of Information Security, Vol. WEISS 2019. WEISS, Boston, MA, 32. https://doi.org/10.17863/CAM.41598",
      "doi": ""
    },
    {
      "text": "Ross Anderson, Chris Barton, Rainer Böhme, Richard Clayton, Michel J. G. van Eeten, Michael Levi, Tyler Moore, and Stefan Savage. 2013. Measuring the Cost of Cybercrime. In The Economics of Information Security and Privacy, Rainer Böhme (Ed.). Springer, Berlin, Heidelberg, 265–300. https://doi.org/10.1007/978-3-642-39498-0_12",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer and M. Six Silberman. 2011. When the Implication Is Not to Design (Technology). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 2271–2274. https://doi.org/10.1145/1978942.1979275",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Paul C Beatty and Gordon B Willis. 2007. Research Synthesis: The Practice of Cognitive Interviewing. Public opinion quarterly 71, 2 (2007), 287–311.",
      "doi": ""
    },
    {
      "text": "Ingolf Becker, Alice Hutchings, Ruba Abu-Salma, Ross Anderson, Nicholas Bohm, Steven J Murdoch, M Angela Sasse, and Gianluca Stringhini. 2017. International Comparison of Bank Fraud Reimbursement: Customer Perceptions and Contractual Terms. Journal of Cybersecurity 3, 2 (June 2017), 109–125. https://doi.org/10.1093/cybsec/tyx011",
      "doi": ""
    },
    {
      "text": "Rosanna Bellini, Nicola Dell, Monica Whitty, Debasis Bhattacharya, David Wall, and Pamela Briggs. 2020. Crime and/or Punishment: Joining the Dots between Crime, Legality and HCI. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3375176",
      "doi": "10.1145/3334480.3375176"
    },
    {
      "text": "Maia J. Boyd, Jamar L. Sullivan Jr., Marshini Chetty, and Blase Ur. 2021. Understanding the Security and Privacy Advice Given to Black Lives Matter Protesters. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–18. https://doi.org/10.1145/3411764.3445061",
      "doi": "10.1145/3411764.3445061"
    },
    {
      "text": "Karoline Busse, Mohammad Tahaei, Katharina Krombholz, Emanuel von Zezschwitz, Matthew Smith, Jing Tian, and Wenyuan Xu. 2020. Cash, Cards or Cryptocurrencies? A Study of Payment Culture in Four Countries. In 2020 IEEE European Symposium on Security and Privacy Workshops (EuroS&PW). IEEE, Genoa, Italy, 200–209. https://doi.org/10.1109/EuroSPW51379.2020.00035",
      "doi": ""
    },
    {
      "text": "David Cantor and James P Lynch. 2000. Self-Report Surveys as Measures of Crime and Criminal Victimization. Criminal justice 4, 2000 (2000), 85–138.",
      "doi": ""
    },
    {
      "text": "Center for Strategic and International Studies. 2014. Net Losses: Estimating the Global Cost of Cybercrime.",
      "doi": ""
    },
    {
      "text": "Center for Strategic and International Studies. 2020. The Hidden Costs of Cybercrime.",
      "doi": ""
    },
    {
      "text": "Linchiat Chang and Jon A Krosnick. 2010. Comparing Oral Interviewing with Self-Administered Computerized Questionnaires: An Experiment. Public Opinion Quarterly 74, 1 (2010), 154–167.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission 2020. Consumer Sentinel Network Data Book 2019.",
      "doi": ""
    },
    {
      "text": "Cassandra Cross. 2015. No Laughing Matter: Blaming the Victim of Online Fraud. International Review of Victimology 21, 2 (May 2015), 187–204. https://doi.org/10.1177/0269758015571471",
      "doi": ""
    },
    {
      "text": "Cassandra Cross, Kelly Richards, and Russell G Smith. 2016. The Reporting Experiences and Support Needs of Victims of Online Fraud. Trends and issues in crime and criminal justice 1, 518 (2016), 1–14.",
      "doi": ""
    },
    {
      "text": "J. Michael Dennis. 2020. Technical Overview of the Amerispeak Panel.",
      "doi": ""
    },
    {
      "text": "Serge Egelman, Lorrie Faith Cranor, and Jason Hong. 2008. You’ve Been Warned: An Empirical Study of the Effectiveness of Web Browser Phishing Warnings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’08). Association for Computing Machinery, New York, NY, USA, 1065–1074. https://doi.org/10.1145/1357054.1357219",
      "doi": "10.1145/1357054.1357219"
    },
    {
      "text": "Greg Freedman Ellis, Thomas Lumley, Tomasz Żółtak, Ben Schneider, and Pavel N. Krivitsky. 2021. Srvyr: ’Dplyr’-Like Syntax for Summary Statistics of Survey Data.",
      "doi": ""
    },
    {
      "text": "Cori Faklaris, Laura Dabbish, and Jason I. Hong. 2019. A Self-Report Measure of End-User Security Attitudes (SA-6). In Proceedings of the Fifteenth USENIX Conference on Usable Privacy and Security(SOUPS’19). USENIX Association, USA, 61–77.",
      "doi": "10.5555/3361476.3361481"
    },
    {
      "text": "Federal Bureau of Investigation. n.d.. The Nation’s Two Crime Measures.",
      "doi": ""
    },
    {
      "text": "Federal Bureau of Investigation. n.d.. Nigerian Letter or “419” Fraud.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission. 2007. Identity Theft Survey Report. Technical Report. Federal Trade Commission.",
      "doi": ""
    },
    {
      "text": "Dennis M. Feehan and Matthew J. Salganik. 2016. Generalizing the Network Scale-Up Method: A New Estimator for the Size of Hidden Populations. Sociological methodology 46, 1 (Aug. 2016), 153–186. https://doi.org/10.1177/0081175016665425",
      "doi": ""
    },
    {
      "text": "Dennis M. Feehan and Matthew J. Salganik. 2016. Networkreporting: Tools for Using Network Reporting Estimators.",
      "doi": ""
    },
    {
      "text": "Dinei Florêncio and Cormac Herley. 2012. Is Everything We Know about Password Stealing Wrong?IEEE Security Privacy 10, 6 (Nov. 2012), 63–69. https://doi.org/10.1109/MSP.2012.57",
      "doi": ""
    },
    {
      "text": "Dinei Florêncio and Cormac Herley. 2013. Sex, Lies and Cyber-Crime Surveys. In Economics of Information Security and Privacy III. Springer, Economics of information security and privacy III, 35–53.",
      "doi": ""
    },
    {
      "text": "Kenneth Friedman. 1982. Victims and Helpers: Reactions to Crime. US Department of Justice, National Institute of Justice, Washington, DC.",
      "doi": ""
    },
    {
      "text": "Alisa Frik, Leysan Nurgalieva, Julia Bernd, Joyce Lee, Florian Schaub, and Serge Egelman. 2019. Privacy and Security Threat Models and Mitigation Strategies of Older Adults. In Fifteenth Symposium on Usable Privacy and Security (SOUPS 2019). SOUPS, Santa Clara, CA, 21–40.",
      "doi": ""
    },
    {
      "text": "Martin S. Greenberg and R. Barry Ruback. 1992. After the Crime: Victim Decision Making. Plenum Press, Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Robert M. Groves, Floyd J. Fowler Jr, Mick P. Couper, James M. Lepkowski, Eleanor Singer, and Roger Tourangeau. 2009. Survey Methodology. John Wiley & Sons, Hoboken, NJ, USA.",
      "doi": ""
    },
    {
      "text": "Aliakbar Haghdoost, Milad Ahmadi Gohari, Ali Mirzazadeh, Farzaneh Zolala, and Mohammad Reza Baneshi. 2018. A Review of Methods to Estimate the Visibility Factor for Bias Correction in Network Scale-up Studies. Epidemiology and Health 40 (Aug. 2018), e2018041. https://doi.org/10.4178/epih.e2018041",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai and Yuli Patrick Hsieh. 2012. Succinct Survey Measures of Web-Use Skills. Social Science Computer Review 30, 1 (2012), 95–107.",
      "doi": "10.1177/0894439310397146"
    },
    {
      "text": "Roberta Heale and Dorothy Forbes. 2013. Understanding Triangulation in Research. Evidence Based Nursing 16, 4 (Oct. 2013), 98–98. https://doi.org/10.1136/eb-2013-101494",
      "doi": ""
    },
    {
      "text": "Michael J. Hindelang, Travis Hirschi, and Joseph G. Weis. 1979. Correlates of Delinquency: The Illusion of Discrepancy between Self-Report and Official Measures. American Sociological Review 44, 6 (1979), 995–1014. https://doi.org/10.2307/2094722",
      "doi": ""
    },
    {
      "text": "HMD. 2021. Human Mortality Database. (2021).",
      "doi": ""
    },
    {
      "text": "Danny Yuxing Huang, Maxwell Matthaios Aliapoulios, Vector Guo Li, Luca Invernizzi, Elie Bursztein, Kylie McRoberts, Jonathan Levin, Kirill Levchenko, Alex C. Snoeren, and Damon McCoy. 2018. Tracking Ransomware End-to-end. In 2018 IEEE Symposium on Security and Privacy (SP). IEEE, San Francisco, CA, 618–631. https://doi.org/10.1109/SP.2018.00047",
      "doi": ""
    },
    {
      "text": "Connor Huff and Dustin Tingley. 2015. “Who Are These People?” Evaluating the Demographic Characteristics and Political Preferences of MTurk Survey Respondents. Research & Politics 2, 3 (2015), 2053168015604648.",
      "doi": ""
    },
    {
      "text": "Internet Crime Complaint Center. 2019. Internet Crime Report. Technical Report. Federal Bureau of Investigation.",
      "doi": ""
    },
    {
      "text": "Lilli Japec, Frauke Kreuter, Marcus Berg, Paul Biemer, Paul Decker, Cliff Lampe, Julia Lane, Cathy O?Neil, and Abe Usher. 2015. Big Data in Survey Research: AAPOR Task Force Report. Public Opinion Quarterly 79, 4 (2015), 839–880.",
      "doi": ""
    },
    {
      "text": "Josine Junger-Tas and Ineke Haen Marshall. 1999. The Self-Report Methodology in Crime Research. Crime and justice 25(1999), 291–367.",
      "doi": ""
    },
    {
      "text": "Charles Kadushin, Peter D. Killworth, H. Russell Bernard, and Andrew A. Beveridge. 2006. Scale-Up Methods as Applied to Estimates of Heroin Use. Journal of Drug Issues 36, 2 (April 2006), 417–440. https://doi.org/10.1177/002204260603600209",
      "doi": ""
    },
    {
      "text": "Steven Kemp, David Buil-Gil, Asier Moneva, Fernando Miró-Llinares, and Nacho Díaz-Castaño. 2021. Empty Streets, Busy Internet: A Time-Series Analysis of Cybercrime and Fraud Trends During COVID-19. Journal of Contemporary Criminal Justice 37, 4 (Nov. 2021), 480–501. https://doi.org/10.1177/10439862211027986",
      "doi": ""
    },
    {
      "text": "Peter D. Killworth, Eugene C. Johnsen, Christopher McCarty, Gene Ann Shelley, and H.Russell Bernard. 1998. A Social Network Approach to Estimating Seroprevalence in the United States. Social Networks 20, 1 (Jan. 1998), 23–50. https://doi.org/10.1016/S0378-8733(96)00305-X",
      "doi": ""
    },
    {
      "text": "Peter D. Killworth, Christopher McCarty, H. Russell Bernard, Gene Ann Shelley, and Eugene C. Johnsen. 1998. Estimation of Seroprevalence, Rape, and Homelessness in the United States Using a Social Network Approach. Evaluation Review 22, 2 (April 1998), 289–308. https://doi.org/10.1177/0193841X9802200205",
      "doi": ""
    },
    {
      "text": "Jooyoung Lee, Sarah Michele Rajtmajer, Eesha Srivatsavaya, and Shomir Wilson. 2021. Digital Inequality through the Lens of Self-Disclosure.Proc. Priv. Enhancing Technol. 2021, 3 (2021), 373–393.",
      "doi": ""
    },
    {
      "text": "Amanda Lenhart. 2005. About 25 Million People Have Used the Internet to Sell Something.",
      "doi": ""
    },
    {
      "text": "Eric Lin, Saul Greenberg, Eileah Trotter, David Ma, and John Aycock. 2011. Does Domain Highlighting Help People Identify Phishing Sites?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 2075–2084. https://doi.org/10.1145/1978942.1979244",
      "doi": "10.1145/1978942.1979244"
    },
    {
      "text": "James P Lynch. 2006. Problems and Promise of Victimization Surveys for Cross-National Research. Crime and justice 34, 1 (2006), 229–287.",
      "doi": ""
    },
    {
      "text": "Mary Madden. 2017. Privacy, Security, and Digital Inequality. Data & Society N/A, N/A (2017), 125.",
      "doi": ""
    },
    {
      "text": "Tyler H. McCormick, Matthew J. Salganik, and Tian Zheng. 2010. How Many People Do You Know?: Efficiently Estimating Personal Network Size. J. Amer. Statist. Assoc. 105, 489 (March 2010), 59–70. https://doi.org/10.1198/jasa.2009.ap08518",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and Inter-Rater Reliability in Qualitative Research: Norms and Guidelines for CSCW and HCI Practice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359174"
    },
    {
      "text": "NortonLifeLock. 2019. Cyber Safety Insights Report. Technical Report. Norton. 3–9 pages.",
      "doi": ""
    },
    {
      "text": "Simon Parkin, Elissa M. Redmiles, Lynne Coventry, and M. Angela Sasse. 2019. Security When It Is Welcome: Exploring Device Purchase as an Opportune Moment for Security Behavior Change. In Proceedings 2019 Workshop on Usable Security. Internet Society, San Diego, CA, 2–10. https://doi.org/10.14722/usec.2019.23024",
      "doi": ""
    },
    {
      "text": "Pew Research Center. n.d.. Questionnaire Design.",
      "doi": ""
    },
    {
      "text": "Kathleen H. Pine and Max Liboiron. 2015. The Politics of Measurement and Action. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, New York, NY, USA, 3147–3156. https://doi.org/10.1145/2702123.2702298",
      "doi": "10.1145/2702123.2702298"
    },
    {
      "text": "Emilee Rader, Rick Wash, and Brandon Brooks. 2012. Stories as Informal Lessons about Security. In Proceedings of the Eighth Symposium on Usable Privacy and Security(SOUPS ’12). Association for Computing Machinery, New York, NY, USA, 1–17. https://doi.org/10.1145/2335356.2335364",
      "doi": "10.1145/2335356.2335364"
    },
    {
      "text": "Elissa M. Redmiles. 2019. ”Should I Worry?” A Cross-Cultural Examination of Account Security Incident Response. In 2019 IEEE Symposium on Security and Privacy (SP). IEEE Computer Society, San Francisco, CA, 1107–1121. https://doi.org/10.1109/SP.2019.00059",
      "doi": ""
    },
    {
      "text": "Elissa M. Redmiles, Sean Kross, and Michelle L. Mazurek. 2016. How I Learned to Be Secure: A Census-Representative Survey of Security Advice Sources and Behavior. In Proceedings of the 2016 ACM SIGSAC Conference on Computer and Communications Security(CCS ’16). Association for Computing Machinery, New York, NY, USA, 666–677. https://doi.org/10.1145/2976749.2978307",
      "doi": "10.1145/2976749.2978307"
    },
    {
      "text": "Elissa M. Redmiles, Sean Kross, and Michelle L. Mazurek. 2017. Where Is the Digital Divide? A Survey of Security, Privacy, and Socioeconomics. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 931–936. https://doi.org/10.1145/3025453.3025673",
      "doi": "10.1145/3025453.3025673"
    },
    {
      "text": "Elissa M. Redmiles, Sean Kross, and Michelle L. Mazurek. 2019. How Well Do My Results Generalize? Comparing Security and Privacy Survey Results from MTurk, Web, and Telephone Samples. In 2019 IEEE Symposium on Security and Privacy (SP). IEEE, Shanghai, China, 1326–1343. https://doi.org/10.1109/SP.2019.00014",
      "doi": ""
    },
    {
      "text": "Elissa M. Redmiles, Amelia R. Malone, and Michelle L. Mazurek. 2016. I Think They’re Trying to Tell Me Something: Advice Sources and Selection for Digital Security. In 2016 IEEE Symposium on Security and Privacy (SP). IEEE, Glasgow, Scotland, 272–288. https://doi.org/10.1109/SP.2016.24",
      "doi": ""
    },
    {
      "text": "Elissa M. Redmiles, Noel Warford, Amritha Jayanti, Aravind Koneru, Sean Kross, Miraida Morales, Rock Stevens, and Michelle L. Mazurek. 2020. A Comprehensive Quality Evaluation of Security and Privacy Advice on the Web. In 29th USENIX Security Symposium (USENIX Security 20). USENIX, Virtual, 89–108.",
      "doi": ""
    },
    {
      "text": "Markus Riek, Rainer Bohme, Michael Ciere, Carlos Ganan, and Michel van Eeten. 2016. Estimating the Costs of Consumer-Facing Cybercrime: A Tailored Instrument and Representative Data for Six EU Countries. Workshop on the Economics of Information Security (WEIS), University of California at Berkeley 2016 (2016), 1–43.",
      "doi": ""
    },
    {
      "text": "Matthew J. Salganik, Dimitri Fazito, Neilane Bertoni, Alexandre H. Abdo, Maeve B. Mello, and Francisco I. Bastos. 2011. Assessing Network Scale-up Estimates for Groups Most at Risk of HIV/AIDS: Evidence From a Multiple-Method Study of Heavy Drug Users in Curitiba, Brazil. American Journal of Epidemiology 174, 10 (Nov. 2011), 1190–1196. https://doi.org/10.1093/aje/kwr246",
      "doi": ""
    },
    {
      "text": "Neil Salkind. 2022. Encyclopedia of Research Design. SAGE Publications Vols. 1-0 (Feb. 2022), N/A. https://doi.org/10.4135/9781412961288",
      "doi": ""
    },
    {
      "text": "Yukiko Sawaya, Mahmood Sharif, Nicolas Christin, Ayumu Kubota, Akihiro Nakarai, and Akira Yamada. 2017. Self-Confidence Trumps Knowledge: A Cross-Cultural Study of Security Behavior. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 2202–2214. https://doi.org/10.1145/3025453.3025926",
      "doi": "10.1145/3025453.3025926"
    },
    {
      "text": "Russell G Smith and Tabor Akman. 2008. Raising Public Awareness of Consumer Fraud in Australia.Trends and issues in crime and criminal justice AIC Trends & Issues in Crime and Criminal Justice, 349 (2008), 1–6.",
      "doi": ""
    },
    {
      "text": "Elizabeth Sully, Margaret Giorgio, and Selena Anjur-Dietrich. 2020. Estimating Abortion Incidence Using the Network Scale-up Method. Demographic Research 43 (Dec. 2020), 1651–1684. https://doi.org/10.4054/DemRes.2020.43.56",
      "doi": ""
    },
    {
      "text": "Rob Thomson and John Langley. 2004. Who Do Young Adult Victims of Physical Assault Talk to about Their Experiences?Journal of Community Psychology 32, 4 (2004), 479–488.",
      "doi": ""
    },
    {
      "text": "Roger Tourangeau. 2003. Cognitive aspects of survey measurement and mismeasurement. International Journal of Public Opinion Research 15, 1 (2003), 3–7.",
      "doi": ""
    },
    {
      "text": "UK Data Service. 2019. Crime Survey for England and Wales [Data File].",
      "doi": ""
    },
    {
      "text": "Jessica Vitak, Yuting Liao, Mega Subramaniam, and Priya Kumar. 2018. ’I Knew It Was Too Good to Be True” the Challenges Economically Disadvantaged Internet Users Face in Assessing Trustworthiness, Avoiding Scams, and Developing Self-Efficacy Online. Proceedings of the ACM on human-computer interaction 2, CSCW(2018), 1–25.",
      "doi": "10.1145/3274445"
    },
    {
      "text": "Jun Wang, Ying Yang, Wan Zhao, Hualin Su, Yanping Zhao, Yue Chen, Tao Zhang, and Tiejun Zhang. 2015. Application of Network Scale Up Method in the Estimation of Population Size for Men Who Have Sex with Men in Shanghai, China. PLOS ONE 10, 11 (Nov. 2015), e0143118. https://doi.org/10.1371/journal.pone.0143118",
      "doi": ""
    },
    {
      "text": "Matthijs J Warrens. 2015. Five Ways to Look at Cohen’s Kappa. Journal of Psychology & Psychotherapy 5, 4 (2015), 1.",
      "doi": ""
    },
    {
      "text": "Rick Wash and Molly M. Cooper. 2018. Who Provides Phishing Training? Facts, Stories, and People Like Me. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": ""
    },
    {
      "text": "Rick Wash and Emilee Rader. 2015. Too Much Knowledge? Security Beliefs and Protective Behaviors Among United States Internet Users. In Eleventh Symposium On Usable Privacy and Security (SOUPS 2015). SOUPS, Ottawa, Canada, 309–325.",
      "doi": ""
    }
  ]
}