{
  "doi": "10.1145/3491102.3501860",
  "title": "Co-Imagining the Future of Playable Cities: A Bottom-Up, Multi-Stakeholder Speculative Inquiry into the Playful Potential of Urban Technology",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2022,
  "badges": [],
  "abstract": "Here we present a co-design exploration into the potential of technology to playfully re-signify urban spaces. We created a speculative catalog of urban tech and used it to facilitate multi-stakeholder discussions about the playful potential of smart cities. The learnings from our co-design engagements embody different people's ideas of how tech might and might not support rich forms of urban play, and contribute to ongoing efforts at exploring how to playfully reconfigure our cities. We present: (1) a list of inspirational play potentials of urban spaces—i.e. playful things already people do, and enjoy, in the public space; (2) a portfolio of speculative ideas that show how tech might help to realize that potential; and (3) a discussion of stakeholders’ responses to these ideas. Our work can provide designers with inspiration and actionable advice for cultivating forms of urban play that cater to people's socio-emotional needs.",
  "authors": [
    {
      "name": "Ferran Altarriba Bertran",
      "institution": "Social Emotional Technology Lab, UC Santa Cruz, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659277137",
      "orcid": "missing"
    },
    {
      "name": "Laura Bisbe Armengol",
      "institution": "ERAM, Universitat de Girona, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659880577",
      "orcid": "missing"
    },
    {
      "name": "Cameron Cooke",
      "institution": "Social Emotional Technology Lab, UC Santa Cruz, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236209",
      "orcid": "missing"
    },
    {
      "name": "Ivy Chen",
      "institution": "Social Emotional Technology Lab, UC Santa Cruz, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659880058",
      "orcid": "missing"
    },
    {
      "name": "Victor Dong",
      "institution": "Social Emotional Technology Lab, UC Santa Cruz, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659873056",
      "orcid": "missing"
    },
    {
      "name": "Binaisha Dastoor",
      "institution": "Social Emotional Technology Lab, UC Santa Cruz, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659883110",
      "orcid": "missing"
    },
    {
      "name": "Kelsea Tadano",
      "institution": "Social Emotional Technology Lab, UC Santa Cruz, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234511",
      "orcid": "missing"
    },
    {
      "name": "Fyez Dean",
      "institution": "Social Emotional Technology Lab, UC Santa Cruz, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237486",
      "orcid": "missing"
    },
    {
      "name": "Jessalyn Wang",
      "institution": "Social Emotional Technology Lab, UC Santa Cruz, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238768",
      "orcid": "missing"
    },
    {
      "name": "Adrià Altarriba Bertran",
      "institution": "Jocs al Segon, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659881683",
      "orcid": "missing"
    },
    {
      "name": "Jared Duval",
      "institution": "Computational Media, University of California Santa Cruz, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659182558",
      "orcid": "missing"
    },
    {
      "name": "Katherine Isbister",
      "institution": "Social Emotional Technology Lab, University of California Santa Cruz, United States",
      "img": "/do/10.1145/contrib-99659489823/rel-imgonly/ella-square.jpg",
      "acmid": "99659489823",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ferran Altarriba Bertran, Jared Duval, Katherine Isbister, Danielle Wilde, Elena Márquez Segura, Oscar Garcia Pañella, and Laia Badal León. 2019. Chasing Play Potentials in Food Culture to Inspire Technology Design. In Extended Abstracts of the Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts (CHI PLAY '19 Extended Abstracts). Association for Computing Machinery, New York, NY, USA, 829–834. DOI:https://doi.org/10.1145/3341215.3349586",
      "doi": "10.1145/3341215.3349586"
    },
    {
      "text": "Ferran Altarriba Bertran, Elena Márquez Segura, Jared Duval, and Katherine Isbister. 2019. Chasing Play Potentials: Towards an Increasingly Situated and Emergent Approach to Everyday Play Design. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19). Association for Computing Machinery, New York, NY, USA, 1265–1277. DOI:https://doi.org/10.1145/3322276.3322325",
      "doi": "10.1145/3322276.3322325"
    },
    {
      "text": "Ferran Altarriba Bertran, Elena Márquez Segura, and Katherine Isbister. 2020. Technology for Situated and Emergent Play: A Bridging Concept and Design Agenda. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. DOI:https://doi.org/10.1145/3313831.3376859",
      "doi": "10.1145/3313831.3376859"
    },
    {
      "text": "Ferran Altarriba Bertran, Jared Duval, Elena Márquez Segura, Laia Turmo Vidal, Yoram Chisik, Marina Juanet Casulleras, Oscar Garcia Pañella, Katherine Isbister, and Danielle Wilde. 2020. Chasing Play Potentials in Food Culture: Learning from Traditions to Inspire Future Human-Food Interaction Design. Proceedings of the 2020 ACM Designing Interactive Systems Conference. Association for Computing Machinery, New York, NY, USA, 979–991. DOI:https://doi.org/10.1145/3357236.3395575",
      "doi": "10.1145/3357236.3395575"
    },
    {
      "text": "Ferran Altarriba Bertran, Laia Turmo Vidal, Ella Dagan, Jared Duval, Elena Márquez Segura, and Katherine Isbister. 2020. Chasing Play with Instagram: How Can We Capture Mundane Play Potentials to Inspire Interaction Design? In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (CHI EA '20). Association for Computing Machinery, New York, NY, USA, 1–8. DOI:https://doi.org/10.1145/3334480.3382913",
      "doi": "10.1145/3334480.3382913"
    },
    {
      "text": "Ferran Altarriba Bertran, Alexandra Pometko, Muskan Gupta, Lauren Wilcox, Reeta Banerjee, and Katherine Isbister. 2021. The Playful Potential of Shared Mealtime: a speculative catalog of playful technologies for day-to-day social eating experiences. In Proceedings of the ACM on Human-Computer Interaction, Vol. 5, CHI PLAY, Article 267 (September 2021), 26 pages, https://doi.org/10.1145/3474694",
      "doi": ""
    },
    {
      "text": "Cristina Ampatzidou, Teodora Constantinescu, Martin Berger, Martina Jauschneg, Katharina Gugerell, & Oswald Devisch. 2018. All work and no play? Facilitating serious games and gamified applications in participatory urban planning and governance. Urban Planning, 3(1), 34-46.",
      "doi": ""
    },
    {
      "text": "Stefano Andreani, Matteo Giacomo Maria Kalchschmidt, Roberto Pinto, & Allen Sayegh. 2019. Reframing technologically enhanced urban scenarios: A design research model towards human centered smart cities. Technological Forecasting and Social Change, 142, 15-25.",
      "doi": ""
    },
    {
      "text": "Charbel Aoun. 2013. The smart city cornerstone: Urban efficiency. Published by Schneider electric.",
      "doi": ""
    },
    {
      "text": "Francesco Paolo Appio, Marcos Lima, & Sotirios Paroutis. 2019. Understanding Smart Cities: Innovation ecosystems, technological advancements, and societal challenges. Technological Forecasting and Social Change, 142, 1-14.",
      "doi": ""
    },
    {
      "text": "James Auger. 2013. Speculative design: crafting the speculation. Digital Creativity, 24(1), 11-35.",
      "doi": ""
    },
    {
      "text": "Jon Back, Elena Márquez Segura, & Annika Waern. 2017. Designing for Transformative Play. ACM Trans. Comput.-Hum. Interact. 24, 3: 18:1–18:28. https://doi.org/10.1145/3057921",
      "doi": "10.1145/3057921"
    },
    {
      "text": "Olav W. Bertelsen, Susanne Bødker, Eva Eriksson, Eve Hoggan, and Jo Vermeulen. 2018. Beyond generalization: research for the very particular. interactions 26, 1 (January - February 2019), 34–38. DOI:https://doi.org/10.1145/3289425",
      "doi": "10.1145/3289425"
    },
    {
      "text": "Boudewijn Boon. 2020. Playscapes: Creating space for young children's physical activity and play.",
      "doi": ""
    },
    {
      "text": "Virginia Braun & Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology, 3(2), 77-101.",
      "doi": ""
    },
    {
      "text": "Soderman Braxton. 2020. The Playful Attitude and the Critical Attitude. In Proceedings of the 2020 DiGRA International Conference: Play Everywhere.",
      "doi": ""
    },
    {
      "text": "Scott L. Brown. 2009. Play: How it shapes the brain, opens the imagination, and invigorates the soul. Penguin.",
      "doi": ""
    },
    {
      "text": "Barry Brown, Julian Bleecker, Marco D'Adamo, Pedro Ferreira, Joakim Formo, Mareike Glöss, Maria Holm, Kristina Höök, Eva-Carin Banka Johnson, Emil Kaburuan, Anna Karlsson, Elsa Vaara, Jarmo Laaksolahti, Airi Lampinen, Lucian Leahu, Vincent Lewandowski, Donald McMillan, Anders Mellbratt, Johanna Mercurio, Cristian Norlin, Nicolas Nova, Stefania Pizza, Asreen Rostami, Mårten Sundquist, Konrad Tollmar, Vasiliki Tsaknaki, Jinyi Wang, Charles Windlin, and Mikael Ydholm. 2016. The IKEA Catalogue: Design Fiction in Academic and Industrial Collaborations. In Proceedings of the 19th International Conference on Supporting Group Work (GROUP ’16). Association for Computing Machinery, New York, NY, USA, 335–344. DOI:https://doi.org/10.1145/2957276.2957298",
      "doi": "10.1145/2957276.2957298"
    },
    {
      "text": "Barry Brown and Oskar Juhlin. 2015. Enjoying machines. Mit Press.",
      "doi": ""
    },
    {
      "text": "Roger Caillois. 2001. Man, play, and games. University of Illinois Press.",
      "doi": ""
    },
    {
      "text": "Ignasi Capdevila & Matias Zarlenga. 2015. Smart city or smart citizens? The Barcelona case. The Barcelona Case (March 26, 2015).",
      "doi": ""
    },
    {
      "text": "Center for the Living City (CLC). (N.d.) Jane Jacobs. Accessed on May 7, 2020 at https://centerforthelivingcity.org/janejacobs#jane-and-the-center",
      "doi": ""
    },
    {
      "text": "Yoram Chisik, Ferran Altarriba Bertran, Marie-Monique Schaper, Elena Márquez Segura, Laia Turmo Vidal, and Danielle Wilde. 2020. Chasing play potentials in food culture: embracing children's perspectives. In Proceedings of the 2020 ACM Interaction Design and Children Conference: Extended Abstracts (IDC '20). Association for Computing Machinery, New York, NY, USA, 46–53. DOI:https://doi.org/10.1145/3397617.3398062",
      "doi": "10.1145/3397617.3398062"
    },
    {
      "text": "Chomko and Rosier. 2014. Shadowing. Accessed on March 29, 2021 at https://www.playablecity.com/projects/shadowing/",
      "doi": ""
    },
    {
      "text": "Mihály Csikszentmihalyi. 1997. Finding flow: The psychology of engagement with everyday life. Basic Books.",
      "doi": ""
    },
    {
      "text": "Renata Paola Dameri & Camille Rosenthal-Sabroux. (Eds.). 2014. Smart city: How to create public and economic value with high technology in urban space. Springer.",
      "doi": ""
    },
    {
      "text": "Bernie DeKoven. 2013. The Well-Played Game: A Player's Philosophy. The MIT Press, Cambridge, MA, USA.",
      "doi": "10.5555/2535025"
    },
    {
      "text": "Michiel de Lange. 2019. The playful city: Citizens making the smart city. The Playful Citizen, 349.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding. 2013. Modes of play: A frame analytic account of video game play (Doctoral dissertation, Staats-und Universitätsbibliothek Hamburg Carl von Ossietzky).",
      "doi": ""
    },
    {
      "text": "Katerina Diamantaki, Charalampos Rizopoulos, Vasileios Tsetsos, Iulianos Theona, Dimitris Charitos, & Nikos Kaimakamis. 2013, July. Integrating game elements for increasing engagement and enhancing User Experience in a smart city context. In Intelligent Environments (Workshops) (pp. 160-171).",
      "doi": ""
    },
    {
      "text": "Sandro Engel and Amelie Künzler. 2012. StreetPong. Retrieved on March 28, 2021 from http://www.streetpong.info",
      "doi": ""
    },
    {
      "text": "Engineering and Physical Sciences Research Council (EPSRC). (N.d). The Equator Project. Accessed on May 7, 2020 at https://web.archive.org/web/20120702141940/http://www.equator.ac.uk/",
      "doi": ""
    },
    {
      "text": "Estudio Guto Requena. 2015. Light creature: interactive facade as a visual soundscape reflection of São Paulo's iconic avenue. Accessed on March 29, 2021 at https://en.gutorequena.com/lightcreature-en/",
      "doi": ""
    },
    {
      "text": "Patrick Tobias Fischer, Christian Zöllner, Eva Hornecker. 2010. VR/Urban: Spread.gun—design process and challenges in developing a shared encounter for media façades. In: Proceedings of British HCI 2010, BCS eWiC series, pp. 289–298. British Computer Society/ACM NY",
      "doi": ""
    },
    {
      "text": "Cristopher Frayling. 1993. Research in art and design (Vol. 1, No. 1, pp. 1-5). London: Royal College of Art.",
      "doi": ""
    },
    {
      "text": "Oscar García, Pablo Chamoso, Javier Prieto, Sara Rodríguez, & Fernando de la Prieta. 2017, June. A serious game to reduce consumption in smart buildings. In International Conference on Practical Applications of Agents and Multi-Agent Systems (pp. 481-493). Springer, Cham.",
      "doi": ""
    },
    {
      "text": "William Gaver. 2002. Designing for homo ludens. I3 Magazine, 12(June), pp. 2-6.",
      "doi": ""
    },
    {
      "text": "Bill Gaver and John Bowers. 2012. Annotated portfolios. interactions 19, 4 (July + August 2012), 40–49. DOI:https://doi.org/10.1145/2212877.2212889",
      "doi": "10.1145/2212877.2212889"
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design?. In Proceedings of the SIGCHI conference on human factors in computing systems (pp. 937-946).",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Bill Gaver and John Bowers. 2012. Annotated portfolios. interactions 19, 4 (July + August 2012), 40–49. DOI:https://doi.org/10.1145/2212877.2212889",
      "doi": "10.1145/2212877.2212889"
    },
    {
      "text": "Anni Gentes, Aude Guyot-Mbodji, & Isabelle Demeure. 2010. Gaming on the move: urban experience as a new paradigm for mobile pervasive game design. Multimedia systems, 16(1), 43-55.",
      "doi": ""
    },
    {
      "text": "René Glas, Sybille Lammes, Michiel de Lange, Joost Raessens, and Imar de Vries (eds.). 2019. The Playful Citizen. Amsterdam University Press.",
      "doi": ""
    },
    {
      "text": "Eric Gordon & Gabriel Mugar. 2021. Meaningful Inefficiencies: Incorporating Play into Civic Design. In Ludics (pp. 125-152). Palgrave Macmillan, Singapore.",
      "doi": ""
    },
    {
      "text": "Giuseppe Grossi & Daniela Pianezzi. 2017. Smart cities: Utopia or neoliberal ideology?.Cities, 69, 79-85.",
      "doi": ""
    },
    {
      "text": "Greg Guest, Kathleen M. MacQueen, & Emily E. Namey. 2011. Applied thematic analysis. sage publications.",
      "doi": ""
    },
    {
      "text": "Deepi Harish. 2017. #FoodPorn Is Changing The Way Millennials Eat. In Huffington Post. Published on March 24th, 2017. Accessed on October 23rd, 2018 at https://www.huffingtonpost.ca/deepi-harish/foodporneating-habits_b_15574714.html",
      "doi": ""
    },
    {
      "text": "Johan Huizinga. 1950. Homo Ludens: A Study of the Play Element in Culture. Beacon Press.",
      "doi": ""
    },
    {
      "text": "Katherine Isbister. 2016. How games move us: Emotion by design. MIT Press.",
      "doi": "10.5555/2927483"
    },
    {
      "text": "Katherine Isbister, Elena Márquez Segura, & Edward F. Melcer. 2018. Social Affordances at Play: Game Design Toward Socio-Technical Innovation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Paper 372, 10 pages. DOI: https://doi.org/10.1145/3173574.3173946",
      "doi": "10.1145/3173574.3173946"
    },
    {
      "text": "Dhruv Khullar. 2016. How social isolation is killing us. New York Times, Dec 22, 2016.",
      "doi": ""
    },
    {
      "text": "Suzanne Kirkpatrick, Nien Lam, & Jamie Lin. 2011. Commons: A game for urban communities to improve their city through citizen stewardship. Accessed on September 24, 2020 at http://civictripod.com/civictripod.com/games/commons/index.html",
      "doi": ""
    },
    {
      "text": "Eva Knutz., Thomas Markussen, & Maria Vanessa aus der Wieschen. 2020. Probing the Future of Participatory Healthcare through Speculative Design. In 6th European Design4Health conference (pp. 73-82). Sheffield Hallam University.",
      "doi": ""
    },
    {
      "text": "Sirkku Kotilainen, Jussi Okkonen, Guna Spurava, Ole Sejer Iversen, Netta Iivari, Marianne Kinnula, and Sumita Sharma. 2020. Researchers' Toolbox for the Future: Empowering Children to Shape Their Future. Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. Association for Computing Machinery, New York, NY, USA, Article 133, 1–3. DOI: https://doi.org/10.1145/3419249.3420082",
      "doi": "10.1145/3419249.3420082"
    },
    {
      "text": "Laboratory for Architectural Experiments. 2015. Urbanimals. Accessed on March 29, 2021 at http://lax.com.pl/portfolio_page/urbanimals/",
      "doi": ""
    },
    {
      "text": "Dale Leorke & Marcus Owens. (Eds.). 2020. Games and Play in the Creative, Smart and Ecological City. Routledge.",
      "doi": ""
    },
    {
      "text": "Andrés Lucero, Evangelos Karapanos, Juha Arrasvuori, and Hannu Korhonen. 2014. Playful or Gameful? creating delightful user experiences. interactions 21, 3 (May-June 2014), 34–39. DOI: https://doi.org/10.1145/2590973",
      "doi": "10.1145/2590973"
    },
    {
      "text": "Maria-Lluïsa Marsal-Llacuna, Joan Colomer-Llinàs, & Joaquim Meléndez-Frigola. 2015. Lessons in urban monitoring taken from sustainable and livable cities to better address the Smart Cities initiative. Technological Forecasting and Social Change, 90, 611-622.",
      "doi": ""
    },
    {
      "text": "Luca Mora, Roberto Bolici, & Mark Deakin. 2017. The first two decades of smart-city research: A bibliometric analysis. Journal of Urban Technology, 24(1), 3-27.",
      "doi": ""
    },
    {
      "text": "Jonathan Lukens & Carl DiSalvo. 2011. Speculative design and technological fluency. International Journal of Learning and Media, 3(4), 23-40.",
      "doi": ""
    },
    {
      "text": "Evgeny Morozov. 2013. To save everything, click here: The folly of technological solutionism. Public Affairs.",
      "doi": ""
    },
    {
      "text": "Evgeny Morozov & Francesca Bria. 2018. Rethinking the smart city. New York: Rosa Luxemburg Stiftung.",
      "doi": ""
    },
    {
      "text": "Michael J. Muller, M. 2007. Participatory design: the third space in HCI (pp. 1087-1108). CRC press.",
      "doi": ""
    },
    {
      "text": "Niantic. (N.d). Pokémon Go. Accessed on May 7, 2020 at www.pokemongo.com",
      "doi": ""
    },
    {
      "text": "Anton Nijholt (ed.). 2017. Playable cities. Singapore: Springer.",
      "doi": ""
    },
    {
      "text": "Feargus O'Sullivan. 2020. Barcelona Will Supersize its Car-Free ‘Superblocks’. In bloomberg.com. Accessed on January 18, 2021 at https://www.bloomberg.com/news/articles/2020-11-11/barcelona-s-new-car-free-superblock-will-be-big",
      "doi": ""
    },
    {
      "text": "PAN Studio, T. Armitage, and G. Galik. 2013. About Hello Lamp Post. Accessed on March 29, 2021 at http://www.hellolamppost.co.uk/about",
      "doi": ""
    },
    {
      "text": "Michel Peeters, Carl Megens, Elise van den Hoven, Caroline Hummels, and Aarnout Brombacher. 2013. Social stairs: taking the piano staircase towards long-term behavioral change. In International Conference on Persuasive Technology (pp. 174-179). Springer, Berlin, Heidelberg.",
      "doi": ""
    },
    {
      "text": "Alenka Poplin. 2011. Games and serious games in urban planning: study cases. In International Conference on Computational Science and Its Applications (pp. 1-14). Springer, Berlin, Heidelberg.",
      "doi": ""
    },
    {
      "text": "Manaswi Saha, Kotaro Hara, Soheil Behnezhad, Anthony Li, Michael Saugstad, Hanuma Maddali, Sage Chen, and Jon E. Froehlich. 2017. A Pilot Deployment of an Online Tool for Large-Scale Virtual Auditing of Urban Accessibility. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '17). Association for Computing Machinery, New York, NY, USA, 305–306. DOI:https://doi.org/10.1145/3132525.3134775",
      "doi": "10.1145/3132525.3134775"
    },
    {
      "text": "Tony Salvador, John W. Sherry, & Alvaro E. Urrutia. 2005. Less cyber, more café: enhancing existing small businesses across the digital divide with ICTs. Inf. Technol. Dev. 11(1), 77–95 (2005).",
      "doi": "10.1002/itdj.20004"
    },
    {
      "text": "Ben Schouten, Gabriele Ferri, Michiel de Lange, and Karel Millenaar (eds.). 2017. Games as strong concepts for city-making. In Playable Cities (pp. 23-45). Springer, Singapore.",
      "doi": ""
    },
    {
      "text": "Elizabeth B. N. Sanders & Pieter Jan Stappers. 2008. Co-creation and the new landscapes of design. Co-design, 4(1), 5-18.",
      "doi": ""
    },
    {
      "text": "John Sharp and David Thomas. 2019. Fun, Taste, & Games: An Aesthetics of the Idle, Unproductive, and Otherwise Playful. MIT Press.",
      "doi": ""
    },
    {
      "text": "Miguel Sicart. 2014. Play matters. MIT Press.",
      "doi": "10.5555/2678068"
    },
    {
      "text": "Bhagya Nathali Silva, Murad Khan, & Kijun Han. 2018. Towards sustainable smart cities: A review of trends, architectures, components, and open challenges in smart cities. Sustainable Cities and Society, 38, 697-713.",
      "doi": ""
    },
    {
      "text": "Henrik Sproedt. 2012. Play. Learn. Innovate. Books on Demand.",
      "doi": ""
    },
    {
      "text": "Staff, J. 2014. Why is everyone so busy. The Economist. Retrieved from http://www. economist.com/news/christmasspecials/21636612-time-poverty-problempartly-perception-and-partly-distributionwhy",
      "doi": ""
    },
    {
      "text": "Jaakko Stenros. 2014. In defence of a magic circle: the social, mental and cultural boundaries of play. Transactions of the Digital Games Research Association, 1(2).",
      "doi": ""
    },
    {
      "text": "Jaakko Stenros. 2015. Behind games: Playful mindsets and transformative practices. The Gameful World: Approaches, Issues, Applications, MIT Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Quentin Stevens. 2007. The ludic city: exploring the potential of public spaces. Routledge.",
      "doi": ""
    },
    {
      "text": "Benjamin Stokes. 2020. Locally played: Real-world games for stronger places and communities. MIT Press.",
      "doi": ""
    },
    {
      "text": "Pekka Sulkunen. 2009. The saturated society: Governing risk & lifestyles in consumer culture. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Brian Sutton-Smith. 2009. The ambiguity of play. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Mattia Thibault. 2019, January. Towards a typology of urban gamification. In Proceedings of the 52nd Hawaii International Conference on System Sciences.",
      "doi": ""
    },
    {
      "text": "Rob Tieben, Linda de Valk, Pepijn Rijnbout, Tilde Bekker, and Ben Schouten. 2014. Shake up the schoolyard: iterative design research for public playful installations. In Proceedings of the 2014 conference on Interaction design and children (IDC '14). Association for Computing Machinery, New York, NY, USA, 175–183. DOI:https://doi.org/10.1145/2593968.2593980",
      "doi": "10.1145/2593968.2593980"
    },
    {
      "text": "Stephen J. Vodanovich. 2003. On the possible benefits of boredom: a neglected area in personality research. Psychology and Education: An Interdisciplinary Journal.",
      "doi": ""
    },
    {
      "text": "ZEMOS98. N.d. Commonspoly. Accessed on November 23, 2021 at https://commonspoly.cc/",
      "doi": ""
    },
    {
      "text": "Eric Zimmerman. 2015. Manifesto for a ludic century. The gameful world: Approaches, issues, applications. MIT Press.",
      "doi": ""
    }
  ]
}