{
  "doi": "10.1145/3491102.3501982",
  "title": "From Treatment to Healing:Envisioning a Decolonial Digital Mental Health",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-23",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The field of digital mental health is making strides in the application of technology to broaden access to care. We critically examine how these technology-mediated forms of care might amplify historical injustices, and erase minoritized experiences and expressions of mental distress and illness. We draw on decolonial thought and critiques of identity-based algorithmic bias to analyze the underlying power relations impacting digital mental health technologies today, and envision new pathways towards a decolonial digital mental health. We argue that a decolonial digital mental health is one that centers lived experience over rigid classification, is conscious of structural factors that influence mental wellbeing, and is fundamentally designed to deter the creation of power differentials that prevent people from having agency over their care. Stemming from this vision, we make recommendations for how researchers and designers can support more equitable futures for people experiencing mental distress and illness.",
  "tags": [
    "artificial intelligence",
    "medical pluralism",
    "digital mental health",
    "decolonial theory",
    "health inequities"
  ],
  "authors": [
    {
      "name": "Sachin R Pendse",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366119",
      "orcid": "missing"
    },
    {
      "name": "Daniel Nkemelu",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659569504",
      "orcid": "missing"
    },
    {
      "name": "Nicola J Bidwell",
      "institution": "Faculty of ICT, International University of Management, Namibia",
      "img": "/do/10.1145/contrib-81100334279/rel-imgonly/81100334279.jpg",
      "acmid": "81100334279",
      "orcid": "missing"
    },
    {
      "name": "Sushrut Jadhav",
      "institution": "University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660232824",
      "orcid": "missing"
    },
    {
      "name": "Soumitra Pathare",
      "institution": "Centre for Mental Health Law and Policy, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233494",
      "orcid": "missing"
    },
    {
      "name": "Munmun De Choudhury",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343491309",
      "orcid": "0000-0002-8939-264X"
    },
    {
      "name": "Neha Kumar",
      "institution": "Georgia Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646715",
      "orcid": "0000-0002-7014-5585"
    }
  ],
  "references": [
    {
      "text": "2015. ABC Indigenous Content. In Australian Broadcasting Corporation.",
      "doi": ""
    },
    {
      "text": "2016. AfriCHI’16: Proceedings of the First African Conference on Human Computer Interaction (Nairobi, Kenya). Association for Computing Machinery, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "2016. Namibia. International Work Group for Indigenous Affairs (IWGIA) (2016).",
      "doi": ""
    },
    {
      "text": "Alexandra L Adame and Larry M Leitner. 2008. Breaking out of the mainstream: The evolution of peer support alternatives to the mental health system. Ethical Human Psychology and Psychiatry 10, 3 (2008), 146–162.",
      "doi": ""
    },
    {
      "text": "Alexandra L Adame, Matthew Morsey, Ronald Bassman, and Kristina Yates. 2017. A brief history of the psychiatric survivor movement. In Exploring Identities of Psychiatric Survivor Therapists. Springer, 33–53.",
      "doi": ""
    },
    {
      "text": "Muhammad Sadi Adamu. 2016. Developing a mobile learning app: A user-centric approach. In Proceedings of the First African Conference on Human Computer Interaction. 139–143.",
      "doi": "10.1145/2998581.2998602"
    },
    {
      "text": "Michael Akuupa. 2015. National culture in post-apartheid Namibia: state-sponsored cultural festivals and their histories. Vol. 15. Basler Afrika Bibliographien.",
      "doi": ""
    },
    {
      "text": "Syed Mustafa Ali. 2016. A brief introduction to decolonial computing. XRDS: Crossroads, The ACM Magazine for Students 22, 4 (2016), 16–21.",
      "doi": "10.1145/2930886"
    },
    {
      "text": "Ali Alkhatib. 2021. To live in their utopia: Why algorithmic systems create absurd outcomes. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–9.",
      "doi": "10.1145/3411764.3445740"
    },
    {
      "text": "Adriana Alvarado Garcia, Juan F Maestre, Manuhuia Barcham, Marilyn Iriarte, Marisol Wong-Villacres, Oscar A Lemus, Palak Dudani, Pedro Reynolds-Cuéllar, Ruotong Wang, and Teresa Cerratto Pargman. 2021. Decolonial Pathways: Our Manifesto for a Decolonizing Agenda in HCI Research and Design. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–9.",
      "doi": "10.1145/3411763.3450365"
    },
    {
      "text": "Nazanin Andalibi and Patricia Garcia. 2021. Sensemaking and coping after pregnancy loss: the seeking and disruption of emotional validation online. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–32.",
      "doi": "10.1145/3449201"
    },
    {
      "text": "Nazanin Andalibi, Oliver L Haimson, Munmun De Choudhury, and Andrea Forte. 2016. Understanding social media disclosures of sexual abuse through the lenses of support seeking and anonymity. In Proceedings of the 2016 CHI conference on human factors in computing systems. 3906–3918.",
      "doi": "10.1145/2858036.2858096"
    },
    {
      "text": "Kimlin Ashing-Giwa, Carolyn Tapp, Monica Rosales, Kommah McDowell, Virginia Martin, Rhonda Holbert Santifer, Phyllis Clark, Joy Steward, Leah Lewis, and Eudora Mitchell. 2012. Peer-based models of supportive care: the impact of peer support groups in African American breast cancer survivors.. In Oncology nursing forum, Vol. 39.",
      "doi": ""
    },
    {
      "text": "American Psychiatric Association. 2013. Diagnostic and statistical manual of mental disorders—Fifth Edition. American Psychiatric Association Washington, DC.",
      "doi": ""
    },
    {
      "text": "Tolani Asuni. 1967. Aro hospital in perspective. American Journal of Psychiatry 124, 6 (1967), 763–770.",
      "doi": ""
    },
    {
      "text": "Kagonya Awori, Nicola J Bidwell, Tigist Sherwaga Hussan, Satinder Gill, and Silvia Lindtner. 2016. Decolonising technology design. In Proceedings of the first African conference on human computer interaction. 226–228.",
      "doi": "10.1145/2998581.2998622"
    },
    {
      "text": "Nicholas B Torretta and Lizette Reitsma. 2019. Design, power and colonisation: decolonial and antioppressive explorations on three approaches for Designfor Sustainability. In Academy for Design Innovation Management Conference 2019.",
      "doi": ""
    },
    {
      "text": "Hans A Baer. 2018. Medical pluralism. The International Encyclopedia of Anthropology (2018), 1–3.",
      "doi": ""
    },
    {
      "text": "David Bamman, Jacob Eisenstein, and Tyler Schnoebelen. 2014. Gender identity and lexical variation in social media. Journal of Sociolinguistics 18, 2 (2014), 135–160.",
      "doi": ""
    },
    {
      "text": "Prathama Banerjee. 2016. Writing the Adivasi: Some historiographical notes. The Indian Economic & Social History Review 53, 1 (2016), 131–153.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2016. Humanistic Hci. Interactions 23, 2 (2016), 20–29.",
      "doi": "10.1145/2888576"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI conference on human factors in computing systems. 1301–1310.",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Emily Baum. 2018. The invention of madness: State, society, and the insane in modern China. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Eric PS Baumer and M Six Silberman. 2011. When the implication is not to design (technology). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2271–2274.",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Andrew Bayor, Cliff Schmidt, Fidelis Dauri, Noel Wilson, Christopher Drovandi, and Margot Brereton. 2018. The talking book: participatory design of an icon-based user interface for rural people with low literacy. In Proceedings of the Second African Conference for Human Computer Interaction: Thriving Communities. 1–10.",
      "doi": "10.1145/3283458.3283462"
    },
    {
      "text": "Aaron T Beck, Calvin H Ward, Mock Mendelson, Jeremiah Mock, and John Erbaugh. 1961. An inventory for measuring depression. Archives of general psychiatry 4, 6 (1961), 561–571.",
      "doi": ""
    },
    {
      "text": "Timothy D Becker and John B Torous. 2019. Recent developments in digital mental health interventions for college and university students. Current Treatment Options in Psychiatry 6, 3 (2019), 210–220.",
      "doi": ""
    },
    {
      "text": "Clifford W Beers. 1929. A mind that found itself.(1929).",
      "doi": ""
    },
    {
      "text": "Dörte Bemme, Natassia Brenman, and Beth Semel. 2020. The subjects of digital psychiatry. Somatosphere (2020).",
      "doi": ""
    },
    {
      "text": "Dror Ben-Zeev and David C Atkins. 2017. Bringing digital mental health to where it is needed most. Nature human behaviour 1, 12 (2017), 849–851.",
      "doi": ""
    },
    {
      "text": "Ruha Benjamin. 2019. Race after technology: Abolitionist tools for the new jim code. Social Forces (2019).",
      "doi": ""
    },
    {
      "text": "José Bertolote. 2008. The roots of the concept of mental health. World Psychiatry 7, 2 (2008), 113.",
      "doi": ""
    },
    {
      "text": "Gurminder K Bhambra, Dalia Gebrial, and Kerem Nişancıoğlu. 2018. Decolonising the university. Pluto Press.",
      "doi": ""
    },
    {
      "text": "Umang Bhatt, Alice Xiang, Shubham Sharma, Adrian Weller, Ankur Taly, Yunhan Jia, Joydeep Ghosh, Ruchir Puri, José MF Moura, and Peter Eckersley. 2020. Explainable machine learning in deployment. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency. 648–657.",
      "doi": "10.1145/3351095.3375624"
    },
    {
      "text": "Dinesh Bhugra. 2005. The global prevalence of schizophrenia. PLoS Med 2, 5 (2005), e151.",
      "doi": ""
    },
    {
      "text": "Kamaldeep Bhui and Dinesh Bhugra. 2002. Explanatory models for mental distress: implications for clinical practice and research. The British Journal of Psychiatry 181, 1 (2002), 6–7.",
      "doi": ""
    },
    {
      "text": "Kamaldeep Bhui and Dinesh Bhugra. 2002. Mental illness in Black and Asian ethnic minorities: Pathways to care and outcomes. Advances in Psychiatric Treatment 8, 1 (2002), 26–33.",
      "doi": ""
    },
    {
      "text": "Niranjan Bidargaddi, Peter Musiat, Ville-Petteri Makinen, Miikka Ermes, Geoffrey Schrader, and Julio Licinio. 2017. Digital footprints: facilitating large-scale environmental psychiatric research in naturalistic settings through data from everyday technologies. Molecular psychiatry 22, 2 (2017), 164–169.",
      "doi": ""
    },
    {
      "text": "Nicola J Bidwell. 2016. Decolonising HCI and interaction design discourse: some considerations in planning AfriCHI. XRDS: Crossroads, The ACM Magazine for Students 22, 4 (2016), 22–27.",
      "doi": "10.1145/2930884"
    },
    {
      "text": "Nicola J Bidwell. 2016. Moving the centre to design social media in rural Africa. AI & society 31, 1 (2016), 51–77.",
      "doi": ""
    },
    {
      "text": "Nicola J Bidwell. 2021. Decolonising in the Gaps: Community Networks and the Identity of African Innovation. In Re-imagining Communication in Africa and the Caribbean. Springer, 97–115.",
      "doi": ""
    },
    {
      "text": "Florian Bieber. 2018. Is nationalism on the rise? Assessing global trends. Ethnopolitics 17, 5 (2018), 519–540.",
      "doi": ""
    },
    {
      "text": "CR Bijoy. 1999. Adivasis betrayed: Adivasi land rights in Kerala. Economic and Political Weekly(1999), 1329–1335.",
      "doi": ""
    },
    {
      "text": "Abeba Birhane and Olivia Guest. 2020. Towards decolonising computational sciences. arXiv preprint arXiv:2009.14258(2020).",
      "doi": ""
    },
    {
      "text": "Michael Leo Birnbaum, Sindhu Kiranmai Ernala, AF Rizvi, Elizabeth Arenare, AR Van Meter, M De Choudhury, and John M Kane. 2019. Detecting relapse in youth with psychotic disorders utilizing patient-generated and patient-contributed digital data from Facebook. NPJ schizophrenia 5, 1 (2019), 1–9.",
      "doi": ""
    },
    {
      "text": "Michael L Birnbaum, Sindhu Kiranmai Ernala, Asra F Rizvi, Munmun De Choudhury, and John M Kane. 2017. A collaborative approach to identifying social media markers of schizophrenia by employing machine learning and clinical appraisals. Journal of medical Internet research 19, 8 (2017), e289.",
      "doi": ""
    },
    {
      "text": "Su Lin Blodgett, Solon Barocas, Hal Daumé III, and Hanna Wallach. 2020. Language (Technology) is Power: A Critical Survey of “Bias” in NLP. In ACL.",
      "doi": ""
    },
    {
      "text": "Su Lin Blodgett and Brendan O’Connor. 2017. Racial disparity in natural language processing: A case study of social media african-american english. arXiv preprint arXiv:1707.00061(2017).",
      "doi": ""
    },
    {
      "text": "Tjeerd W Boonstra, Aliza Werner-Seidler, Bridianne O’Dea, Mark E Larsen, and Helen Christensen. 2017. Smartphone app to investigate the relationship between social connectivity and mental health. In 2017 39th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). IEEE, 287–290.",
      "doi": ""
    },
    {
      "text": "Nicholas C Borgogna, Rachel E Brenner, and Ryon C McDermott. 2021. Sexuality and gender invariance of the PHQ-9 and GAD-7: Implications for 16 identity groups. Journal of Affective Disorders 278 (2021), 122–130.",
      "doi": ""
    },
    {
      "text": "Geoffrey C Bowker and Susan Leigh Star. 2000. Sorting things out: Classification and its consequences. MIT press.",
      "doi": "10.5555/380681"
    },
    {
      "text": "Walter Bromberg and Franck Simon. 1968. The protest psychosis: a special type of reactive psychosis. Archives of general psychiatry 19, 2 (1968), 155–160.",
      "doi": ""
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender shades: Intersectional accuracy disparities in commercial gender classification. In Conference on fairness, accountability and transparency. PMLR, 77–91.",
      "doi": ""
    },
    {
      "text": "Eleanor R Burgess, Kathryn E Ringland, Jennifer Nicholas, Ashley A Knapp, Jordan Eschler, David C Mohr, and Madhu C Reddy. 2019. ” I think people are powerful” The Sociality of Individuals Managing Depression. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–29.",
      "doi": ""
    },
    {
      "text": "Eleanor R Burgess, Renwen Zhang, Sindhu Kiranmai Ernala, Jessica L Feuston, Munmun De Choudhury, Mary Czerwinski, Adrian Aguilera, Stephen M Schueller, and Madhu C Reddy. 2020. Technology ecosystems: Rethinking resources for mental health. Interactions 28, 1 (2020), 66–71.",
      "doi": "10.1145/3434564"
    },
    {
      "text": "Jane M Burns, Tracey A Davenport, Lauren A Durkin, Georgina M Luscombe, and Ian B Hickie. 2010. The internet as a setting for mental health service utilisation by young people. Medical Journal of Australia 192 (2010), S22–S26.",
      "doi": ""
    },
    {
      "text": "Paul Berne Burow, Samara Brock, and Michael R Dove. 2020. Land, Indigeneity, and Hybrid Ontologies. Living Earth Community(2020), 193.",
      "doi": ""
    },
    {
      "text": "Becca Caddy. [n.d.]. Using tech to track employee stress: Work wellbeing win?([n. d.]).",
      "doi": ""
    },
    {
      "text": "Rafael A Calvo, Karthik Dinakar, Rosalind Picard, and Pattie Maes. 2016. Computing in mental health. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 3438–3445.",
      "doi": "10.1145/2851581.2856463"
    },
    {
      "text": "Rafael A Calvo and Dorian Peters. 2014. Positive computing: technology for wellbeing and human potential. MIT Press.",
      "doi": "10.5555/2627995"
    },
    {
      "text": "John Colin Carothers, World Health Organization, 1953. The African mind in health and disease: A study in ethnopsychiatry. World Health Organization.",
      "doi": ""
    },
    {
      "text": "Helena Carter, Ricardo Araya, Kavya Anjur, Davy Deng, and John A Naslund. 2020. The emergence of digital mental health in low-income and middle-income countries: A review of recent advances and implications for the treatment and prevention of mental disorders. Journal of psychiatric research(2020).",
      "doi": ""
    },
    {
      "text": "Aimé Césaire. 1972. Discourse on Colonialism. 1955. Trans. Joan Pinkham. New York: Monthly Review Press (1972).",
      "doi": ""
    },
    {
      "text": "Suhas Chakma and Marianne Jensen. 2001. Racism against indigenous peoples. Number 105. IWGIA.",
      "doi": ""
    },
    {
      "text": "Judi Chamberlin. 1978. On our own: Patient-controlled alternatives to the mental health system.McGraw-Hill.",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Eric PS Baumer, and Munmun De Choudhury. 2019. Who is the” Human” in Human-Centered Machine Learning: The Case of Predicting Mental Health from Social Media. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–32.",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Michael L Birnbaum, Eric D Caine, Vincent MB Silenzio, and Munmun De Choudhury. 2019. A taxonomy of ethical tensions in inferring mental health states from social media. In Proceedings of the Conference on Fairness, Accountability, and Transparency. 79–88.",
      "doi": "10.1145/3287560.3287587"
    },
    {
      "text": "Stevie Chancellor and Munmun De Choudhury. 2020. Methods in predictive techniques for mental health status on social media: a critical review. NPJ digital medicine 3, 1 (2020), 1–11.",
      "doi": ""
    },
    {
      "text": "Pooja Chandrashekar. 2018. Do mental health mobile apps work: evidence and recommendations for designing high-efficacy mental health mobile apps. Mhealth 4(2018).",
      "doi": ""
    },
    {
      "text": "Ahmad Cheikhyoussef, Martin Shapi, Kenneth Matengu, and Hina Mu Ashekele. 2011. Ethnobotanical study of indigenous knowledge on medicinal plant use by traditional healers in Oshikoto region, Namibia. Journal of ethnobiology and ethnomedicine 7, 1 (2011), 1–11.",
      "doi": ""
    },
    {
      "text": "Qijin Cheng and Elad Yom-Tov. 2019. Do search engine helpline notices aid in preventing suicide? Analysis of archival data. Journal of medical internet research 21, 3 (2019), e12235.",
      "doi": ""
    },
    {
      "text": "Alex Cohen, Vikram Patel, and Harry Minas. 2014. A brief history of global mental health. Global mental health: Principles and practice (2014), 3–26.",
      "doi": ""
    },
    {
      "text": "Francesca Cormack, Maggie McCue, Nick Taptiklis, Caroline Skirrow, Emilie Glazer, Elli Panagopoulos, Tempest A van Schaik, Ben Fehnert, James King, and Jennifer H Barnett. 2019. Wearable technology for high-frequency cognitive and mood assessment in major depressive disorder: Longitudinal observational study. JMIR mental health 6, 11 (2019), e12814.",
      "doi": ""
    },
    {
      "text": "Sasha Costanza-Chock. 2020. Design justice: Community-led practices to build the worlds we need. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Philip Cushman. 1992. Psychotherapy to 1992: A historically situated interpretation.(1992).",
      "doi": ""
    },
    {
      "text": "Kate Daley, Ines Hungerbuehler, Kate Cavanagh, Heloísa G Claro, Paul Swinton, and Michael Kapps. 2020. Preliminary evaluation of the engagement and effectiveness of a mental health chatbot.Frontiers in digital health(2020).",
      "doi": ""
    },
    {
      "text": "Rebecca Spirito Dalgin, Simonne Maline, and Peter Driscoll. 2011. Sustaining recovery through the night: Impact of a peer-run warm line.Psychiatric Rehabilitation Journal 35, 1 (2011), 65.",
      "doi": ""
    },
    {
      "text": "Sauvik Das, W Keith Edwards, DeBrae Kennedy-Mayo, Peter Swire, and Yuxi Wu. 2021. Privacy for the People? Exploring Collective Action as a Mechanism to Shift Power to Consumers in End-User Privacy. IEEE Security & Privacy 19, 5 (2021), 66–70.",
      "doi": ""
    },
    {
      "text": "Richard Dawkins 1982. The extended phenotype. Vol. 8. Oxford university press Oxford.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury. 2015. Anorexia on tumblr: A characterization study. In Proceedings of the 5th international conference on digital health 2015. 43–50.",
      "doi": "10.1145/2750511.2750515"
    },
    {
      "text": "Munmun De Choudhury and Sushovan De. 2014. Mental health discourse on reddit: Self-disclosure, social support, and anonymity. In Eighth international AAAI conference on weblogs and social media.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Michael Gamon, Scott Counts, and Eric Horvitz. 2013. Predicting depression via social media.Icwsm 13(2013), 1–10.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Emre Kiciman, Mark Dredze, Glen Coppersmith, and Mrinal Kumar. 2016. Discovering shifts to suicidal ideation from mental health content in social media. In Proceedings of the 2016 CHI conference on human factors in computing systems. 2098–2110.",
      "doi": "10.1145/2858036.2858207"
    },
    {
      "text": "Munmun De Choudhury, Sanket S Sharma, Tomaz Logar, Wouter Eekhout, and René Clausen Nielsen. 2017. Gender and cross-cultural differences in social media disclosures of mental illness. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. 353–369.",
      "doi": "10.1145/2998181.2998220"
    },
    {
      "text": "Redesfera Latinoamericana de la Diversidad Psicosocial. 2018. Declaration of Lima. (2018).",
      "doi": ""
    },
    {
      "text": "Boaventura de Sousa Santos. 2015. Epistemologies of the South: Justice against epistemicide. Routledge.",
      "doi": ""
    },
    {
      "text": "Kevin Doherty, José Marcano-Belisario, Martin Cohn, Nikolaos Mastellos, Cecily Morrison, Josip Car, and Gavin Doherty. 2019. Engagement with mental health screening on mobile devices: Results from an antenatal feasibility study. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3290605.3300416"
    },
    {
      "text": "Michael W Dols. 1987. The origins of the Islamic hospital: myth and reality. Bulletin of the History of Medicine 61, 3 (1987), 367–390.",
      "doi": ""
    },
    {
      "text": "Finale Doshi-Velez, Mason Kortz, Ryan Budish, Chris Bavitz, Sam Gershman, David O’Brien, Kate Scott, Stuart Schieber, James Waldo, David Weinberger, 2017. Accountability of AI under the law: The role of explanation. Berkman Klein Working Paper(2017).",
      "doi": ""
    },
    {
      "text": "Paul Dourish and Scott D Mainwaring. 2012. Ubicomp’s colonial impulse. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing. 133–142.",
      "doi": "10.1145/2370216.2370238"
    },
    {
      "text": "Robert Dover. 2020. SOCMINT: a shifting balance of opportunity. Intelligence and National Security 35, 2 (2020), 216–232.",
      "doi": ""
    },
    {
      "text": "Jamie Ducharme. 2019. Artificial Intelligence Could Help Solve America’s Impending Mental Health Crisis. (2019).",
      "doi": ""
    },
    {
      "text": "Maria Duerr. 1996. Hearing voices: Resistance among psychiatric survivors and consumers. California Institute of Integral Studies.",
      "doi": ""
    },
    {
      "text": "Upol Ehsan, Q Vera Liao, Michael Muller, Mark O Riedl, and Justin D Weisz. 2021. Expanding explainability: Towards social transparency in ai systems. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3411764.3445188"
    },
    {
      "text": "Amanuel Elias, Jehonathan Ben, Fethi Mansouri, and Yin Paradies. 2021. Racism and nationalism during and beyond the COVID-19 pandemic. Ethnic and Racial Studies 44, 5 (2021), 783–793.",
      "doi": ""
    },
    {
      "text": "Eric J Engstrom. 2007. On the Question of Degeneration by Emil Kraepelin (1908) 1. History of Psychiatry 18, 3 (2007), 389–398.",
      "doi": ""
    },
    {
      "text": "Sheena Erete, Aarti Israni, and Tawanna Dillahunt. 2018. An intersectional approach to designing in the margins. Interactions 25, 3 (2018), 66–69.",
      "doi": "10.1145/3194349"
    },
    {
      "text": "Sindhu Kiranmai Ernala, Michael L Birnbaum, Kristin A Candan, Asra F Rizvi, William A Sterling, John M Kane, and Munmun De Choudhury. 2019. Methodological gaps in predicting mental health states from social media: Triangulating diagnostic signals. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–16.",
      "doi": "10.1145/3290605.3300364"
    },
    {
      "text": "Waltraud Ernst. 2013. Colonialism and Transnational Psychiatry: The Development of an Indian Mental Hospital in British India, c. 19251940. Anthem Press.",
      "doi": ""
    },
    {
      "text": "Chukwuma N Eruchalu, Margaret S Pichardo, Maheetha Bharadwaj, Carmen B Rodriguez, Jorge A Rodriguez, Regan W Bergmark, David W Bates, and Gezzer Ortega. 2021. The expanding digital divide: digital health access inequities during the COVID-19 pandemic in New York City. Journal of Urban Health 98, 2 (2021), 183–186.",
      "doi": ""
    },
    {
      "text": "Spencer C Evans and Michael C Roberts. 2014. International classification of diseases (ICD), mental and behavioural disorders section. The encyclopedia of clinical psychology(2014), 1–10.",
      "doi": ""
    },
    {
      "text": "[102] Noldus FaceReader.[n.d.]. ([n. d.]). https://www.noldus.com/facereader",
      "doi": ""
    },
    {
      "text": "Frantz Fanon. 1965. This is the Voice of Algeria. A Dying Colonialism. New York: Monthly Review (1965), 69–98.",
      "doi": ""
    },
    {
      "text": "Frantz Fanon. 2007. The wretched of the earth. Grove/Atlantic, Inc.",
      "doi": ""
    },
    {
      "text": "Frantz Fanon. 2008. Black skin, white masks. Grove press.",
      "doi": ""
    },
    {
      "text": "Ingrid G Farreras. 2019. History of mental illness. General Psychology: Required Reading(2019), 244.",
      "doi": ""
    },
    {
      "text": "Suman Fernando. 2008. Institutional racism and cultural diversity. Critical issues in mental health(2008), 41–57.",
      "doi": ""
    },
    {
      "text": "Suman Fernando. 2011. A’global’mental health program or markets for Big Pharma?Open Mind 475(2011), 27–30.",
      "doi": ""
    },
    {
      "text": "Suman Fernando. 2014. Mental health worldwide: Culture, globalization and development. Springer.",
      "doi": ""
    },
    {
      "text": "Suman Fernando. 2017. How ‘Race’Began, and the Emergence of Psychiatry and Clinical Psychology. In Institutional Racism in Psychiatry and Clinical Psychology. Springer, 11–37.",
      "doi": ""
    },
    {
      "text": "Suman Fernando. 2017. Racialization of the Schizophrenia Diagnosis. Routledge International Handbook of Critical Mental Health (2017), 195–202.",
      "doi": ""
    },
    {
      "text": "Jessica L Feuston and Anne Marie Piper. 2019. Everyday experiences: small stories and mental illness on Instagram. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300495"
    },
    {
      "text": "Deborah L Finfgeld. 2000. Therapeutic groups online: the good, the bad, and the unknown. Issues in mental health nursing 21, 3 (2000), 241–255.",
      "doi": ""
    },
    {
      "text": "Michael B First. 2014. Structured clinical interview for the DSM (SCID). The encyclopedia of clinical psychology(2014), 1–6.",
      "doi": ""
    },
    {
      "text": "Firstbeat. [n.d.]. Firstbeat Life for Corporate Wellness. ([n. d.]). https://www.firstbeat.com/en/wellness-services/firstbeat-life-corporate-wellness/",
      "doi": ""
    },
    {
      "text": "Patrick Fitz-Gerald and Taryn Park. 2020. Telepsychiatry. In Models of Emergency Psychiatric Services That Work. Springer, 153–164.",
      "doi": ""
    },
    {
      "text": "Kathleen Kara Fitzpatrick, Alison Darcy, and Molly Vierhile. 2017. Delivering cognitive behavior therapy to young adults with symptoms of depression and anxiety using a fully automated conversational agent (Woebot): a randomized controlled trial. JMIR mental health 4, 2 (2017), e7785.",
      "doi": ""
    },
    {
      "text": "Transforming Communities for Inclusion Asia Pacific TCI Asia Pacific. 2018. The Bali Declaration. (2018).",
      "doi": ""
    },
    {
      "text": "Michel Foucault. 1988. Madness and civilization: A history of insanity in the age of reason. Vintage.",
      "doi": ""
    },
    {
      "text": "Michel Foucault. 2008. Psychiatric power: Lectures at the college de france, 1973–1974. Macmillan.",
      "doi": ""
    },
    {
      "text": "Sigmund Freud. 1901. The psychopathology of everyday life.",
      "doi": ""
    },
    {
      "text": "Sigmund Freud. 1920. A general introduction to psychoanalysis. Boni and Liveright.",
      "doi": ""
    },
    {
      "text": "Patricia Garcia, Tonia Sutherland, Marika Cifor, Anita Say Chan, Lauren Klein, Catherine D’Ignazio, and Niloufar Salehi. 2020. No: Critical Refusal as Feminist Data Practice. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing. 199–202.",
      "doi": "10.1145/3406865.3419014"
    },
    {
      "text": "Emily M Geramita, Bea Herbeck Belnap, Kaleab Z Abebe, Scott D Rothenberger, Armando J Rotondi, and Bruce L Rollman. 2018. The association between increased levels of patient engagement with an internet support group and improved mental health outcomes at 6-month follow-up: post-hoc analyses from a randomized controlled trial. Journal of medical Internet research 20, 7 (2018), e10402.",
      "doi": ""
    },
    {
      "text": "Rita Giacaman, Yoke Rabaia, Viet Nguyen-Gillham, Rajaie Batniji, Raija-Leena Punamäki, and Derek Summerfield. 2011. Mental health, social distress and political oppression: The case of the occupied Palestinian territory. Global public health 6, 5 (2011), 547–559.",
      "doi": ""
    },
    {
      "text": "Mary Giliberti. 2017. Learning more about clinical depression with the PHQ-9 questionnaire. (2017).",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1968. Asylums: Essays on the social situation of mental patients and other inmates. AldineTransaction.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 2009. Stigma: Notes on the management of spoiled identity. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Erving Goffman 1978. The presentation of self in everyday life. Vol. 21. Harmondsworth London.",
      "doi": ""
    },
    {
      "text": "Bryce Goodman and Seth Flaxman. 2017. European Union regulations on algorithmic decision-making and a “right to explanation”. AI magazine 38, 3 (2017), 50–57.",
      "doi": ""
    },
    {
      "text": "Gerald N Grob. 1994. Mad, homeless, and unwanted: A history of the care of the chronic mentally ill in America. Psychiatric Clinics of North America 17, 3 (1994), 541–558.",
      "doi": ""
    },
    {
      "text": "Ramón Grosfoguel. 2002. Colonial difference, geopolitics of knowledge, and global coloniality in the modern/colonial capitalist world-system. Review (Fernand Braudel Center)(2002), 203–224.",
      "doi": ""
    },
    {
      "text": "Félix Guattari. 1996. Soft Subversions, ed. Sylvère Lotringer, trans. D. Sweet and C. Wiener. New York: Semiotex (e) (1996).",
      "doi": ""
    },
    {
      "text": "Maji Hailemariam and Soumitra Pathare. 2020. The missing global in global mental health. The Lancet Psychiatry 7, 12 (2020), 1011–1012.",
      "doi": ""
    },
    {
      "text": "Foad Hamidi, Patrick Mbullo, Deurence Onyango, Michaela Hynie, Susan McGrath, and Melanie Baljko. 2018. Participatory design of DIY digital assistive technology in Western Kenya. In Proceedings of the Second African Conference for Human Computer Interaction: Thriving Communities. 1–11.",
      "doi": "10.1145/3283458.3283478"
    },
    {
      "text": "Jeyda Hammad and Rachel Tribe. 2020. Social suffering and the psychological impact of structural violence and economic oppression in an ongoing conflict setting: The Gaza Strip. Journal of community psychology 48, 6 (2020), 1791–1810.",
      "doi": ""
    },
    {
      "text": "Keith Hariman, Antonio Ventriglio, and Dinesh Bhugra. 2019. The future of digital psychiatry. Current psychiatry reports 21, 9 (2019), 1–8.",
      "doi": ""
    },
    {
      "text": "Mathias Harrer, Sophia H Adam, Harald Baumeister, Pim Cuijpers, Eirini Karyotaki, Randy P Auerbach, Ronald C Kessler, Ronny Bruffaerts, Matthias Berking, and David D Ebert. 2019. Internet interventions for mental health in university students: A systematic review and meta-analysis. International journal of methods in psychiatric research 28, 2(2019), e1759.",
      "doi": ""
    },
    {
      "text": "Johannes Haushofer, Robert Mudida, and Jeremy P Shapiro. 2020. The Comparative Impact of Cash Transfers and a Psychotherapy Program on Psychological and Economic Well-being. Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "Matthew M Heaton. 2013. Black skin, white coats: Nigerian psychiatrists, decolonization, and the globalization of psychiatry. Ohio University Press.",
      "doi": ""
    },
    {
      "text": "Blake Anthony Hickey, Taryn Chalmers, Phillip Newton, Chin-Teng Lin, David Sibbritt, Craig S McLachlan, Roderick Clifton-Bligh, John Morley, and Sara Lal. 2021. Smart Devices and Wearable Technologies to Detect and Monitor Mental Health Conditions and Stress: A Systematic Review. Sensors 21, 10 (2021), 3461.",
      "doi": ""
    },
    {
      "text": "Kashmir Hill. 2020. The Secretive Company That Might End Privacy as We Know It. (2020).",
      "doi": ""
    },
    {
      "text": "Laura D Hirshbein. 2006. Science, gender, and the emergence of depression in American psychiatry, 1952–1980. Journal of the history of medicine and allied sciences 61, 2 (2006), 187–216.",
      "doi": ""
    },
    {
      "text": "Allan V Horwitz, Jerome C Wakefield, and Lorenzo Lorenzo-Luaces. 2016. History of depression. The Oxford handbook of mood disorders(2016), 11–23.",
      "doi": ""
    },
    {
      "text": "Jane Im, Jill Dimond, Melody Berton, Una Lee, Katherine Mustelier, Mark S Ackerman, and Eric Gilbert. 2021. Yes: Affirmative Consent as a Theoretical Framework for Understanding and Imagining Social Platforms. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3411764.3445778"
    },
    {
      "text": "[146] iMotions.[n.d.]. ([n. d.]). https://imotions.com/",
      "doi": ""
    },
    {
      "text": "Thomas Insel, Bruce Cuthbert, Marjorie Garvey, Robert Heinssen, Daniel S Pine, Kevin Quinn, Charles Sanislow, and Philip Wang. 2010. Research domain criteria (RDoC): toward a new classification framework for research on mental disorders.",
      "doi": ""
    },
    {
      "text": "Thomas R Insel. 2017. Digital phenotyping: technology for a new science of behavior. Jama 318, 13 (2017), 1215–1216.",
      "doi": ""
    },
    {
      "text": "Thomas R Insel. 2018. Digital phenotyping: a global tool for psychiatry. World Psychiatry 17, 3 (2018), 276.",
      "doi": ""
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E Grinter. 2010. Postcolonial computing: a lens on design and development. In Proceedings of the SIGCHI conference on human factors in computing systems. 1311–1320.",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Helvi Itenge and Heike Winschiers-Theophilus. 2018. People’s primary school interactive tech library exhibition. In Proceedings of the Second African Conference for Human Computer Interaction: Thriving Communities. 1–4.",
      "doi": "10.1145/3283458.3283524"
    },
    {
      "text": "Stanley W Jackson. 1986. Melancholia and depression: From hippocratic times to modern times.Yale University Press.",
      "doi": ""
    },
    {
      "text": "Sushrut Jadhav. 2009. What is Cultural Validity and Why is it ignored?AmsterdamAMB.",
      "doi": ""
    },
    {
      "text": "Sumeet Jain. 2016. Cross-cultural psychiatry and the user/survivor movement in the context of global mental health. Philosophy, Psychiatry, & Psychology 23, 3 (2016), 305–308.",
      "doi": ""
    },
    {
      "text": "Sumeet Jain and Sushrut Jadhav. 2009. Pills that swallow policy: Clinical ethnography of a community mental health program in Northern India. Transcultural psychiatry 46, 1 (2009), 60–85.",
      "doi": ""
    },
    {
      "text": "Sachin H Jain, Brian W Powers, Jared B Hawkins, and John S Brownstein. 2015. The digital phenotype. Nature biotechnology 33, 5 (2015), 462–463.",
      "doi": ""
    },
    {
      "text": "Vasundhara Jairath. 2020. Situating claim-making: Land and Adivasi assertion in Jharkhand. Sociological Bulletin 69, 1 (2020), 51–66.",
      "doi": ""
    },
    {
      "text": "David Jenkins and Lon B Johnston. 2004. Unethical treatment of gay and lesbian people with conversion therapy. Families in Society 85, 4 (2004), 557–561.",
      "doi": ""
    },
    {
      "text": "Janis Jenkins. 1992. The meaning of expressed emotion: Theoretical issues raised by cross-cultural research. American journal of psychiatry 149, 1 (1992), 9–21.",
      "doi": ""
    },
    {
      "text": "[160] Jive.[n.d.]. ([n. d.]). https://www.jivesoftware.com/product/people-analytics/",
      "doi": ""
    },
    {
      "text": "Ameil J Joseph. 2015. The Necessity of an Attention to Colonization: An Addition to Mental Health Literature. In Deportation and the Confluence of Violence within Forensic Mental Health and Immigration Systems. Springer, 18–42.",
      "doi": ""
    },
    {
      "text": "Margot E Kaminski. 2019. The right to explanation, explained. Berkeley Tech. LJ 34(2019), 189.",
      "doi": ""
    },
    {
      "text": "Nadia Kanani. 2011. Race and madness: Locating the experiences of racialized people with psychiatric histories in Canada and the United States. Critical Disability Discourses/Discours critiques dans le champ du handicap 3(2011).",
      "doi": ""
    },
    {
      "text": "Nitya Kanuri, Prerna Arora, Sai Talluru, Bona Colaco, Rohan Dutta, Abhimanyu Rawat, Barr C Taylor, M Manjula, and Michelle G Newman. 2020. Examining the initial usability, acceptability and feasibility of a digital mental health intervention for college students in India. International Journal of Psychology 55, 4 (2020), 657–673.",
      "doi": ""
    },
    {
      "text": "Tyler S Kaster, Simone N Vigod, Tara Gomes, Duminda N Wijeysundera, Daniel M Blumberger, and Rinku Sutradhar. 2021. A practical overview and decision tool for analyzing recurrent events in mental illness: A review. Journal of Psychiatric Research(2021).",
      "doi": ""
    },
    {
      "text": "Maria Kauhondamwa, Heike Winschiers-Theophilus, Simson Kapembe, Hiskia Costa, Jan Guxab, Isay Kamati, and Helena Afrikaner. 2018. Co-creating personal augmented reality accessories to enhance social well-being of urban San youth. In Proceedings of the Second African Conference for Human Computer Interaction: Thriving Communities. 1–10.",
      "doi": "10.1145/3283458.3283480"
    },
    {
      "text": "Shadia Kawa and James Giordano. 2012. A brief historicity of the Diagnostic and Statistical Manual of Mental Disorders: issues and implications for the future of psychiatric canon and practice.",
      "doi": ""
    },
    {
      "text": "Elizabeth Kaziunas, Michael S Klinkman, and Mark S Ackerman. 2019. Precarious interventions: Designing for ecologies of care. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–27.",
      "doi": "10.1145/3359215"
    },
    {
      "text": "Richard C Keller. 2008. Colonial Madness: Psychiatry in French North Africa. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Os Keyes, Josephine Hoy, and Margaret Drouhard. 2019. Human-computer insurrection: Notes on an anarchist HCI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300569"
    },
    {
      "text": "Sarah Khan. 2021. Every second surveyed Dalit and Adivasi student couldn’t access online classes: NCDHR report. Justice News (2021).",
      "doi": ""
    },
    {
      "text": "Olga Khazan. 2018. Trump’s Call for Mental Institutions Could Be Good. (23 February 2018).",
      "doi": ""
    },
    {
      "text": "Laurence J Kirmayer, Ana Gomez-Carrillo, and Samuel Veissière. 2017. Culture and depression in global mental health: An ecosocial approach to the phenomenology of psychiatric disorders.(2017).",
      "doi": ""
    },
    {
      "text": "Laurence J Kirmayer and Duncan Pedersen. 2014. Toward a new architecture for global mental health.",
      "doi": ""
    },
    {
      "text": "Darley Jose Kjosavik and Nadarajah Shanmugaratnam. 2021. The Persistent Adivasi Demand for Land Rights and the Forest Rights Act 2006 in Kerala, India. Social Sciences 10, 5 (2021), 158.",
      "doi": ""
    },
    {
      "text": "Arthur Kleinman, Leon Eisenberg, and Byron Good. 1978. Culture, illness, and care: clinical lessons from anthropologic and cross-cultural research. Annals of internal medicine 88, 2 (1978), 251–258.",
      "doi": ""
    },
    {
      "text": "Arthur Kleinman and Joan Kleinman. 1994. How bodies remember: Social memory and bodily experience of criticism, resistance, and delegitimation following China’s cultural revolution. New Literary History 25, 3 (1994), 707–723.",
      "doi": ""
    },
    {
      "text": "James L Knoll IV and George D Annas. 2016. Mass shootings and mental illness.(2016).",
      "doi": ""
    },
    {
      "text": "Robert Kohn, Shekhar Saxena, Itzhak Levav, and Benedetto Saraceno. 2004. The treatment gap in mental health care. Bulletin of the World health Organization 82 (2004), 858–866.",
      "doi": ""
    },
    {
      "text": "Lindah Kotut and Scott D McCrickard. 2021. Trail as heritage: Safeguarding location-specific and transient indigenous knowledge. In 3rd African Human-Computer Interaction Conference: Inclusiveness and Empowerment. 94–102.",
      "doi": "10.1145/3448696.3448702"
    },
    {
      "text": "Emil Kraepelin. 1921. Manic depressive insanity and paranoia. The Journal of Nervous and Mental Disease 53, 4 (1921), 350.",
      "doi": ""
    },
    {
      "text": "Kurt Kroenke and Robert L Spitzer. 2002. The PHQ-9: a new depression diagnostic and severity measure. Psychiatric annals 32, 9 (2002), 509–515.",
      "doi": ""
    },
    {
      "text": "Annika Kuester, Helen Niemeyer, and Christine Knaevelsrud. 2016. Internet-based interventions for posttraumatic stress: a meta-analysis of randomized controlled trials. Clinical Psychology Review 43 (2016), 1–16.",
      "doi": ""
    },
    {
      "text": "Neha Kumar and Naveena Karusala. 2019. Intersectional computing. Interactions 26, 2 (2019), 50–54.",
      "doi": "10.1145/3305360"
    },
    {
      "text": "Santosh Kumar, Wendy J Nilsen, Amy Abernethy, Audie Atienza, Kevin Patrick, Misha Pavel, William T Riley, Albert Shar, Bonnie Spring, Donna Spruijt-Metz, 2013. Mobile health technology evaluation: the mHealth evidence workshop. American journal of preventive medicine 45, 2 (2013), 228–236.",
      "doi": ""
    },
    {
      "text": "H Richard Lamb, Linda E Weinberger, and Walter J DeCuir Jr. 2002. The police and mental health. Psychiatric services 53, 10 (2002), 1266–1271.",
      "doi": ""
    },
    {
      "text": "Antonio Lanata, Gaetano Valenza, Mimma Nardelli, Claudio Gentili, and Enzo Pasquale Scilingo. 2014. Complexity index from a personalized wearable monitoring system for assessing remission in mental health. IEEE Journal of Biomedical and health Informatics 19, 1(2014), 132–139.",
      "doi": ""
    },
    {
      "text": "Claudia Lang. 2018. Depression in Kerala: Ayurveda and Mental Health Care in 21st Century India. Routledge.",
      "doi": ""
    },
    {
      "text": "Emily G Lattie, Elizabeth C Adkins, Nathan Winquist, Colleen Stiles-Shields, Q Eileen Wafford, and Andrea K Graham. 2019. Digital mental health interventions for depression, anxiety, and enhancement of psychological well-being among college students: Systematic review. Journal of medical Internet research 21, 7 (2019), e12869.",
      "doi": ""
    },
    {
      "text": "Shaimaa Lazem, Danilo Giglitto, Makuochi Samuel Nkwo, Hafeni Mthoko, Jessica Upani, and Anicia Peters. 2021. Challenges and paradoxes in decolonising HCI: A critical discussion. Computer Supported Cooperative Work (CSCW)(2021), 1–38.",
      "doi": ""
    },
    {
      "text": "Shaimaa Lazem, Mennatallah Saleh, and Ebtisam Alabdulqader. 2021. ArabHCI: five years and counting. Commun. ACM 64, 4 (2021), 69–71.",
      "doi": "10.1145/3447733"
    },
    {
      "text": "Minha Lee, Sander Ackermans, Nena Van As, Hanwen Chang, Enzo Lucas, and Wijnand IJsselsteijn. 2019. Caring for Vincent: a chatbot for self-compassion. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300932"
    },
    {
      "text": "Alexander Hamilton Leighton. 1963. Psychiatric disorder among the Yoruba: a report. Cornell University Press.",
      "doi": ""
    },
    {
      "text": "Alexander H Leighton. 1969. A comparative study of psychiatric disorder in Nigeria and rural North America. Changing Perspectives in Mental Illness(1969), 179–199.",
      "doi": ""
    },
    {
      "text": "Jason Edward Lewis, Angie Abdilla, Noelani Arista, Kaipulaumakaniolono Baker, Scott Benesiinaabandan, Michelle Brown, Melanie Cheung, Meredith Coleman, Ashley Cordes, Joel Davison, 2020. Indigenous protocol and artificial intelligence position paper. (2020).",
      "doi": ""
    },
    {
      "text": "Roberto Lewis-Fernández, Neil Krishan Aggarwal, Ladson Hinton, Devon E. Hinton, and Laurence J. Kirmayer. 2015. DSM-5 handbook on the cultural formulation interview. American Psychiatric Pub.",
      "doi": ""
    },
    {
      "text": "Ann Light. 2011. HCI as heterodoxy: Technologies of identity and the queering of interaction with computers. Interacting with computers 23, 5 (2011), 430–438.",
      "doi": ""
    },
    {
      "text": "Edwina M Light, Ian H Kerridge, Christopher J Ryan, and Michael D Robertson. 2012. Out of sight, out of mind: making involuntary community treatment visible in the mental health system. Medical Journal of Australia 196, 9 (2012), 591–593.",
      "doi": ""
    },
    {
      "text": "Roland Littlewood and Maurice Lipsedge. 1997. Aliens and alienists: ethnic minorities and psychiatry. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Marti Loring and Brian Powell. 1988. Gender, race, and DSM-III: A study of the objectivity of psychiatric diagnostic behavior. Journal of health and social behavior(1988), 1–22.",
      "doi": ""
    },
    {
      "text": "David D Luxton, Jennifer D June, and Julie T Kinn. 2011. Technology-based suicide prevention: current applications and future directions. Telemedicine and e-Health 17, 1 (2011), 50–54.",
      "doi": ""
    },
    {
      "text": "Sujen Man Maharjan, Anubhuti Poudyal, Alastair van Heerden, Prabin Byanjankar, Ada Thapa, Celia Islam, Brandon A Kohrt, and Ashley Hagaman. 2021. Passive sensing on mobile devices to improve mental health services with adolescent and young mothers in low-resource settings: the role of families in feasibility and acceptability. BMC medical informatics and decision making 21, 1 (2021), 1–19.",
      "doi": ""
    },
    {
      "text": "Catherine A Maloney, Wendel D Abel, and Hamish J McLeod. 2020. Jamaican adolescents’ receptiveness to digital mental health services: A cross-sectional survey from rural and urban communities. Internet Interventions(2020), 100325.",
      "doi": ""
    },
    {
      "text": "Akio Mantani, Tadashi Kato, Toshi A Furukawa, Masaru Horikoshi, Hissei Imai, Takahiro Hiroe, Bun Chino, Tadashi Funayama, Naohiro Yonemoto, Qi Zhou, 2017. Smartphone cognitive behavioral therapy as an adjunct to pharmacotherapy for refractory depression: randomized controlled trial. Journal of medical Internet research 19, 11 (2017), e373.",
      "doi": ""
    },
    {
      "text": "Nayra A Martin-Key, Thea S Schei, Eleanor J Barker, Benedetta Spadaro, Erin Funnell, Jiri Benacek, Jakub Tomasik, and Sabine Bahn. 2021. The Current State and Diagnostic Accuracy of Digital Mental Health Assessment Tools for Psychiatric Disorders: Protocol for a Systematic Review and Meta-analysis. JMIR Research Protocols 10, 1 (2021), e25382.",
      "doi": ""
    },
    {
      "text": "Meghan A Marty and Daniel L Segal. 2014. DSM-5. The Encyclopedia of Clinical Psychology(2014), 1–6.",
      "doi": ""
    },
    {
      "text": "Jack D Maser, Charles Kaelber, and Richard E Weise. 1991. International use and attitudes toward DSM-III and DSM-III—R: Growing consensus in psychiatric classification.Journal of Abnormal Psychology 100, 3 (1991), 271.",
      "doi": ""
    },
    {
      "text": "Bernard Duncan Mayes. 2012. Escaping God’s Closet: The Revelations of a Queer Priest. University of Virginia Press.",
      "doi": ""
    },
    {
      "text": "Topher McDougal. 2011. Law of the landless: the Dalit bid for land redistribution in Gujarat, India. The Law and Development Review 4, 1 (2011), 141–167.",
      "doi": ""
    },
    {
      "text": "Cheryl McGeachan and Chris Philo. 2017. Occupying space: Mental health geography and global directions. In The Palgrave handbook of sociocultural perspectives on global mental health. Springer, 31–50.",
      "doi": ""
    },
    {
      "text": "E Menchen-Trevino. 2018. Digital trace data and social research: A proactive research ethics., 20 pages.",
      "doi": ""
    },
    {
      "text": "Jonathan M Metzl. 2010. The protest psychosis: How schizophrenia became a black disease. Beacon Press.",
      "doi": ""
    },
    {
      "text": "Jonathan M Metzl and Kenneth T MacLeish. 2015. Mental illness, mass shootings, and the politics of American firearms. American journal of public health 105, 2 (2015), 240–249.",
      "doi": ""
    },
    {
      "text": "Walter D Mignolo. 2007. Introduction: Coloniality of power and de-colonial thinking. Cultural studies 21, 2-3 (2007), 155–167.",
      "doi": ""
    },
    {
      "text": "Walter D Mignolo. 2012. Local histories/global designs. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Jude Mikal, Samantha Hurst, and Mike Conway. 2016. Ethical issues in using Twitter for population-level depression monitoring: a qualitative study. BMC medical ethics 17, 1 (2016), 22.",
      "doi": ""
    },
    {
      "text": "Jeannette Milgrom, Brian G Danaher, Alan W Gemmill, Charlene Holt, Christopher J Holt, John R Seeley, Milagra S Tyler, Jessica Ross, and Jennifer Ericksen. 2016. Internet cognitive behavioral therapy for women with postnatal depression: a randomized controlled trial of MumMoodBooster. Journal of Medical Internet Research 18, 3 (2016), e54.",
      "doi": ""
    },
    {
      "text": "China Mills. 2014. Decolonizing global mental health: The psychiatrization of the majority world.Routledge.",
      "doi": ""
    },
    {
      "text": "China Mills. 2015. The Psychiatrization of poverty: rethinking the mental health–poverty Nexus. Social and Personality Psychology Compass 9, 5 (2015), 213–222.",
      "doi": ""
    },
    {
      "text": "China Mills and Eva Hilberg. 2018. The construction of mental health as a technological problem in India. Critical Public Health(2018), 1–12.",
      "doi": ""
    },
    {
      "text": "RD Milns. 1986. Squibb academic lecture: attitudes towards mental illness in antiquity. Australian & New Zealand Journal of Psychiatry 20, 4(1986), 454–462.",
      "doi": ""
    },
    {
      "text": "Shakir Mohamed, Marie-Therese Png, and William Isaac. 2020. Decolonial ai: Decolonial theory as sociotechnical foresight in artificial intelligence. Philosophy & Technology 33, 4 (2020), 659–684.",
      "doi": ""
    },
    {
      "text": "David C Mohr, Heleen Riper, and Stephen M Schueller. 2018. A solution-focused research approach to achieve an implementable revolution in digital mental health. JAMA psychiatry 75, 2 (2018), 113–114.",
      "doi": ""
    },
    {
      "text": "David C Mohr, Ken R Weingardt, Madhu Reddy, and Stephen M Schueller. 2017. Three problems with current digital mental health research... and three things we can do about them. Psychiatric services 68, 5 (2017), 427–429.",
      "doi": ""
    },
    {
      "text": "Maletsabisa Molapo, Melissa Densmore, and Limpho Morie. 2016. Designing with community health workers: enabling productive participation through exploration. In Proceedings of the First African Conference on Human Computer Interaction. 58–68.",
      "doi": "10.1145/2998581.2998589"
    },
    {
      "text": "P Read Montague, Raymond J Dolan, Karl J Friston, and Peter Dayan. 2012. Computational psychiatry. Trends in cognitive sciences 16, 1 (2012), 72–80.",
      "doi": ""
    },
    {
      "text": "Parimala Moodley and Rachel E Perkins. 1991. Routes to psychiatric inpatient care in an Inner London Borough. Social Psychiatry and Psychiatric Epidemiology 26, 1(1991), 47–51.",
      "doi": ""
    },
    {
      "text": "Craig Morgan, Rosemarie Mallett, Gerard Hutchinson, Hemant Bagalkote, Kevin Morgan, Paul Fearon, Paola Dazzan, Jane Boydell, Kwame McKenzie, Glynn Harrison, 2005. Pathways to care and ethnicity. 1: Sample characteristics and compulsory admission: Report from the AeSOP study. The British journal of psychiatry 186, 4 (2005), 281–289.",
      "doi": ""
    },
    {
      "text": "Stephen J Morse. 1982. A preference for liberty: The case against involuntary commitment of the mentally disordered. Calif. L. Rev. 70(1982), 54.",
      "doi": ""
    },
    {
      "text": "Pascah Mungwini. 2013. African modernities and the critical reappropriation of indigenous knowledges: Towards a polycentric global epistemology. International Journal of African Renaissance Studies-Multi-, Inter-and Transdisciplinarity 8, 1 (2013), 78–93.",
      "doi": ""
    },
    {
      "text": "Robin Munro. 2000. Judicial psychiatry in China and its political abuses. Colum. J. Asian L. 14(2000), 1.",
      "doi": ""
    },
    {
      "text": "Elizabeth L Murnane, Tara G Walker, Beck Tench, Stephen Voida, and Jaime Snyder. 2018. Personal informatics in interpersonal contexts: towards the design of technology that supports the social ecologies of long-term mental health management. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–27.",
      "doi": "10.1145/3274396"
    },
    {
      "text": "Elizabeth Murray, Eric B Hekler, Gerhard Andersson, Linda M Collins, Aiden Doherty, Chris Hollis, Daniel E Rivera, Robert West, and Jeremy C Wyatt. 2016. Evaluating digital health interventions: key questions and approaches.",
      "doi": ""
    },
    {
      "text": "Padmini Ray Murray, Naveen L Bagalkot, Shreyas Srivatsa, and Paul Anthony. [n.d.]. Design Beku: Toward Decolonizing Design and Technology through Collaborative and Situated Care-in-Practices. Global Perspectives([n. d.]).",
      "doi": ""
    },
    {
      "text": "Paulus Mwetulundila and Johannes Matsi. 2021. Chapter Fifteen—Autonomy and Sovereignty in Pre-colonial Namibia: A Case of Aawambo People. From #RhodesMustFall Movements to #HumansMustFall Movements (2021), 409.",
      "doi": ""
    },
    {
      "text": "Lameck Mwewa and N Bidwell. 2015. African narratives in technology research & design. At the Intersection of Indigenous and Traditional Knowledge and Technology Design (2015), 353.",
      "doi": ""
    },
    {
      "text": "Meera Nanda. 2003. Prophets facing backward: postmodern critiques of science and Hindu nationalism in India. Rutgers University Press.",
      "doi": ""
    },
    {
      "text": "Ashis Nandy. 1989. Intimate enemy. Oxford University Press Oxford.",
      "doi": ""
    },
    {
      "text": "John A Naslund, Kelly A Aschbrenner, Ricardo Araya, Lisa A Marsch, Jürgen Unützer, Vikram Patel, and Stephen J Bartels. 2017. Digital technology for treating and preventing mental disorders in low-income and middle-income countries: a narrative review of the literature. The Lancet Psychiatry 4, 6 (2017), 486–500.",
      "doi": ""
    },
    {
      "text": "Mervat Nasser. 1987. Psychiatry in ancient Egypt. Bulletin of the Royal College of Psychiatrists 11, 12(1987), 420–422.",
      "doi": ""
    },
    {
      "text": "James Y Nazroo, Kamaldeep S Bhui, and James Rhodes. 2020. Where next for understanding race/ethnic inequalities in severe mental illness? Structural, interpersonal and institutional racism. Sociology of Health & Illness 42, 2 (2020), 262–276.",
      "doi": ""
    },
    {
      "text": "Martha Neary and Stephen M Schueller. 2018. State of the field of mental health apps. Cognitive and Behavioral Practice 25, 4 (2018), 531–537.",
      "doi": ""
    },
    {
      "text": "Harold W Neighbors, Steven J Trierweiler, Briggett C Ford, and Jordana R Muroff. 2003. Racial differences in DSM diagnosis using a semi-structured instrument: The importance of clinical judgment in the diagnosis of African Americans. Journal of health and social behavior(2003), 237–256.",
      "doi": ""
    },
    {
      "text": "Jennifer Nicholas, Katie Shilton, Stephen M Schueller, Elizabeth L Gray, Mary J Kwasny, and David C Mohr. 2019. The role of data type and recipient in individuals’ perspectives on sharing passively collected smartphone data for mental health: Cross-sectional questionnaire study. JMIR mHealth and uHealth 7, 4 (2019), e12578.",
      "doi": ""
    },
    {
      "text": "Mark Nichter. 2010. Idioms of distress revisited. Culture, Medicine, and Psychiatry 34, 2 (2010), 401–416.",
      "doi": ""
    },
    {
      "text": "Pan African Network of People with Psychosocial Disabilities (PANUSP). 2012. The Cape Town Declaration 2011. Disability and the Global South: An International Journal (2012).",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela DR Smith, Alexandra To, and Kentaro Toyama. 2020. Critical race theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Cathy O’Neil. 2016. Weapons of math destruction: How big data increases inequality and threatens democracy. Crown.",
      "doi": ""
    },
    {
      "text": "Jukka-Pekka Onnela and Scott L Rauch. 2016. Harnessing smartphone-based digital phenotyping to enhance behavioral and mental health. Neuropsychopharmacology 41, 7 (2016), 1691–1696.",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2022. International Classification of Diseases (ICD)-11. (2022).",
      "doi": ""
    },
    {
      "text": "World Health Organization 1950. Expert Committee on Mental Health: report on the first session, Geneva, 29 August-2 September 1949. World Health Organization.",
      "doi": ""
    },
    {
      "text": "World Health Organization 1951. Expert Committee on Mental Health: report on the second session, Geneva, 11-16 September 1950. World Health Organization.",
      "doi": ""
    },
    {
      "text": "World Health Organization 1992. The ICD-10 classification of mental and behavioural disorders: clinical descriptions and diagnostic guidelines. World Health Organization.",
      "doi": ""
    },
    {
      "text": "World Health Organization 2020. Coronavirus disease 2019 (COVID-19): situation report, 72. (2020).",
      "doi": ""
    },
    {
      "text": "David MR Orr and Serena Bindi. 2017. Medical pluralism and global mental health. In The Palgrave handbook of sociocultural perspectives on global mental health. Springer, 307–328.",
      "doi": ""
    },
    {
      "text": "Tom L Osborn, Arthur Kleinman, and John R Weisz. 2020. Complementing standard Western measures of depression with locally Co-developed instruments: a cross-cultural study on the experience of depression among the Luo in Kenya. Transcultural Psychiatry(2020), 13634615211000555.",
      "doi": ""
    },
    {
      "text": "Toks Oyedemi. 2020. (De) coloniality and South African academe. Critical Studies in Education 61, 4 (2020), 399–415.",
      "doi": ""
    },
    {
      "text": "Albert Park, Mike Conway, and Annie T Chen. 2018. Examining thematic similarity, difference, and membership in three online mental health communities from Reddit: a text mining and visualization approach. Computers in human behavior 78 (2018), 98–112.",
      "doi": ""
    },
    {
      "text": "Emma M Parrish, Tess F Filip, John Torous, Camille Nebeker, Raeanne C Moore, and Colin A Depp. 2021. Are mental health apps adequately equipped to handle users in crisis?Crisis: The Journal of Crisis Intervention and Suicide Prevention (2021).",
      "doi": ""
    },
    {
      "text": "Javier Pastor-Galindo, Pantaleone Nespoli, Félix Gómez Mármol, and Gregorio Martínez Pérez. 2020. The not yet exploited goldmine of OSINT: Opportunities, open challenges and future trends. IEEE Access 8(2020), 10282–10304.",
      "doi": ""
    },
    {
      "text": "Sachin R Pendse, Naveena Karusala, Divya Siddarth, Pattie Gonsalves, Seema Mehrotra, John A Naslund, Mamta Sood, Neha Kumar, and Amit Sharma. 2019. Mental health in the global south: challenges and opportunities in HCI for development. In Proceedings of the 2nd ACM SIGCAS Conference on Computing and Sustainable Societies. 22–36.",
      "doi": "10.1145/3314344.3332483"
    },
    {
      "text": "Sachin R Pendse, Faisal M Lalani, Munmun De Choudhury, Amit Sharma, and Neha Kumar. 2020. ” Like Shock Absorbers”: Understanding the Human Infrastructures of Technology-Mediated Mental Health Support. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376465"
    },
    {
      "text": "Sachin R Pendse, Kate Niederhoffer, and Amit Sharma. 2019. Cross-Cultural Differences in the Use of Online Mental Health Support Forums. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–29.",
      "doi": "10.1145/3359169"
    },
    {
      "text": "Sachin R Pendse, Amit Sharma, Aditya Vashistha, Munmun De Choudhury, and Neha Kumar. 2021. “Can I Not Be Suicidal on a Sunday?”: Understanding Technology-Mediated Pathways to Mental Health Support. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445410"
    },
    {
      "text": "Michael A Peters and Carl T Mika. 2017. Aborigine, Indian, indigenous or first nations?",
      "doi": ""
    },
    {
      "text": "Trevor J Pinch and Wiebe E Bijker. 1984. The social construction of facts and artefacts: Or how the sociology of science and the sociology of technology might benefit each other. Social studies of science 14, 3 (1984), 399–441.",
      "doi": ""
    },
    {
      "text": "Roy Porter. 2002. Madness: A brief history. (2002).",
      "doi": ""
    },
    {
      "text": "Yada Pruksachatkun, Sachin R Pendse, and Amit Sharma. 2019. Moments of change: Analyzing peer-based cognitive support in online mental health forums. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300294"
    },
    {
      "text": "Sana Qadar and Aunty Lorraine Peeters. 2020. All In The Mind. In Australian Broadcasting Corporation.",
      "doi": ""
    },
    {
      "text": "Eric Rafla-Yuan, Divya K Chhabra, and Michael O Mensah. 2021. Decoupling Crisis Response from Policing—A Step Toward Equitable Psychiatric Emergency Services.",
      "doi": ""
    },
    {
      "text": "Ruth O Ralph. 2000. Recovery. Psychiatric rehabilitation skills 4, 3 (2000), 480–517.",
      "doi": ""
    },
    {
      "text": "Allura L Ralston, Arthur R Andrews III, and Debra A Hope. 2019. Fulfilling the promise of mental health technology to reduce public health disparities: Review and research agenda. Clinical Psychology: Science and Practice 26, 1 (2019), e12277.",
      "doi": ""
    },
    {
      "text": "Yolanda A Rankin and Jakita O Thomas. 2019. Straighten up and fly right: Rethinking intersectionality in HCI research. Interactions 26, 6 (2019), 64–68.",
      "doi": "10.1145/3363033"
    },
    {
      "text": "Yolanda A Rankin, Jakita O Thomas, and Nicole M Joseph. 2020. Intersectionality in HCI: Lost in translation. Interactions 27, 5 (2020), 68–71.",
      "doi": "10.1145/3416498"
    },
    {
      "text": "Amy Leigh Rathbone and Julie Prescott. 2017. The use of mobile apps and SMS messaging as physical and mental health interventions: systematic review. Journal of medical Internet research 19, 8 (2017), e295.",
      "doi": ""
    },
    {
      "text": "Geoffrey M Reed, Michael B First, Cary S Kogan, Steven E Hyman, Oye Gureje, Wolfgang Gaebel, Mario Maj, Dan J Stein, Andreas Maercker, Peter Tyrer, 2019. Innovations and changes in the ICD-11 classification of mental, behavioural and neurodevelopmental disorders. World Psychiatry 18, 1 (2019), 3–19.",
      "doi": ""
    },
    {
      "text": "Darrel A Regier, Emily A Kuhl, and David J Kupfer. 2013. The DSM-5: Classification and criteria changes. World psychiatry 12, 2 (2013), 92–98.",
      "doi": ""
    },
    {
      "text": "Steffi Retzlaff. 2005. What’s in a name? The politics of labelling and Native identity constructions. The Canadian Journal of Native Studies 25, 2 (2005), 609–626.",
      "doi": ""
    },
    {
      "text": "Derek Richards and Thomas Richardson. 2012. Computer-based psychological treatments for depression: a systematic review and meta-analysis. Clinical psychology review 32, 4 (2012), 329–342.",
      "doi": ""
    },
    {
      "text": "Jennifer A Rode. 2011. A theoretical agenda for feminist HCI. Interacting with Computers 23, 5 (2011), 393–400.",
      "doi": "10.1016/j.intcom.2011.04.005"
    },
    {
      "text": "Kat Roemmich and Nazanin Andalibi. 2021. Data Subjects’ Conceptualizations of and Attitudes toward Automatic Emotion Recognition-enabled Wellbeing Interventions on Social Media. Proceedings of the ACM on Human-Computer InteractionCSCW (2021).",
      "doi": "10.1145/3476049"
    },
    {
      "text": "Ribana Roscher, Bastian Bohn, Marco F Duarte, and Jochen Garcke. 2020. Explainable machine learning for scientific insights and discoveries. Ieee Access 8(2020), 42200–42216.",
      "doi": ""
    },
    {
      "text": "Jeffrey Rosen. 2011. The right to be forgotten. Stan. L. Rev. Online 64(2011), 88.",
      "doi": ""
    },
    {
      "text": "Jonathan Hal Sadowsky. 1999. Imperial bedlam: Institutions of madness in colonial Southwest Nigeria. Vol. 10. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman, Jacob M Paul, and Jed R Brubaker. 2019. How computers see gender: An evaluation of gender classification in commercial facial analysis services. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–33.",
      "doi": "10.1145/3359246"
    },
    {
      "text": "Ari Schlesinger, W Keith Edwards, and Rebecca E Grinter. 2017. Intersectional HCI: Engaging identity through gender, race, and class. In Proceedings of the 2017 CHI conference on human factors in computing systems. 5412–5427.",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Andrew Scull. 1991. Psychiatry and social control in the nineteenth and twentieth centuries. History of Psychiatry 2, 6 (1991), 149–169.",
      "doi": ""
    },
    {
      "text": "Patience Seebohm, Sarah Chaudhary, Melanie Boyce, Ruth Elkan, Mark Avis, and Carol Munn-Giddings. 2013. The contribution of self-help/mutual aid groups to mental well-being. Health & social care in the community 21, 4 (2013), 391–401.",
      "doi": ""
    },
    {
      "text": "Ivan Sekulić and Michael Strube. 2020. Adapting deep learning methods for mental health prediction on social media. arXiv preprint arXiv:2003.07634(2020).",
      "doi": ""
    },
    {
      "text": "Evan Selinger and Brenda Leong. 2021. The ethics of facial recognition technology. Forthcoming in The Oxford Handbook of Digital Ethics ed. Carissa Véliz (2021).",
      "doi": ""
    },
    {
      "text": "Adrian Shahbaz and Allie Funk. 2019. Freedom on the net 2019: The crisis of social media. Freedom on the Net. Freedom House(2019).",
      "doi": ""
    },
    {
      "text": "Eva Sharma and Munmun De Choudhury. 2018. Mental health support and its relationship to linguistic accommodation in online communities. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3174215"
    },
    {
      "text": "Amit Sheth, Hong Yung Yip, and Saeedeh Shekarpour. 2019. Extending Patient-Chatbot Experience with Internet-of-Things and Background Knowledge: Case Studies with Healthcare Applications. IEEE Intelligent Systems 34, 4 (2019), 24–30.",
      "doi": "10.1109/MIS.2019.2905748"
    },
    {
      "text": "Nisha P Shetty, Balachandra Muniyal, Arshia Anand, Sushant Kumar, and Sushant Prabhu. 2020. Predicting depression using deep learning and ensemble algorithms on raw twitter data.International Journal of Electrical & Computer Engineering (2088-8708) 10(2020).",
      "doi": ""
    },
    {
      "text": "Jay Shore. 2015. The evolution and history of telepsychiatry and its impact on psychiatric care: Current implications for psychiatrists and psychiatric organizations. International Review of Psychiatry 27, 6 (2015), 469–475.",
      "doi": ""
    },
    {
      "text": "Petr Slovák, Nikki Theofanopoulou, Alessia Cecchet, Peter Cottrell, Ferran Altarriba Bertran, Ella Dagan, Julian Childs, and Katherine Isbister. 2018. ” I just let him cry... Designing Socio-Technical Interventions in Families to Prevent Mental Health Disorders. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–34.",
      "doi": ""
    },
    {
      "text": "Marcus Smith and Seumas Miller. 2021. The ethical application of biometric facial recognition technology. Ai & Society (2021), 1–9.",
      "doi": ""
    },
    {
      "text": "Thomas Spear. 2003. Neo-traditionalism and the limits of invention in British colonial Africa. Journal of African history(2003), 3–27.",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Os Keyes, Ashley Marie Walker, Michael A DeVito, Jeremy Birnholtz, Emeline Brulé, Ann Light, Pınar Barlas, Jean Hardy, Alex Ahmed, 2019. Queer (ing) HCI: Moving forward in theory and practice. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–4.",
      "doi": "10.1145/3290607.3311750"
    },
    {
      "text": "Robert L Spitzer, Kurt Kroenke, Janet BW Williams, Patient Health Questionnaire Primary Care Study Group, Patient Health Questionnaire Primary Care Study Group, 1999. Validation and utility of a self-report version of PRIME-MD: the PHQ primary care study. Jama 282, 18 (1999), 1737–1744.",
      "doi": ""
    },
    {
      "text": "Robert L Spitzer, Kurt Kroenke, Janet BW Williams, and Bernd Löwe. 2006. A brief measure for assessing generalized anxiety disorder: the GAD-7. Archives of internal medicine 166, 10 (2006), 1092–1097.",
      "doi": ""
    },
    {
      "text": "Robert L Spitzer, Janet BW Williams, Miriam Gibbon, and Michael B First. 1992. The structured clinical interview for DSM-III-R (SCID): I: history, rationale, and description. Archives of general psychiatry 49, 8 (1992), 624–629.",
      "doi": ""
    },
    {
      "text": "Fiona Ssozi-Mugarura, Thomas Reitmaier, Anja Venter, and Edwin Blake. 2016. Enough with’In-The-Wild’. In Proceedings of the First African Conference on Human Computer Interaction. 182–186.",
      "doi": "10.1145/2998581.2998601"
    },
    {
      "text": "Monique Starkowitz 2013. African traditional healers’ understanding of depression as a mental illness: implications for social work practice. Ph.D. Dissertation. University of Pretoria.",
      "doi": ""
    },
    {
      "text": "Robert David Steele. 2007. Open source intelligence. Handbook of intelligence studies 42, 5 (2007), 129–147.",
      "doi": ""
    },
    {
      "text": "Sharifa Sultana and Syed Ishtiaque Ahmed. 2019. Witchcraft and hci: Morality, modernity, and postcolonial computing in rural bangladesh. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3290605.3300586"
    },
    {
      "text": "Sharifa Sultana, Zinnat Sultana, and Syed Ishtiaque Ahmed. 2020. Parareligious-HCI: Designing for’Alternative’Rationality in Rural Wellbeing in Bangladesh. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": ""
    },
    {
      "text": "Martin Summers. 2010. ” Suitable Care of the African When Afflicted With Insanity”: Race, Madness, and Social Order in Comparative Perspective. Bulletin of the History of Medicine(2010), 58–91.",
      "doi": ""
    },
    {
      "text": "Amir Tal and John Torous. 2017. The digital mental health revolution: Opportunities and risks.(2017).",
      "doi": ""
    },
    {
      "text": "Michel A Thibodeau and Gordon JG Asmundson. 2014. The PHQ-9 assesses depression similarly in men and women from the general population. Personality and Individual Differences 56 (2014), 149–153.",
      "doi": ""
    },
    {
      "text": "Anja Thieme, Danielle Belgrave, and Gavin Doherty. 2020. Machine learning in mental health: A systematic review of the HCI literature to support the development of effective and implementable ML systems. ACM Transactions on Computer-Human Interaction (TOCHI) 27, 5(2020), 1–53.",
      "doi": "10.1145/3398069"
    },
    {
      "text": "Marilyn D Thomas, Nicholas P Jewell, and Amani M Allen. 2020. Black and unarmed: statistical interaction between age, perceived mental illness, and geographic region among males fatally shot by police using case-only design. Annals of Epidemiology(2020).",
      "doi": ""
    },
    {
      "text": "Bill Tomlinson. 2020. Suffering-centered design. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3334480.3381812"
    },
    {
      "text": "John Torous, Gerhard Andersson, Andrew Bertagnoli, Helen Christensen, Pim Cuijpers, Joseph Firth, Adam Haim, Honor Hsin, Chris Hollis, Shôn Lewis, 2019. Towards a consensus around standards for smartphone apps and digital mental health. World Psychiatry 18, 1 (2019), 97.",
      "doi": ""
    },
    {
      "text": "John Torous, Matcheri Keshavan, and Thomas Gutheil. 2014. Promise and perils of digital psychiatry. Asian journal of psychiatry 10 (2014), 120–122.",
      "doi": ""
    },
    {
      "text": "John Torous, Keris Jän Myrick, Natali Rauseo-Ricupero, and Joseph Firth. 2020. Digital mental health and COVID-19: using technology today to accelerate the curve on access and quality tomorrow. JMIR mental health 7, 3 (2020), e18848.",
      "doi": ""
    },
    {
      "text": "John Torous and Adam C Powell. 2015. Current research and trends in the use of smartphone applications for mood disorders. Internet Interventions 2, 2 (2015), 169–173.",
      "doi": ""
    },
    {
      "text": "John Torous, Maria K Wolters, Greg Wadley, and Rafael A Calvo. 2019. 4 th Symposium on Computing and Mental Health: Designing Ethical eMental Health Services. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–9.",
      "doi": "10.1145/3290607.3298997"
    },
    {
      "text": "Eve Tuck, Marcia McKenzie, and Kate McCoy. 2014. Land education: Indigenous, post-colonial, and decolonizing perspectives on place and environmental education research.",
      "doi": ""
    },
    {
      "text": "Eve Tuck and K Wayne Yang. 2012. Decolonization is not a metaphor. Decolonization: Indigeneity, education & society 1, 1 (2012).",
      "doi": ""
    },
    {
      "text": "Hidde van der Meulen, Darragh McCashin, Gary O’Reilly, David Coyle, 2019. Using computer games to support mental health interventions: naturalistic deployment study. JMIR mental health 6, 5 (2019), e12430.",
      "doi": ""
    },
    {
      "text": "Chad Varah. 1962. How” The Samaritans” Combat Suicide. Mental health 21, 4 (1962), 132.",
      "doi": ""
    },
    {
      "text": "Mélodie Vidal, Jayson Turner, Andreas Bulling, and Hans Gellersen. 2012. Wearable eye tracking for mental health monitoring. Computer Communications 35, 11 (2012), 1306–1311.",
      "doi": "10.1016/j.comcom.2011.11.002"
    },
    {
      "text": "Nicholas Vincent, Hanlin Li, Nicole Tilly, Stevie Chancellor, and Brent Hecht. 2021. Data Leverage: A Framework for Empowering the Public in its Relationship with Technology Companies. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency. 215–227.",
      "doi": "10.1145/3442188.3445885"
    },
    {
      "text": "Maggie Walter and Chris Andersen. 2016. Indigenous statistics: A quantitative research methodology. Routledge.",
      "doi": ""
    },
    {
      "text": "Maggie Walter and Michele Suina. 2019. Indigenous data, indigenous methodologies and indigenous data sovereignty. International Journal of Social Research Methodology 22, 3(2019), 233–243.",
      "doi": ""
    },
    {
      "text": "William Wan. 2019. White House weighs controversial plan on mental illness and mass shootings. (9 September 2019).",
      "doi": ""
    },
    {
      "text": "Rui Wang, Fanglin Chen, Zhenyu Chen, Tianxing Li, Gabriella Harari, Stefanie Tignor, Xia Zhou, Dror Ben-Zeev, and Andrew T Campbell. 2014. StudentLife: assessing mental health, academic performance and behavioral trends of college students using smartphones. In Proceedings of the 2014 ACM international joint conference on pervasive and ubiquitous computing. 3–14.",
      "doi": "10.1145/2632048.2632054"
    },
    {
      "text": "Rui Wang, Fanglin Chen, Zhenyu Chen, Tianxing Li, Gabriella Harari, Stefanie Tignor, Xia Zhou, Dror Ben-Zeev, and Andrew T Campbell. 2017. StudentLife: Using smartphones to assess mental health and academic performance of college students. In Mobile health. Springer, 7–33.",
      "doi": ""
    },
    {
      "text": "Rui Wang, Weichen Wang, Alex DaSilva, Jeremy F Huckins, William M Kelley, Todd F Heatherton, and Andrew T Campbell. 2018. Tracking depression dynamics in college students using mobile phone and wearable sensing. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 1 (2018), 1–26.",
      "doi": "10.1145/3191775"
    },
    {
      "text": "Akash R Wasil, Tom Lee Osborn, John R Weisz, and Robert J DeRubeis. 2021. Online single-session interventions for Kenyan adolescents: study protocol for a comparative effectiveness randomised controlled trial. General Psychiatry 34, 3 (2021), e100446.",
      "doi": ""
    },
    {
      "text": "Emma Watson. 2019. What is peer support? History, evidence and values. Red Globe Press London.",
      "doi": ""
    },
    {
      "text": "Ethan Watters. 2010. Crazy like us: The globalization of the American psyche. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Paul Weindling. 1993. Health, race and German politics between national unification and Nazism, 1870-1945. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Joseph Weizenbaum. 1966. ELIZA—a computer program for the study of natural language communication between man and machine. Commun. ACM 9, 1 (1966), 36–45.",
      "doi": "10.1145/365153.365168"
    },
    {
      "text": "Ross G White and China Mills. 2017. ‘Global mental health spreads like bush fire in the global South’: Efforts to scale up mental health services in low-and middle-income countries. In The Palgrave handbook of sociocultural perspectives on global mental health. Springer, 187–209.",
      "doi": ""
    },
    {
      "text": "Heike Winschiers-Theophilus, Nicola J Bidwell, Shilumbe Chivuno-Kuria, and Gereon Koch Kapuire. 2010. Determining requirements within an indigenous knowledge system of African rural communities. In Proceedings of the 2010 Annual Research Conference of the South African Institute of Computer Scientists and Information Technologists. 332–340.",
      "doi": "10.1145/1899503.1899540"
    },
    {
      "text": "Mary K Wojczynski and Hemant K Tiwari. 2008. Definition of phenotype. Advances in genetics 60(2008), 75–105.",
      "doi": ""
    },
    {
      "text": "Marisol Wong-Villacres, Adriana Alvarado Garcia, Juan F Maestre, Pedro Reynolds-Cuéllar, Heloisa Candello, Marilyn Iriarte, and Carl DiSalvo. 2020. Decolonizing learning spaces for sociotechnical research and design. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing. 519–526.",
      "doi": "10.1145/3406865.3418592"
    },
    {
      "text": "Harry Yi-Jui Wu. 2021. Mad by the Millions: Mental Disorders and the Early Years of the World Health Organization. MIT Press.",
      "doi": ""
    },
    {
      "text": "Diyi Yang, Robert E Kraut, Tenbroeck Smith, Elijah Mayfield, and Dan Jurafsky. 2019. Seekers, providers, welcomers, and storytellers: Modeling social roles in online health communities. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3290605.3300574"
    },
    {
      "text": "Dong Whi Yoo, Michael L Birnbaum, Anna R Van Meter, Asra F Ali, Elizabeth Arenare, Gregory D Abowd, and Munmun De Choudhury. 2020. Designing a clinician-facing tool for using insights from patients’ social media activity: Iterative co-design approach. JMIR Mental Health 7, 8 (2020), e16969.",
      "doi": ""
    },
    {
      "text": "Iris Marion Young. 2014. Five faces of oppression. Rethinking power (2014), 174–95.",
      "doi": ""
    },
    {
      "text": "Hannah Zeavin. 2021. The Distance Cure: A History of Teletherapy. MIT Press.",
      "doi": ""
    },
    {
      "text": "Renwen Zhang, Kathryn E. Ringland, Melina Paan, David C. Mohr, and Madhu Reddy. 2021. Designing for Emotional Well-being: Integrating Persuasion and Customization into Mental Health Technologies. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445771"
    },
    {
      "text": "Ayah Zirikly, Philip Resnik, Ozlem Uzuner, and Kristy Hollingshead. 2019. CLPsych 2019 shared task: Predicting the degree of suicide risk in Reddit posts. In Proceedings of the sixth workshop on computational linguistics and clinical psychology. 24–33.",
      "doi": ""
    }
  ]
}