{
  "doi": "10.1145/3491102.3517729",
  "title": "BIGexplore: Bayesian Information Gain Framework for Information Exploration",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "The Bayesian information gain (BIG) framework has garnered significant interest as an interaction method for predicting a user’s intended target based on a user’s input. However, the BIG framework is constrained to goal-oriented cases, which renders it difficult to support changing goal-oriented cases such as design exploration. During the design exploration process, the design direction is often undefined and may vary over time. The designer’s mental model specifying the design direction is sequentially updated through the information-retrieval process. Therefore, tracking the change point of a user’s goal is crucial for supporting an information exploration. We introduce the BIGexplore framework for changing goal-oriented cases. BIGexplore detects transitions in a user’s browsing behavior as well as the user’s next target. Furthermore, a user study on BIGexplore confirms that the computational cost is significantly reduced compared with the existing BIG framework, and it plausibly detects the point where the user changes goals.",
  "authors": [
    {
      "name": "Kihoon Son",
      "institution": "Department of Interior Architecture Design, Design Informatics Lab, Hanyang University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528173",
      "orcid": "missing"
    },
    {
      "name": "Kyungmin Kim",
      "institution": "Department of Interior Architecture Design, Design Informatics Lab, Hanyang University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236308",
      "orcid": "missing"
    },
    {
      "name": "Kyung Hoon Hyun",
      "institution": "Department of Interior Architecture Design, Design Informatics Lab, Hanyang University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658752032",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "John Archea. 1987. Principles of Computer-aided Design: Computability of Design. Wiley-Interscience, New York, NY, USA, Chapter 3, 37–52.",
      "doi": ""
    },
    {
      "text": "Mathieu Aubry, Daniel Maturana, Alexei A. Efros, Bryan C. Russell, and Josef Sivic. 2014. Seeing 3D Chairs: Exemplar Part-based 2D-3D Alignment Using a Large Dataset of CAD Models. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. IEEE Computer Society, Los Alamitos, CA, USA, 3762–3769.",
      "doi": "10.1109/CVPR.2014.487"
    },
    {
      "text": "Xiaojun Bi, Otmar Hilliges Takeo Igarashi, and Antti Oulasvirta. 2017. Computational Interactivity (Dagstuhl Seminar 17232). Dagstuhl Reports 7, 6 (2017), 48–67. https://doi.org/10.4230/DagRep.7.6.48",
      "doi": ""
    },
    {
      "text": "Sara Bunian, Kai Li, Chaima Jemmali, Casper Harteveld, Yun Fu, Seif El-Nasr, and Magy Seif. 2021. VINS: Visual Search for Mobile User Interface Design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21). ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3411764.3445762",
      "doi": "10.1145/3411764.3445762"
    },
    {
      "text": "CIPLAB. 2019. Real and Fake Face Detection. Retrieved January 14, 2019 from https://www.kaggle.com/ciplab/real-and-fake-face-detection",
      "doi": ""
    },
    {
      "text": "John J. Dudley, Jason T. Jacques, and Per Ola Kristensson. 2019. Crowdsourcing Interface Feature Design with Bayesian Optimization. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19). ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300482",
      "doi": "10.1145/3290605.3300482"
    },
    {
      "text": "Maher Elkhaldi and Robert Woodbury. 2015. Interactive Design Exploration with Alt.Text. International Journal of Architectural Computing 13, 2 (2015), 103–122. https://doi.org/10.1260/1478-0771.13.2.103",
      "doi": ""
    },
    {
      "text": "Stephen Fitchett, Andy Cockburn, and Carl Gutwin. 2013. Improving Navigation-based File Retrieval. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI ’13). ACM, New York, NY, USA, 2329–2338. https://doi.org/10.1145/2470654.2481323",
      "doi": "10.1145/2470654.2481323"
    },
    {
      "text": "Björn Hartmann, Loren Yu, Abel Allison, Yeonsoo Yang, and Scott R. Klemmer. 2008. Design as Exploration: Creating Interface Alternatives through Parallel Authoring and Runtime Tuning. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST ’08). ACM, New York, NY, USA, 91–100. https://doi.org/10.1145/1449715.1449732",
      "doi": "10.1145/1449715.1449732"
    },
    {
      "text": "Chathra Hendahewa and Chirag Shah. 2017. Evaluating User Search Trails in Exploratory Search Tasks. Information Processing and Management 53, 4 (2017), 905–922. https://doi.org/10.1016/j.ipm.2017.04.001",
      "doi": "10.1016/j.ipm.2017.04.001"
    },
    {
      "text": "Forrest Huang, John F. Canny, and Jeffrey Nichols. 2019. Swire: Sketch-based User Interface Retrieval. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19). ACM, New York, NY, USA, 1–10. https://doi.org/10.1145/3290605.3300334",
      "doi": "10.1145/3290605.3300334"
    },
    {
      "text": "Kyung Hoon Hyun and Ji-Hyun Lee. 2018. Balancing Homogeneity and Heterogeneity in Design Exploration by Synthesizing Novel Design Alternatives based on Genetic Algorithm and Strategic Styling Decision. Advanced Engineering Informatics 38 (2018), 113–128. https://doi.org/10.1016/j.aei.2018.06.005",
      "doi": "10.1016/j.aei.2018.06.005"
    },
    {
      "text": "Florian Kadner, Yannik Keller, and Constantin Rothkopf. 2021. AdaptiFont: Increasing Individuals’ Reading Speed with a Generative Font Model and Bayesian Optimization. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21). ACM, New York, NY, USA, 1–11. https://doi.org/10.1145/3411764.3445140",
      "doi": "10.1145/3411764.3445140"
    },
    {
      "text": "Mohammad M. Khajah, Brett D. Roads, Robert V. Lindsey, Yun-En Liu, and Michael C. Mozer. 2016. Designing Engaging Games Using Bayesian Optimization. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16). ACM, New York, NY, USA, 5571–5582. https://doi.org/10.1145/2858036.2858253",
      "doi": "10.1145/2858036.2858253"
    },
    {
      "text": "Yanir Kleiman, Joel Lanir, Dov Danon, Yasmin Felberbaum, and Daniel Cohen-Or. 2015. DynamicMaps: Similarity-based Browsing through a Massive Set of Images. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI ’15). ACM, New York, NY, USA, 995–1004. https://doi.org/10.1145/2702123.2702224",
      "doi": "10.1145/2702123.2702224"
    },
    {
      "text": "Yuki Koyama, Issei Sato, and Masataka Goto. 2020. Sequential Gallery for Interactive Visual Design Optimization. ACM Transactions on Graphics (TOG) 39, 4 (2020), 1–12. https://doi.org/10.1145/3386569.3392444",
      "doi": "10.1145/3386569.3392444"
    },
    {
      "text": "Per Ola Kristensson, Nikola Banovic, Antti Oulasvirta, and John Williamson. 2019. Computational Interaction with Bayesian Methods. In CHI Conference on Human Factors in Computing Systems Extended Abstracts (CHI’19 Extended Abstracts). ACM, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3298820",
      "doi": ""
    },
    {
      "text": "Dan Li and Evangelos Kanoulas. 2018. Bayesian Optimization for Optimizing Retrieval Systems. In Proceedings of the Eleventh ACM International Conference on Web Search and Data Mining (WSDM ’18). ACM, New York, NY, USA, 360–368. https://doi.org/10.1145/3159652.3159665",
      "doi": "10.1145/3159652.3159665"
    },
    {
      "text": "Wanyu Liu, Rafael Lucas D’Oliveira, Michel Beaudouin-Lafon, and Olivier Rioul. 2017. BIGnav: Bayesian Information Gain for Guiding Multiscale Navigation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17). ACM, New York, NY, USA, 5869–5880. https://doi.org/10.1145/3025453.3025524",
      "doi": "10.1145/3025453.3025524"
    },
    {
      "text": "Wanyu Liu, Olivier Rioul, and Michel Beaudouin-Lafon. 2021. Bayesian Information Gain to Design Interaction. In Bayesian Methods for Interaction Design, Nikola Banovic, Per Ola Kristensson, Antti Oulasvirta, and John H. Williamson (Eds.). Cambridge University Press, Cambridge, UK. https://hal.telecom-paris.fr/hal-03323514",
      "doi": ""
    },
    {
      "text": "Wanyu Liu, Olivier Rioul, Joanna McGrenere, Wendy E. Mackay, and Michel Beaudouin-Lafon. 2018. BIGFile: Bayesian Information Gain for Fast File Retrieval. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18). ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173959",
      "doi": "10.1145/3173574.3173959"
    },
    {
      "text": "Justin Matejka, Michael Glueck, Erin Bradner, Ali Hashemi, Tovi Grossman, and George Fitzmaurice. 2018. Dream Lens: Exploration and Visualization of Large-Scale Generative Design Datasets. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ‘18). ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173943",
      "doi": "10.1145/3173574.3173943"
    },
    {
      "text": "Xuehua Shen and ChengXiang Zhai. 2005. Active Feedback in ad hoc Information Retrieval. In Proceedings of the 28th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR ’05). ACM, New York, NY, USA, 59–66. https://doi.org/10.1145/1076034.1076047",
      "doi": "10.1145/1076034.1076047"
    },
    {
      "text": "Ehsan Sherkat, Evangelos E. Milios, and Rosane Minghim. 2019. A Visual Analytics Approach for Interactive Document Clustering. ACM Transactions on Interactive Intelligent Systems 10, 1 (2019), 1–33. https://doi.org/10.1145/3241380",
      "doi": "10.1145/3241380"
    },
    {
      "text": "Kihoon Son, Hwiwon Chun, Sojin Park, and Kyung Hoon Hyun. 2020. C-Space: An Interactive Prototyping Platform for Collaborative Spatial Design Exploration. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20). ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376452",
      "doi": "10.1145/3313831.3376452"
    },
    {
      "text": "Kashyap Todi, Daryl Weir, and Antti Oulasvirta. 2016. Sketchplorer: A mixed-initiative tool for sketching and exploring interactive layout designs. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems(DIS ’16). ACM, New York, NY, USA, 543––555. https://doi.org/10.1145/2901790.2901817",
      "doi": ""
    },
    {
      "text": "Robert Woodbury, Arefin Mohiuddin, Mark Cichy, and Volker Mueller. 2017. Interactive Design Galleries: A General Approach to Interacting with Design Alternatives. Design Studies 52(2017), 40–72. https://doi.org/10.1016/j.destud.2017.05.001",
      "doi": ""
    },
    {
      "text": "Zhang, Enhao and Banovic, Nikola. 2021. Method for Exploring Generative Adversarial Networks (GANs) via Automatically Generated Image Galleries. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). ACM, New York, NY, USA, 1––15. https://doi.org/10.1145/3411764.3445714",
      "doi": ""
    }
  ]
}