{
  "doi": "10.1145/3491102.3502018",
  "title": "Making New Worlds – Transformative Becomings with Soma Design",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "Soma design is intended to increase our ability to appreciate through all our senses and lead to more meaningful interactions with the world. We contribute a longer-term study of soma design that shows evidence of this promise. Using storytelling approaches we draw on qualitative data from a three-month study of the soma mat and breathing light in four households. We tell stories of people’s becomings in the world as they learn of new possibilities for their somas; and as their somas transform. We show how people drew on their somaesthetic experiences with the prototypes to find their way through troubled times; and how through continued engagement some felt compelled to make transformations in how they live their lives. We discuss the implications for the overarching soma design program, focusing on what is required to design for ways of leading a better life.",
  "authors": [
    {
      "name": "Anna Ståhl",
      "institution": "Digital Systems, Data Science, RISE, Research Institutes of Sweden, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100377942",
      "orcid": "missing"
    },
    {
      "name": "Madeline Balaam",
      "institution": "Department of Media Technology and Interaction Design, KTH Royal Institute of Technology, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81448600301",
      "orcid": "0000-0001-9472-3805"
    },
    {
      "name": "Rob Comber",
      "institution": "Department of Media Technology and Interaction Design, KTH Royal Institute of Technology, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502812584",
      "orcid": "0000-0002-3127-1917"
    },
    {
      "name": "Pedro Sanches",
      "institution": "ITI/Larsys, Portugal",
      "img": "/do/10.1145/contrib-81384620808/rel-imgonly/pedro_cropped.png",
      "acmid": "81384620808",
      "orcid": "0000-0001-5620-6305"
    },
    {
      "name": "Kristina Höök",
      "institution": "Media Technology and Interaction Design, KTH Royal Institute of Technology, Sweden",
      "img": "/do/10.1145/contrib-81341491415/rel-imgonly/rigakiafeb2017.jpg",
      "acmid": "81341491415",
      "orcid": "0000-0002-0002-4825"
    }
  ],
  "references": [
    {
      "text": "Yoko Akama. 2014. Attuning to Ma (between-Ness) in Designing. In Proceedings of the 13th Participatory Design Conference on Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium Papers, and Keynote Abstracts - PDC ’14 - Volume 2. ACM Press, Windhoek, Namibia, 21–24. https://doi.org/10.1145/2662155.2662179",
      "doi": ""
    },
    {
      "text": "Yoko Akama. 2015. Being Awake to Ma: Designing in between-Ness as a Way of Becoming With. CoDesign 11, 3-4 (Oct. 2015), 262–274. https://doi.org/10.1080/15710882.2015.1081243",
      "doi": ""
    },
    {
      "text": "Simon Asplund and Martin Jonsson. 2018. SWAY - Designing for Balance and Posture Awareness. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, Stockholm Sweden, 470–475. https://doi.org/10.1145/3173225.3173262",
      "doi": "10.1145/3173225.3173262"
    },
    {
      "text": "Madeline Balaam, Rob Comber, Rachel E. Clarke, Charles Windlin, Anna Ståhl, Kristina Höök, and Geraldine Fitzpatrick. 2019. Emotion Work in Experience-Centered Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). ACM, New York, NY, USA, 602:1–602:12. https://doi.org/10.1145/3290605.3300832",
      "doi": "10.1145/3290605.3300832"
    },
    {
      "text": "Karen Barad. 2003. Posthumanist Performativity: Toward an Understanding of How Matter Comes to Matter. Signs 28, 3 (2003), 801–831. https://doi.org/10.1086/345321",
      "doi": ""
    },
    {
      "text": "Karen Barad. 2007. Meeting the Universe Halfway : Quantum Physics and the Entanglement of Matter and Meaning. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2018. Utopias of Participation: Feminism, Design, and the Futures. ACM Transactions on Computer-Human Interaction 25, 1 (Feb. 2018), 1–24. https://doi.org/10.1145/3127359",
      "doi": "10.1145/3127359"
    },
    {
      "text": "Jane Bennett. 2010. Vibrant Matter: A Political Ecology of Things. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Francesco Bigoni and Cumhur Erkut. 2020. DogDog: Soma-Based Interface Design for an Improvising Musician. In Proceedings of the 7th International Conference on Movement and Computing. ACM, Jersey City/Virtual NJ USA, 1–4. https://doi.org/10.1145/3401956.3404242",
      "doi": "10.1145/3401956.3404242"
    },
    {
      "text": "Julian Bleecker. 2009. Design Fiction: A short essay on design, science, fact and fiction.(2009).",
      "doi": ""
    },
    {
      "text": "Eli Blevis, Sabrina Hauser, and William Odom. 2015. Sharing the Hidden Treasure in Pictorials. Interactions 22, 3 (April 2015), 32–43. https://doi.org/10.1145/2755534",
      "doi": "10.1145/2755534"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101.",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on Reflexive Thematic Analysis. Qualitative Research in Sport, Exercise and Health 11, 4 (Aug. 2019), 589–597. https://doi.org/10.1080/2159676X.2019.1628806",
      "doi": "10.1080/2159676x.2019.1628806"
    },
    {
      "text": "Levi R. Bryant. 2011. Democracy of Objects. Open Humanities Press. https://doi.org/10.3998/ohp.9750134.0001.001",
      "doi": ""
    },
    {
      "text": "Chip Chipman and Elsie Spittle. 2019. Genesis of the Three Principles: Reflections on the Life and Discoveries of Sydney Banks. Independently Published.",
      "doi": ""
    },
    {
      "text": "F. Michael Connelly and D. Jean Clandinin. 2006. Narrative Inquiry. In Handbook of Complementary Methods in Education Research (3rd ed. ed.). Lawrence Erlbaum., Mahwah, NJ, 477–487.",
      "doi": ""
    },
    {
      "text": "Kelsey Cotton, Pedro Sanches, Vasiliki Tsaknaki, and Pavel Karpashevich. 2021. The Body Electric: A NIME Designed through and with the Somatic Experience of Singing. In NIME 2021. PubPub, Shanghai, China. https://doi.org/10.21428/92fbeb44.ec9f8fdd",
      "doi": ""
    },
    {
      "text": "Gilles Deleuze and Félix Guattari. 2013. A Thousand Plateaus: Capitalism and Schizophrenia. Bloomsbury Academic, London.",
      "doi": ""
    },
    {
      "text": "Jacques Derrida. 1993. Memoirs of the Blind: The Self-Portrait and Other Ruins. University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Laura Devendorf, Kristina Andersen, and Aisling Kelliher. 2020. The Fundamental Uncertainties of Mothering: Finding Ways to Honor Endurance, Struggle, and Contradiction. ACM Transactions on Computer-Human Interaction 27, 4 (Sept. 2020), 26:1–26:24. https://doi.org/10.1145/3397177",
      "doi": "10.1145/3397177"
    },
    {
      "text": "John Dewey. 2007. Human Nature and Conduct an Introduction to Social Psychology. Cosimo, New York, N.Y.",
      "doi": ""
    },
    {
      "text": "Carolyn Ellis. 2004. The Ethnographic I: A Methodological Novel about Autoethnography. Number v. 13 in Ethnographic Alternatives Book Series. AltaMira Press, Walnut Creek, CA.",
      "doi": ""
    },
    {
      "text": "Sara Eriksson, Kristina Höök, Richard Shusterman, Dag Svanes, Carl Unander-Scharin, and Åsa Unander-Scharin. 2020. Ethics in Movement: Shaping and Being Shaped in Human-Drone Interaction. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376678"
    },
    {
      "text": "Sara Eriksson, Åsa Unander-Scharin, Vincent Trichon, Carl Unander-Scharin, Hedvig Kjellström, and Kristina Höök. 2019. Dancing With Drones: Crafting Novel Artistic Expressions Through Intercorporeality. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300847",
      "doi": ""
    },
    {
      "text": "Moshé Feldenkrais. 1990. Awareness through Movement: Health Exercises for Personal Growth (1st harpercollins pbk. eded.). HarperSanFrancisco, San Francisco.",
      "doi": ""
    },
    {
      "text": "Jules Françoise, Yves Candau, Sarah Fdili Alaoui, and Thecla Schiphorst. 2017. Designing for Kinesthetic Awareness: Revealing User Experiences through Second-Person Inquiry. Association for Computing Machinery, New York, NY, USA, 5171–5183. https://doi.org/10.1145/3025453.3025714",
      "doi": "10.1145/3025453.3025714"
    },
    {
      "text": "Christopher Frauenberger. 2019. Entanglement HCI The Next Wave?ACM Transactions on Computer-Human Interaction (TOCHI) 27, 1 (Nov. 2019), 2:1–2:27. https://doi.org/10.1145/3364998",
      "doi": ""
    },
    {
      "text": "Paula Gardner and Barbara Jenkins. 2016. Bodily Intra-Actions with Biometric Devices. Body & Society 22, 1 (March 2016), 3–30. https://doi.org/10.1177/1357034X15604030",
      "doi": ""
    },
    {
      "text": "Graham Harman. 2011. The Quadruple Object. Zero Books, Winchester.",
      "doi": ""
    },
    {
      "text": "Sjoerd Hendriks, Simon Mare, Mafalda Gamboa, and Mehmet Aydýn Baytaþ. 2021. Azalea: Co-Experience in Remote Dialog through Diminished Reality and Somaesthetic Interaction Design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3411764.3445052",
      "doi": "10.1145/3411764.3445052"
    },
    {
      "text": "Sarah Homewood, Amanda Karlsson, and Anna Vallgårda. 2020. Removal as a Method: A Fourth Wave HCI Approach to Understanding the Experience of Self-Tracking. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. ACM, Eindhoven Netherlands, 1779–1791. https://doi.org/10.1145/3357236.3395425",
      "doi": "10.1145/3357236.3395425"
    },
    {
      "text": "Kristina Höök. 2018. Designing with the Body: Somaesthetic Interaction Design. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Steve Benford, Paul Tennent, Vasiliki Tsaknaki, Miquel Alfaras, Juan Pablo Martinez Avila, Christine Li, Joseph Marshall, Claudia Dauden Roquet, Pedro Sanches, Anna Ståhl, Muhammad Umair, Charles Windlin, and Feng Zhou. 2021. Unpacking Non-Dualistic Design: The Soma Design Case.ACM Transactions on Computer-Human Interaction 28, 6(2021).",
      "doi": "10.1145/3462448"
    },
    {
      "text": "Kristina Höök, Baptiste Caramiaux, Cumhur Erkut, Jodi Forlizzi, Nassrin Hajinejad, Michael Haller, Caroline Hummels, Katherine Isbister, Martin Jonsson, George Khut, Lian Loke, Danielle Lottridge, Patrizia Marti, Edward Melcer, Florian Müller, Marianne Petersen, Thecla Schiphorst, Elena Segura, Anna Ståhl, Dag Svanæs, Jakob Tholander, and Helena Tobiasson. 2018. Embracing First-Person Perspectives in Soma-Based Design. Informatics 5, 1 (Feb. 2018), 8. https://doi.org/10.3390/informatics5010008",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Sara Eriksson, Marie Louise Juul Søndergaard, Marianela Ciolfi Felice, Nadia Campo Woytuk, Ozgun Kilic Afsar, Vasiliki Tsaknaki, and Anna Ståhl. 2019. Soma Design and Politics of the Body. In Proceedings of the Halfway to the Future Symposium 2019(HTTF 2019). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3363384.3363385",
      "doi": "10.1145/3363384.3363385"
    },
    {
      "text": "Kristina Höök, Martin P. Jonsson, Anna Ståhl, and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 3131–3142.",
      "doi": ""
    },
    {
      "text": "Tim Ingold. 2007. Lines. Routledge. https://doi.org/10.4324/9780203961155",
      "doi": ""
    },
    {
      "text": "Tim Ingold. 2010. Bringing Things Back to Life: Creative Entanglements in a World of Materials.Technical Report. University of Manchester., University of Manchester.",
      "doi": ""
    },
    {
      "text": "Tim Ingold. 2011. Being Alive. Routledge. https://doi.org/10.4324/9780203818336",
      "doi": ""
    },
    {
      "text": "Tim Ingold. 2017. On Human Correspondence: On Human Correspondence. Journal of the Royal Anthropological Institute 23, 1 (March 2017), 9–27. https://doi.org/10.1111/1467-9655.12541",
      "doi": ""
    },
    {
      "text": "Arata Isozaki. 2000. Ma – Ni Ju Nen Ato No Kikanten, (MA – Twenty Years On), Exhibition Catalogue. Tokyo Geijutsu Daigaku, Tokyo.",
      "doi": ""
    },
    {
      "text": "Arata Isozaki. 2006. Japan-Ness in Architecture. MIT Press, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Martin Jonsson, Anna Ståhl, Johanna Mercurio, Anna Karlsson, Naveen Ramani, and Kristina Höök. 2016. The Aesthetics of Heat: Guiding Awareness with Thermal Stimuli. In Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, Eindhoven Netherlands, 109–117. https://doi.org/10.1145/2839462.2839487",
      "doi": "10.1145/2839462.2839487"
    },
    {
      "text": "Kari Kuutti and Liam J. Bannon. 2014. The Turn to Practice in HCI: Towards a Research Agenda. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Toronto Ontario Canada, 3543–3552. https://doi.org/10.1145/2556288.2557111",
      "doi": "10.1145/2556288.2557111"
    },
    {
      "text": "Pui-Ying Lorelei Kwan. 2012. Exploring Japanese Art and Aesthetic as Inspiration for Emotionally Durable Design. In Designed Asia. Hong Kong.",
      "doi": ""
    },
    {
      "text": "Joseph La Delfa, Mehmet Aydin Baytas, Rakesh Patibanda, Hazel Ngari, Rohit Ashok Khot, and Florian ’Floyd’ Mueller. 2020. Drone Chi: Somaesthetic Human-Drone Interaction. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–13. https://doi.org/10.1145/3313831.3376786",
      "doi": "10.1145/3313831.3376786"
    },
    {
      "text": "Debora de Castro Leal, Angelika Strohmayer, and Max Krüger. 2021. On Activism and Academia: Reflecting Together and Sharing Experiences Among Critical Friends. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–18.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2018. How Do Data Come to Matter? Living and Becoming with Personal Data. Big Data & Society 5, 2 (July 2018), 205395171878631. https://doi.org/10.1177/2053951718786314",
      "doi": ""
    },
    {
      "text": "Erin Manning. 2016. The Minor Gesture. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Juan P Martinez Avila, Vasiliki Tsaknaki, Pavel Karpashevich, Charles Windlin, Niklas Valenti, Kristina Höök, Andrew McPherson, and Steve Benford. 2020. Soma Design for NIME. In Proceedings of the International Conference on New Interfaces for Musical Expression. Zenodo, Birmingham, UK. https://doi.org/10.5281/ZENODO.4813491",
      "doi": ""
    },
    {
      "text": "Erin McKenna. 2001. The Task of Utopia: A Pragmatist and Feminist Perspective. Rowman & Littlefield Publishers, Lanham, Md.",
      "doi": ""
    },
    {
      "text": "Svetlana Mironcika, Annika Hupfeld, Joep Frens, Jessica Asjes, and Stephan Wensveen. 2020. Snap-Snap T-Shirt: Posture Awareness Through Playful and Somaesthetic Experience. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, Sydney NSW Australia, 799–809. https://doi.org/10.1145/3374920.3375013",
      "doi": "10.1145/3374920.3375013"
    },
    {
      "text": "Aishath Nasheeda, Haslinda Binti Abdullah, Steven Eric Krauss, and Nobaya Binti Ahmed. 2019. Transforming Transcripts Into Stories: A Multimethod Approach to Narrative Analysis. International Journal of Qualitative Methods 18 (Jan. 2019), 1609406919856797. https://doi.org/10.1177/1609406919856797",
      "doi": ""
    },
    {
      "text": "Claire Petitmengin. 2006. Describing one’s subjective experience in the second person: An interview method for the science of consciousness. Phenomenology and the Cognitive Sciences 5 (12 2006), 229–269. https://doi.org/10.1007/s11097-006-9022-2",
      "doi": ""
    },
    {
      "text": "Richard B. Pilgrim. 1986. Intervals (”Ma”) in Space and Time: Foundations for a Religio-Aesthetic Paradigm in Japan. History of Religions 25, 3 (Feb. 1986), 255–277. https://doi.org/10.1086/463043",
      "doi": ""
    },
    {
      "text": "Kristina Popova, Rachael Garrett, Claudia Núñez Pacheco, Airi Lampinen, and Kristina Höök. 2022. Vulnerability as an Ethical Stance in Soma Design Processes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3491102.3501994",
      "doi": "10.1145/3491102.3501994"
    },
    {
      "text": "Mirjana Prpa, Sarah Fdili-Alaoui, Thecla Schiphorst, and Philippe Pasquier. 2020. Articulating Experience: Reflections from Experts Applying Micro-Phenomenology to Design Research in HCI. Association for Computing Machinery, New York, NY, USA, 1–14. doi.org/10.1145/3313831.3376664",
      "doi": "10.1145/3313831.3376664"
    },
    {
      "text": "Mirjana Prpa, Kıvanç Tatar, Jules Françoise, Bernhard Riecke, Thecla Schiphorst, and Philippe Pasquier. 2018. Attending to Breath: Exploring How the Cues in a Virtual Environment Guide the Attention to Breath and Shape the Quality of Experience to Support Mindfulness. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS’18). Association for Computing Machinery, New York, NY, USA, 71–84. https://doi.org/10.1145/3196709.3196765",
      "doi": "10.1145/3196709.3196765"
    },
    {
      "text": "Johan Redström. 2017. Making Design Theory. The MIT Press. https://doi.org/10.7551/mitpress/11160.001.0001",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Noura Howell, Vasiliki Tsaknaki, Tom Jenkins, and Karey Helms. 2022. Diffraction-in-action: Designerly Explorations of Agential Realism Through Lived Data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3491102.3502029",
      "doi": "10.1145/3491102.3502029"
    },
    {
      "text": "Maxine Sheets-Johnstone. 2011. The Primacy of Movement: Expanded Second Edition (second ed.). Advances in Consciousness Research, Vol. 82. John Benjamins Publishing Company, Amsterdam. https://doi.org/10.1075/aicr.82",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. 2008. Body Consciousness: A Philosophy of Mindfulness and Somaesthetics. Cambridge University Press, Cambridge. https://doi.org/10.1017/CBO9780511802829",
      "doi": ""
    },
    {
      "text": "Herbert A. Simon. 1969. The Sciences of the Artificial(third ed.). MIT Press, Cambridge, MA, USA.",
      "doi": "10.5555/237774"
    },
    {
      "text": "Anna Ståhl, Martin Jonsson, Johanna Mercurio, Anna Karlsson, Kristina Höök, and Eva-Carin Banka Johnson. 2016. The Soma Mat and Breathing Light. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 305–308. https://doi.org/10.1145/2851581.2889464",
      "doi": "10.1145/2851581.2889464"
    },
    {
      "text": "Anna Ståhl, Vasiliki Tsaknaki, and Madeline Balaam. 2021. Validity and Rigour in Soma Design - Sketching with the Soma.ACM Transactions on Computer-Human Interaction 28, 6(2021). https://doi.org/10.1145/3470132",
      "doi": ""
    },
    {
      "text": "Anna Ståhl, Jonas Löwgren, and Kristina Höök. 2014. Evocative Balance : Designing for Interactional Empowerment. International Journal of Design 8, 1 (2014), 43–57.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 1987. Plans and Situated Actions. Cambridge University Press.",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Lucy Suchman. 2006. Human-Machine Reconfigurations: Plans and Situated Actions. Cambridge University Press.",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Petra Sundström, Alex Taylor, Katja Grufberg, Niklas Wirström, Jordi Solsona Belenguer, and Marcus Lundén. 2011. Inspirational Bits: Towards a Shared Understanding of the Digital Material. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Vancouver BC Canada, 1561–1570. https://doi.org/10.1145/1978942.1979170",
      "doi": "10.1145/1978942.1979170"
    },
    {
      "text": "Paul Tennent, Kristina Höök, Steve Benford, Vasiliki Tsaknaki, Anna Ståhl, Claudia Dauden Roquet, Charles Windlin, Pedro Sanches, Joe Marshall, Christine Li, Juan Pablo Martinez Avila, Miquel Alfaras, Muhammad Umair, and Feng Zhou. 2021. Articulating Soma Experiences Using Trajectories. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–16. https://doi.org/10.1145/3411764.3445482",
      "doi": "10.1145/3411764.3445482"
    },
    {
      "text": "Paul Tennent, Joe Marshall, Vasiliki Tsaknaki, Charles Windlin, Kristina Höök, and Miquel Alfaras. 2020. Soma Design and Sensory Misalignment. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–12. https://doi.org/10.1145/3313831.3376812",
      "doi": "10.1145/3313831.3376812"
    },
    {
      "text": "Ron Wakkary, Doenja Oogjes, Henry W. J. Lin, and Sabrina Hauser. 2018. Philosophers Living with the Tilting Bowl. Association for Computing Machinery, New York, NY, USA, 1–12. doi.org/10.1145/3173574.3173668",
      "doi": "10.1145/3173574.3173668"
    },
    {
      "text": "Charles Windlin, Anna Ståhl, Pedro Sanches, Vasiliki Tsaknaki, Pavel Karpashevich, Madeline Balaam, and Kristina Höök. 2019. Soma Bits: Mediating Technology to Orchestrate Bodily Experiences. In RTD Conference. Delft. https://doi.org/10.6084/M9.FIGSHARE.7855799.V2",
      "doi": ""
    }
  ]
}