{
  "doi": "10.1145/3491102.3517560",
  "title": "BikeAR: Understanding Cyclists’ Crossing Decision-Making at Uncontrolled Intersections using Augmented Reality",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "Cycling has become increasingly popular as a means of transportation. However, cyclists remain a highly vulnerable group of road users. According to accident reports, one of the most dangerous situations for cyclists are uncontrolled intersections, where cars approach from both directions. To address this issue and assist cyclists in crossing decision-making at uncontrolled intersections, we designed two visualizations that: (1) highlight occluded cars through an X-ray vision and (2) depict the remaining time the intersection is safe to cross via a Countdown. To investigate the efficiency of these visualizations, we proposed an Augmented Reality simulation as a novel evaluation method, in which the above visualizations are represented as AR, and conducted a controlled experiment with 24 participants indoors. We found that the X-ray ensures a fast selection of shorter gaps between cars, while the Countdown facilitates a feeling of safety and provides a better intersection overview.",
  "tags": [
    "augmented reality",
    "cyclist safety",
    "crossing decision-making"
  ],
  "authors": [
    {
      "name": "Andrii Matviienko",
      "institution": "Telecooperation Lab, Technical University of Darmstadt, Germany",
      "img": "/do/10.1145/contrib-99658734228/rel-imgonly/andrii_2.jpg",
      "acmid": "99658734228",
      "orcid": "0000-0002-6571-0623"
    },
    {
      "name": "Florian Müller",
      "institution": "LMU Munich, Germany",
      "img": "/do/10.1145/contrib-81464642529/rel-imgonly/flo_small.jpg",
      "acmid": "81464642529",
      "orcid": "0000-0002-9621-6214"
    },
    {
      "name": "Dominik Schön",
      "institution": "Telecooperation Lab, Technical University of Darmstadt, Germany",
      "img": "/do/10.1145/contrib-99659260815/rel-imgonly/ich_privat.jpg",
      "acmid": "99659260815",
      "orcid": "0000-0003-2704-2852"
    },
    {
      "name": "Paul Seesemann",
      "institution": "Telecooperation Lab, Technnical University of Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238599",
      "orcid": "missing"
    },
    {
      "name": "Sebastian Günther",
      "institution": "Telecooperation Lab, Technical University of Darmstadt, Germany",
      "img": "/do/10.1145/contrib-99659021644/rel-imgonly/sepp.jpg",
      "acmid": "99659021644",
      "orcid": "0000-0003-1281-2180"
    },
    {
      "name": "Max Mühlhäuser",
      "institution": "Telecooperation Lab, Technical University of Darmstadt, Germany",
      "img": "/do/10.1145/contrib-81100305085/rel-imgonly/max_2669.jpg",
      "acmid": "81100305085",
      "orcid": "0000-0003-4713-5327"
    }
  ],
  "references": [
    {
      "text": "Letty Aarts, JJF Commandeur, Ruth Welsh, S Niesen, Markus Lerner, Pete Thomas, Niels Bos, and RJ Davidse. 2016. Study on serious road traffic injuries in the EU. (2016). https://doi.org/10.2832/29647",
      "doi": ""
    },
    {
      "text": "Josh Andres, Tuomas Kari, Juerg von Kaenel, and Florian ’Floyd’ Mueller. 2019. ”Co-Riding With My EBike to Get Green Lights”. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 1251–1263. https://doi.org/10.1145/3322276.3322307",
      "doi": "10.1145/3322276.3322307"
    },
    {
      "text": "Josh Andres, m.c. schraefel, Nathan Semertzidis, Brahmi Dwivedi, Yutika C. Kulwe, Juerg von Kaenel, and Florian Floyd Mueller. 2020. Introducing Peripheral Awareness as a Neurological State for Human-Computer Integration. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376128",
      "doi": "10.1145/3313831.3376128"
    },
    {
      "text": "Ensar Becic, Christopher J. Edwards, Michael P. Manser, and Max Donath. 2018. Aging and the use of an in-vehicle intersection crossing assist system: An on-road study. Transportation Research Part F: Traffic Psychology and Behaviour 56 (2018), 113–122. https://doi.org/10.1016/j.trf.2018.03.032",
      "doi": ""
    },
    {
      "text": "Ensar Becic, Michael Manser, Christopher Drucker, and Max Donath. 2013. Aging and the impact of distraction on an intersection crossing assist system. Accident Analysis & Prevention 50 (2013), 968–974. https://doi.org/10.1016/j.aap.2012.07.025",
      "doi": ""
    },
    {
      "text": "Ensar Becic, Michael P. Manser, Janet I. Creaser, and Max Donath. 2012. Intersection crossing assist system: Transition from a road-side to an in-vehicle system. Transportation Research Part F: Traffic Psychology and Behaviour 15, 5(2012), 544–555. https://doi.org/10.1016/j.trf.2012.05.010",
      "doi": ""
    },
    {
      "text": "Benjamin J. Chihak, Timofey Y. Grechkin, Joseph K. Kearney, James F. Cremer, and Jodie M. Plumert. 2014. How children and adults learn to intercept moving gaps. Journal of Experimental Child Psychology 122 (2014), 134–152. https://doi.org/10.1016/j.jecp.2013.12.006",
      "doi": ""
    },
    {
      "text": "Michael Clamann, Miles Aubert, and Mary L Cummings. 2017. Evaluation of vehicle-to-pedestrian communication displays for autonomous vehicles. Technical Report.",
      "doi": ""
    },
    {
      "text": "European Commission. 2016. Proactive Safety for Pedestrians and Cyclists: Accident Analysis, Naturalistic Observations and Project Implications. http://www.prospect-project.eu/",
      "doi": ""
    },
    {
      "text": "Alexandru Dancu, Zlatko Franjcic, and Morten Fjeld. 2014. Smart Flashlight: Map Navigation Using a Bike-Mounted Projector. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 3627–3630. https://doi.org/10.1145/2556288.2557289",
      "doi": "10.1145/2556288.2557289"
    },
    {
      "text": "Alexandru Dancu, Velko Vechev, Adviye Ayça Ünlüer, Simon Nilson, Oscar Nygren, Simon Eliasson, Jean-Elie Barjonet, Joe Marshall, and Morten Fjeld. 2015. Gesture Bike: Examining Projection Surfaces and Turn Signal Systems for Urban Cycling. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (Madeira, Portugal) (ITS ’15). Association for Computing Machinery, New York, NY, USA, 151–159. https://doi.org/10.1145/2817721.2817748",
      "doi": "10.1145/2817721.2817748"
    },
    {
      "text": "Debargha Dey, Marieke Martens, Chao Wang, Felix Ros, and Jacques Terken. 2018. Interface Concepts for Intent Communication from Autonomous Vehicles to Vulnerable Road Users. In Adjunct Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Toronto, ON, Canada) (AutomotiveUI ’18). Association for Computing Machinery, New York, NY, USA, 82–86. https://doi.org/10.1145/3239092.3265946",
      "doi": "10.1145/3239092.3265946"
    },
    {
      "text": "Debargha Dey, Andrii Matviienko, Melanie Berger, Bastian Pfleging, Marieke Martens, and Jacques Terken. 2020. Communicating the intention of an automated vehicle to pedestrians: The contributions of eHMI and vehicle behavior. it-Information Technology 1 (2020). https://doi.org/doi:10.1515/itit-2020-0025",
      "doi": ""
    },
    {
      "text": "Rune Elvik and Torkel Bjørnskau. 2017. Safety-in-numbers: A systematic review and meta-analysis of evidence. Safety Science 92(2017), 274–282. https://doi.org/10.1016/j.ssci.2015.07.017",
      "doi": ""
    },
    {
      "text": "Andreas Frank, Fabian Schneider, Alexander Meschtscherjakov, and Julian Stadon. 2015. Advanced Traffic Light Interface: Countdown Timers to Increase User Experience. In Adjunct Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Nottingham, United Kingdom) (AutomotiveUI ’15). Association for Computing Machinery, New York, NY, USA, 56–61. https://doi.org/10.1145/2809730.2809737",
      "doi": "10.1145/2809730.2809737"
    },
    {
      "text": "Moojan Ghafurian and David Reitter. 2016. Impatience Induced by Waiting: An Effect Moderated by the Speed of Countdowns. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). Association for Computing Machinery, New York, NY, USA, 556–564. https://doi.org/10.1145/2901790.2901830",
      "doi": "10.1145/2901790.2901830"
    },
    {
      "text": "Irene Gohl, A Schneider, J Stoll, M Wisch, and V Nitsch. 2016. Car-to-cyclist accidents from the car driver’s point of view. In International Cycling Safety Conference (ICSC). https://doi.org/10.5281/zenodo.1135195",
      "doi": ""
    },
    {
      "text": "Timofey Y Grechkin, Benjamin J Chihak, James F Cremer, Joseph K Kearney, and Jodie M Plumert. 2013. Perceiving and acting on complex affordances: how children and adults bicycle across two lanes of opposing traffic.Journal of experimental psychology: human perception and performance 39, 1(2013), 23. https://doi.org/10.1037/a0029716",
      "doi": ""
    },
    {
      "text": "Uwe Gruenefeld, Sebastian Weiß, Andreas Löcken, Isabella Virgilio, Andrew L. Kun, and Susanne Boll. 2019. VRoad: Gesture-Based Interaction between Pedestrians and Automated Vehicles in Virtual Reality. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications: Adjunct Proceedings (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 399–404. https://doi.org/10.1145/3349263.3351511",
      "doi": "10.1145/3349263.3351511"
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139–183.",
      "doi": ""
    },
    {
      "text": "Dave Horton, Paul Rosen, and Peter Cox. 2016. Cycling and society. Routledge. https://doi.org/10.4324/9781315575735",
      "doi": ""
    },
    {
      "text": "Yuanyuan Jiang, Elizabeth E. O’Neal, Luke Franzen, Junghum Paul Yon, Jodie M. Plumert, and Joseph K. Kearney. 2017. The Influence of Stereoscopic Image Display on Pedestrian Road Crossing in a Large-Screen Virtual Environment. In Proceedings of the ACM Symposium on Applied Perception (Cottbus, Germany) (SAP ’17). Association for Computing Machinery, New York, NY, USA, Article 6, 4 pages. https://doi.org/10.1145/3119881.3119886",
      "doi": "10.1145/3119881.3119886"
    },
    {
      "text": "Eric M. Jones, Ted Selker, and Hyemin Chung. 2007. What You Said about Where You Shook Your Head: A Hands-Free Implementation of a Location-Based Notification System. In CHI ’07 Extended Abstracts on Human Factors in Computing Systems (San Jose, CA, USA) (CHI EA ’07). Association for Computing Machinery, New York, NY, USA, 2477–2482. https://doi.org/10.1145/1240866.1241027",
      "doi": ""
    },
    {
      "text": "Jiro Katto, Masaru Takeuchi, Kenji Kanai, and Heming Sun. 2019. Road Infrastructure Monitoring System Using E-Bikes and Its Extensions for Smart Community. In Proceedings of the 1st ACM Workshop on Emerging Smart Technologies and Infrastructures for Smart Mobility and Sustainability (Los Cabos, Mexico) (SMAS ’19). Association for Computing Machinery, New York, NY, USA, 43–44. https://doi.org/10.1145/3349622.3355455",
      "doi": "10.1145/3349622.3355455"
    },
    {
      "text": "Matthias Kuehn, Thomas Hummel, and Antje Lang. 2015. Cyclist-car accidents–their consequences for cyclists and typical accident scenarios. In Proceedings of the 24th International Conference on the Enhanced Safety of Vehicles.",
      "doi": ""
    },
    {
      "text": "Markus Löchtefeld, Antonio Krüger, and Hans Gellersen. 2016. DeceptiBike: Assessing the Perception of Speed Deception in a Virtual Reality Training Bike System. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (Gothenburg, Sweden) (NordiCHI ’16). Association for Computing Machinery, New York, NY, USA, Article 40, 10 pages. https://doi.org/10.1145/2971485.2971513",
      "doi": "10.1145/2971485.2971513"
    },
    {
      "text": "Andreas Löcken, Carmen Golling, and Andreas Riener. 2019. How Should Automated Vehicles Interact with Pedestrians? A Comparative Analysis of Interaction Concepts in Virtual Reality. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 262–274. https://doi.org/10.1145/3342197.3344544",
      "doi": "10.1145/3342197.3344544"
    },
    {
      "text": "Karthik Mahadevan, Sowmya Somanath, and Ehud Sharlin. 2018. Communicating Awareness and Intent in Autonomous Vehicle-Pedestrian Interaction. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174003",
      "doi": ""
    },
    {
      "text": "Jeehan Malik, Morgan N. Di Napoli Parr, Jessica Flathau, Hanxi Tang, Joseph K. Kearney, Jodie M. Plumert, and Kyle Rector. 2021. Determining the Effect of Smartphone Alerts and Warnings on Street-Crossing Behavior in Non-Mobility-Impaired Older and Younger Adults. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445234",
      "doi": ""
    },
    {
      "text": "Andrii Matviienko, Swamy Ananthanarayan, Shadan Sadeghian Borojeni, Yannick Feld, Wilko Heuten, and Susanne Boll. 2018. Augmenting Bicycles and Helmets with Multimodal Warnings for Children. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (Barcelona, Spain) (MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, Article 15, 13 pages. https://doi.org/10.1145/3229434.3229479",
      "doi": "10.1145/3229434.3229479"
    },
    {
      "text": "Andrii Matviienko, Swamy Ananthanarayan, Stephen Brewster, Wilko Heuten, and Susanne Boll. 2019. Comparing Unimodal Lane Keeping Cues for Child Cyclists. In Proceedings of the 18th International Conference on Mobile and Ubiquitous Multimedia (Pisa, Italy) (MUM ’19). Association for Computing Machinery, New York, NY, USA, Article 14, 11 pages. https://doi.org/10.1145/3365610.3365632",
      "doi": "10.1145/3365610.3365632"
    },
    {
      "text": "Andrii Matviienko, Swamy Ananthanarayan, Abdallah El Ali, Wilko Heuten, and Susanne Boll. 2019. NaviBike: Comparing Unimodal Navigation Cues for Child Cyclists. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300850",
      "doi": "10.1145/3290605.3300850"
    },
    {
      "text": "Andrii Matviienko, Swamy Ananthanarayan, Raphael Kappes, Wilko Heuten, and Susanne Boll. 2020. Reminding Child Cyclists about Safety Gestures. In Proceedings of the 9TH ACM International Symposium on Pervasive Displays (Manchester, United Kingdom) (PerDis ’20). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3393712.3394120",
      "doi": "10.1145/3393712.3394120"
    },
    {
      "text": "Andrii Matviienko, Florian Heller, and Bastian Pfleging. 2021. Quantified Cycling Safety: Towards a Mobile Sensing Platform to Understand Perceived Safety of Cyclists. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 262, 6 pages. https://doi.org/10.1145/3411763.3451678",
      "doi": "10.1145/3411763.3451678"
    },
    {
      "text": "Andrii Matviienko, Andreas Löcken, Abdallah El Ali, Wilko Heuten, and Susanne Boll. 2016. NaviLight: Investigating Ambient Light Displays for Turn-by-Turn Navigation in Cars. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 283–294. https://doi.org/10.1145/2935334.2935359",
      "doi": "10.1145/2935334.2935359"
    },
    {
      "text": "Andrii Matviienko, Florian Müller, Marcel Zickler, Lisa Gasche, Julia Abels, Till Steinert, and Max Mühlhäuser. 2022. Reducing Virtual Reality Sickness for Cyclists in VR Bicycle Simulators(CHI ’22). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3491102.3501959",
      "doi": ""
    },
    {
      "text": "Andrii Matviienko, Maria Rauschenberger, Vanessa Cobus, Janko Timmermann, Heiko Müller, Jutta Fortmann, Andreas Löcken, Christoph Trappe, Wilko Heuten, and Susanne Boll. 2015. Deriving Design Guidelines for Ambient Light Systems. In Proceedings of the 14th International Conference on Mobile and Ubiquitous Multimedia (Linz, Austria) (MUM ’15). Association for Computing Machinery, New York, NY, USA, 267–277. https://doi.org/10.1145/2836041.2836069",
      "doi": "10.1145/2836041.2836069"
    },
    {
      "text": "Siva RK Narla. 2013. The evolution of connected vehicle technology: From smart drivers to smart cars to... self-driving cars. Ite Journal 83, 7 (2013), 22–26.",
      "doi": ""
    },
    {
      "text": "Martin Pielot, Benjamin Poppinga, Wilko Heuten, and Susanne Boll. 2012. Tacticycle: Supporting Exploratory Bicycle Trips. In Proceedings of the 14th International Conference on Human-Computer Interaction with Mobile Devices and Services (San Francisco, California, USA) (MobileHCI ’12). Association for Computing Machinery, New York, NY, USA, 369–378. https://doi.org/10.1145/2371574.2371631",
      "doi": "10.1145/2371574.2371631"
    },
    {
      "text": "Jodie M. Plumert, Joseph K. Kearney, James F. Cremer, Kara M. Recker, and Jonathan Strutt. 2011. Changes in children’s perception-action tuning over short time scales: Bicycling across traffic-filled intersections in a virtual environment. Journal of Experimental Child Psychology 108, 2 (2011), 322–337. https://doi.org/10.1016/j.jecp.2010.07.005",
      "doi": ""
    },
    {
      "text": "Benjamin Poppinga, Martin Pielot, and Susanne Boll. 2009. Tacticycle: A Tactile Display for Supporting Tourists on a Bicycle Trip. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services (Bonn, Germany) (MobileHCI ’09). Association for Computing Machinery, New York, NY, USA, Article 41, 4 pages. https://doi.org/10.1145/1613858.1613911",
      "doi": "10.1145/1613858.1613911"
    },
    {
      "text": "John Pucher and Ralph Buehler. 2012. City cycling. MIT Press. https://doi.org/10.1080/09654313.2013.798111",
      "doi": ""
    },
    {
      "text": "John Pucher and Ralph Buehler. 2017. Cycling towards a more sustainable transport future. Transport Reviews 37, 6 (2017), 689–694. https://doi.org/10.1080/01441647.2017.1340234",
      "doi": ""
    },
    {
      "text": "Pooya Rahimian, Elizabeth E. O’Neal, Junghum Paul Yon, Luke Franzen, Yuanyuan Jiang, Jodie M. Plumert, and Joseph K. Kearney. 2016. Using a virtual environment to study the impact of sending traffic alerts to texting pedestrians. In 2016 IEEE Virtual Reality (VR). 141–149. https://doi.org/10.1109/VR.2016.7504697",
      "doi": ""
    },
    {
      "text": "Pooya Rahimian, Elizabeth E. O’Neal, Shiwen Zhou, Jodie M. Plumert, and Joseph K. Kearney. 2018. Harnessing Vehicle-to-Pedestrian (V2P) Communication Technology: Sending Traffic Warnings to Texting Pedestrians. Human Factors 60, 6 (2018), 833–843. https://doi.org/10.1177/0018720818781365 PMID: 29920115.",
      "doi": ""
    },
    {
      "text": "Michael Rakauskas, Janet Creaser, Michael Manser, Justin Graving, and Max Donath. 2010. Validation Study–On-Road Evaluation of the Cooperative Intersection Collision Avoidance System–Stop Sign Assist Sign: CICAS-SSA Report# 5. (2010).",
      "doi": ""
    },
    {
      "text": "A. Riener, K. Zia, A. Ferscha, C. Ruiz Beltran, and J. J. Minguez Rubio. 2013. Traffic Flow Harmonization in Expressway Merging. Personal Ubiquitous Comput. 17, 3 (March 2013), 519–532. https://doi.org/10.1007/s00779-012-0505-6",
      "doi": "10.1007/s00779-012-0505-6"
    },
    {
      "text": "Sarah Schmidt and Berthold Faerber. 2009. Pedestrians at the kerb–Recognising the action intentions of humans. Transportation research part F: traffic psychology and behaviour 12, 4(2009), 300–310. https://doi.org/10.1016/j.trf.2009.02.003",
      "doi": ""
    },
    {
      "text": "Eldon Schoop, James Smith, and Bjoern Hartmann. 2018. HindSight: Enhancing Spatial Awareness by Sonifying Detected Objects in Real-Time 360-Degree Video. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173717",
      "doi": "10.1145/3173574.3173717"
    },
    {
      "text": "Paul Schroeder and Melanie Wilbur. 2013. 2012 National Survey of Bicyclist and Pedestrian Attitudes and Behavior. Volume 1: Summary Report. Technical Report.",
      "doi": ""
    },
    {
      "text": "Agnieszka Stelling-Kończak, Marjan Hagenzieker, and Bert Van Wee. 2015. Traffic Sounds and Cycling Safety: The Use of Electronic Devices by Cyclists and the Quietness of Hybrid and Electric Cars. Transport Reviews 35, 4 (2015), 422–444. https://doi.org/10.1080/01441647.2015.1017750",
      "doi": ""
    },
    {
      "text": "Haska Steltenpohl and Anders Bouwer. 2013. Vibrobelt: Tactile Navigation Support for Cyclists. In Proceedings of the 2013 International Conference on Intelligent User Interfaces (Santa Monica, California, USA) (IUI ’13). Association for Computing Machinery, New York, NY, USA, 417–426. https://doi.org/10.1145/2449396.2449450",
      "doi": "10.1145/2449396.2449450"
    },
    {
      "text": "Arenda F. te Velde, John van der Kamp, José A. Barela, and Geert J.P. Savelsbergh. 2005. Visual timing and adaptive behavior in a road-crossing simulation study. Accident Analysis & Prevention 37, 3 (2005), 399–406. https://doi.org/10.1016/j.aap.2004.12.002",
      "doi": ""
    },
    {
      "text": "Tamara von Sawitzky, Philipp Wintersberger, Andreas Löcken, Anna-Katharina Frison, and Andreas Riener. 2020. Augmentation Concepts with HUDs for Cyclists to Improve Road Safety in Shared Spaces. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3334480.3383022",
      "doi": "10.1145/3334480.3383022"
    },
    {
      "text": "András Várhelyi. 1998. Drivers’ speed behaviour at a zebra crossing: a case study. Accident Analysis & Prevention 30, 6 (1998), 731–743. https://doi.org/10.1016/S0001-4575(98)00026-8",
      "doi": ""
    },
    {
      "text": "Veronica U. Weser, Joel Hesch, Johnny Lee, and Dennis R. Proffitt. 2016. User Sensitivity to Speed- and Height-Mismatch in VR. In Proceedings of the ACM Symposium on Applied Perception (Anaheim, California) (SAP ’16). Association for Computing Machinery, New York, NY, USA, 143. https://doi.org/10.1145/2931002.2947701",
      "doi": "10.1145/2931002.2947701"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 143–146. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Paweł W. Woźniak, Lex Dekker, Francisco Kiss, Ella Velner, Andrea Kuijt, and Stella F. Donker. 2020. Brotate and Tribike: Designing Smartphone Control for Cycling. In 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services (Oldenburg, Germany) (MobileHCI ’20). Association for Computing Machinery, New York, NY, USA, Article 23, 12 pages. https://doi.org/10.1145/3379503.3405660",
      "doi": "10.1145/3379503.3405660"
    },
    {
      "text": "Matthias Wunsch and Geraldine Fitzpatrick. 2021. Complex Contexts and Subtle Actions: Design and Evaluation of a Virtual Coach for Utilitarian Cycling. In Human-Computer-Interaction – INTERACT 2021, Carmelo Ardito, Rosa Lanzilotti, Alessio Malizia, Helen Petrie, Antonio Piccinno, Giuseppe Desolda, and Kori Inkpen (Eds.). Springer International Publishing, Cham, 125–146. https://doi.org/10.1007/978-3-030-85607-6_9",
      "doi": "10.1007/978-3-030-85607-6_9"
    },
    {
      "text": "Stefanie Zollmann, Raphael Grasset, Gerhard Reitmayr, and Tobias Langlotz. 2014. Image-Based X-Ray Visualization Techniques for Spatial Understanding in Outdoor Augmented Reality. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: The Future of Design (Sydney, New South Wales, Australia) (OzCHI ’14). Association for Computing Machinery, New York, NY, USA, 194–203. https://doi.org/10.1145/2686612.2686642",
      "doi": "10.1145/2686612.2686642"
    }
  ]
}