{
  "doi": "10.1145/3491102.3501865",
  "title": "Captivate! Contextual Language Guidance for Parent–Child Interaction",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "To acquire language, children need rich language input. However, many parents find it difficult to provide children with sufficient language input, which risks delaying their language development. To aid these parents, we design Captivate!, the first system that provides contextual language guidance to parents during play. Our system tracks both visual and spoken language cues to infer targets of joint attention, enabling the real-time suggestion of situation-relevant phrases for the parent. We design our system through a user-centered process with immigrant families—a highly vulnerable yet understudied population—as well as professional speech language therapists. Next, we evaluate Captivate! on parents with children aged 1–3 to observe improvements in responsive language use. We share insights into developing contextual guidance technology for linguistically diverse families1.",
  "tags": [
    "parent–child interaction",
    "cultural diversity",
    "language acquisition",
    "context-aware systems",
    "early childhood"
  ],
  "authors": [
    {
      "name": "Taeahn Kwon",
      "institution": "Computer Science Department, Columbia University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239177",
      "orcid": "0000-0003-0847-8415"
    },
    {
      "name": "Minkyung Jeong",
      "institution": "Department of Computer Science and Engineering, Seoul National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233334",
      "orcid": "missing"
    },
    {
      "name": "Eon-Suk Ko",
      "institution": "Department of English Language and Literature, Chosun University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238188",
      "orcid": "missing"
    },
    {
      "name": "Youngki Lee",
      "institution": "Department of Computer Science and Engineering, Seoul National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416599138",
      "orcid": "0000-0002-1319-7071"
    }
  ],
  "references": [
    {
      "text": "Melissa Baralt, Ashley Darcy Mahoney, and Natalie Brito. 2020. Háblame Bebé: A phone application intervention to support Hispanic children’s early language environments and bilingualism. Child Language Teaching and Therapy 36, 1 (2020), 33–57. https://doi.org/10.1177/0265659020903779",
      "doi": ""
    },
    {
      "text": "Amy Becklenberg, Kimberly A. Hires, Ashley Darcy Mahoney, Melissa Baralt, and Jennifer L. Stapel-Wax. 2021. A Training to Promote Early Language Interactions Among Refugee Mothers Who Are Speakers of Languages Other Than English. Journal of Cultural Diversity 28, 2 (2021), 48 – 55.",
      "doi": ""
    },
    {
      "text": "Katarina Begus, Teodora Gliga, and Victoria Southgate. 2014. Infants Learn What They Want to Learn: Responding to Infant Pointing Leads to Superior Learning. PLOS ONE 9, 10 (2014), 1–4. https://doi.org/10.1371/journal.pone.0108817",
      "doi": ""
    },
    {
      "text": "Elina Birmingham and Alan Kingstone. 2009. Human social attention. Progress in Brain Research 176 (2009), 309–320. https://doi.org/10.1016/s0079-6123(09)17618-5",
      "doi": ""
    },
    {
      "text": "Roger Brown. 1958. Words and Things.Free Press.",
      "doi": ""
    },
    {
      "text": "Margaret Burchinal, Lynne Vernon-Feagans, Martha Cox, and Key Family Life Project Investigators. 2008. Cumulative Social Risk, Parenting, and Infant Development in Rural Low-Income Communities. Parenting 8, 1 (2008), 41–69. https://doi.org/10.1080/15295190701830672",
      "doi": ""
    },
    {
      "text": "Bonnie W. Camp, Maureen Cunningham, and Stephen Berman. 2010. Relationship Between the Cognitive Environment and Vocabulary Development During the Second Year of Life. Archives of Pediatrics & Adolescent Medicine 164, 10 (10 2010), 950–956. https://doi.org/10.1001/archpediatrics.2010.169",
      "doi": ""
    },
    {
      "text": "Erica A. Cartmill, Benjamin F. Armstrong, Lila R. Gleitman, Susan Goldin-Meadow, Tamara N. Medina, and John C. Trueswell. 2013. Quality of early parent input predicts child vocabulary 3 years later. Proceedings of the National Academy of Sciences 110, 28(2013), 11278–11283. https://doi.org/10.1073/pnas.1309518110",
      "doi": ""
    },
    {
      "text": "Hyun Jin Chang, Hee Sook Jeon, Myungsun Shin, and Hyo Jung Kim. 2013. A Study on Selection of Basic Vocabulary for Infants and Toddlers. Journal of Speech-Language & Hearing Disorders 22, 3 (2013), 169–187. https://doi.org/10.15724/jslhd.2013.22.3.010",
      "doi": ""
    },
    {
      "text": "Eun Jung Choi, Sang-Im Jung, Dongsun Yim, and Young Tae Kim. 2019. A Needs Analysis of Mothers from Multicultural Family for Child Language Development Screening Tests: Using Focus Group Interview. Communication Sciences & Disorders 24, 3 (2019), 565–565. https://doi.org/10.12963/csd.19607",
      "doi": ""
    },
    {
      "text": "Eunji Chong, Yongxin Wang, Nataniel Ruiz, and James M. Rehg. 2020. Detecting Attended Visual Targets in Video. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR).",
      "doi": ""
    },
    {
      "text": "Alejandrina Cristia, Marvin Lavechin, Camila Scaff, Melanie Soderstrom, Caroline Rowland, Okko Räsänen, John Bunce, and Elika Bergelson. 2021. A thorough evaluation of the Language Environment Analysis (LENA) system. Behavior Research Methods 53, 2 (2021), 467–486. https://doi.org/10.3758/s13428-020-01393-5",
      "doi": ""
    },
    {
      "text": "Alejandrina Cristia and Amanda Seidl. 2014. The hyperarticulation hypothesis of infant-directed speech. Journal of Child Language 41, 4 (2014), 913–934. https://doi.org/10.1017/S0305000912000669",
      "doi": ""
    },
    {
      "text": "Jiankang Deng, Jia Guo, Evangelos Ververas, Irene Kotsia, and Stefanos Zafeiriou. 2020. RetinaFace: Single-Shot Multi-Level Face Localisation in the Wild. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR).",
      "doi": ""
    },
    {
      "text": "David K. Dickinson and Michelle V. Porche. 2011. Relation Between Language Experiences in Preschool Classrooms and Children’s Kindergarten and Fourth-Grade Language and Reading Abilities. Child Development 82, 3 (2011), 870–886. https://doi.org/10.1111/j.1467-8624.2011.01576.x",
      "doi": ""
    },
    {
      "text": "Fiona Draxler, Audrey Labrie, Albrecht Schmidt, and Lewis L. Chuang. 2020. Augmented Reality to Enable Users in Learning Case Grammar from Their Real-World Interactions. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). 1–12. https://doi.org/10.1145/3313831.3376537",
      "doi": "10.1145/3313831.3376537"
    },
    {
      "text": "Darren Edge, Elly Searle, Kevin Chiu, Jing Zhao, and James A. Landay. 2011. MicroMandarin: Mobile Language Learning in Context. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). 3169–3178. https://doi.org/10.1145/1978942.1979413",
      "doi": "10.1145/1978942.1979413"
    },
    {
      "text": "Leila Fiester. 2010. Early Warning! Why Reading by the End of Third Grade Matters. KIDS COUNT Special Report.Annie E. Casey Foundation(2010). https://eric.ed.gov/?id=ED509795",
      "doi": ""
    },
    {
      "text": "Victoria Fromkin, Robert Rodman, and Nina Hyams. 2018. An Introduction to Language. Cengage Learning.",
      "doi": ""
    },
    {
      "text": "Jill Gilkerson and Jeffrey A. Richards. 2009. The Power of Talk. Technical Report. LENA Research Foundation. https://www.lena.org/wp-content/uploads/2016/07/LTR-01-2_PowerOfTalk.pdf",
      "doi": ""
    },
    {
      "text": "Jill Gilkerson, Jeffrey A. Richards, Steven F. Warren, Judith K. Montgomery, Charles R. Greenwood, D. Kimbrough Oller, John H. L. Hansen, and Terrance D. Paul. 2017. Mapping the Early Language Environment Using All-Day Recordings and Automated Analysis. American Journal of Speech-Language Pathology 26, 2 (2017), 248–265. https://doi.org/10.1044/2016_AJSLP-15-0169",
      "doi": ""
    },
    {
      "text": "Roberta Michnick Golinkoff, Erika Hoff, Meredith L. Rowe, Catherine S. Tamis-LeMonda, and Kathy Hirsh-Pasek. 2019. Language Matters: Denying the Existence of the 30-Million-Word Gap Has Serious Consequences. Child Development 90, 3 (2019), 985–992. https://doi.org/10.1111/cdev.13128",
      "doi": ""
    },
    {
      "text": "Ishaan Grover, Hae Won Park, and Cynthia Breazeal. 2019. A Semantics-Based Model for Predicting Children’s Vocabulary. In Proceedings of the 28th International Joint Conference on Artificial Intelligence(IJCAI’19). 1358–1365. https://doi.org/10.24963/ijcai.2019/188",
      "doi": ""
    },
    {
      "text": "Magnus Haake, Kristina Hansson, Agneta Gulz, Susanne Schötz, and Birgitta Sahlén. 2014. The slower the better? Does the speaker’s speech rate influence children’s performance on a language comprehension test?International Journal of Speech-Language Pathology 16, 2 (2014), 181–190. https://doi.org/10.3109/17549507.2013.845690",
      "doi": ""
    },
    {
      "text": "Eileen Haebig, Andrea McDuffie, and Susan Ellis Weismer. 2013. The Contribution of Two Categories of Parent Verbal Responsiveness to Later Language for Toddlers and Preschoolers on the Autism Spectrum. American Journal of Speech-Language Pathology 22, 1 (2013), 57–70. https://doi.org/10.1044/1058-0360(2012/11-0004)",
      "doi": ""
    },
    {
      "text": "Betty Hart and Todd R Risley. 1995. Meaningful differences in the everyday experience of young American children.Paul H Brookes Publishing.",
      "doi": ""
    },
    {
      "text": "Ari Hautasaari, Takeo Hamada, Kuntaro Ishiyama, and Shogo Fukushima. 2019. VocaBura: A Method for Supporting Second Language Vocabulary Learning While Walking. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 4, Article 135 (Dec 2019), 23 pages. https://doi.org/10.1145/3369824",
      "doi": "10.1145/3369824"
    },
    {
      "text": "Erika Hoff. 2006. How social contexts support and shape language development. Developmental review 26, 1 (2006), 55–88. https://doi.org/10.1016/j.dr.2005.11.002",
      "doi": ""
    },
    {
      "text": "Erika Hoff and Letitia Naigles. 2002. How Children Use Input to Acquire a Lexicon. Child Development 73, 2 (2002), 418–433. https://doi.org/10.1111/1467-8624.00415",
      "doi": ""
    },
    {
      "text": "Bernd Huber, Richard F. Davis, Allison Cotter, Emily Junkin, Mindy Yard, Stuart Shieber, Elizabeth Brestan-Knight, and Krzysztof Z. Gajos. 2019. SpecialTime: Automatically Detecting Dialogue Acts from Speech to Support Parent-Child Interaction Therapy. In Proceedings of the 13th EAI International Conference on Pervasive Computing Technologies for Healthcare(PervasiveHealth’19). 139–148. https://doi.org/10.1145/3329189.3329203",
      "doi": "10.1145/3329189.3329203"
    },
    {
      "text": "Janellen Huttenlocher, Heidi Waterfall, Marina Vasilyeva, Jack Vevea, and Larry V. Hedges. 2010. Sources of variability in children’s language growth. Cognitive Psychology 61, 4 (2010), 343–365. https://doi.org/10.1016/j.cogpsych.2010.08.002",
      "doi": ""
    },
    {
      "text": "Inseok Hwang, Chungkuk Yoo, Chanyou Hwang, Dongsun Yim, Youngki Lee, Chulhong Min, John Kim, and Junehwa Song. 2014. TalkBetter: Family-Driven Mobile Intervention Care for Children with Language Delay. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing(CSCW ’14). 1283–1296. https://doi.org/10.1145/2531602.2531668",
      "doi": "10.1145/2531602.2531668"
    },
    {
      "text": "David Ingram. 1989. First Language Acquisition: Method, Description and Explanation. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Eun-Hee Jeong. 2004. A Study on the Language Development and Environment of Children from Internationally Married Couple Living in an Agricultural Village. Journal of Speech-Language & Hearing Disorders 13, 3 (2004), 33–52.",
      "doi": ""
    },
    {
      "text": "Eunkyung Jo, Hyeonseok Bang, Myeonghan Ryu, Eun Jee Sung, Sungmook Leem, and Hwajung Hong. 2020. MAMAS: Supporting Parent–Child Mealtime Interactions Using Automated Tracking and Speech Recognition. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, CSCW1, Article 066 (May 2020), 32 pages. https://doi.org/10.1145/3392876",
      "doi": "10.1145/3392876"
    },
    {
      "text": "Laura Justice. 2018. Evidence-Based Strategies for Improving Children’s Vocabulary Knowledge.",
      "doi": ""
    },
    {
      "text": "Connie Kasari, Michael Siller, Linh N. Huynh, Wendy Shih, Meghan Swanson, Gerhard S. Hellemann, and Catherine A. Sugar. 2014. Randomized controlled trial of parental responsiveness intervention for toddlers at high risk for autism. Infant Behavior and Development 37, 4 (2014), 711–721. https://doi.org/10.1016/j.infbeh.2014.08.007",
      "doi": ""
    },
    {
      "text": "Wonjung Kim, Seungchul Lee, Seonghoon Kim, Sungbin Jo, Chungkuk Yoo, Inseok Hwang, Seungwoo Kang, and Junehwa Song. 2020. Dyadic Mirror: Everyday Second-Person Live-View for Empathetic Reflection upon Parent-Child Interaction. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 3, Article 86 (Sep 2020), 29 pages. https://doi.org/10.1145/3411815",
      "doi": "10.1145/3411815"
    },
    {
      "text": "Allison Koenecke, Andrew Nam, Emily Lake, Joe Nudell, Minnie Quartey, Zion Mengesha, Connor Toups, John R. Rickford, Dan Jurafsky, and Sharad Goel. 2020. Racial disparities in automated speech recognition. Proceedings of the National Academy of Sciences 117, 14(2020), 7684–7689. https://doi.org/10.1073/pnas.1915768117",
      "doi": ""
    },
    {
      "text": "M.-L. Laakso, A.-M. Poikkeus, Johanna Katajamäki, and Paula Lyytinen. 1999. Early intentional communication as a predictor of language development in young toddlers. First Language 19, 56 (1999), 207–231. https://doi.org/10.1177/014272379901905604",
      "doi": ""
    },
    {
      "text": "Wallace E. Lambert. 1974. Culture and Language as Factors in Learning and Education. Cultural Factors in Learning and Education(1974), 91–122. Edited by Francis E. Aboud and Robert D. Meade.",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Lee and Seong-Sook Oh. 2012. The language aspect of the children in multi-cultural families according to the language use of their mother. The Journal of Korea Open Association for Early Childhood Education 17, 4(2012), 177–205.",
      "doi": ""
    },
    {
      "text": "Soo Jung Lee, Ji Cheol Shin, HyangHee Kim, and Wha-Soo Kim. 2008. A Study on Expressive Vocabulary Ability in Multicultural Family Children: Based on K-BNT-C. Journal of Speech-Language & Hearing Disorders 17, 3 (2008), 95–115. https://doi.org/10.15724/jslhd.2008.17.3.007",
      "doi": ""
    },
    {
      "text": "Sangmin-Michelle Lee. 2019. A systematic review of context-aware technology use in foreign language learning. Computer Assisted Language Learning(2019), 1–25. https://doi.org/10.1080/09588221.2019.1688836",
      "doi": ""
    },
    {
      "text": "Janice Light and David Mcnaughton. 2015. Designing AAC Research and Intervention to Improve Outcomes for Individuals with Complex Communication Needs. Augmentative and Alternative Communication 31, 2 (2015), 85–96. https://doi.org/10.3109/07434618.2015.1036458",
      "doi": ""
    },
    {
      "text": "Huei-Mei Liu, Patricia K. Kuhl, and Feng-Ming Tsao. 2003. An association between mothers’ speech clarity and infants’ speech discrimination skills. Developmental Science 6, 3 (2003), F1–F10. https://doi.org/10.1111/1467-7687.00275",
      "doi": ""
    },
    {
      "text": "Andrea A. N. MacLeod, Rabia Sabah Meziane, and Diane Pesco. 2020. Language abilities of children with refugee backgrounds: Insights from case studies. Applied Psycholinguistics 41, 6 (2020), 1329–1349. https://doi.org/10.1017/S0142716420000405",
      "doi": ""
    },
    {
      "text": "Aziza Y. Mayo and Paul P.M. Leseman. 2008. Off to a good start? Vocabulary development and differences in early family and classroom experiences of children from native-Dutch and immigrant families in the Netherlands. Educational and Child Psychology 25, 3 (2008), 70–83.",
      "doi": ""
    },
    {
      "text": "Margarethe McDonald, Taeahn Kwon, Hyunji Kim, Youngki Lee, and Eon-Suk Ko. 2021. Evaluating the Language ENvironment Analysis System for Korean. Journal of Speech, Language, and Hearing Research 64, 3 (2021), 792–808. https://doi.org/10.1044/2020_JSLHR-20-00489",
      "doi": ""
    },
    {
      "text": "Michelle L. McGillion, Jane S. Herbert, Julian M. Pine, Tamar Keren-Portnoy, Marilyn M. Vihman, and Danielle E. Matthews. 2013. Supporting Early Vocabulary Development: What Sort of Responsiveness Matters?IEEE Transactions on Autonomous Mental Development 5, 3(2013), 240–248. https://doi.org/10.1109/TAMD.2013.2275949",
      "doi": ""
    },
    {
      "text": "Emily C. Merz, Elaine A. Maskus, Samantha A. Melvin, Xiaofu He, and Kimberly G. Noble. 2020. Socioeconomic Disparities in Language Input Are Associated With Children’s Language-Related Brain Structure and Reading Skills. Child Development 91, 3 (2020), 846–860. https://doi.org/10.1111/cdev.13239",
      "doi": ""
    },
    {
      "text": "Chris Moore and Philip J. Dunham. 2014. Joint Attention: Its Origins and Role in Development. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Pamela Nicely, Catherine S. Tamis-LeMonda, and Marc H. Bornstein. 1999. Mothers’ attuned responses to infant affect expressivity promote earlier achievement of language milestones. Infant Behavior and Development 22, 4 (1999), 557–568. https://doi.org/10.1016/S0163-6383(00)00023-0",
      "doi": ""
    },
    {
      "text": "Republic of Korea Ministry of Gender Equality and Family. 2018. National Survey of Multicultural Families. http://www.mogef.go.kr/mp/pcd/mp_pcd_s001d.do?mid=plc503&bbtSn=704820",
      "doi": ""
    },
    {
      "text": "Republic of Korea Ministry of Interiorand Saftey. 2020. Survey of foreign residents in Korea. https://kosis.kr/statHtml/statHtml.do?orgId=110&tblId=DT_110025_A041_A&conn_path=I2 Data retrieved from KOSIS.",
      "doi": ""
    },
    {
      "text": "So Jung Oh, Young Tae Kim, and Young Ran Kim. 2009. Preliminary Study on Language Characteristics and Related Family Factors in Children from Multicultural Family. Special Education Research 8, 1 (2009), 137–161. https://doi.org/10.18541/ser.2009.04.8.1.137",
      "doi": ""
    },
    {
      "text": "D. K. Oller, P. Niyogi, S. Gray, J. A. Richards, J. Gilkerson, D. Xu, U. Yapanel, and S. F. Warren. 2010. Automated vocal analysis of naturalistic recordings from children with autism, language delay, and typical development. Proceedings of the National Academy of Sciences 107, 30(2010), 13354–13359. https://doi.org/10.1073/pnas.1003882107",
      "doi": ""
    },
    {
      "text": "Barbara Alexander Pan, Meredith L. Rowe, Judith D. Singer, and Catherine E. Snow. 2005. Maternal Correlates of Growth in Toddler Vocabulary Production in Low-Income Families. Child Development 76, 4 (2005), 763–782. https://doi.org/10.1111/1467-8624.00498-i1",
      "doi": ""
    },
    {
      "text": "Laura Pina, Kael Rowan, Asta Roseway, Paul Johns, Gillian R. Hayes, and Mary Czerwinski. 2014. In Situ Cues for ADHD Parenting Strategies Using Mobile Technology. In Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare(PervasiveHealth ’14). 17–24. https://doi.org/10.4108/icst.pervasivehealth.2014.254958",
      "doi": "10.4108/icst.pervasivehealth.2014.254958"
    },
    {
      "text": "Sheena Reilly, Patricia Eadie, Edith L Bavin, Melissa Wake, Margot Prior, Joanne Williams, Lesley Bretherton, Yin Barrett, and Obioha C Ukoumunne. 2006. Growth of infant communication between 8 and 12 months: A population study. Journal of Paediatrics and Child Health 42, 12 (2006), 764–770. https://doi.org/10.1111/j.1440-1754.2006.00974.x",
      "doi": ""
    },
    {
      "text": "Shaoqing Ren, Kaiming He, Ross Girshick, and Jian Sun. 2015. Faster R-CNN: Towards Real-Time Object Detection with Region Proposal Networks. In Advances in Neural Information Processing Systems(NeurIPS’15, Vol. 28).",
      "doi": ""
    },
    {
      "text": "Megan Y. Roberts and Ann P. Kaiser. 2011. The Effectiveness of Parent-Implemented Language Interventions: A Meta-Analysis. American Journal of Speech-Language Pathology 20, 3 (2011), 180–199. https://doi.org/10.1044/1058-0360(2011/10-0055)",
      "doi": ""
    },
    {
      "text": "Pamela Rosenthal Rollins. 2003. Caregivers’ contingent comments to 9-month-old infants: Relationships with later language. Applied Psycholinguistics 24, 2 (2003), 221–234. https://doi.org/10.1017/S0142716403000110",
      "doi": ""
    },
    {
      "text": "Rachel R. Romeo, Julia A. Leonard, Sydney T. Robinson, Martin R. West, Allyson P. Mackey, Meredith L. Rowe, and John D. E. Gabrieli. 2018. Beyond the 30-Million-Word Gap: Children’s Conversational Exposure Is Associated With Language-Related Brain Function. Psychological science 29, 5 (2018), 700–710. https://doi.org/10.1177/0956797617742725",
      "doi": ""
    },
    {
      "text": "Rachel R. Romeo, Joshua Segaran, Julia A. Leonard, Sydney T. Robinson, Martin R. West, Allyson P. Mackey, Anastasia Yendiki, Meredith L. Rowe, and John D.E. Gabrieli. 2018. Language Exposure Relates to Structural Neural Connectivity in Childhood. Journal of Neuroscience 38, 36 (2018), 7870–7877. https://doi.org/10.1523/JNEUROSCI.0484-18.2018",
      "doi": ""
    },
    {
      "text": "Meredith L. Rowe. 2008. Child-directed speech: relation to socioeconomic status, knowledge of child development and child vocabulary skill. Journal of Child Language 35, 1 (2008), 185–205. https://doi.org/10.1017/S0305000907008343",
      "doi": ""
    },
    {
      "text": "Meredith L. Rowe. 2012. A Longitudinal Investigation of the Role of Quantity and Quality of Child-Directed Speech in Vocabulary Development. Child Development 83, 5 (2012), 1762–1774. https://doi.org/10.1111/j.1467-8624.2012.01805.x",
      "doi": ""
    },
    {
      "text": "Alia Salam, Russell K. McIntire, and Lucille B. Pilling. 2019. Communication disorders among Syrian refugee children in Beqaa, Lebanon. International Journal of Migration, Health and Social Care (2019). https://doi.org/10.1108/IJMHSC-09-2018-0059",
      "doi": ""
    },
    {
      "text": "Laura A. Shneidman, Michelle E. Arroyo, Susan C. Levine, and Susan Goldin-Meadow. 2013. What counts as effective input for word learning?Journal of Child Language 40, 3 (2013), 672–686. https://doi.org/10.1017/S0305000912000141",
      "doi": ""
    },
    {
      "text": "Seokwoo Song, Seungho Kim, John Kim, Wonjeong Park, and Dongsun Yim. 2016. TalkLIME: Mobile System Intervention to Improve Parent-Child Interaction for Children with Language Delay. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’16). 304–315. https://doi.org/10.1145/2971648.2971650",
      "doi": "10.1145/2971648.2971650"
    },
    {
      "text": "Tobias Sonne, Jörg Müller, Paul Marshall, Carsten Obel, and Kaj Grønbæk. 2016. Changing Family Practices with Assistive Technology: MOBERO Improves Morning and Bedtime Routines for Children with ADHD. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). 152–164. https://doi.org/10.1145/2858036.2858157",
      "doi": "10.1145/2858036.2858157"
    },
    {
      "text": "Keith Topping, Rayenne Dekhinet, and Suzanne Zeedyk. 2013. Parent–infant interaction and children’s language development. Educational Psychology 33, 4 (2013), 391–426. https://doi.org/10.1080/01443410.2012.744159",
      "doi": ""
    },
    {
      "text": "Steven F. Warren, Nancy Brady, Audra Sterling, Kandace Fleming, and Janet Marquis. 2010. Maternal Responsivity Predicts Language Development in Young Children With Fragile X Syndrome. American Journal on Intellectual and Developmental Disabilities 115, 1(2010), 54–75. https://doi.org/10.1352/1944-7558-115.1.54",
      "doi": ""
    },
    {
      "text": "Adriana Weisleder and Anne Fernald. 2013. Talking to Children Matters: Early Language Experience Strengthens Processing and Builds Vocabulary. Psychological Science 24, 11 (2013), 2143–2152. https://doi.org/10.1177/0956797613488145",
      "doi": ""
    },
    {
      "text": "Kenneth Wong, Crystal Thomas, and Megan Boben. 2020. Providence talks: A citywide partnership to address early childhood language development. Studies in Educational Evaluation 64 (2020), 100818. https://doi.org/10.1016/j.stueduc.2019.100818",
      "doi": ""
    },
    {
      "text": "Lauren Head Zauche, Taylor A. Thul, Ashley E. Darcy Mahoney, and Jennifer L. Stapel-Wax. 2016. Influence of language nutrition on children’s language and cognitive development: An integrated review. Early Childhood Research Quarterly 36 (2016), 318–333. https://doi.org/10.1016/j.ecresq.2016.01.015",
      "doi": ""
    }
  ]
}