{
  "doi": "10.1145/3491102.3517659",
  "title": "A Personalized Visual Aid for Selections of Appearance Building Products with Long-term Effects",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "It is challenging for customers to select appearance building products (e.g., skincare products, weight loss programs) that suit them personally as such products usually demonstrate efficacy only after long-term usage. Although e-retailers generally provide product descriptions or other customers’ reviews, users often find it hard to relate to their own situations. In this work, we proposed a pipeline to display envisioned users’ appearance after long-term use of appearance building products to deliver their efficacy on each individual visually. We selected skincare as a case and developed SkincareMirror which predicts skincare effects on users’ facial images by analyzing product function labels, efficacy ratings, and skin models’ images. The results of a between-subjects study (N=48) show that (1) SkincareMirror outperforms the baseline shopping site in terms of perceived usability, usefulness, user satisfaction and helps users select products faster; (2) SkincareMirror is especially effective to males and users with limited product domain knowledge.",
  "authors": [
    {
      "name": "Chuhan Shi",
      "institution": "Hong Kong University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659547865",
      "orcid": "0000-0002-3370-1626"
    },
    {
      "name": "Zhihan Jiang",
      "institution": "Electrical and Electronic Engineering, The University of Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239635",
      "orcid": "missing"
    },
    {
      "name": "Xiaojuan Ma",
      "institution": "Hong Kong University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654594",
      "orcid": "0000-0002-9847-7784"
    },
    {
      "name": "Qiong Luo",
      "institution": "Department of Computer Science and Engineering, Hong Kong University of Science and Technology, China",
      "img": "/do/10.1145/contrib-81339515235/rel-imgonly/edited_5968.jpg",
      "acmid": "81339515235",
      "orcid": "0000-0002-2861-9492"
    }
  ],
  "references": [
    {
      "text": "I Bartenjev, L Oremović, M Rogl Butina, I Sjerobabski Masnec, A Bouloc, K Voda, and M Šitum. 2011. Topical effectiveness of a cosmetic skincare treatment for acne-prone skin: a clinical study. Acta Dermatoven APA 20, 2 (2011).",
      "doi": ""
    },
    {
      "text": "Shlomo Berkovsky and Jill Freyne. 2015. Web personalization and recommender systems. In Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. 2307–2308.",
      "doi": "10.1145/2783258.2789995"
    },
    {
      "text": "Carlos Flavián Blanco, Raquel Gurrea Sarasa, and Carlos Orús Sanclemente. 2010. Effects of visual and textual information in online product presentations: looking for the best combination in website design. European Journal of information systems 19, 6 (2010), 668–686.",
      "doi": ""
    },
    {
      "text": "Ivaylo Boyadzhiev, Kavita Bala, Sylvain Paris, and Edward Adelson. 2015. Band-sifting decomposition for image-based material editing. ACM Transactions on Graphics (TOG) 34, 5 (2015), 1–16.",
      "doi": "10.1145/2809796"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Evert Van den Broeck, Karolien Poels, and Michel Walrave. 2017. A factorial survey study on the influence of advertising place and the use of personal data on user acceptance of Facebook ads. American behavioral scientist 61, 7 (2017), 653–671.",
      "doi": ""
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender shades: Intersectional accuracy disparities in commercial gender classification. In Conference on fairness, accountability and transparency. PMLR, 77–91.",
      "doi": ""
    },
    {
      "text": "Scot Burton, Richard G Netemeyer, and Donald R Lichtenstein. 1995. Gender differences for appearance-related attitudes and behaviors: Implications for consumer welfare. Journal of Public Policy & Marketing 14, 1 (1995), 60–75.",
      "doi": ""
    },
    {
      "text": "C2H4. 2017. You are so beautiful today.Retrieved August 17, 2020 from http://c2h4.org",
      "doi": ""
    },
    {
      "text": "Chih-Wei Chen, Da-Yuan Huang, and Chiou-Shann Fuh. 2009. Automatic skin color beautification. In International Conference on Arts and Technology. Springer, 157–164.",
      "doi": ""
    },
    {
      "text": "Jen-Yi Chen. 2013. Advertisements of skin care products in Taiwan. Mass Communicator: International Journal of Communication Studies 7, 4(2013), 19–25.",
      "doi": ""
    },
    {
      "text": "Yu-Chen Chen, Rong-An Shang, and Chen-Yu Kao. 2009. The effects of information overload on consumers’ subjective state towards buying decision in the internet shopping environment. Electronic Commerce Research and Applications 8, 1(2009), 48–58.",
      "doi": "10.1016/j.elerap.2008.09.001"
    },
    {
      "text": "Yi-Fen Chen and Hui-Fen Lu. 2015. We-commerce: Exploring factors influencing online group-buying intention in T aiwan from a conformity perspective. Asian Journal of Social Psychology 18, 1 (2015), 62–75.",
      "doi": ""
    },
    {
      "text": "Elizabeth Cowley and Andrew A Mitchell. 2003. The moderating effect of product knowledge on the learning and organization of product information. Journal of Consumer Research 30, 3 (2003), 443–454.",
      "doi": ""
    },
    {
      "text": "Filipe Morgado Simoes de Campos and Carlos H Morimoto. 2014. Virtual makeup: Foundation, eye shadow and lipstick simulation. In 2014 XVI Symposium on Virtual and Augmented Reality. IEEE, 181–189.",
      "doi": "10.1109/SVR.2014.32"
    },
    {
      "text": "DEM Dharshan and Japa Asritha Reddy. 2019. A Study of Customer Behaviour towards Online Shopping in Hyderabad. International Journal of trend in scientific research and development 3 (2019), 741–744.",
      "doi": ""
    },
    {
      "text": "Jun Ehara and Hideo Saito. 2006. Texture overlay for virtual clothing based on PCA of silhouettes. In 2006 IEEE/ACM International Symposium on Mixed and Augmented Reality. Citeseer, 139–142.",
      "doi": "10.1109/ISMAR.2006.297805"
    },
    {
      "text": "Yuri Fitrian, Miftachul Huda, Adibah Muhtar, Azhar Yaakub Arifin, Norhafizah Musa, Kamarul Shukri Mat Teh, Novita Mulya Sari, and Andino Maseleno. 2019. Application design for determining suitable cosmetics with the facial skin type using fuzzy logic approach. Journal of Computational and Theoretical Nanoscience 16, 5-6(2019), 2153–2158.",
      "doi": ""
    },
    {
      "text": "Sanjay Ghosh, Ruturaj G Gavaskar, Debasisha Panda, and Kunal N Chaudhury. 2019. Fast Scale-Adaptive Bilateral Texture Smoothing. IEEE Transactions on Circuits and Systems for Video Technology (2019).",
      "doi": "10.1109/TCSVT.2019.2916589"
    },
    {
      "text": "Ian J Goodfellow, Jean Pouget-Abadie, Mehdi Mirza, Bing Xu, David Warde-Farley, Sherjil Ozair, Aaron Courville, and Yoshua Bengio. 2014. Generative adversarial networks. arXiv preprint arXiv:1406.2661(2014).",
      "doi": ""
    },
    {
      "text": "Peng Guan, Loretta Reiss, David A Hirshberg, Alexander Weiss, and Michael J Black. 2012. Drape: Dressing any person. ACM Transactions on Graphics (TOG) 31, 4 (2012), 1–10.",
      "doi": "10.1145/2185520.2185531"
    },
    {
      "text": "Xintong Han, Xiaojun Hu, Weilin Huang, and Matthew R Scott. 2019. Clothflow: A flow-based model for clothed person generation. In Proceedings of the IEEE/CVF International Conference on Computer Vision. 10471–10480.",
      "doi": ""
    },
    {
      "text": "Xintong Han, Zuxuan Wu, Zhe Wu, Ruichi Yu, and Larry S Davis. 2018. Viton: An image-based virtual try-on network. In Proceedings of the IEEE conference on computer vision and pattern recognition. 7543–7552.",
      "doi": ""
    },
    {
      "text": "Lee Hao Suan Samuel, MS Balaji, and Khong Kok Wei. 2015. An investigation of online shopping experience on trust and behavioral intentions. Journal of Internet Commerce 14, 2 (2015), 233–254.",
      "doi": ""
    },
    {
      "text": "Anna Hilsmann and Peter Eisert. 2009. Tracking and retexturing cloth for real-time virtual clothing applications. In International Conference on Computer Vision/Computer Graphics Collaboration Techniques and Applications. Springer, 94–105.",
      "doi": "10.1007/978-3-642-01811-4_9"
    },
    {
      "text": "Wen Huang. 2020. Investigating the novelty effect in virtual reality on stem learning. Ph.D. Dissertation. Arizona State University.",
      "doi": ""
    },
    {
      "text": "Sibt Ul Hussain, Thibault Napoléon, and Fréderic Jurie. 2012. Face recognition using local quantized patterns.",
      "doi": ""
    },
    {
      "text": "Surgan Jandial, Ayush Chopra, Kumar Ayush, Mayur Hemani, Balaji Krishnamurthy, and Abhijeet Halwai. 2020. Sievenet: A unified framework for robust image-based virtual try-on. In Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision. 2182–2190.",
      "doi": ""
    },
    {
      "text": "Sirrka L Jarvenpaa and Peter A Todd. 1996. Consumer reactions to electronic shopping on the World Wide Web. International Journal of electronic commerce 1, 2 (1996), 59–88.",
      "doi": "10.1080/10864415.1996.11518283"
    },
    {
      "text": "Ana Javornik, Yvonne Rogers, Ana Maria Moutinho, and Russell Freeman. 2016. Revealing the shopper experience of using a” magic mirror” augmented reality make-up application. In Conference on designing interactive systems, Vol. 2016. Association for Computing Machinery (ACM), 871–882.",
      "doi": "10.1145/2901790.2901881"
    },
    {
      "text": "Thomas J Johnson and Barbara K Kaye. 2004. Wag the blog: How reliance on traditional media and the Internet influence credibility perceptions of weblogs among blog users. Journalism & mass communication quarterly 81, 3 (2004), 622–642.",
      "doi": ""
    },
    {
      "text": "Jaehee Jung and Seung-Hee Lee. 2006. Cross-cultural comparisons of appearance self-schema, body image, self-esteem, and dieting behavior between Korean and US women. Family and Consumer Sciences Research Journal 34, 4 (2006), 350–365.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman and Amos Tversky. 2013. Prospect theory: An analysis of decision under risk. In Handbook of the fundamentals of financial decision making: Part I. World Scientific, 99–127.",
      "doi": ""
    },
    {
      "text": "Mai Ngoc Khuong and Hoang Thi My Duyen. 2016. Personal factors affecting consumer purchase decision towards men skin care products—A study in Ho Chi Minh City, Vietnam. International Journal of Trade, Economics and Finance 7, 2 (2016), 44–50.",
      "doi": ""
    },
    {
      "text": "Jiyeon Kim and Sandra Forsythe. 2008. Adoption of virtual try-on technology for online apparel shopping. Journal of Interactive Marketing 22, 2 (2008), 45–59.",
      "doi": ""
    },
    {
      "text": "Gyeongeun Lee. [n.d.]. A Content-based Skincare Product Recommendation System. ([n. d.]).",
      "doi": ""
    },
    {
      "text": "Tingting Li, Ruihe Qian, Chao Dong, Si Liu, Qiong Yan, Wenwu Zhu, and Liang Lin. 2018. Beautygan: Instance-level facial makeup transfer with deep generative adversarial network. In Proceedings of the 26th ACM international conference on Multimedia. 645–653.",
      "doi": "10.1145/3240508.3240618"
    },
    {
      "text": "Xiaolin Lin, Mauricio Featherman, Stoney L Brooks, and Nick Hajli. 2019. Exploring gender differences in online consumer purchase decision making: An online product presentation perspective. Information Systems Frontiers 21, 5 (2019), 1187–1201.",
      "doi": "10.1007/s10796-018-9831-1"
    },
    {
      "text": "Guoqiang Liu, Dan Song, Ruofeng Tong, and Min Tang. 2021. Toward Realistic Virtual Try-on Through Landmark-Guided Shape Matching. (2021).",
      "doi": ""
    },
    {
      "text": "Si Liu, Xinyu Ou, Ruihe Qian, Wei Wang, and Xiaochun Cao. 2016. Makeup like a Superstar: Deep Localized Makeup Transfer Network. In Proceedings of the Twenty-Fifth International Joint Conference on Artificial Intelligence (New York, New York, USA) (IJCAI’16). AAAI Press, 2568–2575.",
      "doi": ""
    },
    {
      "text": "Elizabeth T Makino, Lily I Jiang, Priscilla Tan, Tsing Cheng, and Rahul C Mehta. 2018. Addressing male facial skin concerns: clinical efficacy of a topical skincare treatment product for men.Journal of drugs in dermatology: JDD 17, 3 (2018), 301–306.",
      "doi": ""
    },
    {
      "text": "Miguel Malheiros, Charlene Jennett, Snehalee Patel, Sacha Brostoff, and Martina Angela Sasse. 2012. Too close for comfort: A study of the effectiveness and acceptability of rich-media personalized advertising. In Proceedings of the SIGCHI conference on human factors in computing systems. 579–588.",
      "doi": "10.1145/2207676.2207758"
    },
    {
      "text": "Aleksandar Matic, Martin Pielot, and Nuria Oliver. 2017. ” OMG! How did it know that?” Reactions to Highly-Personalized Ads. In Adjunct Publication of the 25th Conference on User Modeling, Adaptation and Personalization. 41–46.",
      "doi": "10.1145/3099023.3101411"
    },
    {
      "text": "Yuki Matsunami, Mayumi Ueda, and Shinsuke Nakajima. 2017. Tag recommendation method for a cosmetics review recommender system. In Proceedings of the 19th International Conference on Information Integration and Web-based Applications & Services. 166–170.",
      "doi": "10.1145/3151759.3151832"
    },
    {
      "text": "Meitu. 2015. Meitu AI Open Platform Skin Analysis.Retrieved August 23, 2020 from https://ai.meitu.com",
      "doi": ""
    },
    {
      "text": "Fiona Monro and Gail Huon. 2005. Media-portrayed idealized images, body shame, and appearance anxiety. International Journal of Eating Disorders 38, 1 (2005), 85–90.",
      "doi": ""
    },
    {
      "text": "Amy Muise and Serge Desmarais. 2010. Women’s perceptions and use of “anti-aging” products. Sex Roles 63, 1-2 (2010), 126–137.",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu, Ronald Baecker, Gerald Penn, Elaine Toms, and David James. 2006. The effect of speech recognition accuracy rates on the usefulness and usability of webcast archives. In Proceedings of the SIGCHI conference on Human Factors in computing systems. 493–502.",
      "doi": "10.1145/1124772.1124848"
    },
    {
      "text": "Maki Nakagawa, Koji Tsukada, and Itiro Siio. 2010. Remote skincare advice system using life logs. In CHI’10 Extended Abstracts on Human Factors in Computing Systems. 3811–3816.",
      "doi": ""
    },
    {
      "text": "Yoko Nakajima, Hirotoshi Honma, Haruka Aoshima, Tomoyoshi Akiba, and Shigeru Masuyama. 2019. Recommender System Based on User Evaluations and Cosmetic Ingredients. In 2019 4th International Conference on Information Technology (InCIT). IEEE, 22–27.",
      "doi": ""
    },
    {
      "text": "Nurliana Nasution, Bayu Febriadi, Galih Mahalisa, Nadiya Hijriana, Muhammad Rasyidan, Dewinta Marthadinata Sinaga, Sinta Maulina Dewi, Agus Perdana Windarto, Novita Aswan, and Mokhamad Ramdhani Raharjo. 2020. Application of ELECTRE Algorithm in Skincare Product Selection. JPhCS 1471, 1 (2020), 012066.",
      "doi": ""
    },
    {
      "text": "Hieu V Nguyen and Li Bai. 2010. Cosine similarity metric learning for face verification. In Asian conference on computer vision. Springer, 709–720.",
      "doi": ""
    },
    {
      "text": "Zhenhui Peng, Qingyu Guo, Ka Wing Tsang, and Xiaojuan Ma. 2020. Exploring the effects of technological writing assistance for support providers in online mental health community. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376695"
    },
    {
      "text": "Zhenhui Peng, Yunhwan Kwon, Jiaan Lu, Ziming Wu, and Xiaojuan Ma. 2019. Design and evaluation of service robot’s proactivity in decision-making support process. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300328"
    },
    {
      "text": "Pearl Pu, Li Chen, and Rong Hu. 2011. A user-centric evaluation framework for recommender systems. In Proceedings of the fifth ACM conference on Recommender systems. 157–164.",
      "doi": "10.1145/2043932.2043962"
    },
    {
      "text": "Pakawan Pugsee, Patcharaporn Sombatsri, and Rujiporn Juntiwakul. 2017. Satisfactory analysis for cosmetic product review comments. In Proceedings of the 2017 International Conference on Data Mining, Communications and Information Technology. 1–6.",
      "doi": "10.1145/3089871.3089890"
    },
    {
      "text": "Frode Eika Sandnes, Levent Neyse, and Yo-Ping Huang. 2016. Simple and practical skin detection with static RGB-color lookup tables: A visualization-based study. In 2016 IEEE International Conference on Systems, Man, and Cybernetics (SMC). IEEE, 002370–002375.",
      "doi": "10.1109/SMC.2016.7844593"
    },
    {
      "text": "Scott Schaefer, Travis McPhail, and Joe Warren. 2006. Image deformation using moving least squares. In ACM SIGGRAPH 2006 Papers. 533–540.",
      "doi": "10.1145/1179352.1141920"
    },
    {
      "text": "Hanna Schäfer. 2016. Personalized support for healthy nutrition decisions. In Proceedings of the 10th ACM Conference on Recommender Systems. 455–458.",
      "doi": "10.1145/2959100.2959105"
    },
    {
      "text": "P Seebach. 2005. Baby duck syndrome: Imprinting on your first system makes change a very hard thing. IBM DeveloperWorks (2005).",
      "doi": ""
    },
    {
      "text": "Masami SENOO, Yuko TAKEMOTO, and Hideo JINGU. 2002. Change in affections by continuous use of skincare cosmetics. Kansei Engineering International 3, 3 (2002), 31–36.",
      "doi": ""
    },
    {
      "text": "Anne R Smink, Sanne Frowijn, Eva A van Reijmersdal, Guda van Noort, and Peter C Neijens. 2019. Try online before you buy: How does shopping with augmented reality affect brand responses and personal data disclosure. Electronic Commerce Research and Applications 35 (2019), 100854.",
      "doi": "10.1016/j.elerap.2019.100854"
    },
    {
      "text": "Dan Song, Tianbao Li, Zhendong Mao, and An-An Liu. 2020. SP-VITON: shape-preserving image-based virtual try-on network. Multimedia Tools and Applications 79, 45 (2020), 33757–33769.",
      "doi": "10.1007/s11042-019-08363-w"
    },
    {
      "text": "Brendan Spillane, Isla Hoe, Mike Brady, Vincent Wade, and Séamus Lawless. 2020. Tabloidization versus credibility: Short term gain for long term pain. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376388"
    },
    {
      "text": "Sanun Srisuk. 2014. Bilateral filtering as a tool for image smoothing with edge preserving properties. In 2014 International Electrical Engineering Congress (iEECON). IEEE, 1–4.",
      "doi": ""
    },
    {
      "text": "STYLECASTER. 2018. How Long Does It Really Take for Skin-Care Products to Deliver Results?Retrieved Sep 2, 2020 from https://stylecaster.com/beauty/how-long-til-skin-care-products-work/",
      "doi": ""
    },
    {
      "text": "Songsri Tangsripairoj, Kwanchanok Khongson, Pitchapa Puangnak, and Yada Boonserm. 2018. SkinProf: An Android Application for Smart Cosmetic and Skincare Users. In 2018 15th International Joint Conference on Computer Science and Software Engineering (JCSSE). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Carlo Tomasi and Roberto Manduchi. 1998. Bilateral filtering for gray and color images. In Sixth international conference on computer vision (IEEE Cat. No. 98CH36271). IEEE, 839–846.",
      "doi": ""
    },
    {
      "text": "Wai-Shun Tong, Chi-Keung Tang, Michael S Brown, and Ying-Qing Xu. 2007. Example-based cosmetic transfer. In 15th Pacific Conference on Computer Graphics and Applications (PG’07). IEEE, 211–218.",
      "doi": "10.1109/PG.2007.21"
    },
    {
      "text": "TroveSkin. 2017. TroveSkin: A FREE Skincare App for Skin Analysis & Track.Retrieved August 23, 2020 from https://www.troveskin.com",
      "doi": ""
    },
    {
      "text": "April Yi Wang, Dakuo Wang, Jaimie Drozdal, Michael Muller, Soya Park, Justin D Weisz, Xuye Liu, Lingfei Wu, and Casey Dugan. 2021. Themisto: Towards Automated Documentation Generation in Computational Notebooks. arXiv preprint arXiv:2102.12592(2021).",
      "doi": ""
    },
    {
      "text": "Fuxue Wang, Yi Li, and Yiwen Zhang. 2011. An empirical study on the search engine optimization technique and its outcomes. In 2011 2nd International Conference on Artificial Intelligence, Management Science and Electronic Commerce (AIMSEC). IEEE, 2767–2770.",
      "doi": ""
    },
    {
      "text": "Lin Wang, Huijie Tang, Dong Liu, and Caiyan Xing. 2017. Study on Customer Experience Dimension Based on Online Shopping reviews of MI’s Products. In MATEC Web of Conferences, Vol. 100. EDP Sciences, 05024.",
      "doi": ""
    },
    {
      "text": "Xingbo Wang, Haipeng Zeng, Yong Wang, Aoyu Wu, Zhida Sun, Xiaojuan Ma, and Huamin Qu. 2020. VoiceCoach: Interactive Evidence-based Training for Voice Modulation Skills in Public Speaking. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376726"
    },
    {
      "text": "Jeffrey Warshaw, Tara Matthews, Steve Whittaker, Chris Kau, Mateo Bengualid, and Barton A Smith. 2015. Can an Algorithm Know the” Real You”? Understanding People’s Reactions to Hyper-personal Analytics Systems. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 797–806.",
      "doi": "10.1145/2702123.2702274"
    },
    {
      "text": "Stephan Weibelzahl, Alexandros Paramythis, and Judith Masthoff. 2020. Evaluation of adaptive systems. In Proceedings of the 28th ACM Conference on User Modeling, Adaptation and personalization. 394–395.",
      "doi": "10.1145/3340631.3398668"
    },
    {
      "text": "Shaomei Wu, Lindsay Reynolds, Xian Li, and Francisco Guzmán. 2019. Design and evaluation of a social media writing support tool for people with dyslexia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300746"
    },
    {
      "text": "Meng Xia, Mingfei Sun, Huan Wei, Qing Chen, Yong Wang, Lei Shi, Huamin Qu, and Xiaojuan Ma. 2019. Peerlens: Peer-inspired interactive learning path planning in online question pool. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3290605.3300864"
    },
    {
      "text": "Qinwei Xie and Meng Zhang. 2013. White or tan? A cross-cultural analysis of skin beauty advertisements between China and the United States. Asian Journal of Communication 23, 5 (2013), 538–554.",
      "doi": ""
    },
    {
      "text": "Litao Yan, Elena L Glassman, and Tianyi Zhang. 2021. Visualizing Examples of Deep Neural Networks at Scale. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445654"
    },
    {
      "text": "Han Yang, Ruimao Zhang, Xiaobao Guo, Wei Liu, Wangmeng Zuo, and Ping Luo. 2020. Towards photo-realistic virtual try-on by adaptively generating-preserving image content. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 7850–7859.",
      "doi": ""
    },
    {
      "text": "Liu Yang, Weike Chen, and Lin Xu. 2019. Skin map-aided skin smoothing of images using a bilateral filter. US Patent App. 16/079,308.",
      "doi": ""
    },
    {
      "text": "Qiang Yang, Yang Liu, Yong Cheng, Yan Kang, Tianjian Chen, and Han Yu. 2019. Federated learning. Synthesis Lectures on Artificial Intelligence and Machine Learning 13, 3(2019), 1–207.",
      "doi": ""
    },
    {
      "text": "Manna Zelealem. 2017. Diversity in the Beauty Industry. (2017).",
      "doi": ""
    },
    {
      "text": "Tingting Zhang, Ling Cao, and William YC Wang. 2017. The Impact of Virtual Try-on Image Interaction Technology on Online Shoppers’ Purchase Decision. In Proceedings of the 8th International Conference on E-Education, E-Business, E-Management and E-Learning. 6–10.",
      "doi": "10.1145/3026480.3026484"
    },
    {
      "text": "Tingting Zhang, William Yu Chung Wang, Ling Cao, and Yan Wang. 2019. The role of virtual try-on technology in online purchase decision from consumers’ aspect. Internet Research (2019).",
      "doi": ""
    },
    {
      "text": "Yunfeng Zhang, Rachel KE Bellamy, and Wendy A Kellogg. 2015. Designing information for remediating cognitive biases in decision-making. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 2211–2220.",
      "doi": "10.1145/2702123.2702239"
    }
  ]
}