{
  "doi": "10.1145/3491102.3502103",
  "title": "Exploring the Role of Paradata in Digitally Supported Qualitative Co-Research",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "Academics and community organisations are increasingly adopting co-research practices where participants contribute to qualitative data collection, analysis, and dissemination. These qualitative practices can often lack transparency that can present a problem for stakeholders (such as funding agencies) who seek evidence of the rigour and accountability in these decision-making processes. When qualitative research is done digitally, paradata is available as interaction logs that reveal the underlying processes, such as the time spent engaging with different segments of an interview. In practice, paradata is seldom used to examine the decisions associated with undertaking qualitative research. This paper explores the role of paradata arising from a four-month engagement with a community-led charity that used a digital platform to support their qualitative co-research project. Through observations of platform use and reflective post-deployment interviews, our findings highlight examples of paradata generated through digital tools in qualitative research, e.g., listening coverage, engagement rate, thematic maps and data discards. From this, we contribute a conceptualisation of paradata and discuss its role in qualitative research to improve process transparency, enhance data sharing, and to create feedback loops with research participants.",
  "authors": [
    {
      "name": "Jay Rainey",
      "institution": "Open Lab, Newcastle University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367245",
      "orcid": "missing"
    },
    {
      "name": "Siobhan Macfarlane",
      "institution": "Open Lab, Newcastle University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235901",
      "orcid": "missing"
    },
    {
      "name": "Aare Puussaar",
      "institution": "Northumbria University, United Kingdom",
      "img": "/do/10.1145/contrib-99659160561/rel-imgonly/profile.jpg",
      "acmid": "99659160561",
      "orcid": "missing"
    },
    {
      "name": "Vasilis Vlachokyriakos",
      "institution": "Open Lab, Newcastle University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502803064",
      "orcid": "0000-0001-6038-5959"
    },
    {
      "name": "Roger Burrows",
      "institution": "School of Architecture, Planning and Landscape, Newcastle University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659295677",
      "orcid": "missing"
    },
    {
      "name": "Jan David Smeddinck",
      "institution": "Ludwig Boltzmann Institute for Digital Health and Prevention, Austria",
      "img": "/do/10.1145/contrib-81456638428/rel-imgonly/jan15ls.jpg",
      "acmid": "81456638428",
      "orcid": "missing"
    },
    {
      "name": "Pamela Briggs",
      "institution": "PaCT Lab, Northumbria University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100277550",
      "orcid": "missing"
    },
    {
      "name": "Kyle Montague",
      "institution": "Northumbria University, United Kingdom",
      "img": "/do/10.1145/contrib-81472655898/rel-imgonly/xsmall_profile.jpg",
      "acmid": "81472655898",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Christine Ashby. 2011. Whose “Voice” is it Anyway?: Giving Voice and Qualitative Research Involving Individuals that Type to Communicate. Disability Studies Quarterly 31 (2011), 55–66. http://dsq-sds.org/article/view/1723/1771",
      "doi": ""
    },
    {
      "text": "Louise Barkhuus and Barry Brown. 2011. TagPad for iPad – Designing a Support Tool for Interview Studies. In The Eleventh Danish Human Computer Interaction Research Symposium. Copenhagen Business School, Copenhagen, Denmark, 49–52.",
      "doi": ""
    },
    {
      "text": "Tom Bartindale, Delvin Varghese, Guy Schofield, and Miki Tsukamoto. 2019. Our Story: Addressing Challenges in Development Contexts for Sustainable Participatory Video. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 437, 12 pages. https://doi.org/10.1145/3290605.3300667",
      "doi": "10.1145/3290605.3300667"
    },
    {
      "text": "Rosanna Bellini, Jay Rainey, Andrew Garbett, and Pamela Briggs. 2019. Vocalising Violence: Using Violent Mens’ Voices for Service Delivery and Feedback. In Proceedings of the 9th International Conference on Communities & Technologies - Transforming Communities (Vienna, Austria) (C&T ’19). ACM, New York, NY, USA, 210–217. https://doi.org/10.1145/3328320.3328405",
      "doi": "10.1145/3328320.3328405"
    },
    {
      "text": "Simon Bowen, Peter Wright, Alexander Wilson, Andy Dow, Tom Bartindale, and Robert Anderson. 2020. Metro Futures: Experience-Centred Co-Design at Scale. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376885",
      "doi": "10.1145/3313831.3376885"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2013. Successful Qualitative Research: A Practical Guide for Beginners. SAGE Publications Ltd, London.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4 (2019), 589–597. https://doi.org/10.1080/2159676X.2019.1628806",
      "doi": ""
    },
    {
      "text": "California Department of Justice. 2018. California Consumer Privacy Act of 2018. Retrieved January 8, 2022 from http://leginfo.legislature.ca.gov/faces/codes_displayText.xhtml?lawCode=CIV&division=3.&title=1.81.5.&part=4.&chapter=&article=",
      "doi": ""
    },
    {
      "text": "Mario Callegaro. 2013. Paradata in Web Surveys. In Improving Surveys with Paradata: Analytic Uses of Process Information. John Wiley & Sons, Inc., Hoboken, New Jersey, 259–279. https://doi.org/10.1002/9781118596869.ch11",
      "doi": ""
    },
    {
      "text": "Amelia Chauvette, Kara Schick-Makaroff, and Anita E. Molzahn. 2019. Open Data in Qualitative Research. International Journal of Qualitative Methods 18 (2019), 0–6. https://doi.org/10.1177/1609406918823863",
      "doi": ""
    },
    {
      "text": "Jilin Chen, Gary Hsieh, Jalal U. Mahmud, and Jeffrey Nichols. 2014. Understanding Individuals’ Personal Values from Social Media Word Use. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing(Baltimore, Maryland, USA) (CSCW ’14). ACM, New York, NY, USA, 405–414. https://doi.org/10.1145/2531602.2531608",
      "doi": "10.1145/2531602.2531608"
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, and m.c. schraefel. 2015. Characterizing Visualization Insights from Quantified Selfers’ Personal Data Presentations. IEEE Computer Graphics and Applications 35, 4 (2015), 28–37. https://doi.org/10.1109/MCG.2015.51",
      "doi": "10.1109/MCG.2015.51"
    },
    {
      "text": "Lewis L. Chuang and Ulrike Pfeil. 2018. Transparency and Openness Promotion Guidelines for HCI. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). ACM, New York, NY, USA, 1–4. https://doi.org/10.1145/3170427.3185377",
      "doi": "10.1145/3170427.3185377"
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, and Alan Dix. 2018. HARK No More: On the Preregistration of CHI Experiments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM, New York, New York, USA, 1–12. https://doi.org/10.1145/3173574.3173715",
      "doi": "10.1145/3173574.3173715"
    },
    {
      "text": "Condens. 2020. Supercharge Your UX Research Analysis. Retrieved January 8, 2022 from https://condens.io/",
      "doi": ""
    },
    {
      "text": "Mick P Couper and Eleanor Singer. 2013. Informed Consent for Web Paradata Use.Survey research methods 7, 1 (2013), 57–67. https://doi.org/10.1038/mp.2011.182.doi",
      "doi": ""
    },
    {
      "text": "Clara Crivellaro, Rob Anderson, Daniel Lambton-Howard, Tom Nappey, Patrick Olivier, Vasilis Vlachokyriakos, Alexander Wilson, and Pete Wright. 2019. Infrastructuring Public Service Transformation. ACM Transactions on Computer-Human Interaction (TOCHI) 26, 3 (may 2019), 1–29. https://doi.org/10.1145/3310284",
      "doi": "10.1145/3310284"
    },
    {
      "text": "Jaewoo Do and Lisa C. Yamagata-Lynch. 2017. Designing and Developing Cell Phone Applications for Qualitative Research. Qualitative Inquiry 23, 10 (2017), 757–767. https://doi.org/10.1177/1077800417731085",
      "doi": ""
    },
    {
      "text": "Dovetail. 2020. The User Experience Platform for Teams – DoveTailApp. Retrieved January 8, 2022 from https://dovetailapp.com/",
      "doi": ""
    },
    {
      "text": "Andy Dow, Rob Comber, and John Vines. 2018. Between Grassroots and the Hierarchy: Lessons Learned from the Design of a Public Services Directory. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174016",
      "doi": "10.1145/3173574.3174016"
    },
    {
      "text": "Andy Dow, John Vines, Rob Comber, and Rob Wilson. 2016. ThoughtCloud: Exploring the Role of Feedback Technologies in Care Organisations. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 3625–3636. https://doi.org/10.1145/2858036.2858105",
      "doi": "10.1145/2858036.2858105"
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A Lived Informatics Model of Personal Informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Osaka, Japan) (UbiComp ’15). ACM, New York, NY, USA, 731–742. https://doi.org/10.1145/2750858.2804250",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Casey Fiesler, Jed R. Brubaker, Andrea Forte, Shion Guha, Nora McDonald, and Michael Muller. 2019. Qualitative Methods for CSCW: Challenges and Opportunities. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing(Austin, TX, USA) (CSCW ’19). ACM, New York, NY, USA, 455–460. https://doi.org/10.1145/3311957.3359428",
      "doi": "10.1145/3311957.3359428"
    },
    {
      "text": "Borja García, Jo Welford, and Brett Smith. 2016. Using a smartphone app in qualitative research: the good, the bad and the ugly. Qualitative Research 16, 5 (2016), 508–525. https://doi.org/10.1177/1468794115593335",
      "doi": ""
    },
    {
      "text": "Timing Software GmbH. 2020. The Automatic Mac Time Tracker — No More Start/Stop Timers — Timing. Retrieved January 8, 2022 from https://timingapp.com/",
      "doi": ""
    },
    {
      "text": "W3C Working Group. 2013. PROV-Overview. An Overview of the PROV Family of Documents. Retrieved January 8, 2022 from https://www.w3.org/TR/prov-overview/",
      "doi": ""
    },
    {
      "text": "Jean Hartley and John Benington. 2000. Co-research: A new methodology for new times. European Journal of Work and Organizational Psychology 9, 4 (2000), 463–476. https://doi.org/10.1080/13594320050203085",
      "doi": ""
    },
    {
      "text": "David Hiles and Ivo Čermák. 2007. Qualitative Research: Transparency and Narrative Oriented Inquiry. 10th European Congress of Psychology, Prague, CZ, July 1 (2007), 3–6.",
      "doi": ""
    },
    {
      "text": "Dorothy Howard and Lilly Irani. 2019. Ways of Knowing When Research Subjects Care. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–16. https://doi.org/10.1145/3290605.3300327",
      "doi": "10.1145/3290605.3300327"
    },
    {
      "text": "Ioanna Iacovides, Charlene Jennett, Cassandra Cornish-Trestrail, and Anna L. Cox. 2013. Do Games Attract or Sustain Engagement in Citizen Science? A Study of Volunteer Motivations. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France) (CHI EA ’13). ACM, New York, NY, USA, 1101–1106. https://doi.org/10.1145/2468356.2468553",
      "doi": "10.1145/2468356.2468553"
    },
    {
      "text": "Christopher Kullenberg and Dick Kasperowski. 2016. What Is Citizen Science? – A Scientometric Meta-Analysis. PLOS ONE 11, 1 (01 2016), 1–16. https://doi.org/10.1371/journal.pone.0147152",
      "doi": ""
    },
    {
      "text": "Tanja Kunz, Camille Landesvatter, and Tobias Gummer. 2020. Informed consent for paradata use in web surveys. International Journal of Market Research 62, 4 (2020), 396–408. https://doi.org/10.1177/1470785320931669",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A Stage-Based Model of Personal Informatics Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). ACM, New York, NY, USA, 557–566. https://doi.org/10.1145/1753326.1753409",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Narges Mahyar, Diana V. Nguyen, Maggie Chan, Jiayi Zheng, and Steven P. Dow. 2019. The Civic Data Deluge: Understanding the Challenges of Analyzing Large-Scale Community Input. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). ACM, New York, NY, USA, 1171–1181. https://doi.org/10.1145/3322276.3322354",
      "doi": "10.1145/3322276.3322354"
    },
    {
      "text": "Jennifer Manuel, Geoff Vigar, Tom Bartindale, and Rob Comber. 2017. Participatory Media: Creating Spaces for Storytelling in Neighbourhood Planning. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 1688–1701. https://doi.org/10.1145/3025453.3025745",
      "doi": "10.1145/3025453.3025745"
    },
    {
      "text": "Megh Marathe and Kentaro Toyama. 2018. Semi-Automated Coding for Qualitative Research: A User-Centered Inquiry and Initial Prototypes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173922",
      "doi": "10.1145/3173574.3173922"
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and Inter-Rater Reliability in Qualitative Research: Norms and Guidelines for CSCW and HCI Practice. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 72 (Nov. 2019), 23 pages. https://doi.org/10.1145/3359174",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Jane Meyrick. 2006. What is good qualitative research? A first step towards a comprehensive approach to judging rigour/quality. Journal of Health Psychology 11, 5 (2006), 799–808. https://doi.org/10.1177/1359105306066643",
      "doi": ""
    },
    {
      "text": "Lokesh P Nijhawan, Manthan D Janodia, B S Muddukrishna, K M Bhat, K L Bairy, N Udupa, and Prashant B Musmade. 2013. Informed consent: Issues and challenges. Journal of advanced pharmaceutical technology & research 4, 3 (07 2013), 134–140. https://doi.org/10.4103/2231-4040.116779",
      "doi": ""
    },
    {
      "text": "House of Commons Committee of Public Accounts. 2016. Personal budgets in social care. Retrieved January 8, 2022 from https://publications.parliament.uk/pa/cm201617/cmselect/cmpubacc/74/74.pdf",
      "doi": ""
    },
    {
      "text": "Ministry of Education and Finland Culture. 2004. FAIR principles | Fairdata. Retrieved January 8, 2022 from https://www.fairdata.fi/en/about-fairdata/fair-principles/",
      "doi": ""
    },
    {
      "text": "Department of Health, Social Care, and NHS England. 2018. Extending legal rights to personal health budgets and integrated personal budgets: consultation response. Retrieved January 8, 2022 from https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/780330/Extending_legal_rights_to_health_budgets_consultation_response.pdf",
      "doi": ""
    },
    {
      "text": "Victoria Palacin, Maria Angela Ferrario, Gary Hsieh, Antti Knutas, Annika Wolff, and Jari Porras. 2021. Human values and digital citizen science interactions. International Journal of Human-Computer Studies 149 (2021), 102605. https://doi.org/10.1016/j.ijhcs.2021.102605",
      "doi": ""
    },
    {
      "text": "Victoria Palacin, Síle Ginnane, Maria Angela Ferrario, Ari Happonen, Annika Wolff, Sara Piutunen, and Niina Kupiainen. 2019. SENSEI: Harnessing Community Wisdom for Local Environmental Monitoring in Finland. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems(Glasgow, Scotland Uk) (CHI EA ’19). ACM, New York, NY, USA, 1–8. https://doi.org/10.1145/3290607.3299047",
      "doi": ""
    },
    {
      "text": "European Parliament. 2016. Regulation 2016/679 of the European Parliament and of the council. Official Journal of the European Union 59, 119 (2016), 149. Retrieved January 8, 2022 from https://eur-lex.europa.eu/legal-content/EN/TXT/PDF/?uri=OJ:L:2016:119:FULL&from=EN",
      "doi": ""
    },
    {
      "text": "Trena Paulus, Jessica Lester, and Paul Dempster. 2014. Digital Tools for Qualitative Research. SAGE Publications Ltd, SAGE Publications Ltd. 216 pages. https://doi.org/10.4135/9781473957671",
      "doi": ""
    },
    {
      "text": "Trena Paulus, Megan Woods, David P. Atkins, and Rob Macklin. 2017. The discourse of QDAS: reporting practices of ATLAS.ti and NVivo users with implications for best practices. International Journal of Social Research Methodology 20, 1(2017), 35–47. https://doi.org/10.1080/13645579.2015.1102454",
      "doi": ""
    },
    {
      "text": "Paul Prinsloo and Sharon Slade. 2015. Student Privacy Self-management: Implications for Learning Analytics. In Proceedings of the Fifth International Conference on Learning Analytics And Knowledge (Poughkeepsie, New York) (LAK ’15). ACM, New York, NY, USA, 83–92. https://doi.org/10.1145/2723576.2723585",
      "doi": "10.1145/2723576.2723585"
    },
    {
      "text": "Kingsley Purdam. 2014. Citizen social science and citizen data? Methodological and ethical challenges for social research. Current Sociology 62, 3 (2014), 374–392. https://doi.org/10.1177/0011392114527997",
      "doi": ""
    },
    {
      "text": "Aare Puussaar, Adrian K. Clear, and Peter Wright. 2017. Enhancing Personal Informatics Through Social Sensemaking. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 6936–6942. https://doi.org/10.1145/3025453.3025804",
      "doi": "10.1145/3025453.3025804"
    },
    {
      "text": "Aare Puussaar, Ian G. Johnson, Kyle Montague, Philip James, and Peter Wright. 2018. Making Open Data Work for Civic Advocacy. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 143 (Nov. 2018), 20 pages. https://doi.org/10.1145/3274412",
      "doi": "10.1145/3274412"
    },
    {
      "text": "QSR International. 2020. Qualitative Data Analysis Software | NVivo - QSR International. Retrieved January 8, 2022 from https://www.qsrinternational.com/nvivo-qualitative-data-analysis-software/home",
      "doi": ""
    },
    {
      "text": "Quirkos. 2020. Simple Qualitative Analysis Software | Quirkos. Retrieved January 8, 2022 from https://www.quirkos.com/",
      "doi": ""
    },
    {
      "text": "Jay Rainey, Juan Carlos Alvarez de la Vega, Dan Richardson, Daniel Lambton-Howard, Sara Armouch, Tom Bartindale, Shaun Hazeldine, Pamela Briggs, Patrick Olivier, and Kyle Montague. 2020. TalkFutures: Supporting Qualitative Practices in Distributed Community Engagements. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). ACM, New York, NY, USA, 771–784. https://doi.org/10.1145/3357236.3395531",
      "doi": "10.1145/3357236.3395531"
    },
    {
      "text": "Jay Rainey, Kyle Montague, Pamela Briggs, Robert Anderson, Thomas Nappey, and Patrick Olivier. 2019. Gabber: Supporting Voice in Participatory Qualitative Practices. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 377, 12 pages. https://doi.org/10.1145/3290605.3300607",
      "doi": "10.1145/3290605.3300607"
    },
    {
      "text": "Rémi Rampin and Vicky Rampin. 2021. Taguette: open-source qualitative data analysis. Journal of Open Source Software 6, 68 (2021), 3522. https://doi.org/10.21105/joss.03522",
      "doi": ""
    },
    {
      "text": "Tim Rietz and Alexander Maedche. 2021. Cody: An AI-Based System to Semi-Automate Coding for Qualitative Research. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). ACM, New York, NY, USA, Article 394, 14 pages. https://doi.org/10.1145/3411764.3445591",
      "doi": "10.1145/3411764.3445591"
    },
    {
      "text": "Tim Rietz, Peyman Toreini, and Alexander Maedche. 2020. Cody: An Interactive Machine Learning System for Qualitative Coding. In Adjunct Publication of the 33rd Annual ACM Symposium on User Interface Software and Technology(Virtual Event, USA) (UIST ’20 Adjunct). ACM, New York, NY, USA, 90–92. https://doi.org/10.1145/3379350.3416195",
      "doi": "10.1145/3379350.3416195"
    },
    {
      "text": "Guy Schofield, Tom Bartindale, and Peter Wright. 2015. Bootlegger: Turning Fans into Film Crew. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 767–776. https://doi.org/10.1145/2702123.2702229",
      "doi": "10.1145/2702123.2702229"
    },
    {
      "text": "Clive Seale, Giampietro Gobo, Jaber Gubrium, and David Silverman. 2004. Qualitative Research Practice. SAGE Publications, Ltd., London. https://doi.org/10.4135/9781848608191",
      "doi": ""
    },
    {
      "text": "Conglei Shi, Siwei Fu, Qing Chen, and Huamin Qu. 2015. VisMOOC: Visualizing video clickstream data from Massive Open Online Courses. In 2015 IEEE Pacific Visualization Symposium (PacificVis). Institute of Electrical and Electronics Engineers (IEEE), online, 159–166. https://doi.org/10.1109/PACIFICVIS.2015.7156373",
      "doi": ""
    },
    {
      "text": "Petr Slovák, Joris Janssen, and Geraldine Fitzpatrick. 2012. Understanding Heart Rate Sharing: Towards Unpacking Physiosocial Space. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). ACM, New York, NY, USA, 859–868. https://doi.org/10.1145/2207676.2208526",
      "doi": "10.1145/2207676.2208526"
    },
    {
      "text": "Jan David Smeddinck, Marc Herrlich, Max Roll, and Malaka Rainer. 2014. Motivational Effects of a Gamified Training Analysis Interface. In Mensch & Computer(M&M’14). De Gruyter Oldenbourg, Berlin, 397–404.",
      "doi": ""
    },
    {
      "text": "Kaiwen Sun, Abraham H. Mhaidli, Sonakshi Watel, Christopher A. Brooks, and Florian Schaub. 2019. It’s My Data! Tensions Among Stakeholders of a Learning Analytics Dashboard. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 594, 14 pages. https://doi.org/10.1145/3290605.3300824",
      "doi": "10.1145/3290605.3300824"
    },
    {
      "text": "Poorna Talkad Sukumar, Ignacio Avellino, Christian Remy, Michael A. DeVito, Tawanna R. Dillahunt, Joanna McGrenere, and Max L. Wilson. 2020. Transparency in Qualitative Research: Increasing Fairness in the CHI Review Process. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(Honolulu, HI, USA) (CHI EA ’20). ACM, New York, NY, USA, 1–6. https://doi.org/10.1145/3334480.3381066",
      "doi": ""
    },
    {
      "text": "Rivka Tuval-Mashiach. 2017. Raising the curtain: The importance of transparency in qualitative research.Qualitative Psychology 4, 2 (aug 2017), 126–138. https://doi.org/10.1037/qup0000062",
      "doi": ""
    },
    {
      "text": "Delvin Varghese, Patrick Olivier, Tom Bartindale, and Matt Baillie Smith. 2020. Towards Participatory Video 2.0. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376694",
      "doi": "10.1145/3313831.3376694"
    },
    {
      "text": "Vasillis Vlachokyriakos, Clara Crivellaro, Christopher A. Le Dantec, Eric Gordon, Pete Wright, and Patrick Olivier. 2016. Digital Civics: Citizen Empowerment With and Through Technology. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems(San Jose, California, USA) (CHI EA ’16). ACM, New York, NY, USA, 1096–1099. https://doi.org/10.1145/2851581.2886436",
      "doi": "10.1145/2851581.2886436"
    },
    {
      "text": "Chat Wacharamanotham, Lukas Eisenring, Steve Haroz, and Florian Echtler. 2020. Transparency of CHI Research Artifacts: Results of a Self-Reported Survey. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376448",
      "doi": "10.1145/3313831.3376448"
    },
    {
      "text": "Mark D. Wilkinson, Michel Dumontier, IJsbrand Jan Aalbersberg, Gabrielle Appleton, Myles Axton, Arie Baak, Niklas Blomberg, Jan-Willem Boiten, Luiz Bonino da Silva Santos, Philip E. Bourne, Jildau Bouwman, Anthony J. Brookes, Tim Clark, Mercè Crosas, Ingrid Dillo, Olivier Dumon, Scott Edmunds, Chris T. Evelo, Richard Finkers, Alejandra Gonzalez-Beltran, Alasdair J. G. Gray, Paul Groth, Carole Goble, Jeffrey S. Grethe, Jaap Heringa, Peter A. C ’t Hoen, Rob Hooft, Tobias Kuhn, Ruben Kok, Joost Kok, Scott J. Lusher, Maryann E. Martone, Albert Mons, Abel L. Packer, Bengt Persson, Philippe Rocca-Serra, Marco Roos, Rene van Schaik, Susanna-Assunta Sansone, Erik Schultes, Thierry Sengstag, Ted Slater, George Strawn, Morris A. Swertz, Mark Thompson, Johan van der Lei, Erik van Mulligen, Jan Velterop, Andra Waagmeester, Peter Wittenburg, Katherine Wolstencroft, Jun Zhao, and Barend Mons. 2016. The FAIR Guiding Principles for scientific data management and stewardship. Scientific Data 3(2016), 1–9. https://doi.org/10.1038/sdata.2016.18",
      "doi": ""
    },
    {
      "text": "Jordan Wirfs-Brock, Sarah Mennicken, and Jennifer Thom. 2020. Giving Voice to Silent Data: Designing with Personal Music Listening History. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). ACM, New York, NY, USA, 1–11. https://doi.org/10.1145/3313831.3376493",
      "doi": "10.1145/3313831.3376493"
    },
    {
      "text": "Megan Woods, Trena Paulus, David P. Atkins, and Rob Macklin. 2016. Advancing Qualitative Research Using Qualitative Data Analysis Software (QDAS)? Reviewing Potential Versus Practice in Published Studies using ATLAS.ti and NVivo, 1994–2013. Social Science Computer Review 34, 5 (2016), 597–617. https://doi.org/10.1177/0894439315596311",
      "doi": "10.1177/0894439315596311"
    }
  ]
}