{
  "doi": "10.1145/3491102.3517575",
  "title": "“Should I visit the clinic”: Analyzing WhatsApp-mediated Online Health Support for Expectant and New Mothers in Rural India",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2022,
  "badges": [],
  "abstract": "Limited interaction with professionals, infrastructural, and social constraints put barriers in providing holistic support to expectant and new mothers in low-resource settings. We examine the use of digital support groups facilitated through WhatsApp by a non-government organization in India. Complementing prior research, these digital peer support groups inform about an open public space created over a chat platform where rural communities and health professionals can engage. By qualitatively analyzing six months of interaction among 588 group members and collecting the experiences of the group moderators, we inform about how the support groups acted as an important source for compensating the gaps in the existing healthcare, providing reassurance support on routine health, explanation on test reports, validation and counseling support in ongoing treatments. We also derive implications for the future of digital support groups and the need for further research on the use of unplatformed design models in resource-constrained settings.",
  "tags": [
    "Social support",
    "Digital support group",
    "WhatsApp",
    "Maternal health"
  ],
  "authors": [
    {
      "name": "Deepika Yadav",
      "institution": "IIIT-Delhi, India",
      "img": "/do/10.1145/contrib-99659022046/rel-imgonly/pic.png",
      "acmid": "99659022046",
      "orcid": "missing"
    },
    {
      "name": "Kirti Dabas",
      "institution": "IIIT-DELHI, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659481475",
      "orcid": "missing"
    },
    {
      "name": "Prerna Malik",
      "institution": "IIIT-Delhi, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659480687",
      "orcid": "missing"
    },
    {
      "name": "Anushka Bhandari",
      "institution": "IIIT-Delhi, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659481847",
      "orcid": "missing"
    },
    {
      "name": "Pushpendra Singh",
      "institution": "IIIT-Delhi, India",
      "img": "/do/10.1145/contrib-81309502140/rel-imgonly/psingh.jpg",
      "acmid": "81309502140",
      "orcid": "0000-0003-2152-1027"
    }
  ],
  "references": [
    {
      "text": "Amna Abid and Suleman Shahid. 2017. Helping pregnant women in the rural areas of Pakistan using a low-cost interactive system. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development. Association for Computing Machinery, New York, NY, USA, 1–5.",
      "doi": "10.1145/3136560.3136607"
    },
    {
      "text": "BBC Media Action. 2012. Mobile Kunji. Retrieved September 12, 2018 from https://www.rethink1000days.org/programme-outputs/mobile-kunji/",
      "doi": ""
    },
    {
      "text": "Atik Ahsan and Ananya Raihan. 2013. Understanding mHealth impact among Aponjon (MAMA Bangladesh) subscribers through a phone survey in Bangladesh. In Proceedings of the Sixth International Conference on Information and Communications Technologies and Development: Notes-Volume 2. Association for Computing Machinery, New York, NY, USA, 1–4.",
      "doi": "10.1145/2517899.2517920"
    },
    {
      "text": "Ahmad Habeeb Hattab Dala Ali Alani, Bassam Abdul Rasool Hassan, Azyyati Mohd Suhaimi, and Ali Haider Mohammed. 2020. Use, Awareness, Knowledge and Beliefs of Medication During Pregnancy in Malaysia. Osong public health and research perspectives 11, 6(2020), 373.",
      "doi": ""
    },
    {
      "text": "Terrance L Albrecht and Mara B Adelman. 1987. Communicating social support.Sage Publications, Inc, UK.",
      "doi": ""
    },
    {
      "text": "Tawfiq Ammari, Sarita Schoenebeck, and Silvia Lindtner. 2017. The crafting of DIY fatherhood. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. Association for Computing Machinery, New York, NY, USA, 1109–1122.",
      "doi": "10.1145/2998181.2998270"
    },
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018. Announcing pregnancy loss on Facebook: A decision-making framework for stigmatized disclosures on identified social network sites. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3173574.3173732"
    },
    {
      "text": "Miranda R Andrus and Mary T Roth. 2002. Health literacy: a review. Pharmacotherapy: The Journal of Human Pharmacology and Drug Therapy 22, 3(2002), 282–302.",
      "doi": ""
    },
    {
      "text": "Sinan E Arkonac, Joe Frazer, Ryan John Horgan, Anna Kracewicz, and Latefa Al-Naimi. 2017. ParentCircle: Helping Single Parents Build a Support Network. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 26–32.",
      "doi": "10.1145/3027063.3049271"
    },
    {
      "text": "Naveen Bagalkot, Nervo Verdezoto, Anushri Ghode, Shipra Purohit, Lakshmi Murthy, Nicola Mackintosh, and Paula Griffiths. 2020. Beyond Health Literacy: Navigating Boundaries and Relationships During High-Risk Pregnancies: Challenges and Opportunities for Digital Health in North-West India. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. Association for Computing Machinery, New York, NY, USA, 1–15.",
      "doi": "10.1145/3419249.3420126"
    },
    {
      "text": "Lesley Barclay, Louise Everitt, Frances Rogan, Virginia Schmied, and Aileen Wyllie. 1997. Becoming a mother—an analysis of women’s experience of early motherhood. Journal of advanced nursing 25, 4 (1997), 719–728.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, Association for Computing Machinery, New York, NY, USA, 1301–1310.",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Peter Barron, Joanne Peter, Amnesty E LeFevre, Jane Sebidi, Marcha Bekker, Robert Allen, Annie Neo Parsons, Peter Benjamin, and Yogan Pillay. 2018. Mobile health messaging service and helpdesk for South African mothers (MomConnect): history, successes and challenges. BMJ global health 3, Suppl 2 (2018), e000559.",
      "doi": ""
    },
    {
      "text": "Amna Batool, Samia Razaq, Maham Javaid, Beenish Fatima, and Kentaro Toyama. 2017. Maternal Complications: Nuances in Mobile Interventions for Maternal Health in Urban Pakistan. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development. ACM, Association for Computing Machinery, New York, NY, USA, 3.",
      "doi": "10.1145/3136560.3136573"
    },
    {
      "text": "The BBC. 2019. Mobile data: Why India has the world’s cheapest. https://www.bbc.com/news/world-asia-india-47537201. [Online; accessed 10-Jan-2022].",
      "doi": ""
    },
    {
      "text": "Laveesh Bhandari and Siddhartha Dutta. 2007. Health infrastructure in rural India. India infrastructure report 2007 (2007), 265–85.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jean Hardy, Tawfiq Ammari, Tiffany Veinot, Cliff Lampe, and Sarita Schoenebeck. 2016. LGBT parents and social media: Advocacy, privacy, and disclosure during shifting social movements. In Proceedings of the 2016 CHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 610–622.",
      "doi": "10.1145/2858036.2858342"
    },
    {
      "text": "Dawn O Braithwaite, Vincent R Waldron, and Jerry Finn. 1999. Communication of social support in computer-mediated groups for people with disabilities. Health communication 11, 2 (1999), 123–151.",
      "doi": ""
    },
    {
      "text": "Grace Burleson, Mustafa Naseem, and Kentaro Toyama. 2020. An exploration of African-American pregnant women’s information-seeking behavior in Detroit. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development. Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": "10.1145/3392561.3394647"
    },
    {
      "text": "Sergio Carmona, Nada Alayed, Ali Al-Ibrahim, and Rohan D’Souza. 2018. Realizing the potential of real-time clinical collaboration in maternal–fetal and obstetric medicine through WhatsApp. Obstetric medicine 11, 2 (2018), 83–89.",
      "doi": ""
    },
    {
      "text": "Dipanjan Chakraborty, Akshay Gupta, and Aaditeshwar Seth. 2019. Experiences from a mobile-based behaviour change campaign on maternal and child nutrition in rural India. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development. Association for Computing Machinery, New York, NY, USA, 1–11.",
      "doi": "10.1145/3287098.3287110"
    },
    {
      "text": "Rajesh Chandwani and Neha Kumar. 2018. Stitching infrastructures to facilitate telemedicine for low-resource environments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": "10.1145/3173574.3173958"
    },
    {
      "text": "Yee Tak Derek Cheung, Ching Han Helen Chan, Chi-Keung Jonah Lai, Wai Fung Vivian Chan, Man Ping Wang, Ho Cheung William Li, Sophia Siu Chee Chan, and Tai-Hing Lam. 2015. Using WhatsApp and Facebook online social groups for smoking relapse prevention for recent quitters: a pilot pragmatic cluster randomized controlled trial. Journal of medical Internet research 17, 10 (2015), e4829.",
      "doi": ""
    },
    {
      "text": "Sheldon Cohen, Lynn G. Underwood, and Benjamin H. Gottlieb. 2015. Social Support Measurement and Intervention: A Guide for Health and Social Scientists: A Guide for Health and Social Scientists. Oxford University Press, New York, NY. https://doi.org/10.1093/med:psych/9780195126709.001.0001",
      "doi": ""
    },
    {
      "text": "Jesse Coleman, Kate C Bohlin, Anna Thorson, Vivian Black, Patricia Mechael, Josie Mangxaba, and Jaran Eriksen. 2017. Effectiveness of an SMS-based maternal mHealth intervention to improve clinical outcomes of HIV-positive pregnant women. AIDS care 29, 7 (2017), 890–897.",
      "doi": ""
    },
    {
      "text": "Carolyn E Cutrona and Julie A Suhr. 1992. Controllability of stressful events and satisfaction with spouse support behaviors. Communication research 19, 2 (1992), 154–174.",
      "doi": ""
    },
    {
      "text": "Ashavaree Das and Madhurima Sarkar. 2014. Pregnancy-related health information-seeking behaviors among rural pregnant women in India: validating the Wilson model in the Indian context. The Yale journal of biology and medicine 87, 3 (2014), 251.",
      "doi": ""
    },
    {
      "text": "Runi Datta. 2013. The world of quacks: A parallel health care system in rural West Bengal. IOSR Journal of Humanities and Social Science 14, 2 (2013), 44–53.",
      "doi": ""
    },
    {
      "text": "Brian DeRenzi, Neal Lesh, Tapan Parikh, Clayton Sims, Werner Maokla, Mwajuma Chemba, Yuna Hamisi, Marc Mitchell, Gaetano Borriello, 2008. E-IMCI: Improving pediatric health care in low-income countries. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, Association for Computing Machinery, New York, NY, USA, 753–762.",
      "doi": "10.1145/1357054.1357174"
    },
    {
      "text": "Pranav Dorwal, Ritesh Sachdev, Dheeraj Gautam, Dharmendra Jain, Pooja Sharma, Assem Kumar Tiwari, and Vimarsh Raina. 2016. Role of WhatsApp messenger in the laboratory management system: a boon to communication. Journal of medical systems 40, 1 (2016), 1–5.",
      "doi": "10.1007/s10916-015-0384-2"
    },
    {
      "text": "Victoria L Franklin, Annalu Waller, Claudia Pagliari, and Stephen A Greene. 2006. A randomized controlled trial of Sweet Talk, a text-messaging system to support young people with diabetes. Diabetic medicine 23, 12 (2006), 1332–1338.",
      "doi": ""
    },
    {
      "text": "Lorna Gibson and Vicki L Hanson. 2013. Digital motherhood: How does technology help new mothers?. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, Association for Computing Machinery, New York, NY, USA, 313–322.",
      "doi": "10.1145/2470654.2470700"
    },
    {
      "text": "Mark S Granovetter. 1973. The strength of weak ties. American journal of sociology 78, 6 (1973), 1360–1380.",
      "doi": ""
    },
    {
      "text": "Xinning Gui, Yu Chen, Yubo Kou, Katie Pine, and Yunan Chen. 2017. Investigating support seeking from peers for pregnancy in online health communities. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–19.",
      "doi": "10.1145/3134685"
    },
    {
      "text": "Md Mahfuzul Haque, Mohammad Yousuf, Ahmed Shatil Alam, Pratyasha Saha, Syed Ishtiaque Ahmed, and Naeemul Hassan. 2020. Combating Misinformation in Bangladesh: Roles and Responsibilities as Perceived by Journalists, Fact-Checkers, and Users. Proc. ACM Hum.-Comput. Interact. 4, CSCW2, Article 130 (oct 2020), 32 pages. https://doi.org/10.1145/3415201",
      "doi": "10.1145/3415201"
    },
    {
      "text": "The Hindu. 2021. One out of two graduates still not employable: study. https://www.thehindu.com/news/national/kerala/one-out-of-two-graduates-still-not-employable-study/article34805488.ece. [Online; accessed 10-Jan-2022].",
      "doi": ""
    },
    {
      "text": "James S House. 1983. Work stress and social support. Addison-Wesley Series on Occupational Stress, USA.",
      "doi": ""
    },
    {
      "text": "Kuang-Yuan Huang, Indushobha Chengalur-Smith, and Alain Pinsonneault. 2019. Sharing is caring: Social support provision and companionship activities in healthcare virtual support communities. MIS quarterly 43, 2 (2019), 395–424.",
      "doi": ""
    },
    {
      "text": "Jina Huh. 2015. Clinical questions in online health communities: the case of” See your doctor” threads. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. Association for Computing Machinery, New York, NY, USA, 1488–1499.",
      "doi": "10.1145/2675133.2675259"
    },
    {
      "text": "ICDS. 2021. Roles and Responsibilities of AWWs. https://icds-wcd.nic.in/icdsimg/RoleresponseAWWs.pdf. [Online; accessed 13-Oct-2019].",
      "doi": ""
    },
    {
      "text": "Favorite Iradukunda. 2020. Food taboos during pregnancy. Health care for women international 41, 2 (2020), 159–168.",
      "doi": ""
    },
    {
      "text": "T Jayakrishnan, MC Jeeja, V Kuniyil, and S Paramasivam. 2016. Increasing out-of-pocket health care expenditure in India-due to supply or demand. Pharmacoeconomics 1, 105 (2016), 2.",
      "doi": ""
    },
    {
      "text": "Maged N Kamel Boulos, Dean M Giustini, and Steve Wheeler. 2016. Instagram and WhatsApp in health and healthcare: An overview. Future internet 8, 3 (2016), 37.",
      "doi": ""
    },
    {
      "text": "Naveena Karusala, David Odhiambo Seeh, Cyrus Mugo, Brandon Guthrie, Megan A Moreno, Grace John-Stewart, Irene Inwani, Richard Anderson, and Keshet Ronen. 2021. “That courage to encourage”: Participation and Aspirations in Chat-based Peer Support for Youth Living with HIV. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–17.",
      "doi": "10.1145/3411764.3445313"
    },
    {
      "text": "Naveena Karusala, Ding Wang, and Jacki O’Neill. 2020. Making chat at home in the hospital: Exploring chat use by nurses. In Proceedings of the 2020 chi conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 1–15.",
      "doi": "10.1145/3313831.3376166"
    },
    {
      "text": "Dmitri S. Katz, Nick Dalton, and Blaine A. Price. 2015. Failing the challenge: Diabetes apps & long-term daily adoption. In 8th International Conference on Advanced Technologies & Treatments for Diabetes. ATTD 2015, Paris, 1.",
      "doi": ""
    },
    {
      "text": "Michelle R Kaufman, Jennifer J Harman, Marina Smelyanskaya, Jennifer Orkis, and Robert Ainslie. 2017. “Love me, parents!”: impact evaluation of a national social and behavioral change communication campaign on maternal health outcomes in Tanzania. BMC pregnancy and childbirth 17, 1 (2017), 1–10.",
      "doi": ""
    },
    {
      "text": "Jasmeet Kaur and Pushpendra Singh. 2020. Understanding Engagement of Parents In Online Health Communities for Early Childhood. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development. Association for Computing Machinery, New York, NY, USA, 1–5.",
      "doi": "10.1145/3392561.3397582"
    },
    {
      "text": "Piyanee Klainin and David Gordon Arthur. 2009. Postpartum depression in Asian cultures: a literature review. International journal of nursing studies 46, 10 (2009), 1355–1373.",
      "doi": ""
    },
    {
      "text": "Neha Kumar, Trevor Perrier, Michelle Desmond, Kiersten Israel-Ballard, Vikrant Kumar, Sudip Mahapatra, Anil Mishra, Shreya Agarwal, Rikin Gandhi, Pallavi Lal, 2015. Projecting health: community-led video education for maternal health. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development. ACM, Association for Computing Machinery, New York, NY, USA, 17.",
      "doi": "10.1145/2737856.2738023"
    },
    {
      "text": "Daniel Lambton-Howard, Patrick Olivier, Vasilis Vlachokyriakos, Hanna Celina, and Ahmed Kharrufa. 2020. Unplatformed Design: A Model for Appropriating Social Media Technologies for Coordinated Participation. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3313831.3376179"
    },
    {
      "text": "Daniel Lambton-Howard, Emma Simpson, Kim Quimby, Ahmed Kharrufa, Heidi Hoi Ming Ng, Emma Foster, and Patrick Olivier. 2021. Blending into Everyday Life: Designing a Social Media-Based Peer Support System. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3411764.3445079"
    },
    {
      "text": "Stephen S Lim, Lalit Dandona, Joseph A Hoisington, Spencer L James, Margaret C Hogan, and Emmanuela Gakidou. 2010. India’s Janani Suraksha Yojana, a conditional cash transfer programme to increase births in health facilities: an impact evaluation. The Lancet 375, 9730 (2010), 2009–2023.",
      "doi": ""
    },
    {
      "text": "Nan Lin, Walter M Ensel, Ronald S Simeone, and Wen Kuo. 1979. Social support, stressful life events, and illness: A model and an empirical test. Journal of health and Social Behavior 20, 2 (1979), 108–119.",
      "doi": ""
    },
    {
      "text": "Nguyen Hoang Long, E Johansson, K Lönnroth, B Eriksson, A Winkvist, and VK Diwan. 1999. Longer delays in tuberculosis diagnosis among women in Vietnam. The International Journal of Tuberculosis and Lung Disease 3, 5(1999), 388–393.",
      "doi": ""
    },
    {
      "text": "Xiaojuan Ma, Xinning Gui, Jiayue Fan, Mingqian Zhao, Yunan Chen, and Kai Zheng. 2018. Professional Medical Advice at your Fingertips: An empirical study of an online” Ask the Doctor” platform. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–22.",
      "doi": "10.1145/3274385"
    },
    {
      "text": "Caio Machado, Beatriz Kira, Vidya Narayanan, Bence Kollanyi, and Philip Howard. 2019. A Study of Misinformation in WhatsApp Groups with a Focus on the Brazilian Presidential Elections.. In Companion Proceedings of The 2019 World Wide Web Conference (San Francisco, USA) (WWW ’19). Association for Computing Machinery, New York, NY, USA, 1013–1019. https://doi.org/10.1145/3308560.3316738",
      "doi": "10.1145/3308560.3316738"
    },
    {
      "text": "Girija Kalayil Madhavanprabhakaran, KA Kumar, S Ramasubramaniam, and AA Akintola. 2013. Effects of pregnancy related anxiety on labour outcomes: A prospective cohort study. Journal of Research in Nursing and Midwifery (JRNM) 2, 7 (2013), 96–103.",
      "doi": ""
    },
    {
      "text": "Mishu Mangla and Deepak Singla. 2016. Prevalence of anaemia among pregnant women in rural India: a longitudinal observational study. Int J Reprod Contracept Obstet Gynecol 5, 10 (2016), 3500–5.",
      "doi": ""
    },
    {
      "text": "Clarissa Martyn-Hemphill, Somita Sarkar, John Withington, Ashoke Roy, Rosaline Chisholm, Toby Newton, Diego Ottaviani, Connie Pidgeon, Sonia Szamocki, Daniel Cohen, 2015. Mp16-06 ‘whatsapp Doc?’Evaluating A Novel Modality Of Communication Amongst Urology Team Members To Promote Patient Safety. The Journal of urology 193, 4S (2015), e169–e170.",
      "doi": ""
    },
    {
      "text": "National Health Mission. 2019. Village Health Nutrition Day. http://164.100.154.238/communitisation/village-health-nutrition-day.html. [Online; accessed 13-Oct-2019].",
      "doi": ""
    },
    {
      "text": "National Health Mission. 2020. Janani Suraksha Yojana (JSY). https://nhm.gov.in/index1.php?lang=1&level=3&lid=309&sublinkid=841. [Online; accessed 1-Jan-2022].",
      "doi": ""
    },
    {
      "text": "Nerges Mistry, Sheela Rangan, Yatin Dholakia, Eunice Lobo, Shimoni Shah, and Akshaya Patil. 2016. Durations and delays in care seeking, diagnosis and treatment initiation in uncomplicated pulmonary tuberculosis patients in Mumbai, India. PloS one 11, 3 (2016), e0152287.",
      "doi": ""
    },
    {
      "text": "Phoenix KH Mo and Neil S Coulson. 2008. Exploring the communication of social support within virtual communities: a content analysis of messages posted to an online HIV/AIDS support group. Cyberpsychology & behavior 11, 3 (2008), 371–374.",
      "doi": ""
    },
    {
      "text": "Mohammad H Mobasheri, Dominic King, Maximilian Johnston, Sanjay Gautama, Sanjay Purkayastha, Ara Darzi, 2015. The ownership and clinical use of smartphones by doctors and nurses in the UK: a multicentre survey study. BMJ Innov 1, 4 (2015), 174–181.",
      "doi": ""
    },
    {
      "text": "Maletsabisa Molapo, Melissa Densmore, and Limpho Morie. 2016. Designing with community health workers: enabling productive participation through exploration. In Proceedings of the First African Conference on Human Computer Interaction. Association for Computing Machinery, New York, NY, USA, 58–68.",
      "doi": "10.1145/2998581.2998589"
    },
    {
      "text": "Lalit Mourya and Subhojit Goswami. 2021. India’s health workforce crisis. https://www.downtoearth.org.in/dte-infographics/61322-not_enough_doctors.html. [Online; accessed 08-Jan-2022].",
      "doi": ""
    },
    {
      "text": "Maryam Mustafa, Amna Batool, Beenish Fatima, Fareeda Nawaz, Kentaro Toyama, and Agha Ali Raza. 2020. Patriarchy, maternal health and spiritual healing: Designing maternal health interventions in Pakistan. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3313831.3376294"
    },
    {
      "text": "Bruno Nardo, Marco Cannistrà, Vincenzo Diaco, Agostino Naso, Matteo Novello, Alessandra Zullo, Michele Ruggiero, Raffaele Grande, and Rosario Sacco. 2016. Optimizing patient surgical management using WhatsApp application in the Italian healthcare system. Telemedicine and e-Health 22, 9 (2016), 718–725.",
      "doi": ""
    },
    {
      "text": "Mustafa Naseem, Fouzia Younas, and Maryam Mustafa. 2020. Designing Digital Safe Spaces for Peer Support and Connectivity in Patriarchal Contexts. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–24.",
      "doi": "10.1145/3415217"
    },
    {
      "text": "Ministry of Health & Family Welfare. 2020. Kilkari Service. https://interactivebees.com/citizen/kilkariservices?bene=2. [Online; accessed 1-Jan-2022].",
      "doi": ""
    },
    {
      "text": "Ministry of Health and Family Welfare. 2021. National Family Health Survey - 5. http://rchiips.org/nfhs/index.shtml. [Online; accessed 1-Jan-2022].",
      "doi": ""
    },
    {
      "text": "Finance Commission of India. 2021. Finance Commission in COVID Times. https://fincomindia.nic.in/ShowContentOne.aspx?id=9&Section=1. [Online; accessed 2-Sept-2021].",
      "doi": ""
    },
    {
      "text": "Ministry of Women and Child Development. 2022. About Poshan Abhiyaan. https://icds-wcd.nic.in/nnm/home.htm. [Online; accessed 1-Jan-2022].",
      "doi": ""
    },
    {
      "text": "Sachin R Pendse, Faisal M Lalani, Munmun De Choudhury, Amit Sharma, and Neha Kumar. 2020. ” Like Shock Absorbers”: Understanding the Human Infrastructures of Technology-Mediated Mental Health Support. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376465"
    },
    {
      "text": "Trevor Perrier, Nicola Dell, Brian DeRenzi, Richard Anderson, John Kinuthia, Jennifer Unger, and Grace John-Stewart. 2015. Engaging pregnant women in Kenya with a hybrid computer-human SMS communication system. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Association for Computing Machinery, New York, NY, USA, 1429–1438.",
      "doi": "10.1145/2702123.2702124"
    },
    {
      "text": "Trevor Perrier, Elizabeth K Harrington, Keshet Ronen, Daniel Matemo, John Kinuthia, Grace John-Stewart, Richard Anderson, and Jennifer A Unger. 2018. Male partner engagement in family planning SMS conversations at Kenyan health clinics. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies. ACM, Association for Computing Machinery, New York, NY, USA, 3.",
      "doi": "10.1145/3209811.3209857"
    },
    {
      "text": "Basant. Potnuru. 2017. Aggregate availability of doctors in India: 2014 - 2030. Indian Journal of Public Health 61, 3 (2017), 182–187. https://doi.org/10.4103/ijph.IJPH_143_16 arXiv:https://www.ijph.in/article.asp?issn=0019-557X;year=2017;volume=61;issue=3;spage=182;epage=187;aulast=Potnuru;t=6",
      "doi": ""
    },
    {
      "text": "PTI. 2017. India’s health workforce crisis. https://indianexpress.com/article/india/doctors-in-india-see-patients-for-just-two-minutes-study-4929453/. [Online; accessed 08-Jan-2022].",
      "doi": ""
    },
    {
      "text": "Divya Ramachandran, John Canny, Prabhu Dutta Das, and Edward Cutrell. 2010. Mobile-izing health workers in rural India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Association for Computing Machinery, New York, NY, USA, 1889–1898.",
      "doi": "10.1145/1753326.1753610"
    },
    {
      "text": "Divya Ramachandran, John Canny, Prabhu Dutta Das, and Edward Cutrell. 2010. Mobile-izing Health Workers in Rural India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). ACM, New York, NY, USA, 1889–1898. https://doi.org/10.1145/1753326.1753610",
      "doi": "10.1145/1753326.1753610"
    },
    {
      "text": "Dinsa Sachan. 2013. India looks to a new course to fix rural doctor shortage. The Lancet 382, 9899 (2013), e10.",
      "doi": ""
    },
    {
      "text": "Umaira Uzma Sajjad and Suleman Shahid. 2016. Baby+ a mobile application to support pregnant women in Pakistan. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct. Association for Computing Machinery, New York, NY, USA, 667–674.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Garen Checkley, Amna Batool, Nova Ahmed, David Nemer, Laura Sanely Gaytán-Lugo, Tara Matthews, Sunny Consolvo, and Elizabeth Churchil. 2018. ”Privacy is Not for Me, It’s for Those Rich Women”: Performative Privacy Practices on Mobile Phones by Women in South Asia. In Proceedings of the Fourteenth USENIX Conference on Usable Privacy and Security (Baltimore, MD, USA) (SOUPS ’18). USENIX Association, USA, 127–142.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan and Thomas Smyth. 2010. The human infrastructure of ICTD. In Proceedings of the 4th ACM/IEEE international conference on information and communication technologies and development. Association for Computing Machinery, New York, NY, USA, 1–9.",
      "doi": "10.1145/2369220.2369258"
    },
    {
      "text": "Linda Sanneving, Nadja Trygg, Deepak Saxena, Dileep Mavalankar, and Sarah Thomsen. 2013. Inequity in India: the case of maternal and reproductive health. Global health action 6, 1 (2013), 19145.",
      "doi": ""
    },
    {
      "text": "Kristi Sidney, Mariano Salazar, Gaetano Marrone, Vishal Diwan, Ayesha DeCosta, and Lars Lindholm. 2016. Out-of-pocket expenditures for childbirth in the context of the Janani Suraksha Yojana (JSY) cash transfer program to promote facility births: who pays and how much? Studies from Madhya Pradesh, India. International journal for equity in health 15, 1 (2016), 1–11.",
      "doi": ""
    },
    {
      "text": "Prashant Kumar Singh, Rajesh Kumar Rai, and Chandan Kumar. 2013. Equity in maternal, newborn, and child health care coverage in India. Global health action 6, 1 (2013), 22217.",
      "doi": ""
    },
    {
      "text": "Ayushi Srivastava, Shivani Kapania, Anupriya Tuli, and Pushpendra Singh. 2021. Actionable UI Design Guidelines for Smartphone Applications Inclusive of Low-Literate Users. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 136 (apr 2021), 30 pages. https://doi.org/10.1145/3449210",
      "doi": "10.1145/3449210"
    },
    {
      "text": "Sharifa Sultana, François Guimbretière, Phoebe Sengers, and Nicola Dell. 2018. Design within a patriarchal society: Opportunities and challenges in designing for rural women in bangladesh. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3173574.3174110"
    },
    {
      "text": "SurveyMonkey. 2019. Turn feedback into action. https://www.surveymonkey.com/. [Online; accessed 18-Dec-2019].",
      "doi": ""
    },
    {
      "text": "Sereen Thaddeus and Deborah Maine. 1994. Too far to walk: maternal mortality in context. Social science & medicine 38, 8 (1994), 1091–1110.",
      "doi": ""
    },
    {
      "text": "Sai Krishna Tikka, Sonia Parial, Amrit Pattojoshi, Ashlesha Bagadia, Chandni Prakash, Deyashini Lahiri, Jyoti Jaiswal, Manju Puri, Prerna Kukreti, Rabindra Nath Behera, 2021. Anxiety among pregnant women during the COVID-19 pandemic in India- A multicentric study. Asian journal of psychiatry 66 (2021), 102880.",
      "doi": ""
    },
    {
      "text": "Austin L Toombs, Kellie Morrissey, Emma Simpson, Colin M Gray, John Vines, and Madeline Balaam. 2018. Supporting the complex social lives of new parents. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3173574.3173994"
    },
    {
      "text": "Sarah E Van Ness, Ankit Chandra, Sonali Sarkar, Jane Pleskunas, Jerrold J Ellner, Gautam Roy, Subitha Lakshminarayanan, Swaroop Sahu, C Robert Horsburgh, Helen E Jenkins, 2017. Predictors of delayed care seeking for tuberculosis in southern India: an observational study. BMC infectious diseases 17, 1 (2017), 1–9.",
      "doi": ""
    },
    {
      "text": "Aditya Vashistha, Edward Cutrell, Gaetano Borriello, and William Thies. 2015. Sangeet Swara: A Community-Moderated Voice Forum in Rural India. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 417–426. https://doi.org/10.1145/2702123.2702191",
      "doi": "10.1145/2702123.2702191"
    },
    {
      "text": "Ding Wang, Santosh D Kale, and Jacki O’Neill. 2020. Please call the specialism: Using WeChat to support patient care in China. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3313831.3376274"
    },
    {
      "text": "Shabeer Ahmad Wani, Sari M Rabah, Sara AlFadil, Nancy Dewanjee, and Yahya Najmi. 2013. Efficacy of communication amongst staff members at plastic and reconstructive surgery section using smartphone and mobile WhatsApp. Indian Journal of Plastic Surgery 46, 03 (2013), 502–505.",
      "doi": ""
    },
    {
      "text": "Deepika Yadav, Anushka Bhandari, and Pushpendra Singh. 2019. LEAP: Scaffolding Collaborative Learning of Community Health Workers in India. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 169.",
      "doi": "10.1145/3359271"
    },
    {
      "text": "Deepika Yadav, Prerna Malik, Kirti Dabas, and Pushpendra Singh. 2019. Feedpal: Understanding Opportunities for Chatbots in Breastfeeding Education of Women in India. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 170.",
      "doi": "10.1145/3359272"
    },
    {
      "text": "Deepika Yadav, Pushpendra Singh, Kyle Montague, Vijay Kumar, Deepak Sood, Madeline Balaam, Drishti Sharma, Mona Duggal, Tom Bartindale, Delvin Varghese, 2017. Sangoshthi: Empowering Community Health Workers through Peer Learning in Rural India. In Proceedings of the 26th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, CHE, 499–508.",
      "doi": ""
    }
  ]
}