{
  "doi": "10.1145/3491102.3517520",
  "title": "Obfuscation Remedies Harms Arising from Content Flagging of Photos",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-25",
  "year": 2022,
  "badges": [],
  "abstract": "People share photos on Social Networks Sites, but at the same time want to keep some photo content private. This tension between sharing and privacy has led researchers to try to solve this problem, but without considering users’ needs. To fill this gap, we present a novel interface that expands privacy options beyond recipient-control (R). Our system can also flag sensitive content (C) and obfuscate (O) it (RCO). We then describe the results of a two-step experiment that compares RCO with two alternative interfaces - (R) which mimics existing SNS privacy options by providing recipient control, and a system that in addition to recipient control also flags sensitive content (RC). Results suggest RC performs worse than R regarding perceived privacy risks, willingness to share, and user experience. However, RCO, which provides obfuscation options, restores these metrics to the same levels as R. We conclude by providing insights on system implementation.",
  "authors": [
    {
      "name": "Yifang Li",
      "institution": "School of Computing, Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659175137",
      "orcid": "missing"
    },
    {
      "name": "Kelly Caine",
      "institution": "School of Computing, Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548023260",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2020. Photo self-Censorship on social networking sites. (2020). Under submission.",
      "doi": ""
    },
    {
      "text": "Paarijaat Aditya, Rijurekha Sen, Peter Druschel, Seong Joon Oh, Rodrigo Benenson, Mario Fritz, Bernt Schiele, Bobby Bhattacharjee, and Tong Tong Wu. 2016. I-pic: A platform for privacy-compliant image capture. In Proceedings of the 14th annual international conference on mobile systems, applications, and services. 235–248.",
      "doi": "10.1145/2906388.2906412"
    },
    {
      "text": "Shane Ahern, Dean Eckles, Nathaniel S Good, Simon King, Mor Naaman, and Rahul Nair. 2007. Over-exposed?: privacy patterns and considerations in online and mobile photo sharing. In Proceedings of the SIGCHI conference on Human factors in Computing Systems. ACM, 357–366.",
      "doi": "10.1145/1240624.1240683"
    },
    {
      "text": "Mary Jean Amon, Rakibul Hasan, Kurt Hugenberg, Bennett I Bertenthal, and Apu Kapadia. 2020. Influencing Photo Sharing Decisions on Social Media: A Case of Paradoxical Findings. In 2020 IEEE Symposium on Security and Privacy (SP). 79–95.",
      "doi": ""
    },
    {
      "text": "Gaurav Bansal, David Gefen, 2010. The impact of personal dispositions on information sensitivity, privacy concern and trust in disclosing health information online. Decision support systems 49, 2 (2010), 138–150.",
      "doi": ""
    },
    {
      "text": "Susan B Barnes. 2006. A privacy paradox: Social networking in the United States. First Monday 11, 9 (2006).",
      "doi": ""
    },
    {
      "text": "Andrew Besmer and Heather Richter Lipford. 2010. Moving beyond untagging: photo privacy in a tagged world. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1563–1572.",
      "doi": "10.1145/1753326.1753560"
    },
    {
      "text": "Danah Boyd and Eszter Hargittai. 2010. Facebook privacy settings: Who cares?First Monday 15, 8 (2010).",
      "doi": ""
    },
    {
      "text": "Thorben Burghardt, Andreas Walter, Erik Buchmann, and Klemens Böhm. 2008. Primo-towards privacy aware image sharing. In 2008 IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology, Vol. 3. IEEE, 21–24.",
      "doi": "10.1109/WIIAT.2008.23"
    },
    {
      "text": "Byebye Camera. 2020. Byebye Camera. Retrieved July 5, 2020 from https://apps.apple.com/us/app/bye-bye-camera/id1467903179.",
      "doi": ""
    },
    {
      "text": "Kelly Caine. 2016. Local standards for sample size at CHI. In Proceedings of the 2016 CHI conference on human factors in computing systems. 981–992.",
      "doi": "10.1145/2858036.2858498"
    },
    {
      "text": "Kelly Erinn Caine. 2009. Exploring everyday privacy behaviors and misclosures. Ph.D. Dissertation. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Mark G Core, H Chad Lane, Michael Van Lent, Dave Gomboc, Steve Solomon, and Milton Rosenberg. 2006. Building explainable artificial intelligence systems. In AAAI. 1766–1773.",
      "doi": ""
    },
    {
      "text": "David Crandall and Noah Snavely. 2012. Modeling people and places with internet photo collections. Commun. ACM 55, 6 (2012), 52–60.",
      "doi": "10.1145/2184319.2184336"
    },
    {
      "text": "Bernhard Debatin, Jennette P Lovejoy, Ann-Kathrin Horn, and Brittany N Hughes. 2009. Facebook and online privacy: Attitudes, behaviors, and unintended consequences. Journal of computer-mediated communication 15, 1 (2009), 83–108.",
      "doi": ""
    },
    {
      "text": "Christine DiStefano, Min Zhu, and Diana Mindrila. 2009. Understanding and using factor scores: Considerations for the applied researcher. Practical Assessment, Research, and Evaluation 14, 1(2009), 20.",
      "doi": ""
    },
    {
      "text": "J. B. Djoko, J. Lange, and A. J. Lee. 2019. NeXUS: Practical and Secure Access Control on Untrusted Storage Platforms using Client-Side SGX. In 2019 49th Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN). 401–413.",
      "doi": ""
    },
    {
      "text": "Derek Doran, Sarah Schulz, and Tarek R Besold. 2017. What does explainable AI really mean? A new conceptualization of perspectives. arXiv preprint arXiv:1710.00794(2017).",
      "doi": ""
    },
    {
      "text": "Emília Duarte, Francisco Rebelo, Júlia Teles, and Michael S Wogalter. 2012. A personalized speech warning facilitates compliance in an immersive virtual environment. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 56. SAGE Publications Sage CA: Los Angeles, CA, 2045–2049.",
      "doi": ""
    },
    {
      "text": "Catherine Dwyer, Starr Hiltz, and Katia Passerini. 2007. Trust and privacy concern within social networking sites: A comparison of Facebook and MySpace. AMCIS 2007 proceedings(2007), 339.",
      "doi": ""
    },
    {
      "text": "Nicole B Ellison, Jessica Vitak, Charles Steinfield, Rebecca Gray, and Cliff Lampe. 2011. Negotiating privacy concerns and social capital needs in a social media environment. In Privacy online. Springer, 19–32.",
      "doi": ""
    },
    {
      "text": "Lujun Fang and Kristen LeFevre. 2010. Privacy wizards for social networking sites. In Proceedings of the 19th international conference on World wide web. 351–360.",
      "doi": "10.1145/1772690.1772727"
    },
    {
      "text": "Liang Fang, Lihua Yin, Qiaoduo Zhang, Fenghua Li, and Binxing Fang. 2017. Who Is Visible: Resolving Access Policy Conflicts in Online Social Networks. In GLOBECOM 2017-2017 IEEE Global Communications Conference. IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Mauricio S Featherman and Paul A Pavlou. 2003. Predicting e-services adoption: a perceived risk facets perspective. International journal of human-computer studies 59, 4 (2003), 451–474.",
      "doi": "10.1016/S1071-5819%2803%2900111-3"
    },
    {
      "text": "Ricard L Fogues, Jose M Such, Agustin Espinosa, and Ana Garcia-Fornes. 2017. Exploring the viability of tie strength and tags in access controls for photo sharing. In Proceedings of the Symposium on Applied Computing. ACM, 1082–1085.",
      "doi": "10.1145/3019612.3019909"
    },
    {
      "text": "Kambiz Ghazinour and John Ponchak. 2017. Hidden Privacy Risks in Sharing Pictures on Social Media. Procedia Computer Science 113 (2017), 267–272.",
      "doi": ""
    },
    {
      "text": "Pulkit Goyal, Sapan Diwakar, 2010. Fast and enhanced algorithm for exemplar based image inpainting. In Image and Video Technology (PSIVT), 2010 Fourth Pacific-Rim Symposium on. IEEE, 325–330.",
      "doi": ""
    },
    {
      "text": "Rakibul Hasan, David Crandall, Mario Fritz, and Apu Kapadia. 2020. Automatically Detecting Bystanders in Photos to Reduce Privacy Risks. (2020).",
      "doi": ""
    },
    {
      "text": "Rakibul Hasan, Eman Hassan, Yifang Li, Kelly Caine, David J Crandall, Roberto Hoyle, and Apu Kapadia. 2018. Viewer experience of obscuring scene elements in photos to enhance privacy. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 47.",
      "doi": "10.1145/3173574.3173621"
    },
    {
      "text": "Rakibul Hasan, Yifang Li, Eman Hassan, Kelly Caine, David J Crandall, Roberto Hoyle, and Apu Kapadia. 2019. Can privacy be satisfying? on improving viewer satisfaction for privacy-enhanced photos using aesthetic transforms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300597"
    },
    {
      "text": "Rakibul Hasan, Patrick Shaffer, David Crandall, Eman T Apu Kapadia, 2017. Cartooning for enhanced privacy in lifelogging and streaming videos. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition Workshops. 29–38.",
      "doi": ""
    },
    {
      "text": "Benjamin Henne, Maximilian Koch, and Matthew Smith. 2014. On the Awareness, Control and Privacy of Shared Photo Metadata. In International Conference on Financial Cryptography and Data Security. Springer, 77–88.",
      "doi": ""
    },
    {
      "text": "Benjamin Henne, Christian Szongott, and Matthew Smith. 2013. SnapMe if you can: privacy threats of other peoples’ geo-tagged media and what we can do about it. In Proceedings of the sixth ACM conference on Security and privacy in wireless and mobile networks. 95–106.",
      "doi": "10.1145/2462096.2462113"
    },
    {
      "text": "Nicola Henry, Anastasia Powell, and Asher Flynn. 2018. AI can now create fake porn, making revenge porn even more complicated. The Conversation 28(2018).",
      "doi": ""
    },
    {
      "text": "Roberto Hoyle, Robert Templeman, Denise Anthony, David Crandall, and Apu Kapadia. 2015. Sensitive lifelogs: A privacy analysis of photos from wearable cameras. In Proceedings of the 33rd Annual ACM conference on Human Factors in Computing Systems. ACM, 1645–1648.",
      "doi": "10.1145/2702123.2702183"
    },
    {
      "text": "Panagiotis Ilia, Iasonas Polakis, Elias Athanasopoulos, Federico Maggi, and Sotiris Ioannidis. 2015. Face/off: Preventing privacy leakage from photos in social networks. In Proceedings of the 22nd ACM SIGSAC Conference on Computer and Communications Security. ACM, 781–792.",
      "doi": "10.1145/2810103.2813603"
    },
    {
      "text": "Instagram. 2020. Imma Instagram. Retrieved July 5, 2020 from https://www.instagram.com/imma.gram/?hl=en.",
      "doi": ""
    },
    {
      "text": "Harvey Jones and José Hiram Soltren. 2005. Facebook: Threats to privacy. Project MAC: MIT Project on Mathematics and Computing 1 (2005), 1–76.",
      "doi": ""
    },
    {
      "text": "Sanjay Kairam, Joseph’Jofish’ Kaye, John Alexis Guerra-Gomez, and David A Shamma. 2016. Snap decisions?: How users, content, and aesthetics interact to shape photo sharing behaviors. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 113–124.",
      "doi": "10.1145/2858036.2858451"
    },
    {
      "text": "John F Kelley. 2018. Wizard of Oz (WoZ) a yellow brick journey. Journal of Usability Studies 13, 3 (2018), 119–124.",
      "doi": "10.5555/3294033.3294034"
    },
    {
      "text": "Dan J Kim, Donald L Ferrin, and H Raghav Rao. 2009. Trust and satisfaction, two stepping stones for successful e-commerce relationships: A longitudinal exploration. Information systems research 20, 2 (2009), 237–257.",
      "doi": ""
    },
    {
      "text": "Peter Klemperer, Yuan Liang, Michelle Mazurek, Manya Sleeper, Blase Ur, Lujo Bauer, Lorrie Faith Cranor, Nitin Gupta, and Michael Reiter. 2012. Tag, you can see it!: Using tags for access control in photo sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 377–386.",
      "doi": "10.1145/2207676.2207728"
    },
    {
      "text": "Bart Piet Knijnenburg. 2015. A user-tailored approach to privacy decision support. Ph.D. Dissertation. UC Irvine.",
      "doi": ""
    },
    {
      "text": "Bart Piet Knijnenburg and Alfred Kobsa. 2014. Increasing sharing tendency without reducing satisfaction: finding the best privacy-settings user interface for social networks. (2014).",
      "doi": ""
    },
    {
      "text": "Bart P Knijnenburg, Martijn C Willemsen, Zeno Gantner, Hakan Soncu, and Chris Newell. 2012. Explaining the user experience of recommender systems. User Modeling and User-Adapted Interaction 22, 4-5 (2012), 441–504.",
      "doi": "10.1007/s11257-011-9118-4"
    },
    {
      "text": "Mohammed Korayem, Robert Templeman, Dennis Chen, David Crandall, and Apu Kapadia. 2016. Enhancing lifelogging privacy by detecting screens. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 4309–4314.",
      "doi": "10.1145/2858036.2858417"
    },
    {
      "text": "Haein Lee, Hyejin Park, and Jinwoo Kim. 2013. Why do people share their context information on Social Network Services? A qualitative study and an experimental study on users’ behavior of balancing perceived benefit and risk. International Journal of Human-Computer Studies 71, 9 (2013), 862–877.",
      "doi": "10.1016/j.ijhcs.2013.01.005"
    },
    {
      "text": "Kun Chang Lee and Namho Chung. 2009. Understanding factors affecting trust in and satisfaction with mobile banking in Korea: A modified DeLone and McLean’s model perspective. Interacting with computers 21, 5-6 (2009), 385–392.",
      "doi": ""
    },
    {
      "text": "Congcong Li, Alexander C Loui, and Tsuhan Chen. 2010. Towards aesthetics: A photo quality assessment and photo selection system. In Proceedings of the 18th ACM international conference on Multimedia. ACM, 827–830.",
      "doi": "10.1145/1873951.1874089"
    },
    {
      "text": "Fenghua Li, Zhe Sun, Ang Li, Ben Niu, Hui Li, and Guohong Cao. 2019. HideMe: privacy-preserving photo sharing on social networks. In IEEE INFOCOM 2019-IEEE Conference on Computer Communications. IEEE, 154–162.",
      "doi": "10.1109/INFOCOM.2019.8737466"
    },
    {
      "text": "Fenghua Li, Zhe Sun, Ben Niu, Jin Cao, and Hui Li. 2019. An Extended Control Framework for Privacy-Preserving Photo Sharing across Different Social Networks. In 2019 International Conference on Computing, Networking and Communications (ICNC). IEEE, 390–394.",
      "doi": ""
    },
    {
      "text": "Wenjie Li, Rongrong Ni, and Yao Zhao. 2017. JPEG Photo Privacy-Preserving Algorithm Based on Sparse Representation and Data Hiding. In International Conference on Image and Graphics. Springer, 575–586.",
      "doi": ""
    },
    {
      "text": "Yifang Li, Nishant Vishwamitra, Hongxin Hu, and Kelly Caine. 2020. Towards A Taxonomy of Content Sensitivity and Sharing Preferences for Photos. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376498"
    },
    {
      "text": "Yifang Li, Nishant Vishwamitra, Hongxin Hu, Bart P Knijnenburg, and Kelly Caine. 2017. Effectiveness and users’ experience of face blurring as a privacy protection for sharing photos via online social networks. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 61. SAGE Publications Sage CA: Los Angeles, CA, 803–807.",
      "doi": ""
    },
    {
      "text": "Yifang Li, Nishant Vishwamitra, Bart P. Knijnenburg, Hongxin Hu, and Kelly Caine. 2017. Effectiveness and users’ experience of obfuscation as a privacy-enhancing technology for sharing photos. Proceedings of the ACM on Human-Computer Interaction 1, 2(2017).",
      "doi": "10.1145/3134702"
    },
    {
      "text": "Tsung-Yi Lin, Michael Maire, Serge Belongie, James Hays, Pietro Perona, Deva Ramanan, Piotr Dollár, and C Lawrence Zitnick. 2014. Microsoft coco: Common objects in context. In European conference on computer vision. Springer, 740–755.",
      "doi": ""
    },
    {
      "text": "Yu-Lun Liu, Wei-Sheng Lai, Ming-Hsuan Yang, Yung-Yu Chuang, and Jia-Bin Huang. 2020. Learning to See Through Obstructions. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 14215–14224.",
      "doi": ""
    },
    {
      "text": "Naresh K Malhotra, Sung S Kim, and James Agarwal. 2004. Internet users’ information privacy concerns (IUIPC): The construct, the scale, and a causal model. Information systems research 15, 4 (2004), 336–355.",
      "doi": ""
    },
    {
      "text": "Jeremy Mendel, Christopher B Mayhorn, Jefferson B Hardee, Ryan T West, and Richard Pak. 2010. The effect of warning design and personalization on user compliance in computer security dialogs. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 54. SAGE Publications Sage CA: Los Angeles, CA, 1961–1965.",
      "doi": ""
    },
    {
      "text": "Miriam J Metzger. 2004. Privacy, trust, and disclosure: Exploring barriers to electronic commerce. Journal of computer-mediated communication 9, 4 (2004), JCMC942.",
      "doi": ""
    },
    {
      "text": "Caroline Lancelot Miltgen and Dominique Peyrat-Guillard. 2014. Cultural and generational influences on privacy concerns: a qualitative study in seven European countries. European Journal of Information Systems 23, 2 (2014), 103–125.",
      "doi": ""
    },
    {
      "text": "Sucheta Nadkarni and Reetika Gupta. 2007. A task-based model of perceived website complexity. Mis Quarterly (2007), 501–524.",
      "doi": ""
    },
    {
      "text": "Sophie J Nightingale, Kimberley A Wade, and Derrick G Watson. 2017. Can people identify original and manipulated photos of real-world scenes?Cognitive research: principles and implications 2, 1(2017), 30.",
      "doi": ""
    },
    {
      "text": "Angelo Nodari, Marco Vanetti, and Ignazio Gallo. 2012. Digital privacy: Replacing pedestrians from google street view images. In Pattern Recognition (ICPR), 2012 21st International Conference on. IEEE, 2889–2893.",
      "doi": ""
    },
    {
      "text": "Patricia A Norberg, Daniel R Horne, and David A Horne. 2007. The privacy paradox: Personal information disclosure intentions versus behaviors. Journal of consumer affairs 41, 1 (2007), 100–126.",
      "doi": "10.1111/j.1745-"
    },
    {
      "text": "Anne Oeldorf-Hirsch and S Shyam Sundar. 2010. Online photo sharing as mediated communication. In annual conference of the International Communication Association, Singapore.",
      "doi": ""
    },
    {
      "text": "Alexandra-Mihaela Olteanu, Kévin Huguenin, Italo Dacosta, and J-P Hubaux. 2018. Consensual and privacy-preserving sharing of multi-subject and interdependent data. In Proceedings of the 25th Network and Distributed System Security Symposium (NDSS). Internet Society, 1–16.",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2018. Internet/Broadband Fact Sheet. Retrieved February, 2019 from http://www.pewinternet.org/fact-sheet/internet-broadband/.",
      "doi": ""
    },
    {
      "text": "Joseph Phelps, Glen Nowak, and Elizabeth Ferrell. 2000. Privacy concerns and consumer willingness to provide personal information. Journal of public policy & marketing 19, 1 (2000), 27–41.",
      "doi": ""
    },
    {
      "text": "Florian Schaub, Rebecca Balebako, Adam L Durity, and Lorrie Faith Cranor. 2015. A design space for effective privacy notices. In Eleventh Symposium On Usable Privacy and Security ({SOUPS} 2015). 1–17.",
      "doi": ""
    },
    {
      "text": "Aaron Sedley and Hendrik Müller. 2013. Minimizing change aversion for the google drive launch. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. 2351–2354.",
      "doi": ""
    },
    {
      "text": "Sadia Shamma and Md Yusuf Sarwar Uddin. 2014. Towards privacy-aware photo sharing using mobile phones. In Electrical and Computer Engineering (ICECE), 2014 International Conference on. IEEE, 449–452.",
      "doi": ""
    },
    {
      "text": "Jiayu Shu, Rui Zheng, and Pan Hui. 2018. Cardea: context-aware visual privacy protection for photo taking and sharing. In Proceedings of the 9th ACM Multimedia Systems Conference. ACM, 304–315.",
      "doi": "10.1145/3204949.3204973"
    },
    {
      "text": "Manya Sleeper, Rebecca Balebako, Sauvik Das, Amber Lynn McConahy, Jason Wiese, and Lorrie Faith Cranor. 2013. The post that wasn’t: exploring self-censorship on facebook. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 793–802.",
      "doi": "10.1145/2441776.2441865"
    },
    {
      "text": "Agrima Srivastava and G Geethakumari. 2014. A privacy settings recommender system for online social networks. In Recent Advances and Innovations in Engineering (ICRAIE), 2014. IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "David L Streiner. 2005. Finding our way: an introduction to path analysis. The Canadian Journal of Psychiatry 50, 2 (2005), 115–122.",
      "doi": ""
    },
    {
      "text": "Fred Stutzman and Jacob Kramer-Duffield. 2010. Friends only: examining a privacy-enhancing behavior in facebook. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 1553–1562.",
      "doi": "10.1145/1753326.1753559"
    },
    {
      "text": "Jose M Such, Joel Porter, Sören Preibusch, and Adam Joinson. 2017. Photo privacy conflicts in social media: A large-scale empirical study. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3821–3832.",
      "doi": "10.1145/3025453.3025668"
    },
    {
      "text": "Weiwei Sun, Jiantao Zhou, Ran Lyu, and Shuyuan Zhu. 2016. Processing-aware privacy-preserving photo sharing over online social networks. In Proceedings of the 24th ACM international conference on Multimedia. 581–585.",
      "doi": "10.1145/2964284.2967288"
    },
    {
      "text": "Matt Tierney, Ian Spiro, Christoph Bregler, and Lakshminarayanan Subramanian. 2013. Cryptagram: photo privacy for online social media. In Proceedings of the first ACM conference on Online social networks. ACM, 75–88.",
      "doi": "10.1145/2512938.2512939"
    },
    {
      "text": "Cody Toombs. 2017. Snapseed v2.17 adds tools to make wild facial adjustments, create double exposures, and more. Blog. http://www.androidpolice.com/2017/03/22/snapseed-v2-17-adds-tools-to-make-wild-facial-adjustments-create-double-exposures-and-more-apk-download/.",
      "doi": ""
    },
    {
      "text": "Joanne R Ullman and N Clayton Silver. 2018. Perceived Effectiveness of Potential Music Piracy Warnings. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 62. SAGE Publications Sage CA: Los Angeles, CA, 1353–1357.",
      "doi": ""
    },
    {
      "text": "Nishant Vishwamitra, Yifang Li, Kevin Wang, Hongxin Hu, Kelly Caine, and Gail-Joon Ahn. 2017. Towards PII-based Multiparty Access Control for Photo Sharing in Online Social Networks. In Proceedings of the 22nd ACM on Symposium on Access Control Models and Technologies. ACM, 155–166.",
      "doi": "10.1145/3078861.3078875"
    },
    {
      "text": "Robin Wakefield. 2013. The influence of user affect in online information disclosure. The Journal of Strategic Information Systems 22, 2 (2013), 157–174.",
      "doi": "10.1016/j.jsis.2013.01.003"
    },
    {
      "text": "Yang Wang, Pedro Giovanni Leon, Kevin Scott, Xiaoxuan Chen, Alessandro Acquisti, and Lorrie Faith Cranor. 2013. Privacy nudges for social media: an exploratory Facebook study. In Proceedings of the 22nd International Conference on World Wide Web. 763–770.",
      "doi": "10.1145/2487788.2488038"
    },
    {
      "text": "Stephen G West, Aaron B Taylor, Wei Wu, 2012. Model fit and model selection in structural equation modeling. Handbook of structural equation modeling 1 (2012), 209–231.",
      "doi": ""
    },
    {
      "text": "Heng Xu. 2007. The effects of self-construal and perceived control on privacy concerns. ICIS 2007 proceedings(2007), 125.",
      "doi": ""
    },
    {
      "text": "Kaihe Xu, Yuanxiong Guo, Linke Guo, Yuguang Fang, and Xiaolin Li. 2017. My privacy my decision: Control of photo sharing on online social networks. IEEE Transactions on Dependable and Secure Computing 14, 2 (2017), 199–210.",
      "doi": "10.1109/TDSC.2015.2443795"
    },
    {
      "text": "Alyson Leigh Young and Anabel Quan-Haase. 2013. Privacy protection strategies on Facebook: The Internet privacy paradox revisited. Information, Communication & Society 16, 4 (2013), 479–500.",
      "doi": ""
    },
    {
      "text": "Xiaoyi Yu, Kenta Chinomi, Takashi Koshimizu, Naoko Nitta, Yoshimichi Ito, and Noboru Babaguchi. 2008. Privacy protecting visual processing for secure video surveillance. In Image Processing, 2008. ICIP 2008. 15th IEEE International Conference on. IEEE, 1672–1675.",
      "doi": ""
    },
    {
      "text": "Lin Yuan, Pavel Korshunov, and Touradj Ebrahimi. 2015. Secure JPEG scrambling enabling privacy in photo sharing. In Automatic Face and Gesture Recognition (FG), 2015 11th IEEE International Conference and Workshops on, Vol. 4. IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Sergej Zerr, Stefan Siersdorfer, and Jonathon Hare. 2012. PicAlert! a system for privacy-aware image classification and retrieval. In Proceedings of the 21st ACM international conference on Information and knowledge management. 2710–2712.",
      "doi": ""
    }
  ]
}