{
  "doi": "10.1145/3491102.3517557",
  "title": "A Study of Solar Cooking: Exploring Climate-Resilient Food Preparation and Opportunities for HCI",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 2022,
  "badges": [],
  "abstract": "As parts of our planet continue to experience extreme heat waves, it is more urgent than ever for human-food interaction research to examine climate-resilient and sustainable food practices. Our work, conducted in the hottest city in the USA, focuses on solar cooking as a set of creative DIY activities that use extreme heat and mitigate human impact on the environment. We report on a summer-long study whereby 7 enthusiasts built solar ovens from scratch and experimented with solar recipes ranging from slow-cooked pork and chicken to bread, kale chips, brownies, jerky, and fruit rollups. Our findings depict solar cooking as a form of iterative DIY, which, through its challenges and creative workarounds, serves as a point of engagement with both food and extreme heat. We reflect on solar cooking as a climate-resilient food practice and conclude with design considerations for HCI to support solar cooking as a habitual community practice.",
  "tags": [
    "sustainable HCI",
    "food science",
    "DIY",
    "Solar cooking"
  ],
  "authors": [
    {
      "name": "Stacey Kuznetsov",
      "institution": "School of Arts, Media, and Engineering, Arizona State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338489421",
      "orcid": "missing"
    },
    {
      "name": "Alejandra Rodriguez Vega",
      "institution": "Arizona State University, United States",
      "img": "/do/10.1145/contrib-99659442401/rel-imgonly/ale_headshot_2022.jpg",
      "acmid": "99659442401",
      "orcid": "missing"
    },
    {
      "name": "Elenore Long",
      "institution": "Department of English, Arizona State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021732",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "All American Sun Oven. https://www.sunoven.com/product/all-american-sun-oven/",
      "doi": ""
    },
    {
      "text": "Lorraine Anderson, Rick Palkovic. Cooking with Sunshine: The Complete Guide to Solar Cuisine with 150 Easy Sun-Cooked Recipes. Da Capo Press; 2nd edition (May 26, 2006)",
      "doi": ""
    },
    {
      "text": "Sharon Baurley, Bruna Petreca, Paris Selinas, Mark Selby, and Martin Flintham. 2020. Modalities of Expression: Capturing Embodied Knowledge in Cooking. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '20). Association for Computing Machinery, New York, NY, USA, 785–797. DOI:https://doi.org/10.1145/3374920.3375005",
      "doi": "10.1145/3374920.3375005"
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, and Austin Toombs. 2014. \"now that's definitely a proper hack\": self-made tools in hackerspaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 473-476.",
      "doi": "10.1145/2556288.2557221"
    },
    {
      "text": "Brandes, U., Stich, S., and Wender, M. Design by Use. Birkhäuser, 2009.",
      "doi": ""
    },
    {
      "text": "Brynjarsdottir, H., Håkansson, M., Pierce, J., Baumer, E., DiSalvo, C., Sengers, P. 2012. Sustainably unpersuaded: how persuasion narrows our vision of sustainability. CHI '12, 947-956.",
      "doi": ""
    },
    {
      "text": "Minsuk Chang, Leonore V. Guillain, Hyeungshik Jung, Vivian M. Hare, Juho Kim, and Maneesh Agrawala. 2018. RecipeScape: An Interactive Tool for Analyzing Cooking Instructions at Scale. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Paper 451, 1–12. DOI:https://doi.org/10.1145/3173574.3174025",
      "doi": "10.1145/3173574.3174025"
    },
    {
      "text": "Jaz Hee-jeong Choi, Conor Linehan, Rob Comber, and John McCarthy. 2012. Food for thought: designing for critical reflection on food practices. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, New York, NY, USA, 793-794. ",
      "doi": "10.1145/2317956.2318077"
    },
    {
      "text": "Adrian K. Clear, Rob Comber, Adrian Friday, Eva Ganglbauer, Mike Hazas, and Yvonne Rogers. 2013. Green food technology: UbiComp opportunities for reducing the environmental impacts of food. In Proceedings of the 2013 ACM conference on Pervasive and ubiquitous computing adjunct publication (UbiComp '13 Adjunct). ACM, New York, NY, USA, 553-558. ",
      "doi": "10.1145/2494091.2497316"
    },
    {
      "text": "Adrian K. Clear, Mike Hazas, Janine Morley, Adrian Friday, and Oliver Bates. 2013. Domestic food and sustainable design: a study of university student cooking and its impacts. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2447–2456. DOI:https://doi.org/10.1145/2470654.2481339",
      "doi": "10.1145/2470654.2481339"
    },
    {
      "text": "Rob Comber, Eva Ganglbauer, Jaz Hee-jeong Choi, Jettie Hoonhout, Yvonne Rogers, Kenton O'Hara, and Julie Maitland. 2012. Food and interaction design: designing for food in everyday life. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 2767-2770.",
      "doi": "10.1145/2212776.2212716"
    },
    {
      "text": "CooKit on Solar Cookers International. https://www.solarcookers.org/resources/cookit-purchase",
      "doi": ""
    },
    {
      "text": "Jialin Deng, Yan Wang, Carlos Velasco, Ferran Altarriba Altarriba Bertran, Rob Comber, Marianna Obrist, Katherine Isbister, Charles Spence, and Florian 'Floyd' Mueller. 2021. The Future of Human-Food Interaction. Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 100, 1–6. DOI:https://doi.org/10.1145/3411763.3441312",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Laura Fries, Thomas Lodato, Beth Schechter, Thomas Barnwell. GrowBot Garden. http://carldisalvo.com/posts/growbot-garden/",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). Association for Computing Machinery, New York, NY, USA, 1975–1984.",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Marketa Dolejsova. 2018. Edible Speculations in the Parlour of Food Futures. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). Association for Computing Machinery, New York, NY, USA, Paper alt13, 1–10. DOI:https://doi.org/10.1145/3170427.3188406",
      "doi": ""
    },
    {
      "text": "Markéta Dolejšová, Sjef van Gaalen, Danielle Wilde, Paul Graham Raven, Sara Heitlinger, and Ann Light. 2020. Designing with More-than-Human Food Practices for Climate-Resilience. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference (DIS' 20 Companion). Association for Computing Machinery, New York, NY, USA, 381–384. DOI:https://doi-org.ezproxy1.lib.asu.edu/10.1145/3393914.3395909",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2010. HCI and environmental sustainability: the politics of design and the design of politics. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, New York, NY, USA, 1-10.",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Froehlich, J., Findlater, L., Landay, J. 2010. The design of eco-feedback technology. CHI '10, 1999-2008.",
      "doi": ""
    },
    {
      "text": "Verena Fuchsberger, Martin Murer, Manfred Tscheligi, Silvia Lindtner, Shaowen Bardzell, Jeffrey Bardzell, Andreas Reiter, and Pernille Bjorn. 2016. Fabrication & HCI: Hobbyist Making, Industrial Production, and Beyond. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 3550-3557.",
      "doi": "10.1145/2851581.2856491"
    },
    {
      "text": "GoSun products. https://gosun.co/products/",
      "doi": ""
    },
    {
      "text": "Håkansson, M., Sengers, P. 2013. Beyond being green: simple living families and ICT. CHI '13, 2725-2734.",
      "doi": ""
    },
    {
      "text": "Sara Heitlinger, Lara Houston, Alex Taylor, and Ruth Catlow. 2021. Algorithmic Food Justice: Co-Designing More-than-Human Blockchain Futures for the Food Commons. In CHI Conference on Human Factors in Computing Systems (CHI ’21), May 08–13, 2021, Yokohama, Japan. ACM, New York, NY, USA, 17 pages. https://doi.org/10.1145/3411764.3445655",
      "doi": ""
    },
    {
      "text": "Tad Hirsch, Phoebe Sengers, Eli Blevis, Richard Beckwith, and Tapan Parikh. 2010. Making food, producing sustainability. In CHI '10 Extended Abstracts on Human Factors in Computing Systems(CHI EA '10). ACM, New York, NY, USA, 3147-3150. ",
      "doi": "10.1145/1753846.1753939"
    },
    {
      "text": "IPCC, 2021: Climate Change 2021: The Physical Science Basis. Contribution of Working Group I to the Sixth Assessment Report of the Intergovernmental Panel on Climate Change [Masson-Delmotte, V., P. Zhai, A. Pirani, S. L. Connors, C. Péan, S. Berger, N. Caud, Y. Chen, L. Goldfarb, M. I. Gomis, M. Huang, K. Leitzell, E. Lonnoy, J. B. R. Matthews, T. K. Maycock, T. Waterfield, O. Yelekçi, R. Yu and B. Zhou (eds.)]. Cambridge University Press. In Press.",
      "doi": ""
    },
    {
      "text": "Wendy Ju, Rebecca Hurwitz, Tilke Judd, and Bonny Lee. 2001. CounterActive: an interactive cookbook for the kitchen counter. In CHI '01 Extended Abstracts on Human Factors in Computing Systems (CHI EA '01). ACM, New York, NY, USA, 269-270. ",
      "doi": "10.1145/634067.634227"
    },
    {
      "text": "Hyangah Kim and Woohun Lee. 2012. Framing creative uses for describing cases of appropriation. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work Companion (CSCW '12). ACM, New York, NY, USA, 135-138. ",
      "doi": "10.1145/2141512.2141561"
    },
    {
      "text": "Klein, R.J.T. 2007. Inter-relationships between adaptation and mitigation. Climate Change 2007: Impacts, Adaptation and Vulnerability. (M.L. Parry Eds.). Cambridge University Press, Cambridge, UK, and New York, N.Y., U.S.A.",
      "doi": ""
    },
    {
      "text": "Knowles, B., Blair, L., Coulton, P., Lochrie, M. 2014. Rethinking plan A for sustainable HCI. CHI '14, 3593-3596.",
      "doi": ""
    },
    {
      "text": "Stacey Kuznetsov, Christina J. Santana, Elenore Long, Rob Comber, and Carl DiSalvo. 2016. The Art of Everyday Food Science: Foraging for Design Opportunities. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 3516-3523.",
      "doi": "10.1145/2851581.2856483"
    },
    {
      "text": "Odom, W., Banks, R., Durrant, A., Kirk, D., Pierce, J. 2012. Slow technology: critical reflection and future directions. DIS '12, 816-817.",
      "doi": ""
    },
    {
      "text": "Lora Oehlberg, Wesley Willett, and Wendy E. Mackay. 2015. Patterns of Physical Design Remixing in Online Maker Communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 639-648.",
      "doi": ""
    },
    {
      "text": "Panwar, N.L, S.C Kaushik, and Surendra Kothari. “State of the Art of Solar Cooking: An Overview.” Renewable & sustainable energy reviews 16, no. 6 (2012): 3776–3785.",
      "doi": ""
    },
    {
      "text": "Sebastian Prost, Clara Crivellaro, Andy Haddon, and Rob Comber. 2018. Food Democracy in the Making: Designing with Local Food Networks. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Paper 333, 1–14. DOI:https://doi.org/10.1145/3173574.3173907",
      "doi": "10.1145/3173574.3173907"
    },
    {
      "text": "Sebastian Prost, Irina Pavlovskaya, Kahina Meziant, Vasilis Vlachokyriakos, and Clara Crivellaro. 2021. Contact Zones: Designing for More-than-Human Food Relations. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 47 (April 2021), 24 pages. DOI:https://doi-org.ezproxy1.lib.asu.edu/10.1145/3449121",
      "doi": "10.1145/3449121"
    },
    {
      "text": "Ankita Raturi, Juliet Norton, Bill Tomlinson, Eli Blevis, and Lynn Dombrowski. 2017. Designing Sustainable Food Systems. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). Association for Computing Machinery, New York, NY, USA, 609–616. DOI:https://doi.org/10.1145/3027063.3027075",
      "doi": "10.1145/3027063.3027075"
    },
    {
      "text": "Recipes. https://www.sunoven.com/sun-cooking-usa/how-to-use/recipes/",
      "doi": ""
    },
    {
      "text": "Recipes on Solar Cookers International. https://solarcooking.fandom.com/wiki/Recipes",
      "doi": ""
    },
    {
      "text": "Daniela Rosner and Jonathan Bean. 2009. Learning from IKEA hacking: i'm not one to decoupage a tabletop and call it a day. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 419-422. ",
      "doi": "10.1145/1518701.1518768"
    },
    {
      "text": "Solar Cooker Plans. https://solarcooking.fandom.com/wiki/Category:Solar_cooker_plans",
      "doi": ""
    },
    {
      "text": "Solar Cookers World Network on Facebook. https://www.facebook.com/groups/scwnet",
      "doi": ""
    },
    {
      "text": "Solar Oven. A collection of designs on Instructables. https://www.instructables.com/Solar-Oven-2/",
      "doi": ""
    },
    {
      "text": "Theresa Jean Tanenbaum, Karen Tanenbaum, and Ron Wakkary. 2012. Design fictions. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12), Stephen N. Spencer (Ed.). ACM, New York, NY, USA, 347-350.",
      "doi": "10.1145/2148131.2148214"
    },
    {
      "text": "Theresa Jean Tanenbaum, Amanda M. Williams, Audrey Desjardins, and Karen Tanenbaum. 2013. Democratizing technology: pleasure, utility and expressiveness in DIY and maker practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2603-2612.",
      "doi": "10.1145/2470654.2481360"
    },
    {
      "text": "Torrey, C., McDonald, D. W., Schilit, B. N., Bly, S. How-To Pages: Informal Systems of Expertise Sharing. Proceedings of European Conference on Computer Supported Cooperative Work. Springer, 391–410, (2007).",
      "doi": ""
    },
    {
      "text": "Daisuke Uriu, Mizuki Namai, Satoru Tokuhisa, Ryo Kashiwagi, Masahiko Inami, and Naohito Okude. 2012. Panavi: recipe medium with a sensors-embedded pan for domestic users to master professional culinary arts. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 129–138. DOI:https://doi.org/10.1145/2207676.2207695",
      "doi": "10.1145/2207676.2207695"
    },
    {
      "text": "Viswanathan, V., & Linsey, J. (2011, January). Design fixation in physical modeling: an investigation on the role of sunk cost. In ASME 2011 International Design Engineering Technical Conferences and Computers and Information in Engineering Conference (pp. 119-130). American Societyof Mechanical Engineers.",
      "doi": ""
    },
    {
      "text": "Dhaval Vyas. 2012. Domestic artefacts: sustainability in the context of indian middle class. In Proceedings of the 4th international conference on Intercultural Collaboration (ICIC '12). ACM, New York, NY, USA, 119-128.",
      "doi": "10.1145/2160881.2160900"
    },
    {
      "text": "Ylipulli, J., Luusua, A., Kukka, H., Ojala, T. 2014. Winter is coming: introducing climate sensitive urban computing. DIS '14, 647-656. ",
      "doi": ""
    },
    {
      "text": "Wadley, G., Bumpus, A., Green, R. 2014. Citizen involvement in the design of technology for climate change adaptation projects in the Pacific. OzCHI’14.",
      "doi": ""
    },
    {
      "text": "Ron Wakkary and Leah Maestri. 2007. The resourcefulness of everyday design. In Proceedings of the 6th ACM SIGCHI conference on Creativity & cognition (C&C '07). ACM, New York, NY, USA, 163-172.",
      "doi": "10.1145/1254960.1254984"
    },
    {
      "text": "Ron Wakkary and Karen Tanenbaum. 2009. A sustainable identity: the creativity of an everyday designer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 365-374.",
      "doi": "10.1145/1518701.1518761"
    },
    {
      "text": "Tricia Wang and Joseph 'Jofish' Kaye. 2011. Inventive leisure practices: understanding hacking communities as sites of sharing and innovation. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, 263-272. ",
      "doi": "10.1145/1979742.1979615"
    },
    {
      "text": "Wilde, D., Dolejsova, M., van Gaalen, S., Altarriba Bertran, F., Davis, H., & Graham Raven, P. (2021). Troubling the Impact of Food Future Imaginaries. Nordes 2021. pp. 115-124",
      "doi": ""
    }
  ]
}