{
  "doi": "10.1145/3491102.3517486",
  "title": "Paper Trail: An Immersive Authoring System for Augmented Reality Instructional Experiences",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "Prior work has demonstrated augmented reality’s benefits to education, but current tools are difficult to integrate with traditional instructional methods. We present Paper Trail, an immersive authoring system designed to explore how to enable instructors to create AR educational experiences, leaving paper at the core of the interaction and enhancing it with various forms of digital media, animations for dynamic illustrations, and clipping masks to guide learning. To inform the system design, we developed five scenarios exploring the benefits that hand-held and head-worn AR can bring to STEM instruction and developed a design space of AR interactions enhancing paper based on these scenarios and prior work. Using the example of an AR physics handout, we assessed the system’s potential with PhD-level instructors and its usability with XR design experts. In an elicitation study with high-school teachers, we study how Paper Trail could be used and extended to enable flexible use cases across various domains. We discuss benefits of immersive paper for supporting diverse student needs and challenges for making effective use of AR for learning.",
  "tags": [
    "augmented reality",
    "STEM.",
    "immersive paper",
    "educational technology"
  ],
  "authors": [
    {
      "name": "Shwetha Rajaram",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529394",
      "orcid": "0000-0001-7645-4488"
    },
    {
      "name": "Michael Nebeling",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484640607",
      "orcid": "0000-0003-3743-2387"
    }
  ],
  "references": [
    {
      "text": "Michelle Annett, Tovi Grossman, Daniel J. Wigdor, and George W. Fitzmaurice. 2015. MoveableMaker: Facilitating the Design, Generation, and Assembly of Moveable Papercraft. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, UIST 2015, Charlotte, NC, USA, November 8-11, 2015. ACM, New York, NY, USA, 565–574. https://doi.org/10.1145/2807442.2807483",
      "doi": "10.1145/2807442.2807483"
    },
    {
      "text": "Narges Ashtari, Andrea Bunt, Joanna McGrenere, Michael Nebeling, and Parmit K. Chilana. 2020. Creating Augmented and Virtual Reality Applications: Current Practices, Challenges, and Opportunities. In CHI ’20: CHI Conference on Human Factors in Computing Systems, Honolulu, HI, USA, April 25-30, 2020. ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376722",
      "doi": ""
    },
    {
      "text": "Elham Beheshti, David Kim, Gabrielle Ecanow, and Michael S. Horn. 2017. Looking Inside the Wires: Understanding Museum Visitor Learning with an Augmented Circuit Exhibit. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, Denver, CO, USA, May 06-11, 2017. ACM, New York, NY, USA, 1583–1594. https://doi.org/10.1145/3025453.3025479",
      "doi": "10.1145/3025453.3025479"
    },
    {
      "text": "Olha Bondarenko and Ruud Janssen. 20. Documents at Hand: Learning from Paper to Improve Digital Technologies. In Proceedings of the 2005 Conference on Human Factors in Computing Systems, CHI 2005, Portland, Oregon, USA, April 2-7, 2005. ACM, New York, NY, USA, 121–130. https://doi.org/10.1145/1054972.1054990",
      "doi": "10.1145/1054972.1054990"
    },
    {
      "text": "Peter Brandl, Christoph Richter, and Michael Haller. 2010. NiCEBook: supporting natural note taking. In Proceedings of the 28th International Conference on Human Factors in Computing Systems, CHI 2010, Atlanta, Georgia, USA, April 10-15, 2010. ACM, New York, NY, USA, 599–608. https://doi.org/10.1145/1753326.1753417",
      "doi": "10.1145/1753326.1753417"
    },
    {
      "text": "John Brooke. 1995. SUS: A quick and dirty usability scale. Usability Eval. Ind. 189 (11 1995).",
      "doi": ""
    },
    {
      "text": "John M. Carroll. 1999. Five Reasons for Scenario-Based Design. In Proceedings of the Thirty-Second Annual Hawaii International Conference on System Sciences-Volume 3 - Volume 3(HICSS ’99). IEEE Computer Society, USA, 3051.",
      "doi": ""
    },
    {
      "text": "Peng Chen, Xiaolin Liu, Wei Cheng, and Ronghuai Huang. 2017. A review of using Augmented Reality in Education from 2011 to 2016. In Innovations in Smart Learning, Elvira Popescu, Kinshuk, Mohamed Koutheair Khribi, Ronghuai Huang, Mohamed Jemni, Nian-Shing Chen, and Demetrios G. Sampson (Eds.). Springer Singapore, Singapore, 13–18.",
      "doi": ""
    },
    {
      "text": "Zhutian Chen, Wai Tong, Qianwen Wang, Benjamin Bach, and Huamin Qu. 2020. Augmenting Static Visualizations with PapARVis Designer. In CHI ’20: CHI Conference on Human Factors in Computing Systems, Honolulu, HI, USA, April 25-30, 2020. ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376436",
      "doi": ""
    },
    {
      "text": "Stephanie Claudino Daffara, Anna Brewer, Balasaravanan Thoravi Kumaravel, and Bjoern Hartmann. 2020. Living Paper: Authoring AR Narratives Across Digital and Tangible Media. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems, CHI 2020, Honolulu, HI, USA, April 25-30, 2020. ACM, New York, NY, USA, 1–10. https://doi.org/10.1145/3334480.3383091",
      "doi": ""
    },
    {
      "text": "Nicola Dell, Vidya Vaidyanathan, Indrani Medhi, Edward Cutrell, and William Thies. 2012. ”Yours is better!”: participant response bias in HCI. In CHI Conference on Human Factors in Computing Systems, CHI ’12, Austin, TX, USA - May 05 - 10, 2012. ACM, New York, NY, USA, 1321–1330. https://doi.org/10.1145/2207676.2208589",
      "doi": "10.1145/2207676.2208589"
    },
    {
      "text": "Fiona Draxler, Audrey Labrie, Albrecht Schmidt, and Lewis L. Chuang. 2020. Augmented Reality to Enable Users in Learning Case Grammar from Their Real-World Interactions. In CHI ’20: CHI Conference on Human Factors in Computing Systems, Honolulu, HI, USA, April 25-30, 2020. ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376537",
      "doi": ""
    },
    {
      "text": "Maribeth Gandy and Blair MacIntyre. 2014. Designer’s augmented reality toolkit, ten years later: implications for new media authoring tools. In The 27th Annual ACM Symposium on User Interface Software and Technology, UIST ’14, Honolulu, HI, USA, October 5-8, 2014. ACM, New York, NY, USA, 627–636. https://doi.org/10.1145/2642918.2647369",
      "doi": "10.1145/2642918.2647369"
    },
    {
      "text": "Jérémie Garcia, Theophanis Tsandilas, Carlos Agón, and Wendy E. Mackay. 2014. Structured observation with polyphony: a multifaceted tool for studying music composition. In Designing Interactive Systems Conference 2014, DIS ’14, Vancouver, BC, Canada, June 21-25, 2014. ACM, New York, NY, USA, 199–208. https://doi.org/10.1145/2598510.2598512",
      "doi": "10.1145/2598510.2598512"
    },
    {
      "text": "Raphaël Grasset, Andreas Dünser, Hartmut Seichter, and Mark Billinghurst. 2007. The mixed reality book: a new multimedia reading experience. In Extended Abstracts Proceedings of the 2007 Conference on Human Factors in Computing Systems, CHI 2007, San Jose, California, USA, April 28 - May 3, 2007. ACM, New York, NY, USA, 1953–1958. https://doi.org/10.1145/1240866.1240931",
      "doi": "10.1145/1240866.1240931"
    },
    {
      "text": "François Guimbretière. 2003. Paper augmented digital documents. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology, Vancouver, Canada, November 2-5, 2003. ACM, New York, NY, USA, 51–60. https://doi.org/10.1145/964696.964702",
      "doi": "10.1145/964696.964702"
    },
    {
      "text": "Aakar Gupta, Bo Rui Lin, Siyi Ji, Arjav Patel, and Daniel Vogel. 2020. Replicate and Reuse: Tangible Interaction Design for Digitally-Augmented Physical Media Objects. In CHI ’20: CHI Conference on Human Factors in Computing Systems, Honolulu, HI, USA, April 25-30, 2020. ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376139",
      "doi": ""
    },
    {
      "text": "Feng Han, Yifei Cheng, Megan Strachan, and Xiaojuan Ma. 2021. Hybrid Paper-Digital Interfaces: A Systematic Literature Review. In DIS ’21: Designing Interactive Systems Conference 2021, Virtual Event, USA, 28 June, July 2, 2021. ACM, New York, NY, USA, 1087–1100. https://doi.org/10.1145/3461778.3462059",
      "doi": "10.1145/3461778.3462059"
    },
    {
      "text": "Rorik Henrikson, Bruno Rodrigues De Araújo, Fanny Chevalier, Karan Singh, and Ravin Balakrishnan. 2016. Multi-Device Storyboards for Cinematic Narratives in VR. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology, UIST 2016, Tokyo, Japan, October 16-19, 2016. ACM, New York, NY, USA, 787–796. https://doi.org/10.1145/2984511.2984539",
      "doi": "10.1145/2984511.2984539"
    },
    {
      "text": "Juan David Hincapié-Ramos, Sophie Roscher, Wolfgang Büschel, Ulrike Kister, Raimund Dachselt, and Pourang Irani. 2014. CAR: Contact Augmented Reality with Transparent-Display Mobile Devices. In Proceedings of The International Symposium on Pervasive Displays (Copenhagen, Denmark) (PerDis ’14). Association for Computing Machinery, New York, NY, USA, 80–85. https://doi.org/10.1145/2611009.2611014",
      "doi": "10.1145/2611009.2611014"
    },
    {
      "text": "David Holman, Roel Vertegaal, Mark Altosaar, Nikolaus F. Troje, and Derek Johns. 2005. Paper windows: interaction techniques for digital paper. In Proceedings of the 2005 Conference on Human Factors in Computing Systems, CHI 2005, Portland, Oregon, USA, April 2-7, 2005. ACM, New York, NY, USA, 591–599. https://doi.org/10.1145/1054972.1055054",
      "doi": "10.1145/1054972.1055054"
    },
    {
      "text": "Eva Hornecker and Thomas Psik. 2005. Using ARToolKit Markers to Build Tangible Prototypes and Simulate Other Technologies. In Human-Computer Interaction - INTERACT 2005, IFIP TC13 International Conference, Rome, Italy, September 12-16, 2005, Proceedings(Lecture Notes in Computer Science, Vol. 3585). Springer, Berlin, Heidelberg, 30–42. https://doi.org/10.1007/11555261_6",
      "doi": ""
    },
    {
      "text": "María-Blanca Ibáñez and Carlos Delgado-Kloos. 2018. Augmented reality for STEM learning: A systematic review. Computers & Education 123 (2018), 109–123. https://doi.org/10.1016/j.compedu.2018.05.002",
      "doi": "10.1016/j.compedu.2018.05.002"
    },
    {
      "text": "Annie Kelly, R. Benjamin Shapiro, Jonathan de Halleux, and Thomas Ball. 2018. ARcadia: A Rapid Prototyping Platform for Real-time Tangible Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, CHI 2018, Montreal, QC, Canada, April 21-26, 2018. ACM, New York, NY, USA, 409. https://doi.org/10.1145/3173574.3173983",
      "doi": ""
    },
    {
      "text": "Konstantin Klamka and Raimund Dachselt. 2017. IllumiPaper: Illuminated Interactive Paper. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, Denver, CO, USA, May 06-11, 2017. ACM, New York, NY, USA, 5605–5618. https://doi.org/10.1145/3025453.3025525",
      "doi": "10.1145/3025453.3025525"
    },
    {
      "text": "Balasaravanan Thoravi Kumaravel, Fraser Anderson, George W. Fitzmaurice, Bjoern Hartmann, and Tovi Grossman. 2019. Loki: Facilitating Remote Instruction of Physical Tasks Using Bi-Directional Mixed-Reality Telepresence. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology, UIST 2019, New Orleans, LA, USA, October 20-23, 2019. ACM, New York, NY, USA, 161–174. https://doi.org/10.1145/3332165.3347872",
      "doi": "10.1145/3332165.3347872"
    },
    {
      "text": "Balasaravanan Thoravi Kumaravel, Cuong Nguyen, Stephen DiVerdi, and Bjoern Hartmann. 2020. TransceiVR: Bridging Asymmetrical Communication Between VR Users and External Collaborators. In UIST ’20: The 33rd Annual ACM Symposium on User Interface Software and Technology, Virtual Event, USA, October 20-23, 2020. ACM, New York, NY, USA, 182–195. https://doi.org/10.1145/3379337.3415827",
      "doi": "10.1145/3379337.3415827"
    },
    {
      "text": "Susan Lechelt, Frederik Brudy, Nicolai Marquardt, and Yvonne Rogers. 2021. EvalMe: Exploring the Value of New Technologies for In Situ Evaluation of Learning Experiences. In CHI ’21: CHI Conference on Human Factors in Computing Systems, Virtual Event / Yokohama, Japan, May 8-13, 2021. ACM, New York, NY, USA, 59:1–59:14. https://doi.org/10.1145/3411764.3445749",
      "doi": "10.1145/3411764.3445749"
    },
    {
      "text": "David Ledo, Steven Houben, Jo Vermeulen, Nicolai Marquardt, Lora Oehlberg, and Saul Greenberg. 2018. Evaluation Strategies for HCI Toolkit Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, CHI 2018, Montreal, QC, Canada, April 21-26, 2018. ACM, New York, NY, USA, 36. https://doi.org/10.1145/3173574.3173610",
      "doi": "10.1145/3173574.3173610"
    },
    {
      "text": "Gun A. Lee, Claudia Nelles, Mark Billinghurst, and Gerard Jounghyun Kim. 2004. Immersive Authoring of Tangible Augmented Reality Applications. In 3rd IEEE and ACM International Symposium on Mixed and Augmented Reality (ISMAR 2004), 2-5 November 2004, Arlington, VA, USA. IEEE Computer Society, New York, NY, USA, 172–181. https://doi.org/10.1109/ISMAR.2004.34",
      "doi": ""
    },
    {
      "text": "Germán Leiva and Michel Beaudouin-Lafon. 2018. Montage: A Video Prototyping System to Reduce Re-Shooting and Increase Re-Usability. In The 31st Annual ACM Symposium on User Interface Software and Technology, UIST 2018, Berlin, Germany, October 14-17, 2018. ACM, New York, NY, USA, 675–682. https://doi.org/10.1145/3242587.3242613",
      "doi": "10.1145/3242587.3242613"
    },
    {
      "text": "Germán Leiva, Cuong Nguyen, Rubaiat Habib Kazi, and Paul Asente. 2020. Pronto: Rapid Augmented Reality Video Prototyping Using Sketches and Enaction. In CHI ’20: CHI Conference on Human Factors in Computing Systems, Honolulu, HI, USA, April 25-30, 2020. ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376160",
      "doi": ""
    },
    {
      "text": "Zhen Li, Michelle Annett, Ken Hinckley, Karan Singh, and Daniel Wigdor. 2019. HoloDoc: Enabling Mixed Reality Workspaces that Harness Physical and Digital Content. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, CHI 2019, Glasgow, Scotland, UK, May 04-09, 2019. ACM, New York, NY, USA, 687. https://doi.org/10.1145/3290605.3300917",
      "doi": "10.1145/3290605.3300917"
    },
    {
      "text": "Chunyuan Liao, François Guimbretière, and Ken Hinckley. 2005. PapierCraft: a command system for interactive paper. In Proceedings of the 18th Annual ACM Symposium on User Interface Software and Technology, Seattle, WA, USA, October 23-26, 2005. ACM, New York, NY, USA, 241–244. https://doi.org/10.1145/1095034.1095074",
      "doi": "10.1145/1095034.1095074"
    },
    {
      "text": "Roman Lissermann, Simon Olberding, Benjamin Petry, Max Mühlhäuser, and Jürgen Steimle. 2012. PaperVideo: interacting with videos on multiple paper-like displays. In Proceedings of the 20th ACM Multimedia Conference, MM ’12, Nara, Japan, October 29 - November 02, 2012. ACM, New York, NY, USA, 129–138. https://doi.org/10.1145/2393347.2393372",
      "doi": "10.1145/2393347.2393372"
    },
    {
      "text": "Blair MacIntyre, Maribeth Gandy, Steven Dow, and Jay David Bolter. 2004. DART: a toolkit for rapid design exploration of augmented reality experiences. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology, Santa Fe, NM, USA, October 24-27, 2004. ACM, New York, NY, USA, 197–206. https://doi.org/10.1145/1029632.1029669",
      "doi": "10.1145/1029632.1029669"
    },
    {
      "text": "W. Mackay and D. Pagani. 1994. Video Mosaic: Laying out Time in a Physical Space. In Proceedings of the Second ACM International Conference on Multimedia (San Francisco, California, USA) (MULTIMEDIA ’94). Association for Computing Machinery, New York, NY, USA, 165–172. https://doi.org/10.1145/192593.192646",
      "doi": ""
    },
    {
      "text": "Wendy E. Mackay, Guillaume Pothier, Catherine Letondal, Kaare Bøegh, and Hans Erik Sørensen. 2002. The missing link: augmenting biology laboratory notebooks. In Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology, Paris, France, October 27-30, 2002. ACM, New York, NY, USA, 41–50. https://doi.org/10.1145/571985.571992",
      "doi": "10.1145/571985.571992"
    },
    {
      "text": "Paul Marshall. 2007. Do tangible interfaces enhance learning?. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction 2007, Baton Rouge, Louisiana, USA, February 15-17, 2007. ACM, New York, NY, USA, 163–170. https://doi.org/10.1145/1226969.1227004",
      "doi": "10.1145/1226969.1227004"
    },
    {
      "text": "Jorge Martín-Gutiérrez, Peña Fabiani, Wanda Benesova, María Dolores Meneses, and Carlos E. Mora. 2015. Augmented reality to promote collaborative and autonomous learning in higher education. Computers in Human Behavior 51 (2015), 752–761. https://doi.org/10.1016/j.chb.2014.11.093 Computing for Human Learning, Behaviour and Collaboration in the Social and Mobile Networks Era.",
      "doi": "10.1016/j.chb.2014.11.093"
    },
    {
      "text": "Paul Milgram and Fumio Kishino. 1994. A Taxonomy of Mixed Reality Visual Displays. IEICE Transactions on Information and Systems 77 (1994), 1321–1329.",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Andreea Danielescu, Steven Mark Drucker, Danyel Fisher, Bongshin Lee, m. c. schraefel, and Jacob O. Wobbrock. 2014. Reducing legacy bias in gesture elicitation studies. Interactions 21, 3 (2014), 40–45. https://doi.org/10.1145/2591689",
      "doi": "10.1145/2591689"
    },
    {
      "text": "Michael Nebeling, Katy Lewis, Yu-Cheng Chang, Lihan Zhu, Michelle Chung, Piaoyang Wang, and Janet Nebeling. 2020. XRDirector: A Role-Based Collaborative Immersive Authoring System. In CHI ’20: CHI Conference on Human Factors in Computing Systems, Honolulu, HI, USA, April 25-30, 2020. ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376637",
      "doi": "10.1145/3313831.3376637"
    },
    {
      "text": "Michael Nebeling and Katy Madier. 2019. 360proto: Making Interactive Virtual Reality & Augmented Reality Prototypes from Paper. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, CHI 2019, Glasgow, Scotland, UK, May 04-09, 2019. ACM, New York, NY, USA, 596. https://doi.org/10.1145/3290605.3300826",
      "doi": "10.1145/3290605.3300826"
    },
    {
      "text": "Michael Nebeling, Janet Nebeling, Ao Yu, and Rob Rumble. 2018. ProtoAR: Rapid Physical-Digital Prototyping of Mobile Augmented Reality Applications. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, CHI 2018, Montreal, QC, Canada, April 21-26, 2018. ACM, New York, NY, USA, 353. https://doi.org/10.1145/3173574.3173927",
      "doi": "10.1145/3173574.3173927"
    },
    {
      "text": "Michael Nebeling, Shwetha Rajaram, Liwei Wu, Yifei Cheng, and Jaylin Herskovitz. 2021. XRStudio: A Virtual Production and Live Streaming System for Immersive Instructional Experiences. In CHI ’21: CHI Conference on Human Factors in Computing Systems, Virtual Event / Yokohama, Japan, May 8-13, 2021. ACM, New York, NY, USA, 107:1–107:12. https://doi.org/10.1145/3411764.3445323",
      "doi": "10.1145/3411764.3445323"
    },
    {
      "text": "Michael Nebeling and Maximilian Speicher. 2018. The Trouble with Augmented Reality/Virtual Reality Authoring Tools. In IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2018 Adjunct, Munich, Germany, October 16-20, 2018. IEEE, New York, NY, USA, 333–337. https://doi.org/10.1109/ISMAR-Adjunct.2018.00098",
      "doi": ""
    },
    {
      "text": "Jie Qi and Leah Buechley. 2014. Sketching in circuits: designing and building electronics on paper. In CHI Conference on Human Factors in Computing Systems, CHI’14, Toronto, ON, Canada - April 26 - May 01, 2014. ACM, New York, NY, USA, 1713–1722. https://doi.org/10.1145/2556288.2557391",
      "doi": "10.1145/2556288.2557391"
    },
    {
      "text": "Jaziar Radianti, Tim A. Majchrzak, Jennifer Fromm, and Isabell Wohlgenannt. 2020. A systematic review of immersive virtual reality applications for higher education: Design elements, lessons learned, and research agenda. Computers & Education 147 (2020), 103778. https://doi.org/10.1016/j.compedu.2019.103778",
      "doi": "10.1016/j.compedu.2019.103778"
    },
    {
      "text": "Iulian Radu. 2014. Augmented reality in education: a meta-review and cross-media analysis. Pers. Ubiquitous Comput. 18, 6 (2014), 1533–1543. https://doi.org/10.1007/s00779-013-0747-y",
      "doi": "10.1007/s00779-013-0747-y"
    },
    {
      "text": "Iulian Radu and Bertrand Schneider. 2019. What Can We Learn from Augmented Reality (AR)?. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, CHI 2019, Glasgow, Scotland, UK, May 04-09, 2019. ACM, New York, NY, USA, 544. https://doi.org/10.1145/3290605.3300774",
      "doi": "10.1145/3290605.3300774"
    },
    {
      "text": "Raf Ramakers, Kashyap Todi, and Kris Luyten. 2015. PaperPulse: An Integrated Approach for Embedding Electronics in Paper Designs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI 2015, Seoul, Republic of Korea, April 18-23, 2015. ACM, New York, NY, USA, 2457–2466. https://doi.org/10.1145/2702123.2702487",
      "doi": ""
    },
    {
      "text": "Joan Sol Roo and Martin Hachet. 2017. One Reality: Augmenting How the Physical World is Experienced by combining Multiple Mixed Reality Modalities. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology, UIST 2017, Quebec City, QC, Canada, October 22 - 25, 2017. ACM, New York, NY, USA, 787–795. https://doi.org/10.1145/3126594.3126638",
      "doi": "10.1145/3126594.3126638"
    },
    {
      "text": "Abigail J. Sellen and Richard H. R. Harper. 2003. The Myth of the Paperless Office. MIT Press, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Hyunyoung Song, Tovi Grossman, George W. Fitzmaurice, François Guimbretière, Azam Khan, Ramtin Attar, and Gordon Kurtenbach. 2009. PenLight: combining a mobile projector and a digital pen for dynamic visual overlay. In Proceedings of the 27th International Conference on Human Factors in Computing Systems, CHI 2009, Boston, MA, USA, April 4-9, 2009. ACM, New York, NY, USA, 143–152. https://doi.org/10.1145/1518701.1518726",
      "doi": "10.1145/1518701.1518726"
    },
    {
      "text": "Hyunyoung Song, François Guimbretière, Tovi Grossman, and George W. Fitzmaurice. 2010. MouseLight: bimanual interactions on digital paper using a pen and a spatially-aware mobile projector. In Proceedings of the 28th International Conference on Human Factors in Computing Systems, CHI 2010, Atlanta, Georgia, USA, April 10-15, 2010. ACM, New York, NY, USA, 2451–2460. https://doi.org/10.1145/1753326.1753697",
      "doi": "10.1145/1753326.1753697"
    },
    {
      "text": "Hyunyoung Song, François Guimbretière, Chang Hu, and Hod Lipson. 2006. ModelCraft: capturing freehand annotations and edits on physical 3D models. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology, Montreux, Switzerland, October 15-18, 2006. ACM, New York, NY, USA, 13–22. https://doi.org/10.1145/1166253.1166258",
      "doi": "10.1145/1166253.1166258"
    },
    {
      "text": "Maximilian Speicher, Brian D. Hall, and Michael Nebeling. 2019. What is Mixed Reality?. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, CHI 2019, Glasgow, Scotland, UK, May 04-09, 2019. ACM, New York, NY, USA, 537. https://doi.org/10.1145/3290605.3300767",
      "doi": "10.1145/3290605.3300767"
    },
    {
      "text": "Maximilian Speicher, Katy Lewis, and Michael Nebeling. 2021. Designers, the Stage Is Yours! Medium-Fidelity Prototyping of Augmented & Virtual Reality Interfaces with 360theater. Proceedings of the ACM on Human-Computer Interaction 5, EICS(2021), 1–25.",
      "doi": "10.1145/3461727"
    },
    {
      "text": "Hariharan Subramonyam, Steven Mark Drucker, and Eytan Adar. 2019. Affinity Lens: Data-Assisted Affinity Diagramming with Augmented Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, CHI 2019, Glasgow, Scotland, UK, May 04-09, 2019. ACM, New York, NY, USA, 398. https://doi.org/10.1145/3290605.3300628",
      "doi": "10.1145/3290605.3300628"
    },
    {
      "text": "Ryo Suzuki, Rubaiat Habib Kazi, Li-Yi Wei, Stephen DiVerdi, Wilmot Li, and Daniel Leithinger. 2020. RealitySketch: Embedding Responsive Graphics and Visualizations in AR through Dynamic Sketching. In UIST ’20: The 33rd Annual ACM Symposium on User Interface Software and Technology, Virtual Event, USA, October 20-23, 2020. ACM, New York, NY, USA, 166–181. https://doi.org/10.1145/3379337.3415892",
      "doi": "10.1145/3379337.3415892"
    },
    {
      "text": "Theophanis Tsandilas, Catherine Letondal, and Wendy E. Mackay. 2009. Musink: composing music through augmented drawing. In Proceedings of the 27th International Conference on Human Factors in Computing Systems, CHI 2009, Boston, MA, USA, April 4-9, 2009. ACM, New York, NY, USA, 819–828. https://doi.org/10.1145/1518701.1518827",
      "doi": ""
    },
    {
      "text": "Ana M. Villanueva, Zhengzhe Zhu, Ziyi Liu, Kylie Peppler, Thomas Redick, and Karthik Ramani. 2020. Meta-AR-App: An Authoring Platform for Collaborative Augmented Reality in STEM Classrooms. In CHI ’20: CHI Conference on Human Factors in Computing Systems, Honolulu, HI, USA, April 25-30, 2020. ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376146",
      "doi": ""
    },
    {
      "text": "Nadir Weibel, Adriana Ispas, Beat Signer, and Moira C. Norrie. 2008. Paperproof: a paper-digital proof-editing system. In Extended Abstracts Proceedings of the 2008 Conference on Human Factors in Computing Systems, CHI 2008, Florence, Italy, April 5-10, 2008. ACM, New York, NY, USA, 2349–2354. https://doi.org/10.1145/1358628.1358682",
      "doi": "10.1145/1358628.1358682"
    },
    {
      "text": "Pierre Wellner. 1991. The DigitalDesk calculator: tangible manipulation on a desk top display. In Proceedings of the 4th Annual ACM Symposium on User Interface Software and Technology, UIST 1991, Hilton Head, South Carolina, USA, November 11-13, 1991. ACM, New York, NY, USA, 27–33. https://doi.org/10.1145/120782.120785",
      "doi": "10.1145/120782.120785"
    },
    {
      "text": "Richard White and Richard Gunstone. 1992. Probing Understanding. Routledge, London, 208. https://doi.org/10.4324/9780203761342",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. 2009. User-defined gestures for surface computing. In Proceedings of the 27th International Conference on Human Factors in Computing Systems, CHI 2009, Boston, MA, USA, April 4-9, 2009. ACM, New York, NY, USA, 1083–1092. https://doi.org/10.1145/1518701.1518866",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Haijun Xia, Sebastian Herscher, Ken Perlin, and Daniel Wigdor. 2018. Spacetime: Enabling Fluid Individual and Collaborative Editing in Virtual Reality. In The 31st Annual ACM Symposium on User Interface Software and Technology, UIST 2018, Berlin, Germany, October 14-17, 2018. ACM, New York, NY, USA, 853–866. https://doi.org/10.1145/3242587.3242597",
      "doi": ""
    }
  ]
}