{
  "doi": "10.1145/3491102.3501962",
  "title": "Iterative Design of Gestures During Elicitation: Understanding the Role of Increased Production",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Previous gesture elicitation studies have found that user proposals are influenced by legacy bias which may inhibit users from proposing gestures that are most appropriate for an interaction. Increasing production during elicitation studies has shown promise moving users beyond legacy gestures. However, variety decreases as more symbols are produced. While several studies have used increased production since its introduction, little research has focused on understanding the effect on the proposed gesture quality, on why variety decreases, and on whether increased production should be limited. In this paper, we present a gesture elicitation study aimed at understanding the impact of increased production. We show that users refine the most promising gestures and that how long it takes to find promising gestures varies by participant. We also show that gestural refinements provide insight into the gestural features that matter for users to assign semantic meaning and discuss implications for training gesture classifiers.",
  "authors": [
    {
      "name": "Andreea Danielescu",
      "institution": "Accenture Labs, United States",
      "img": "/do/10.1145/contrib-81444607832/rel-imgonly/81444607832.png",
      "acmid": "81444607832",
      "orcid": "0000-0001-7460-2467"
    },
    {
      "name": "David Piorkowski",
      "institution": "IBM Research, United States",
      "img": "/do/10.1145/contrib-81474694114/rel-imgonly/profile_sm.jpg",
      "acmid": "81474694114",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexander, J., Han, T., Judd, W., Irani, P. and Subramanian, S. 2012. Putting Your Best Foot Forward: Investigating Real-World Mappings for Foot-based Gestures. CHI ’12 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA, 2012), 1229–1238.",
      "doi": "10.1145/2207676.2208575"
    },
    {
      "text": "Ali, A.X., Morris, M.R. and Wobbrock, J.O. 2021. “I Am Iron Man” Priming Improves the Learnability and memorability of user-elicited gestures. Conference on Human Factors in Computing Systems - Proceedings (2021), 1–14.",
      "doi": ""
    },
    {
      "text": "Cafaro, F., Lyons, L. and Antle, A.N. 2018. Framed Guessability: Improving the Discoverability of Gestures and Body Movements for Full - Body Interaction. Proceedings of CHI 2018 (Montreal, Quebec, Canada, 2018), 1–12.",
      "doi": ""
    },
    {
      "text": "Cafaro, F., Lyons, L., Kang, R., Radinsky, J., Roberts, J. and Vogt, K. 2014. Framed Guessability: Using Embodied Allegories to Increase User Agreement on Gesture Sets. Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (Munich, Germany, 2014), 197–204.",
      "doi": ""
    },
    {
      "text": "Cauchard, J.R., E, J.L., Zhai, K.Y. and Landay, J.A. 2015. Drone & Me: An Exploration Into Natural Human-Drone Interaction. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp ’15 (New York, NY, USA, 2015).",
      "doi": "10.1145/2750858.2805823"
    },
    {
      "text": "Chan, E., Seyed, T., Stuerzlinger, W., Yang, X.-D. and Maurer, F. 2016. User Elicitation on Single-hand Microgestures. Proceedings of CHI 2016 (San Jose, CA, USA, 2016), 3403–3414.",
      "doi": ""
    },
    {
      "text": "COVID-19 Giving Touchless Interfaces a Chance to Make an Impression: 2020. https://www.designnews.com/design-hardware-software/covid-19-giving-touchless-interfaces-chance-make-impression-0.",
      "doi": ""
    },
    {
      "text": "Danielescu, L.A. 2019. Discoverable Free Space Gesture Sets for Walk-Up-and-Use Interactions. Arizona State University.",
      "doi": ""
    },
    {
      "text": "Dow, S.P., Fortuna, J., Schwartz, D., Altringer, B., Schwartz, D.L. and Klemmer, S.R. 2011. Prototyping Dynamics: Sharing Multiple Designs Improves Exploration , Group Rapport , and Results. Proceedings of the SIGCHI conference on Human factors in computing systems (Vancouver, BC, Canada, 2011), 1–10.",
      "doi": "10.1145/1978942.1979359"
    },
    {
      "text": "E, J.L., E, I.L., Landay, J.A. and Cauchard, J.R. 2017. Drone & Wo: Cultural Influences on Human-Drone Interaction Techniques. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17) (New York, NY, USA, 2017), 6794–6799.",
      "doi": ""
    },
    {
      "text": "Epps, J., Lichman, S. and Wu, M. 2006. A study of hand shape use in tabletop gesture interaction. CHI ’06 extended abstracts on Human factors in computing systems - CHI EA ’06 (New York, New York, USA, 2006), 748–753.",
      "doi": ""
    },
    {
      "text": "Erazo, O., Rekik, Y. and Grisoni, L. 2017. Understanding Gesture Articulations Variability. INTERACT 2017 (2017), 293–314.",
      "doi": ""
    },
    {
      "text": "Felberbaum, Y. and Lanir, J. 2018. Better Understanding of Foot Gestures: An Elicitation Study. Proceedings of CHI 2018 (Montreal, Quebec, Canada, 2018), 218–224.",
      "doi": ""
    },
    {
      "text": "Frisch, M., Heydekorn, J. and Dachselt, R. 2009. Investigating multi-touch and pen gestures for diagram editing on interactive surfaces. Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces - ITS ’09 (New York, New York, USA, 2009), 149–156.",
      "doi": "10.1145/1731903.1731933"
    },
    {
      "text": "Glaser, B.G. and Strauss, A.L. 1967. The Discovery of Grounded Theory. Routledge.",
      "doi": ""
    },
    {
      "text": "Grace, K., Grace, S., Maher, M. Lou, Mahzoon, M.J., Lee, L., LoCurto, L. and Outcault, B. 2017. The willful marionette: Exploring responses to embodied interaction. Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition - C&C ’17 (Singapore, 2017), 15–27.",
      "doi": "10.1145/3059454.3059475"
    },
    {
      "text": "Hands off! How Covid-19 paves the way for fully touchless experiences: 2020. https://www.thedrum.com/opinion/2020/07/27/hands-how-covid-19-paves-the-way-fully-touchless-experiences.",
      "doi": ""
    },
    {
      "text": "Hincapié-Ramos, J., Guo, X., Moghadasian, P. and Irani, P. 2014. Consumed Endurance: A metric to quantify arm fatigue of mid-air interactions. Proceedings of CHI 2014 (Toronto, ON, Canada, 2014), 1063–1072.",
      "doi": ""
    },
    {
      "text": "Hincapié-Ramos, J.D., Guo, X. and Irani, P. 2014. The Consumed Endurance Workbench: A Tool to Assess Arm Fatigue during Mid-Air Interactions. Proceedings of DIS 2014 (Vancouver, BC, Canada, 2014), 109–112.",
      "doi": ""
    },
    {
      "text": "Hoff, L., Hornecker, E., Bertel, S., Weimar, B. and Media, F. 2016. Modifying Gesture Elicitation: Do Kinaesthetic Priming and Increased Production Reduce Legacy Bias? Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (New York, New York, USA, 2016), 86–91.",
      "doi": "10.1145/2839462.2839472"
    },
    {
      "text": "How Many Test Users in a Usability Study? 2012. https://www.nngroup.com/articles/how-many-test-users/.",
      "doi": ""
    },
    {
      "text": "Jang, S., Stuerzlinger, W., Ambike, S. and Ramani, K. 2017. Modeling Cumulative Arm Fatigue in Mid-Air Interaction based on Perceived Exertion and Kinetics of Arm Motion. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI ’17 (Denver, CO, USA, 2017), 3328–3339.",
      "doi": ""
    },
    {
      "text": "Köpsel, A. and Bubalo, N. 2015. Benefiting from legacy bias. Interactions.",
      "doi": ""
    },
    {
      "text": "Koutsabasis, P. and Domouzis, C.K. 2016. Mid-Air Browsing and Selection in Image Collections. Proceedings of AVI ’16 (2016), 21–27.",
      "doi": ""
    },
    {
      "text": "Krueger, M.W. 1993. Environmental Technology Making the Real Virtual. Communications of the ACM.",
      "doi": ""
    },
    {
      "text": "Law, L.A.F. and Avin, K.G. 2010. Endurance time is joint-specific: A modelling and meta-analysis investigation. Ergonomics. 53, 1 (2010), 109–129. DOI:https://doi.org/10.1016/j.fusengdes.2017.02.047.",
      "doi": ""
    },
    {
      "text": "Maher, M. Lou and Lee, L. 2017. Designing for Gesture and Tangible Interaction. Morgan & Claypool Publishers.",
      "doi": ""
    },
    {
      "text": "May, K.R., Gable, T.M. and Walker, B.N. 2017. Designing an In-Vehicle Air Gesture Set Using Elicitation Methods. Proceedings of the 9th ACM International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Oldenburg, Germany, 2017), 74–83.",
      "doi": ""
    },
    {
      "text": "McAweeney, E., Zhang, H. and Nebeling, M. 2018. User-Driven Design Principles for Gesture Representations. Proceedings of CHI 2018 (Montreal, Quebec, Canada, 2018), 547:1-547:13.",
      "doi": ""
    },
    {
      "text": "McDonald, N., Schoenebeck, S. and Forte, A. 2019. Reliability and inter-rater reliability in qualitative research: Norms and guidelines for CSCW and HCI practice. Proceedings of the ACM on Human-Computer Interaction. 3, CSCW (2019), 23. DOI:https://doi.org/10.1145/3359174.",
      "doi": ""
    },
    {
      "text": "Micire, M., Desai, M., Courtemanche, A., Tsui, K.M. and Yanco, H. a. 2009. Analysis of natural gestures for controlling robot teams on multi-touch tabletop surfaces. Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces - ITS ’09 (New York, New York, USA, 2009), 41–48.",
      "doi": "10.1145/1731903.1731912"
    },
    {
      "text": "Morris, M.R. 2012. Web on the Wall: Insights from a Multimodal Interaction Elicitation Study. ITS ’12 Proceedings of the 2012 ACM international conference on Interactive tabletops and surfaces (Cambridge, Massachusetts, USA, 2012), 95–104.",
      "doi": "10.1145/2396636.2396651"
    },
    {
      "text": "Morris, M.R., Danielescu, A., Drucker, S., Fisher, D., Lee, B., Schraefel, M.C. and Wobbrock, J.O. 2014. Reducing legacy bias in gesture elicitation studies. Interactions. 21, 3 (2014), 40–45. DOI:https://doi.org/10.1145/2591689.",
      "doi": "10.1145/2591689"
    },
    {
      "text": "Morris, M.R., Wobbrock, J.O. and Wilson, A.D. 2010. Understanding Users’ Preferences for Surface Gestures. Graphics Interface 2010 (2010), 261–268.",
      "doi": ""
    },
    {
      "text": "Nacenta, M.A., Kamber, Y., Qiang, Y. and Kristensson, P.O. 2013. Memorability of Pre-designed & User-defined Gesture Sets. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’13 (New York, New York, USA, 2013), 1099.",
      "doi": "10.1145/2470654.2466142"
    },
    {
      "text": "Nielsen, M., Störring, M., Moeslund, T.B. and Granum, E. 2004. A procedure for developing intuitive and ergonomic gesture interfaces for HCI. Gesture-Based Communication in Human-Computer Interaction (2004), 409–420.",
      "doi": ""
    },
    {
      "text": "North, C., Dwyer, T., Lee, B., Fisher, D., Isenberg, P., Robertson, G. and Quinn, K.I. 2009. Understanding Multi-touch Manipulation for Surface Computing. IFIP Conference on Human-Computer Interaction (2009), 236–249.",
      "doi": ""
    },
    {
      "text": "Oh, U. and Findlater, L. 2013. The challenges and potential of end-user gesture customization. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’13 (New York, New York, USA, 2013).",
      "doi": "10.1145/2470654.2466145"
    },
    {
      "text": "Ortega, F.R., Tarre, K., Barreto, A.B., Kress, M., Rishe, N.D. and Williams, A.S. 2019. Selection and manipulation whole body gesture elicitation study in virtual reality. 26th IEEE Conference on Virtual Reality and 3D User Interfaces, VR 2019 - Proceedings. (2019), 1110–1111. DOI:https://doi.org/10.1109/VR.2019.8798182.",
      "doi": ""
    },
    {
      "text": "Pham, T., Vermeulen, J., Tang, A. and MacDonald Vermeulen, L. 2018. Scale Impacts Elicited Gestures for Manipulating Holograms. Proceedings of the 2018 on Designing Interactive Systems Conference 2018 - DIS ’18. (2018), 227–240. DOI:https://doi.org/10.1145/3196709.3196719.",
      "doi": ""
    },
    {
      "text": "Piumsomboon, T., Clark, A., Billinghurst, M. and Cockburn, A. 2013. User-defined gestures for augmented reality. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). 8118 LNCS, PART 2 (2013), 282–299. DOI:https://doi.org/10.1007/978-3-642-40480-1_18.",
      "doi": ""
    },
    {
      "text": "Rekik, Y., Grisoni, L. and Roussel, N. 2013. Towards many gestures to one command: A user study for tabletops. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). 8118 LNCS, PART 2 (2013), 246–263. DOI:https://doi.org/10.1007/978-3-642-40480-1_16.",
      "doi": ""
    },
    {
      "text": "Ruiz, J., Li, Y. and Lank, E. 2011. User-defined motion gestures for mobile interaction. Proceedings of the 2011 annual conference on Human factors in computing systems - CHI ’11 (New York, New York, USA, 2011), 197–206.",
      "doi": ""
    },
    {
      "text": "Ruiz, J. and Vogel, D. 2015. Soft-Constraints to Reduce Legacy and Performance Bias to Elicit Whole-body Gestures with Low Arm Fatigue. Proceedings of CHI 2015 (Seoul, Republic of Korea, 2015), 3347–3350.",
      "doi": ""
    },
    {
      "text": "Ryall, K., Morris, M.R., Everitt, K., Forlines, C. and Shen, C. 2006. Experiences with and Observations of Direct-Touch Tabletops. Proceedings of the First IEEE International Workshop on Horizontal Interactive Human-Computer Systems (TABLETOP ’06) (Adelaide, SA, Australia, 2006), 89–96.",
      "doi": ""
    },
    {
      "text": "Siddhpuria, S., Katsuragawa, K., Wallace, J.R. and Lank, E. 2017. Exploring At-Your-Side Gestural Interaction for Ubiquitous Environments. Proceedings of the 2017 Conference on Designing Interactive Systems - DIS ’17 (Edinburgh, United Kingdom, 2017), 1111–1122.",
      "doi": "10.1145/3064663.3064695"
    },
    {
      "text": "Touchless Interaction In A Post-Covid-19 World: 2020. .",
      "doi": ""
    },
    {
      "text": "Tsandilas, T. 2018. Fallacies of Agreement: A Critical Review of Consensus Assessment Methods for Gesture Elicitation. ACM Transactions on Computer-Human Interaction. 25, 3 (2018), 1–49.",
      "doi": "10.1145/3182168"
    },
    {
      "text": "Tullis, T. and Wood, L. 2004. How Many Users Are Enough for a Card-Sorting Study? Usability Professionals Association (UPA) 2004 Conference (Minneapolis, MN, 2004).",
      "doi": ""
    },
    {
      "text": "Vatavu, R.-D. 2019. The Dissimilarity-Consensus Approach to Agreement Analysis in Gesture Elicitation Studies. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19 (Glasgow, Scotland UK, 2019), 1–13.",
      "doi": "10.1145/3290605.3300454"
    },
    {
      "text": "Vatavu, R.-D. 2012. User-defined gestures for free-hand TV control. Proceedings of the 10th European conference on Interactive tv and video - EuroiTV ’12 (New York, New York, USA, 2012), 45–48.",
      "doi": "10.1145/2325616.2325626"
    },
    {
      "text": "Vatavu, R.-D. and Wobbrock, J.O. 2016. Between-Subjects Elicitation Studies: Formalization and Tool Support. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, CA, USA, 2016), 3390–3402.",
      "doi": "10.1145/2858036.2858228"
    },
    {
      "text": "Vatavu, R.-D. and Wobbrock, J.O. 2015. Formalizing Agreement Analysis for Elicitation Studies: New Measures, Significance Test, and Toolkit. Proceedings of the ACM CHI’15 Conference on Human Factors in Computing Systems (Seoul, Republic of Korea, 2015), 1325–1334.",
      "doi": ""
    },
    {
      "text": "Villarreal-Narvaez, S., Vanderdonckt, J., Vatavu, R.-D. and Wobbrock, J.O. 2020. A Systematic Review of Gesture Elicitation Studies: What Can We Learn from 216 Studies? Proceedings of ACM conference on Designing Interactive Systems (DIS ’20) (New York, New York, USA, 2020).",
      "doi": "10.1145/3357236.3395511"
    },
    {
      "text": "Williams, A.S., Garcia, J., De Zayas, F., Hernandez, F., Sharp, J. and Ortega, F.R. 2020. The Cost of Production in Elicitation Studies and the Legacy Bias-Consensus Trade off. Multimodal Technologies and Interaction. 4, 88 (2020), 16. DOI:https://doi.org/10.3390/mti4040088.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J.O., Aung, H.H., Rothrock, B. and Myers, B. a. 2005. Maximizing the guessability of symbolic input. CHI ’05 extended abstracts on Human factors in computing systems - CHI ’05 (New York, New York, USA, 2005), 1869–1872.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J.O., Findlater, L., Gergle, D. and Higgins, J. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only ANOVA Procedures. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’11) (Vancouver, BC, Canada, 2011), 143–146.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J.O., Morris, M.R. and Wilson, A.D. 2009. User-defined gestures for surface computing. Proceedings of the 27th International conference on Human factors in computing systems - CHI 09 (New York, New York, USA, 2009), 1083.",
      "doi": ""
    }
  ]
}