{
  "doi": "10.1145/3491102.3517601",
  "title": "Multifractal Mice: Operationalising Dimensions of Readiness-to-hand via a Feature of Hand Movement",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "The philosophical construct readiness-to-hand describes focused, intuitive, tool use, and has been linked to tool-embodiment and immersion. The construct has been influential in HCI and design for decades, but researchers currently lack appropriate measures and tools to investigate it empirically. To support such empirical work we investigate the possibility of operationalising readiness-to-hand in measurements of multfractality in movement, building on recent work in cognitive science. We conduct two experiments (N=44, N=30) investigating multifractality in mouse movements during a computer game, replicating prior results and contributing new findings. Our results show that multifractality correlates with dimensions associated with readiness-to-hand, including skill and task-engagement, during tool breakdown, task learning and normal play. We describe future possibilities for the application of these methods in HCI, supporting such work by sharing scripts and data (https://osf.io/2hm9u/), and introducing a new data-driven approach to parameter selection.",
  "tags": [
    "cognitive science",
    "engagement",
    "complex systems",
    "phenomenology",
    "readiness to hand",
    "user experience",
    "embodiment"
  ],
  "authors": [
    {
      "name": "Dan Bennett",
      "institution": "Bristol Interaction Group, University of Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526751",
      "orcid": "0000-0002-9330-5529"
    },
    {
      "name": "Anne Roudaut",
      "institution": "Bristol Interaction Group, University of Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81414614562/rel-imgonly/81414614562.png",
      "acmid": "81414614562",
      "orcid": "0000-0003-3082-4564"
    },
    {
      "name": "Oussama Metatla",
      "institution": "Bristol Interaction Group, University of Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418592476",
      "orcid": "0000-0002-3882-3243"
    }
  ],
  "references": [
    {
      "text": "Miguel Aguilera, Manuel G. Bedia, and Xabier E. Barandiaran. 2016. Extended Neural Metastability in an Embodied Model of Sensorimotor Coupling. Frontiers in Systems Neuroscience 10 (Sept. 2016), 15. https://doi.org/10.3389/fnsys.2016.00076",
      "doi": ""
    },
    {
      "text": "Ayman Alzayat, Mark Hancock, and Miguel A. Nacenta. 2017. Measuring Readiness-to-Hand through Differences in Attention to the Task vs. Attention to the Tool. In Proceedings of the Interactive Surfaces and Spaces on ZZZ - ISS ’17. ACM Press, Brighton, United Kingdom, 42–51. https://doi.org/10.1145/3132272.3134114",
      "doi": "10.1145/3132272.3134114"
    },
    {
      "text": "Ayman Alzayat, Mark Hancock, and Miguel A. Nacenta. 2019. Quantitative Measurement of Tool Embodiment for Virtual Reality Input Alternatives. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 443.",
      "doi": "10.1145/3290605.3300673"
    },
    {
      "text": "Luís Amaral. 2012. A Brief Overview of Multifractal Time Series. https://archive.physionet.org/tutorials/multifractal/",
      "doi": ""
    },
    {
      "text": "Tatiana A. Amor, Saulo D. S. Reis, Daniel Campos, Hans J. Herrmann, and José S. Andrade. 2016. Persistence in eye movement during visual search. Scientific Reports 6, 1 (Feb. 2016), 20815. https://doi.org/10.1038/srep20815 Number: 1 Publisher: Nature Publishing Group.",
      "doi": ""
    },
    {
      "text": "Jason R. Anastas, Damian G. Kelty-Stephen, and James A. Dixon. 2014. Executive Function as an Interaction-Dominant Process. Ecological Psychology 26, 4 (Oct. 2014), 262–282. https://doi.org/10.1080/10407413.2014.957985",
      "doi": ""
    },
    {
      "text": "Jason R. Anastas, Damian G. Stephen, and James A. Dixon. 2011. The scaling behavior of hand motions reveals self-organization during an executive function task. Physica A: Statistical Mechanics and its Applications 390, 9 (May 2011), 1539–1545. https://doi.org/10.1016/j.physa.2010.11.038",
      "doi": ""
    },
    {
      "text": "Christopher A. Bell, Nicole S. Carver, John A. Zbaracki, and Damian G. Kelty-Stephen. 2019. Non-linear Amplification of Variability Through Interaction Across Scales Supports Greater Accuracy in Manual Aiming: Evidence From a Multifractal Analysis With Comparisons to Linear Surrogates in the Fitts Task. Frontiers in Physiology 10 (2019), 17. https://doi.org/10.3389/fphys.2019.00998 Publisher: Frontiers.",
      "doi": ""
    },
    {
      "text": "Joanna Bergström, Aske Mottelson, Andreea Muresan, and Kasper Hornb\\a ek. 2019. Tool Extension in Human-Computer Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 568.",
      "doi": "10.1145/3290605.3300798"
    },
    {
      "text": "Jon Bird. 2011. The phenomenal challenge of designing transparent technologies. Interactions 18, 6 (Nov. 2011), 20–23. https://doi.org/10.1145/2029976.2029983",
      "doi": "10.1145/2029976.2029983"
    },
    {
      "text": "Guillermo Borragán, Hichem Slama, Mario Bartolomei, and Philippe Peigneux. 2017. Cognitive fatigue: A Time-based Resource-sharing account. Cortex 89 (April 2017), 71–84. https://doi.org/10.1016/j.cortex.2017.01.023",
      "doi": ""
    },
    {
      "text": "Gunnar Breivik. 2007. Skillful Coping in Everyday Life and in Sport: A Critical Examination of the Views of Heidegger and Dreyfus. Journal of the Philosophy of Sport 34, 2 (Oct. 2007), 116–134. https://doi.org/10.1080/00948705.2007.9714716",
      "doi": ""
    },
    {
      "text": "Géry Casiez and Nicolas Roussel. 2011. No more bricolage!: methods and tools to characterize, replicate and compare pointing transfer functions. In Proceedings of the 24th annual ACM symposium on User interface software and technology - UIST ’11. ACM Press, Santa Barbara, California, USA, 603. https://doi.org/10.1145/2047196.2047276",
      "doi": "10.1145/2047196.2047276"
    },
    {
      "text": "James T. Cavanaugh, Damian G. Kelty-Stephen, and Nicholas Stergiou. 2017. Multifractality, Interactivity, and the Adaptive Capacity of the Human Movement System: A Perspective for Advancing the Conceptual Basis of Neurologic Physical Therapy. Journal of Neurologic Physical Therapy 41, 4 (Oct. 2017), 245–251. https://doi.org/10.1097/NPT.0000000000000199",
      "doi": ""
    },
    {
      "text": "Matthew Chalmers and Areti Galani. 2004. Seamful Interweaving: Heterogeneity in the Theory and Design of Interactive Systems. In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques(DIS ’04). ACM, New York, NY, USA, 243–252. https://doi.org/10.1145/1013115.1013149",
      "doi": "10.1145/1013115.1013149"
    },
    {
      "text": "Matthew Chalmers and Ian MacColl. 2003. Seamful and seamless design in ubiquitous computing. In Proceedings of Ubicomp 2003, Vol. 8. ACM, Seattle, Washington, United States, 8.",
      "doi": ""
    },
    {
      "text": "David Coyle, James Moore, Per Ola Kristensson, Paul Fletcher, and Alan Blackwell. 2012. I did that!: measuring users’ experience of agency in their own actions. In CHI ’12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM Press, Austin, Texas, 2025. https://doi.org/10.1145/2207676.2208350",
      "doi": "10.1145/2207676.2208350"
    },
    {
      "text": "Tehran J. Davis, Thomas R. Brooks, and James A. Dixon. 2016. Multi-scale interactions in interpersonal coordination. Journal of Sport and Health Science 5, 1 (March 2016), 25–34. https://doi.org/10.1016/j.jshs.2016.01.015",
      "doi": ""
    },
    {
      "text": "Lisette de Jonge-Hoekstra, Ralf Cox, Steffie van der Steen, and James A. Dixon. 2020. Easier said than done? Task difficulty’s influence on temporal alignment, semantic similarity, and complexity matching between gestures and speech. preprint. PsyArXiv. https://doi.org/10.31234/osf.io/zsjhf",
      "doi": ""
    },
    {
      "text": "Helena De Preester. 2012. Equipment and Existential Spatiality: Heidegger, Cognitive Science and the Prosthetic. In Heidegger and cognitive science. Palgrave Macmillan, London, 276–308. Publisher: Palgrave Macmillan.",
      "doi": ""
    },
    {
      "text": "Frédéric Dehais, Alex Lafont, Raphaëlle Roy, and Stephen Fairclough. 2020. A Neuroergonomics Approach to Mental Workload, Engagement and Human Performance. Frontiers in Neuroscience 14 (2020), 17. https://doi.org/10.3389/fnins.2020.00268 Publisher: Frontiers.",
      "doi": ""
    },
    {
      "text": "Dix, Alan. 2010. Struggling with Heidegger. https://alandix.com/blog/2010/08/12/struggling-with-heidegger/",
      "doi": ""
    },
    {
      "text": "Kevin Doherty and Gavin Doherty. 2018. Engagement in HCI: Conception, Theory and Measurement. Comput. Surveys 51, 5 (Nov. 2018), 1–39. https://doi.org/10.1145/3234149",
      "doi": "10.1145/3234149"
    },
    {
      "text": "Dobromir Dotov and Anthony Chemero. 2014. Breaking the Perception-Action Cycle: Experimental Phenomenology of Non-Sense and its Implications for Theories of Perception and Movement Science. In Enactive Cognition at the Edge of Sense-Making. Palgrave Macmillan UK, London, 37–60. https://doi.org/10.1057/9781137363367_2",
      "doi": ""
    },
    {
      "text": "Dobromir Dotov and Tom Froese. 2018. Mutual synchronization and control between artificial chaotic system and human. In The 2018 Conference on Artificial Life. MIT Press, Tokyo, Japan, 109–110. https://doi.org/10.1162/isal_a_00028",
      "doi": ""
    },
    {
      "text": "Dobromir Dotov, Lin Nie, Kevin Wojcik, Anastasia Jinks, Xiaoyu Yu, and Anthony Chemero. 2017. Cognitive and movement measures reflect the transition to presence-at-hand. New Ideas in Psychology 45 (April 2017), 1–10. https://doi.org/10.1016/j.newideapsych.2017.01.001",
      "doi": ""
    },
    {
      "text": "Dobromir G. Dotov, Lin Nie, and Anthony Chemero. 2010. A Demonstration of the Transition from Ready-to-Hand to Unready-to-Hand. PLoS ONE 5, 3 (March 2010), e9433. https://doi.org/10.1371/journal.pone.0009433",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2004. Where the action is: the foundations of embodied interaction. MIT press, Cambridge, MA.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Hubert L. Dreyfus and L. Hubert. 1991. Being-in-the-world: A commentary on Heidegger’s Being and Time, Division I. Vol. 1. Mit Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Andras Eke. 2012. Pitfalls in fractal time series analysis: fMRI BOLD as an exemplary case. Frontiers in Physiology 3 (2012), 24. https://doi.org/10.3389/fphys.2012.00417",
      "doi": ""
    },
    {
      "text": "Johan Eliasson, Teresa Cerratto Pargman, and Robert Ramberg. 2009. Embodied Interaction or Context-Aware Computing? An Integrated Approach to Design. In Human-Computer Interaction. New Trends(Lecture Notes in Computer Science), Julie A. Jacko (Ed.). Springer, Berlin, Heidelberg, 606–615. https://doi.org/10.1007/978-3-642-02574-7_68",
      "doi": ""
    },
    {
      "text": "Stefan Engeser and Falko Rheinberg. 2008. Flow, performance and moderators of challenge-skill balance. Motivation and Emotion 32, 3 (Sept. 2008), 158–172. https://doi.org/10.1007/s11031-008-9102-4",
      "doi": ""
    },
    {
      "text": "Luis H. Favela, Mary Jean Amon, Lorena Lobo, and Anthony Chemero. 2021. Empirical Evidence for Extended Cognitive Systems. Cognitive Science 45, 11 (2021), e13060. https://doi.org/10.1111/cogs.13060 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/cogs.13060.",
      "doi": ""
    },
    {
      "text": "Timothy LJ Ferris. 2003. Exploration of the application of’Ready-to-hand’and’Present-at-hand’in the design of systems. PhD Thesis. ANZSYS 2003.",
      "doi": ""
    },
    {
      "text": "Igor Freitas Cruz and Jaime Sampaio. 2020. Multifractal Analysis of Movement Behavior in Association Football. Symmetry 12, 8 (Aug. 2020), 1287. https://doi.org/10.3390/sym12081287 Number: 8 Publisher: Multidisciplinary Digital Publishing Institute.",
      "doi": ""
    },
    {
      "text": "H.-J. Freund. 1986. Time control of hand movements. In Progress in Brain Research. Vol. 64. Elsevier, Amsterdam, 287–294. https://doi.org/10.1016/S0079-6123(08)63423-8",
      "doi": ""
    },
    {
      "text": "Matt Germonprez, Jessie Pallud, and Emmanuel Monod. 2011. Technology embodiment: The contribution of heidegger’s phenomenology. In Proceedings of JAIS Theory Development Workshop. Sprouts: Working Papers on Information Systems. JAIS, Shanghai, 27.",
      "doi": ""
    },
    {
      "text": "D. L. Gilden, T. Thornton, and M. W. Mallon. 1995. 1/f Noise in Human Cognition. Science 267, 5205 (March 1995), 1837–1839. https://www.science.org/doi/abs/10.1126/science.7892611 Publisher: American Association for the Advancement of Science.",
      "doi": ""
    },
    {
      "text": "Goldberger, AL, Amaral, LAN, Glass, L, Hausdorff, JM, Ivanov, PCh, Mark, RG, Mietus, JE, Moody, GB, Peng, C-K, and Stanley, HE. 2002. Software for Analysis of Multifractal Time Series. https://physionet.org/content/multifractal/1.0.0/",
      "doi": ""
    },
    {
      "text": "Goldberger, AL, Amaral, LAN, Glass, L, Hausdorff, JM, Ivanov, PCh, Mark, RG, Mietus, JE, Moody, GB, Peng, C-K, and Stanley, HE. 2003. PhysioBank, PhysioToolkit, and PhysioNet: Components of a New Research Resource for Complex Physiologic Signals. Circulation e215-e220.(2003), e215–e220. https://physionet.org/content/multifractal/1.0.0/",
      "doi": ""
    },
    {
      "text": "Daniel Gopher, Michael Brickner, and David Navon. 1982. Different difficulty manipulations interact differently with task emphasis: Evidence for multiple resources.Journal of Experimental Psychology: Human Perception and Performance 8, 1(1982), 146. Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Martin Heidegger. 1996. Being and time: A translation of Sein und Zeit. SUNY press, New York.",
      "doi": ""
    },
    {
      "text": "Kasper Hornbæk and Antti Oulasvirta. 2017. What Is Interaction?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM Press, Denver, Colorado, USA, 5040–5052. https://doi.org/10.1145/3025453.3025765",
      "doi": "10.1145/3025453.3025765"
    },
    {
      "text": "J. P. Huke. 2006. Embedding Nonlinear Dynamical Systems: A Guide to Takens’ Theorem. http://eprints.maths.manchester.ac.uk/175/ ISSN: 1749-9097 Issue: 2006.26 Library Catalog: eprints.maths.manchester.ac.uk Number: 2006.26 Place: Manchester, UK Publisher: Manchester Institute for Mathematical Sciences, University of Manchester.",
      "doi": ""
    },
    {
      "text": "Espen AF Ihlen and Beatrix Vereijken. 2010. Interaction-dominant dynamics in human cognition: Beyond 1/f fluctuation.Journal of Experimental Psychology: General 139, 3 (2010), 436.",
      "doi": ""
    },
    {
      "text": "Espen A. F. Ihlen. 2012. Introduction to Multifractal Detrended Fluctuation Analysis in Matlab. Frontiers in Physiology 3 (June 2012), 18. https://doi.org/10.3389/fphys.2012.00141",
      "doi": ""
    },
    {
      "text": "Espen A. F. Ihlen and Beatrix Vereijken. 2013. Multifractal formalisms of human behavior. Human Movement Science 32, 4 (Aug. 2013), 633–651. https://doi.org/10.1016/j.humov.2013.01.008",
      "doi": ""
    },
    {
      "text": "Sue Jackson, Bob Eklund, Andrew Martin, and Susan A Jackson. 2012. The FLOW Manual The Manual for the Flow Scales. Mind Garden, Menlo Park.",
      "doi": ""
    },
    {
      "text": "Zhi-Qiang Jiang, Wen-Jie Xie, Wei-Xing Zhou, and Didier Sornette. 2019. Multifractal analysis of financial markets: a review. Reports on Progress in Physics 82, 12 (Nov. 2019), 125901. https://doi.org/10.1088/1361-6633/ab42fb Publisher: IOP Publishing.",
      "doi": ""
    },
    {
      "text": "Peter Jurica. 2018. MFDFA: MultiFractal Detrended Fluctuation Analysis for Time Series. https://mlaib.github.io/MFDFA/",
      "doi": ""
    },
    {
      "text": "Jan W. Kantelhardt. 2008. Fractal and Multifractal Time Series. In Mathematics of Complexity and Dynamical Systems. Springer, Cham, 463–487. http://arxiv.org/abs/0804.0747 arXiv:0804.0747.",
      "doi": ""
    },
    {
      "text": "Stephan Kaufer and Anthony Chemero. 2015. Phenomenology: an introduction. Polity, Cambridge UK.",
      "doi": ""
    },
    {
      "text": "Christopher T. Kello, Gregory G. Anderson, John G. Holden, and Guy C. Van Orden. 2008. The Pervasiveness of 1/f Scaling in Speech Reflects the Metastable Basis of Cognition. Cognitive Science 32, 7 (Oct. 2008), 1217–1231. https://doi.org/10.1080/03640210801944898",
      "doi": ""
    },
    {
      "text": "Damian G. Kelty-Stephen, P. Furmanek Mariusz, and Madhur Mangalam. 2020. Multifractality distinguishes reactive from proactive cascades in postural control. preprint. Neuroscience. https://doi.org/10.1101/2020.10.21.349589",
      "doi": ""
    },
    {
      "text": "Damian G. Kelty-Stephen and Daniel Mirman. 2013. Gaze fluctuations are not additively decomposable: Reply to Bogartz and Staub. Cognition 126, 1 (Jan. 2013), 128–134. https://doi.org/10.1016/j.cognition.2012.09.002",
      "doi": ""
    },
    {
      "text": "Damian G. Kelty-Stephen, Kinga Palatinus, Elliot Saltzman, and James A. Dixon. 2013. A Tutorial on Multifractality, Cascades, and Interactivity for Empirical Time Series in Ecological Science. Ecological Psychology 25, 1 (Jan. 2013), 1–62. https://doi.org/10.1080/10407413.2013.753804",
      "doi": ""
    },
    {
      "text": "Damian G. Kelty-Stephen, Leia A. Stirling, and Lewis A. Lipsitz. 2016. Multifractal temporal correlations in circle-tracing behaviors are associated with the executive function of rule-switching assessed by the Trail Making Test.Psychological Assessment 28, 2 (2016), 171–180. https://doi.org/10.1037/pas0000177",
      "doi": ""
    },
    {
      "text": "Julian Kiverstein and Michael Wheeler. 2012. Heidegger and Cognitive Science. Palgrave Macmillan, London. Google-Books-ID: X5mhCgAAQBAJ.",
      "doi": ""
    },
    {
      "text": "Astrid Twenebowa Larssen, Toni Robertson, and Jenny Edwards. 2007. The feel dimension of technology interaction: exploring tangibles through movement and touch. In Proceedings of the 1st international conference on Tangible and embedded interaction(TEI ’07). Association for Computing Machinery, New York, NY, USA, 271–278. https://doi.org/10.1145/1226969.1227024",
      "doi": "10.1145/1226969.1227024"
    },
    {
      "text": "Aaron D. Likens, Laura K. Allen, and Danielle S. McNamara. 2017. Keystroke Dynamics Predict Essay Quality. In CogSci. Cognitive Science Society, London, 2573–2578.",
      "doi": ""
    },
    {
      "text": "Aaron D. Likens, Justin M. Fine, Eric L. Amazeen, and Polemnia G. Amazeen. 2015. Experimental control of scaling behavior: what is not fractal?Experimental Brain Research 233, 10 (Oct. 2015), 2813–2821. https://doi.org/10.1007/s00221-015-4351-4",
      "doi": ""
    },
    {
      "text": "C. Lopez, F. Lopez, L. F. Castillo, M. Bedia, T. Gomez, and M. Aguilera. 2014. Psychometric Tests in the Field of Drawing Based in Timing Measurements. In Methodologies and Intelligent Systems for Technology Enhanced Learning. Vol. 292. Springer International Publishing, Cham, 101–108.",
      "doi": ""
    },
    {
      "text": "Benoit B. Mandelbrot. 1983. The fractal geometry of nature. Times Books, London.",
      "doi": ""
    },
    {
      "text": "manu mannattil. 2018. NoLiTSA Github Repository. https://github.com/manu-mannattil/nolitsa",
      "doi": ""
    },
    {
      "text": "Maryse Maurel. 2009. The Explicitation Interview: Examples and Applications. Journal of Consciousness Studies 16, 10-11 (Jan. 2009), 58–89.",
      "doi": ""
    },
    {
      "text": "Darian Meacham and Miguel Prado Casanova. 2018. The Over-Extended Mind? Pink Noise and the Ethics of Interaction-Dominant Systems. NanoEthics 12 (Nov. 2018), 13. https://doi.org/10.1007/s11569-018-0325-x",
      "doi": ""
    },
    {
      "text": "Maurice Merleau-Ponty. 1969. Phenomenology of perception. Routledge, Abingdon, Oxfordshire. Publisher: Routledge London.",
      "doi": ""
    },
    {
      "text": "Richard Morris, Paul Marshall, and Yvonne Rogers. 2008. Analysing Fluid Interaction across Multiple Displays. In International Working Conference on Advanced Visual Interfaces. AVI, Naples, 5.",
      "doi": ""
    },
    {
      "text": "Jeanne Nakamura and Mihaly Csikszentmihalyi. 2014. The concept of flow. In Flow and the foundations of positive psychology. Springer, cham, 239–263.",
      "doi": ""
    },
    {
      "text": "Lin Nie, Dobromir G Dotov, and Anthony Chemero. 2011. Readiness-to-hand, extended cognition, and multifractality. In Proceedings of the Annual Meeting of the Cognitive Science Society, Vol. 33. Cognitive Science Society, Merced California, 7.",
      "doi": ""
    },
    {
      "text": "Tetsushi Nonaka and Blandine Bril. 2014. Fractal dynamics in dexterous tool use: The case of hammering behavior of bead craftsmen.Journal of Experimental Psychology: Human Perception and Performance 40, 1(2014), 218–231. https://doi.org/10.1037/a0033277",
      "doi": ""
    },
    {
      "text": "Heather L. O’Brien and Elaine G. Toms. 2010. The development and evaluation of a survey to measure user engagement. Journal of the American Society for Information Science and Technology 61, 1 (Jan. 2010), 50–69. https://doi.org/10.1002/asi.21229",
      "doi": ""
    },
    {
      "text": "Van Orden. 2011. Living in the Pink: Intentionality, Wellbeing, and Complexity - ScienceDirect. https://www.sciencedirect.com/science/article/pii/B9780444520760500225",
      "doi": ""
    },
    {
      "text": "Heather L. O’Brien and Elaine G. Toms. 2013. Examining the generalizability of the User Engagement Scale (UES) in exploratory search. Information Processing & Management 49, 5 (Sept. 2013), 1092–1107. https://doi.org/10.1016/j.ipm.2012.08.005",
      "doi": ""
    },
    {
      "text": "Kate O’Keeffe, Simon Hodder, and Alex Lloyd. 2020. A comparison of methods used for inducing mental fatigue in performance research: individualised, dual-task and short duration cognitive tests are most effective. Ergonomics 63, 1 (Jan. 2020), 1–12. https://doi.org/10.1080/00140139.2019.1687940 Publisher: Taylor & Francis _eprint: https://doi.org/10.1080/00140139.2019.1687940.",
      "doi": ""
    },
    {
      "text": "C.‐K. Peng, Shlomo Havlin, H. Eugene Stanley, and Ary L. Goldberger. 1995. Quantification of scaling exponents and crossover phenomena in nonstationary heartbeat time series. Chaos: An Interdisciplinary Journal of Nonlinear Science 5, 1 (March 1995), 82–87. https://doi.org/10.1063/1.166141 Publisher: American Institute of Physics.",
      "doi": ""
    },
    {
      "text": "C. Petitmengin. 2017. Enaction as a Lived Experience: Towards a Radical Neurophenomenology. Constructivist Foundations 12, 2 (2017), 139–147. https://constructivist.info/12/2/139.petitmengin",
      "doi": ""
    },
    {
      "text": "Richard R. Plant and Garry Turner. 2009. Millisecond precision psychological research in a world of commodity computers: New hardware, new problems?Behavior Research Methods 41, 3 (Aug. 2009), 598–614. https://doi.org/10.3758/BRM.41.3.598",
      "doi": ""
    },
    {
      "text": "Yvan Pratviel, Veronique Deschodt-Arsac, Florian Larrue, and Laurent M. Arsac. 2021. Fast Hand Movements Unveil Multifractal Roots of Adaptation in the Visuomotor Cognitive System. Frontiers in Physiology 12 (July 2021), 713076. https://doi.org/10.3389/fphys.2021.713076",
      "doi": ""
    },
    {
      "text": "Erik Rietveld. 2012. Context-Switching and Responsiveness to Real Relevance. In Heidegger and Cognitive Science. Palgrave Macmillan UK, London, 105–134. https://doi.org/10.1007/978-1-137-00610-3_3",
      "doi": ""
    },
    {
      "text": "P. Romero and E. Calvillo-Gamez. 2014. An Embodied View of Flow. Interacting with Computers 26, 6 (Nov. 2014), 513–527. https://doi.org/10.1093/iwc/iwt051",
      "doi": ""
    },
    {
      "text": "Rydin. 2020. LRydin/MFDFA. https://github.com/LRydin/MFDFA original-date: 2019-11-26T08:01:06Z.",
      "doi": ""
    },
    {
      "text": "Thomas Schreiber and Andreas Schmitz. 1996. Improved Surrogate Data for Nonlinearity Tests. Physical Review Letters 77, 4 (July 1996), 635–638. https://doi.org/10.1103/PhysRevLett.77.635",
      "doi": ""
    },
    {
      "text": "George Sperling and Melvin J. Melchner. 1978. The attention operating characteristic: Examples from visual search. Science 202, 4365 (1978), 315–318. Publisher: American Association for the Advancement of Science.",
      "doi": ""
    },
    {
      "text": "C. Stan, C. Astefanoaei, E. Pretegiani, L. Optican, D. Creanga, A. Rufa, and C. P. Cristescu. 2014. Nonlinear analysis of saccade speed fluctuations during combined action and perception tasks. Journal of Neuroscience Methods 232 (July 2014), 102–109. https://doi.org/10.1016/j.jneumeth.2014.05.010",
      "doi": ""
    },
    {
      "text": "Damian G. Stephen and Jason Anastas. 2011. Fractal fluctuations in gaze speed visual search. Attention, Perception, & Psychophysics 73, 3 (April 2011), 666–677. https://doi.org/10.3758/s13414-010-0069-3",
      "doi": ""
    },
    {
      "text": "Jelle Stienstra, Miguel Bruns Alonso, Stephan Wensveen, and Stoffel Kuenen. 2012. How to design for transformation of behavior through interactive materiality. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design(NordiCHI ’12). Association for Computing Machinery, New York, NY, USA, 21–30. https://doi.org/10.1145/2399016.2399020",
      "doi": "10.1145/2399016.2399020"
    },
    {
      "text": "Thomas Wendt. 2013. Designing for Transparency and the Myth of the Modern Interface | UX Magazine. http://uxmag.com/articles/designing-for-transparency-and-the-myth-of-the-modern-interface",
      "doi": ""
    },
    {
      "text": "Dimitri van der Linden, Michael Frese, and Theo F Meijman. 2003. Mental fatigue and the control of cognitive processes: effects on perseveration and planning. Acta Psychologica 113, 1 (May 2003), 45–65. https://doi.org/10.1016/S0001-6918(02)00150-6",
      "doi": ""
    },
    {
      "text": "Guy C. Van Orden, John G. Holden, and Michael T. Turvey. 2003. Self-organization of cognitive performance.Journal of Experimental Psychology: General 132, 3 (2003), 331–350. https://doi.org/10.1037/0096-3445.132.3.331",
      "doi": ""
    },
    {
      "text": "Sebastian Wallot and Damian G. Kelty-Stephen. 2018. Interaction-Dominant Causation in Mind and Brain, and Its Implication for Questions of Generalization and Replication. Minds and Machines 28, 2 (June 2018), 353–374. https://doi.org/10.1007/s11023-017-9455-0",
      "doi": "10.1007/s11023-017-9455-0"
    },
    {
      "text": "Mark Weiser. 1991. The Computer for the 21 st Century. Scientific american 265, 3 (1991), 94–105.",
      "doi": ""
    },
    {
      "text": "Marc Weiser. 1994. The World is Not a Desktop. interactions 1, 1 (Jan. 1994), 7–8. https://doi.org/10.1145/174800.174801",
      "doi": ""
    },
    {
      "text": "Gerhard Werner. 2010. Fractals in the Nervous System: Conceptual Implications for Theoretical Neuroscience. Frontiers in Physiology 1 (July 2010), 15. https://doi.org/10.3389/fphys.2010.00015",
      "doi": ""
    },
    {
      "text": "Michael Wheeler. 2005. Reconstructing the cognitive world. MIT Press, Cambridge, Ma.",
      "doi": ""
    },
    {
      "text": "Michael Wheeler. 2008. Cognition in Context: Phenomenology, Situated Robotics and the Frame Problem. International Journal of Philosophical Studies 16, 3 (July 2008), 323–349. https://doi.org/10.1080/09672550802113235",
      "doi": ""
    },
    {
      "text": "Michael Wheeler. 2018. The reappearing tool: transparency, smart technology, and the extended mind. AI & SOCIETY 34 (Feb. 2018), 10. https://doi.org/10.1007/s00146-018-0824-x",
      "doi": "10.1007/s00146-018-0824-x"
    },
    {
      "text": "Max L Wilson, Wendy Mackay, Ed Chi, Michael Bernstein, Dan Russell, and Harold Thimbleby. 2011. RepliCHI - CHI should be replicating and validating results more: discuss. In Proceedings of CHI’11 Extended Abstracts on Human Factors in Computing Systems. ACM, Vancouver, British Columbia, Canada, 4.",
      "doi": "10.1145/1979742.1979491"
    },
    {
      "text": "Terry Winograd, Fernando Flores, and Fernando F. Flores. 1986. Understanding computers and cognition: A new foundation for design. Intellect Books, Bristol.",
      "doi": "10.5555/576359"
    }
  ]
}