{
  "doi": "10.1145/3491102.3502141",
  "title": "GANSlider: How Users Control Generative Models for Images using Multiple Sliders with and without Feedforward Information",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "We investigate how multiple sliders with and without feedforward visualizations influence users’ control of generative models. In an online study (N=138), we collected a dataset of people interacting with a generative adversarial network (StyleGAN2) in an image reconstruction task. We found that more control dimensions (sliders) significantly increase task difficulty and user actions. Visual feedforward partly mitigates this by enabling more goal-directed interaction. However, we found no evidence of faster or more accurate task performance. This indicates a tradeoff between feedforward detail and implied cognitive costs, such as attention. Moreover, we found that visualizations alone are not always sufficient for users to understand individual control dimensions. Our study quantifies fundamental UI design factors and resulting interaction behavior in this context, revealing opportunities for improvement in the UI design for interactive applications of generative models. We close by discussing design directions and further aspects.",
  "authors": [
    {
      "name": "Hai Dang",
      "institution": "Department of Computer Science, University of Bayreuth, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702585",
      "orcid": "0000-0003-3617-5657"
    },
    {
      "name": "Lukas Mecke",
      "institution": "Bundeswehr University Munich, Germany and LMU Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659035193",
      "orcid": "missing"
    },
    {
      "name": "Daniel Buschek",
      "institution": "Department of Computer Science, University of Bayreuth, Germany",
      "img": "/do/10.1145/contrib-82659024557/rel-imgonly/daniel.png",
      "acmid": "82659024557",
      "orcid": "0000-0002-0013-715X"
    }
  ],
  "references": [
    {
      "text": "Douglas Bates, Martin Mächler, Ben Bolker, and Steve Walker. 2015. Fitting Linear Mixed-Effects Models Using lme4. Journal of Statistical Software 67, 1 (2015), 1–48. https://doi.org/10.18637/jss.v067.i01",
      "doi": ""
    },
    {
      "text": "David Bau, Hendrik Strobelt, William Peebles, Jonas Wulff, Bolei Zhou, Jun-Yan Zhu, and Antonio Torralba. 2019. Semantic Photo Manipulation with a Generative Image Prior. ACM Trans. Graph. 38, 4, Article 59 (July 2019), 11 pages. https://doi.org/10.1145/3306346.3323023",
      "doi": "10.1145/3306346.3323023"
    },
    {
      "text": "Olivier Bau and Wendy E. Mackay. 2008. OctoPocus: A Dynamic Guide for Learning Gesture-Based Command Sets. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology(Monterey, CA, USA) (UIST ’08). Association for Computing Machinery, New York, NY, USA, 37–46. https://doi.org/10.1145/1449715.1449724",
      "doi": "10.1145/1449715.1449724"
    },
    {
      "text": "Yoshua Bengio, Aaron Courville, and Pascal Vincent. 2013. Representation Learning: A Review and New Perspectives. IEEE Transactions on Pattern Analysis and Machine Intelligence 35, 8(2013), 1798–1828. https://doi.org/10.1109/TPAMI.2013.50",
      "doi": "10.1109/TPAMI.2013.50"
    },
    {
      "text": "Tom B. Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, Sandhini Agarwal, Ariel Herbert-Voss, Gretchen Krueger, Tom Henighan, Rewon Child, Aditya Ramesh, Daniel M. Ziegler, Jeffrey Wu, Clemens Winter, Christopher Hesse, Mark Chen, Eric Sigler, Mateusz Litwin, Scott Gray, Benjamin Chess, Jack Clark, Christopher Berner, Sam McCandlish, Alec Radford, Ilya Sutskever, and Dario Amodei. 2020. Language Models are Few-Shot Learners. (2020). arxiv:2005.14165 [cs.CL]",
      "doi": ""
    },
    {
      "text": "Zana Buçinca, Phoebe Lin, Krzysztof Z. Gajos, and Elena L. Glassman. 2020. Proxy Tasks and Subjective Measures Can Be Misleading in Evaluating Explainable AI Systems. In Proceedings of the 25th International Conference on Intelligent User Interfaces (Cagliari, Italy) (IUI ’20). Association for Computing Machinery, New York, NY, USA, 454–464. https://doi.org/10.1145/3377325.3377498",
      "doi": "10.1145/3377325.3377498"
    },
    {
      "text": "Sven Coppers, Kris Luyten, Davy Vanacken, David Navarre, Philippe Palanque, and Christine Gris. 2019. Fortunettes: Feedforward about the Future State of GUI Widgets. Proc. ACM Hum.-Comput. Interact. 3, EICS, Article 20 (June 2019), 20 pages. https://doi.org/10.1145/3331162",
      "doi": "10.1145/3331162"
    },
    {
      "text": "Emily Denton, Ben Hutchinson, Margaret Mitchell, and Timnit Gebru. 2019. Detecting Bias with Generative Counterfactual Face Attribute Augmentation. CoRR abs/1906.06439(2019). arxiv:1906.06439http://arxiv.org/abs/1906.06439",
      "doi": ""
    },
    {
      "text": "Malin Eiband, Daniel Buschek, and Heinrich Hussmann. 2021. How to Support Users in Understanding Intelligent Systems? Structuring the Discussion. In 26th International Conference on Intelligent User Interfaces (College Station, TX, USA) (IUI ’21). Association for Computing Machinery, New York, NY, USA, 120–132. https://doi.org/10.1145/3397481.3450694",
      "doi": "10.1145/3397481.3450694"
    },
    {
      "text": "Sandra G. Hart. 2006. Nasa-Task Load Index (NASA-TLX); 20 Years Later. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50, 9(2006), 904–908. https://doi.org/10.1177/154193120605000909 arXiv:https://doi.org/10.1177/154193120605000909",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A. Hancock and Najmedin Meshkati (Eds.). Advances in Psychology, Vol. 52. North-Holland, 139–183. https://doi.org/10.1016/S0166-4115(08)62386-9",
      "doi": ""
    },
    {
      "text": "Erik Härkönen, Aaron Hertzmann, Jaakko Lehtinen, and Sylvain Paris. 2020. GANSpace: Discovering Interpretable GAN Controls. arxiv:2004.02546 [cs.CV]",
      "doi": ""
    },
    {
      "text": "Tero Karras, Miika Aittala, Samuli Laine, Erik Härkönen, Janne Hellsten, Jaakko Lehtinen, and Timo Aila. 2021. Alias-Free Generative Adversarial Networks. CoRR abs/2106.12423(2021). arxiv:2106.12423https://arxiv.org/abs/2106.12423",
      "doi": ""
    },
    {
      "text": "Tero Karras, Samuli Laine, and Timo Aila. 2019. A Style-Based Generator Architecture for Generative Adversarial Networks. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR).",
      "doi": ""
    },
    {
      "text": "Tero Karras, Samuli Laine, Miika Aittala, Janne Hellsten, Jaakko Lehtinen, and Timo Aila. 2020. Analyzing and Improving the Image Quality of StyleGAN. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR).",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Cynthia Matuszek, and Sean A. Munson. 2015. Unequal Representation and Gender Stereotypes in Image Search Results for Occupations. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 3819–3828. https://doi.org/10.1145/2702123.2702520",
      "doi": "10.1145/2702123.2702520"
    },
    {
      "text": "Alexandra Kuznetsova, Per B. Brockhoff, and Rune H. B. Christensen. 2017. lmerTest Package: Tests in Linear Mixed Effects Models. Journal of Statistical Software 82, 13 (2017), 1–26. https://doi.org/10.18637/jss.v082.i13",
      "doi": ""
    },
    {
      "text": "Bum Chul Kwon, Hannah Kim, Emily Wall, Jaegul Choo, Haesun Park, and Alex Endert. 2017. AxiSketcher: Interactive Nonlinear Axis Mapping of Visualizations through User Drawings. IEEE Transactions on Visualization and Computer Graphics 23, 1(2017), 221–230. https://doi.org/10.1109/TVCG.2016.2598446",
      "doi": "10.1109/TVCG.2016.2598446"
    },
    {
      "text": "Justin Matejka, Michael Glueck, Tovi Grossman, and George Fitzmaurice. 2016. The Effect of Visual Appearance on the Performance of Continuous Sliders and Visual Analogue Scales. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 5421–5432. https://doi.org/10.1145/2858036.2858063",
      "doi": "10.1145/2858036.2858063"
    },
    {
      "text": "Lukas Mecke, Daniel Buschek, Mathias Kiermeier, Sarah Prange, and Florian Alt. 2019. Exploring Intentional Behaviour Modifications for Password Typing on Mobile Touchscreen Devices. In Fifteenth Symposium on Usable Privacy and Security (SOUPS 2019). USENIX Association, Santa Clara, CA, 303–317. https://www.usenix.org/conference/soups2019/presentation/mecke-behaviour",
      "doi": ""
    },
    {
      "text": "Taesung Park, Ming-Yu Liu, Ting-Chun Wang, and Jun-Yan Zhu. 2019. Semantic Image Synthesis with Spatially-Adaptive Normalization. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition.",
      "doi": ""
    },
    {
      "text": "Taesung Park, Jun-Yan Zhu, Oliver Wang, Jingwan Lu, Eli Shechtman, Alexei A. Efros, and Richard Zhang. 2020. Swapping Autoencoder for Deep Image Manipulation. In Advances in Neural Information Processing Systems.",
      "doi": ""
    },
    {
      "text": "Omkar M. Parkhi, Andrea Vedaldi, and Andrew Zisserman. 2015. Deep Face Recognition. In Proceedings of the British Machine Vision Conference (BMVC), Xianghua Xie, Mark W. Jones, and Gary K. L. Tam (Eds.). BMVA Press, Article 41, 12 pages. https://doi.org/10.5244/C.29.41",
      "doi": ""
    },
    {
      "text": "Forough Poursabzi-Sangdeh, Daniel G Goldstein, Jake M Hofman, Jennifer Wortman Wortman Vaughan, and Hanna Wallach. 2021. Manipulating and Measuring Model Interpretability. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 237, 52 pages. https://doi.org/10.1145/3411764.3445315",
      "doi": "10.1145/3411764.3445315"
    },
    {
      "text": "XiPeng Qiu, TianXiang Sun, YiGe Xu, YunFan Shao, Ning Dai, and XuanJing Huang. 2020. Pre-trained models for natural language processing: A survey. Science China Technological Sciences 63, 10 (Oct. 2020), 1872–1897. https://doi.org/10.1007/s11431-020-1647-3",
      "doi": ""
    },
    {
      "text": "R Core Team. 2020. R: A Language and Environment for Statistical Computing. R Foundation for Statistical Computing, Vienna, Austria. https://www.R-project.org",
      "doi": ""
    },
    {
      "text": "Janet Rafner, Arthur Hjorth, Sebastian Risi, Lotte Philipsen, Charles Dumas, Michael Mose Biskjær, Lior Noy, Kristian Tylén, Carsten Bergenholtz, Jesse Lynch, Blanka Zana, and Jacob Sherson. 2020. Crea.Blender: A Neural Network-Based Image Generation Game to Assess Creativity. In Extended Abstracts of the 2020 Annual Symposium on Computer-Human Interaction in Play (Virtual Event, Canada) (CHI PLAY ’20). Association for Computing Machinery, New York, NY, USA, 340–344. https://doi.org/10.1145/3383668.3419907",
      "doi": "10.1145/3383668.3419907"
    },
    {
      "text": "Janet Rafner, Steven Langsford, Arthur Hjorth, Miroslav Gajdacz, Lotte Philipsen, Sebastian Risi, Joel Simon, and Jacob Sherson. 2021. Utopian or Dystopian?: Using a ML-Assisted Image Generation Game to Empower the General Public to Envision the Future. In Creativity and Cognition (Virtual Event, Italy) (C&C ’21). Association for Computing Machinery, New York, NY, USA, Article 53, 5 pages. https://doi.org/10.1145/3450741.3466815",
      "doi": ""
    },
    {
      "text": "Karl Ridgeway. 2016. A Survey of Inductive Biases for Factorial Representation-Learning. CoRR abs/1612.05299(2016). arxiv:1612.05299http://arxiv.org/abs/1612.05299",
      "doi": ""
    },
    {
      "text": "Andrew Ross, Nina Chen, Elisa Zhao Hang, Elena L. Glassman, and Finale Doshi-Velez. 2021. Evaluating the Interpretability of Generative Models by Interactive Reconstruction. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445296",
      "doi": ""
    },
    {
      "text": "Julia Schwarz, Jennifer Mankoff, and Scott E. Hudson. 2015. An Architecture for Generating Interactive Feedback in Probabilistic User Interfaces. Association for Computing Machinery, New York, NY, USA, 2545–2554. https://doi.org/10.1145/2702123.2702228",
      "doi": ""
    },
    {
      "text": "Kevin Scott. 2020. Microsoft teams up with OpenAI to exclusively license GPT-3 language model. https://blogs.microsoft.com/blog/2020/09/22/microsoft-teams-up-with-openai-to-exclusively-license-gpt-3-language-model/",
      "doi": ""
    },
    {
      "text": "Stanley Tack. 2020. Adobe Photoshop Gets New NVIDIA AI-Powered Neural Filters | NVIDIA Blog. https://blogs.nvidia.com/blog/2020/10/20/adobe-max-ai/",
      "doi": ""
    },
    {
      "text": "Michael Terry and Elizabeth D. Mynatt. 2002. Side Views: Persistent, on-Demand Previews for Open-Ended Tasks. In Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology (Paris, France) (UIST ’02). Association for Computing Machinery, New York, NY, USA, 71–80. https://doi.org/10.1145/571985.571996",
      "doi": "10.1145/571985.571996"
    },
    {
      "text": "Anestis Touloumis. 2015. R Package multgee: A Generalized Estimating Equations Solver for Multinomial Responses. Journal of Statistical Software 64, 8 (2015), 1–14. http://www.jstatsoft.org/v64/i08/",
      "doi": ""
    },
    {
      "text": "Roger Tourangeau, Mick P. Couper, and Frederick Conrad. 2004. Spacing, Position, and Order: Interpretive Heuristics for Visual Features of Survey Questions. Public Opinion Quarterly 68, 3 (Sept. 2004), 368–393. https://doi.org/10.1093/poq/nfh035",
      "doi": ""
    },
    {
      "text": "Theophanis Tsandilas, Anastasia Bezerianos, and Thibaut Jacob. 2015. SketchSliders: Sketching Widgets for Visual Exploration on Wall Displays. Association for Computing Machinery, New York, NY, USA, 3255–3264. https://doi.org/10.1145/2702123.2702129",
      "doi": ""
    },
    {
      "text": "Daniyar Turmukhambetov, Neill D.F. Campbell, Dan B Goldman, and Jan Kautz. 2015. Interactive Sketch-Driven Image Synthesis. Computer Graphics Forum 34, 8 (2015), 130–142. https://doi.org/10.1111/cgf.12665 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/cgf.12665",
      "doi": "10.1111/cgf.12665"
    },
    {
      "text": "James Vincent. 2020. What a machine learning tool that turns Obama white can (and can’t) tell us about AI bias. https://www.theverge.com/21298762/face-depixelizer-ai-machine-learning-tool-pulse-stylegan-obama-bias",
      "doi": ""
    },
    {
      "text": "Wesley Willett, Jeffrey Heer, and Maneesh Agrawala. 2007. Scented Widgets: Improving Navigation Cues with Embedded Visualizations. IEEE Transactions on Visualization and Computer Graphics 13, 6 (Nov. 2007), 1129–1136. https://doi.org/10.1109/TVCG.2007.70589",
      "doi": "10.1109/TVCG.2007.70589"
    },
    {
      "text": "Austin P. Wright, Zijie J. Wang, Haekyu Park, Grace Guo, Fabian Sperrle, Mennatallah El-Assady, Alex Endert, Daniel A. Keim, and Duen Horng Chau. 2020. A Comparative Analysis of Industry Human-AI Interaction Guidelines. CoRR abs/2010.11761(2020). arxiv:2010.11761https://arxiv.org/abs/2010.11761",
      "doi": ""
    },
    {
      "text": "Mengyu Yang, David Rokeby, and Xavier Snelgrove. 2020. Mask-Guided Discovery of Semantic Manifolds in Generative Models. In 4th Workshop on Machine Learning for Creativity and Design at NeurIPS 2020.",
      "doi": ""
    },
    {
      "text": "Enhao Zhang and Nikola Banovic. 2021. Method for Exploring Generative Adversarial Networks (GANs) via Automatically Generated Image Galleries. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445714",
      "doi": ""
    },
    {
      "text": "Jun-Yan Zhu, Philipp Krähenbühl, Eli Shechtman, and Alexei A. Efros. 2016. Generative Visual Manipulation on the Natural Image Manifold. In Proceedings of European Conference on Computer Vision (ECCV).",
      "doi": ""
    }
  ]
}