{
  "doi": "10.1145/3491102.3517500",
  "title": "Designing Human-Agent Collaborations: Commitment, responsiveness, and support",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "With the advancements in AI, agents (i.e., smart products, robots, software agents) are increasingly capable of working closely together with humans in a variety of ways while benefiting from each other. These human-agent collaborations have gained growing attention in the HCI community; however, the field lacks clear guidelines on how to design the agents’ behaviors in collaborations. In this paper, the qualities that are relevant for designers to create robust and pleasant human-agent collaborations were investigated. Bratman's Shared Cooperative Activity framework was used to identify the core characteristics of collaborations and survey the most important issues in the design of human-agent collaborations, namely code-of-conduct, task delegation, autonomy and control, intelligibility, common ground, offering help and requesting help. The aim of this work is to add structure to this growing and important facet of HCI research and operationalize the concept of human-agent collaboration with concrete design considerations.",
  "authors": [
    {
      "name": "Nazli Cila",
      "institution": "Human-Centered Design, Delft University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019752",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ashraf Abdul, Jo Vermeulen, Danding Wang, Brian Y. Lim, and Mohan Kankanhalli. 2018. Trends and Trajectories for Explainable, Accountable and Intelligible Systems: An HCI Research Agenda. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Paper 582, 1–18. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/3173574.3174156",
      "doi": "10.1145/3173574.3174156"
    },
    {
      "text": "Alper T. Alan, Enrico Costanza, Sarvapali D. Ramchurn, Joel Fischer, Tom Rodden, and Nicholas R. Jennings. 2016. Tariff Agent: Interacting with a Future Smart Energy System at Home. ACM Trans. Comput.-Hum. Interact. 23, 4, Article 25 (September 2016), 28 pages. DOI:https://doi.org/10.1145/2943770",
      "doi": "10.1145/2943770"
    },
    {
      "text": "Victoria Alonso and Paloma de la Puente. 2018. System transparency in shared autonomy: a mini review. Front Neurorobot 12, 83. DOI: https://doi.org/10.3389/fnbot.2018.00083",
      "doi": ""
    },
    {
      "text": "Patrícia Alves-Oliveira, Maria Luce Lupetti, Michal Luria, Diana Löffler, Mafalda Gamboa, Lea Albaugh, Waki Kamino, Anastasia K. Ostrowski, David Puljiz, Pedro Reynolds-Cuéllar, Marcus Scheunemann, Michael Suguitan, and Dan Lockton. 2021. Collection of Metaphors for Human-Robot Interaction. Designing Interactive Systems Conference 2021. Association for Computing Machinery, New York, NY, USA, 1366–1379. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/3461778.3462060",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Paper 3, 1–13. DOI:10.1145/3290605.3300233",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Siddhartha Banerjee, Andrew Silva, and Sonia Chernova. 2018. Robot Classification of Human Interruptibility and a Study of Its Effects. J. Hum.-Robot Interact. 7, 2, Article 14 (October 2018), 35 pages. DOI:https://doi.org/10.1145/3277902",
      "doi": "10.1145/3277902"
    },
    {
      "text": "Jimmy Baraglia, Maya Cakmak, Yukie Nagai, Rajesh Rao, and Minoru Asada. 2016. Initiative in robot assistance during collaborative task execution. In 2016 11th ACM/IEEE international conference on human-robot interaction (HRI), IEEE, 67-74. DOI: 10.1109/HRI.2016.7451735",
      "doi": ""
    },
    {
      "text": "Jimmy Baraglia, Yukie Nagai, and Minoru Asada. 2014. Prediction error minimization for emergence of altruistic behavior. In 4th Intl. conf. on Development and Learning and on Epigenetic Robotics, IEEE, 281–286. DOI: 0.1109/DEVLRN.2014.6982994",
      "doi": ""
    },
    {
      "text": "Christoph Bartneck, Tony Belpaeme, Friederike Eyssel, Takayuki Kanda, Merel Keijsers, and Selma Šabanović. 2020. Human-robot interaction: An introduction. Chapter 10. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Jenay M. Beer, Arthur D. Fisk, and Wendy A. Rogers. 2014. Toward a framework for levels of robot autonomy in human-robot interaction. J. Hum.-Robot Interact. 3, 2, 74-99. DOI: https://doi.org/10.5898/JHRI.3.2.Beer",
      "doi": "10.5898/JHRI.3.2.Beer"
    },
    {
      "text": "Edmon Begoli, Tanmoy Bhattacharya, and Dimitri Kusnezov. 2019. The need for uncertainty quantification in machine-assisted medical decision making. Nature-Machine Intelligence 1, 1 (jan 2019), 20–23. https://doi.org/10.1038/s42256-018-0004-1",
      "doi": ""
    },
    {
      "text": "Rachel K. E. Bellamy, Sean Andrist, Timothy Bickmore, Elizabeth F. Churchill, and Thomas Erickson. 2017. Human-Agent Collaboration: Can an Agent be a Partner? In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). Association for Computing Machinery, New York, NY, USA, 1289–1294. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/3027063.3051138",
      "doi": "10.1145/3027063.3051138"
    },
    {
      "text": "Tony Belpaeme, James Kennedy, Paul Baxter, Paul Vogt, Emiel E. J. Krahmer, Stefan Kopp, Kirsten Bergmann, Paul Leseman, Aylin C. Kuntay, Tilbe Goksun, 2015. L2tor-second language tutoring using social robots. In Proceedings of the ICSR 2015 WONDER Workshop. https://pub.uni-bielefeld.de/download/2900267/2900268.",
      "doi": ""
    },
    {
      "text": "Jesse Josua Benjamin, Arne Berger, Nick Merrill, and James Pierce. 2021. Machine Learning Uncertainty as a Design Material: A Post-Phenomenological Inquiry. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 171, 1–14. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/3411764.3445481",
      "doi": "10.1145/3411764.3445481"
    },
    {
      "text": "Olle Blomberg. 2015. Shared Agency: A Planning Theory of Acting Together By Michael Bratman. Analysis, 75, 2, 346. Oxford University Press. DOI:10.1093/analys/anu155",
      "doi": ""
    },
    {
      "text": "Jan O. Borchers. 2008. A pattern approach to interaction design. In Cognition, Communication and Interaction, 114-131. Springer, London, 2008.",
      "doi": ""
    },
    {
      "text": "Michael Bratman. 1992. Shared Cooperative Activity. The Philosophical Review, 101, 2, 327-341. doi:10.2307/2185537",
      "doi": ""
    },
    {
      "text": "Michael Bratman. 1993. Shared intention. Ethics, 104, 97-113. DOI:https://doi-org.tudelft.idm.oclc.org/10.1086/293577",
      "doi": ""
    },
    {
      "text": "Alfred Benedikt Brendel, Maike Greve, Stephan Diederich, Johannes Bührke, and Lutz M. Kolbe. 2020. You are an Idiot! How Conversational Agent Communication Patterns Influence Frustration and Harassment. 2020. AMCIS 2020 Proceedings. 13.",
      "doi": ""
    },
    {
      "text": "Penelope Brown and Stephen C. Levinson. 1978. Universals in language usage: Politeness phenomena. In Questions and politeness: Strategies in social interaction, pp. 56-311. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Eva Burneleit, Fabian Hemmert, and Reto Wettach. 2009. Living interfaces: the impatient toaster. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (TEI '09). Association for Computing Machinery, New York, NY, USA, 21–22. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/1517664.1517673",
      "doi": "10.1145/1517664.1517673"
    },
    {
      "text": "Daniel J. Butler, Justin Huang, Franziska Roesner, and Maya Cakmak. 2015. The Privacy-Utility Tradeoff for Remotely Teleoperated Robots. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction (HRI '15). Association for Computing Machinery, New York, NY, USA, 27–34. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/2696454.2696484",
      "doi": "10.1145/2696454.2696484"
    },
    {
      "text": "Jaime R. Carbonell. 1970. Mixed-initiative man-computer instructional dialogues. Final report. Tech. Rep. No. BBN-1971, Job No. 11399. Cambridge, MA: Bolt Beranek & Newman, Inc.",
      "doi": ""
    },
    {
      "text": "Elizabeth Cha, Anca D. Dragan, and Siddhartha S. Srinivasa. 2015. Perceived robot capability. In Proceedings of the Twenty-Fourth IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). 541–548. DOI: 10.1109/ROMAN.2015.7333656",
      "doi": "10.1109/ROMAN.2015.7333656"
    },
    {
      "text": "Joyce Y. Chai, Lanbo She, Rui Fang, Spencer Ottarson, Cody Littley, Changsong Liu, and Kenneth Hanson. 2014. Collaborative effort towards common ground in situated human-robot dialogue.\" In 2014 9th ACM/IEEE International Conference on Human-Robot Interaction (HRI), IEEE, 33-40.",
      "doi": ""
    },
    {
      "text": "Mai Lee Chang, Taylor Kessler Faulkner, Thomas Benjamin Wei, Elaine Schaertl Short, Gokul Anandaraman, and Andrea Lockerd Thomaz. 2020. TASC: Teammate Algorithm for Shared Cooperation. In 2020 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEE. DOI: 10.1109/IROS45743.2020.9340983",
      "doi": "10.1109/IROS45743.2020.9340983"
    },
    {
      "text": "EunJeong Cheon and Norman Makoto Su. 2016. Integrating roboticist values into a Value Sensitive Design framework for humanoid robots. 11th ACM/IEEE International Conference on Human-Robot Interaction (HRI), 375-382, doi: 10.1109/HRI.2016.7451775.",
      "doi": ""
    },
    {
      "text": "Yi-Shiu Chiang, Ting-Sheng Chu, Chung Dial Lim, Tung-Yen Wu, Shih-Huan Tseng, and Li-Chen Fu. 2014. Personalizing robot behavior for interruption in social human-robot interaction. In 2014 IEEE International Workshop on Advanced Robotics and its Social Impacts. IEEE, 44–49. https://doi.org/10.1109/ARSO.2014.7020978",
      "doi": ""
    },
    {
      "text": "Nazli Cila, Iskander Smit, Elisa Giaccardi, and Ben Kröse. 2017. Products as Agents: Metaphors for Designing the Products of the IoT Age. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 448–459. DOI:https://doi.org/10.1145/3025453.3025797",
      "doi": "10.1145/3025453.3025797"
    },
    {
      "text": "Mark Coeckelbergh. 2020. AI Ethics. MIT Press.",
      "doi": ""
    },
    {
      "text": "Philip R. Cohen and Hector J. Levesque. 1991. Teamwork. Nous 25, 4, 487-512.",
      "doi": ""
    },
    {
      "text": "Francesco Corea. 2019. Distributed Artificial Intelligence. Retrieved from: https://francesco-ai.medium.com/distributed-artificial-intelligence-3e3491e0771c",
      "doi": ""
    },
    {
      "text": "Elizabeth Clark, Anne Spencer Ross, Chenhao Tan, Yangfeng Ji, and Noah A. Smith. 2018. Creative Writing with a Machine in the Loop: Case Studies on Slogans and Stories. In 23rd International Conference on Intelligent User Interfaces (IUI’ 18). Association for Computing Machinery, New York, NY, USA, 329–340. DOI:http://dx.doi.org/10.1145/3172944.3172983",
      "doi": "10.1145/3172944.3172983"
    },
    {
      "text": "Herbert H. Clark. 1996. Using language. New York, NY: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Herbert H. Clark. 2005. Coordinating with each other in a material world. Discourse Studies, 7, 507–525.",
      "doi": ""
    },
    {
      "text": "Herbert H. Clark and Susan E. Brennan. 1991. Grounding in communication. In L. B. Resnick, J. M. Levine, & S. D. Teasley (Eds.), Perspectives on Socially Shared Cognition (127-149). Washington, D.C.: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Allan Dafoe, Yoram Bachrach, Gillian Hadfield, Eric Horvitz, Kate Larson, and Thore Graepel. 2021. Cooperative AI: machines must learn to find common ground. Nature, 593, 33-36. DOI: 10.1038/d41586-021-01170-0",
      "doi": ""
    },
    {
      "text": "Sylvain Daronnat, Leif Azzopardi, Martin Halvey, and Mateusz Dubiel. 2020. Impact of Agent Reliability and Predictability on Trust in Real Time Human-Agent Collaboration. In Proceedings of the 8th International Conference on Human-Agent Interaction (HAI '20). Association for Computing Machinery, New York, NY, USA, 131–139. DOI:https://doi.org/10.1145/3406499.3415063",
      "doi": "10.1145/3406499.3415063"
    },
    {
      "text": "Maartje M. A. de Graaf and Bertram F. Malle. 2017. How People Explain Action (and Autonomous Intelligent Systems Should Too). AAAI 2017 Fall Symposium on \"AI-HRI\", 19-26.",
      "doi": ""
    },
    {
      "text": "Maartje M. A. de Graaf and Bertram F. Malle. 2019. People's Explanations of Robot Behavior Subtly Reveal Mental State Inferences. 14th ACM/IEEE International Conference on Human-Robot Interaction (HRI), 239-248. doi: 10.1109/HRI.2019.8673308.",
      "doi": ""
    },
    {
      "text": "Ewart J. De Visser, Marieke M. M. Peeters, Malte F. Jung, Spencer Kohn, Tyler H. Shaw, Richard Pak, and Mark A. Neerincx. 2020. Towards a theory of longitudinal trust calibration in human–robot teams. Int. j. of soc. robotics 12, 2, 459-478. DOI:10.1007/s12369-019-00596-x",
      "doi": ""
    },
    {
      "text": "Carl F. Disalvo, Francine Gemperle, Jodi Forlizzi, and Sara Kiesler. 2002. All robots are not created equal: The design and perception of humanoid robot heads. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS’02). 321–326.",
      "doi": "10.1145/778712.778756"
    },
    {
      "text": "Judith Dörrenbächer, Diana Löffler, and Marc Hassenzahl. 2020. Becoming a Robot - Overcoming Anthropomorphism with Techno-Mimesis. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. DOI:https://doi.org/10.1145/3313831.3376507",
      "doi": "10.1145/3313831.3376507"
    },
    {
      "text": "Anca D. Dragan, Shira Bauman, Jodi Forlizzi, and Siddhartha S. Srinivasa. 2015. Effects of robot motion on human-robot collaboration. In Proceedings of the 10th Annual ACM/IEEE International Conference on Human–Robot Interaction. ACM, 51–58.",
      "doi": ""
    },
    {
      "text": "Alpana Dubey, Kumar Abhinav, Sakshi Jain, Veenu Arora, and Asha Puttaveerana. 2020. HACO: A Framework for Developing Human-AI Teaming. In Proceedings of the 13th Innovations in Software Engineering Conference on Formerly known as India Software Engineering Conference (ISEC 2020). Association for Computing Machinery, New York, NY, USA, Article 10, 1–9. DOI:10.1145/3385032.3385044",
      "doi": "10.1145/3385032.3385044"
    },
    {
      "text": "Brian Duffy. 2003. Anthropomorphism and the social robot. 2003. Robotics and Autonomous Systems, 42, 3, 177–190. https://doi.org/10.1016/S0921-8890(02)00374-3",
      "doi": ""
    },
    {
      "text": "Joseph F. Engelberger. 1980. Robotics in practice: management and applications of industrial robots. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Vanessa Evers, Heidy Maldonado, Talia Brodecki, and Pamela Hinds. 2008. Relational vs. group self-construal: Untangling the role of national culture in HRI. In 2008 3rd ACM/IEEE International Conference on Human-Robot Interaction (HRI), IEEE, 255-262. doi: 10.1145/1349822.1349856.",
      "doi": "10.1145/1349822.1349856"
    },
    {
      "text": "Umer Farooq and Jonathan Grudin. 2016. Human-computer integration. interactions 23, 6 (November-December 2016), 26–32. DOI:https://doi.org/10.1145/3001896",
      "doi": ""
    },
    {
      "text": "Fanny Ficuciello, Guglielmo Tamburrini, Alberto Arezzo, Luigi Villani, and Bruno Siciliano. 2019. Autonomy in surgical robots and its meaningful human control. J. of Behavioral Robotics 10, 1, 30-43. DOI: 10.1515/pjbr-2019-0002",
      "doi": ""
    },
    {
      "text": "Luciano Floridi, Josh Cowls, Monica Beltrametti, Raja Chatila, Patrice Chazerand, Virginia Dignum, Christoph Luetge 2018. AI4People—an ethical framework for a good AI society: opportunities, risks, principles, and recommendations. Minds and Machines, 28, 4, 689-707. DOI:10.1007/s11023-018-9482-5",
      "doi": "10.1007/s11023-018-9482-5"
    },
    {
      "text": "Terrence W. Fong. 2001. Collaborative control: A robot-centric model for vehicle teleoperation. Pittsburgh, PA: Robotics Institute, Carnegie Mellon University.",
      "doi": ""
    },
    {
      "text": "Eduard Fosch-Villaronga, Pranav Khanna, Hadassah Drukarch, and Bart H. M. Custers. 2021. A human in the loop in surgery automation. Nature Machine Intelligence 3, 5, 368-369. DOI:10.1038/s42256-021-00349-4",
      "doi": ""
    },
    {
      "text": "Elisa Giaccardi and Johan Redström. 2020. Technology and more-than-human design. Design Issues 36, 4, 33-44.",
      "doi": ""
    },
    {
      "text": "Margaret Gilbert. 1987. Modelling collective belief. Synthese, 73, 1, 185-204.",
      "doi": ""
    },
    {
      "text": "Margaret Gilbert. 2003. The structure of the social atom: Joint commitment as the foundation of human social behavior. In Socializing metaphysics, ed. Frederick Schmitt. Lanham, MD: Rowman & Littlefield. 39-64.",
      "doi": ""
    },
    {
      "text": "Kate Goddard, Abdul Roudsari, and Jeremy C. Wyatt. 2012. Automation bias: a systematic review of frequency, effect mediators, and mitigators. J. of the American Medical Informatics Association, 19, 1, 121-127. DOI:10.1136/amiajnl-2011-000089",
      "doi": ""
    },
    {
      "text": "Michael A. Goodrich and Dan R. Olsen. 2003. Seven principles of efficient human robot interaction. In Proceedings of the IEEE International Conference on Systems, Man, and Cybernetics. DOI: 10.1109/ICSMC.2003.1244504",
      "doi": ""
    },
    {
      "text": "Alvin I. Goldman. 2012. Theory of mind. In E. Margolis, & S. P. Stich (Eds.). The Oxford Handbook of Philosophy of Cognitive Science, 402–424. London: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Eberhard Graether and Florian Mueller. 2012. Joggobot: a flying robot as jogging companion. CHI '12 Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1063–1066. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/2212776.2212386",
      "doi": "10.1145/2212776.2212386"
    },
    {
      "text": "Barbara J. Grosz. 1996. Collaborative systems (AAAI-94 presidential address). AI magazine, 17, 2, 67.",
      "doi": ""
    },
    {
      "text": "Barbara J. Grosz and Sarit Kraus. 1996. Collaborative plans for complex group action. Artificial Intelligence, 86, 2, 269-357.",
      "doi": "10.1016/0004-3702%2895%2900103-4"
    },
    {
      "text": "Barbara J. Grosz and Candace L. Sidner. 1990. Plans for discourse. In P. R. Cohen, J. Morgan, & M. E. Pollack (Eds.), Intentions in communication (Chapter 20). Cambridge, MA: The MIT Press.",
      "doi": ""
    },
    {
      "text": "Thilo Hagendorff. 2020. The Ethics of AI Ethics: An Evaluation of Guidelines. Minds & Machines, 30, 99–120. DOI: 10.1007/s11023-020-09517-8",
      "doi": "10.1007/s11023-020-09517-8"
    },
    {
      "text": "Maaike Harbers, Karel van den Bosch, and John-Jules Ch. Meyer. 2009. A study into preferred explanations of virtual agent behavior. In Proceedings of the 9th International Conference on Intelligent Virtual Agents. Amsterdam, The Netherlands, 132-145. https://doi.org/10.1007/978-3-642-04380-2_17",
      "doi": ""
    },
    {
      "text": "Benjamin Hardin and Michael A. Goodrich. 2009. On using mixed-initiative control: a perspective for managing large-scale robotic teams. In Proceedings of the 4th ACM/IEEE international conference on Human robot interaction (HRI '09). Association for Computing Machinery, New York, NY, USA, 165–172. DOI:https://doi.org/10.1145/1514095.1514126",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl, Jan Borchers, Susanne Boll, Astrid Rosenthal-von der Pütten, and Volker Wulf. 2020. Otherware: how to best interact with autonomous systems. interactions 28, 1 (January - February 2021), 54–57. DOI:https://doi.org/10.1145/3436942",
      "doi": ""
    },
    {
      "text": "Pamela J. Hinds, Teresa L. Roberts, and Hank Jones. 2004. Whose job is it anyway? A study of human-robot interaction in a collaborative task. Human–Computer Interaction, 19, 1-2, 151-181. DOI: 10.1080/07370024.2004.9667343",
      "doi": ""
    },
    {
      "text": "Guy Hoffman and Cynthia Breazeal. 2004. Collaboration in human-robot teams. In AIAA 1st Intelligent Systems Technical Conference. 6434.",
      "doi": ""
    },
    {
      "text": "Lars Erik Holmquist. 2017. Intelligence on tap: artificial intelligence as a new design material. interactions 24, 4 (July-August 2017), 28–33. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/3085571",
      "doi": "10.1145/3085571"
    },
    {
      "text": "Chien-Ming Huang and Bilge Mutlu. 2016. Anticipatory robot control for efficient human-robot collaboration. In Proceedings of 11th ACM/IEEE International Conference on Human-Robot Interaction (HRI’16). DOI:10.1109/HRI.2016.7451737",
      "doi": ""
    },
    {
      "text": "Giulio Jacucci, Anna Spagnolli, Jonathan Freeman, and Luciano Gamberini. 2015. Symbiotic interaction: a critical definition and comparison to other human-computer paradigms. In International workshop on symbiotic interaction, pp. 3-20. Springer, Cham.",
      "doi": ""
    },
    {
      "text": "Siddarth Jain and Brenna Argall. 2019. Probabilistic Human Intent Recognition for Shared Autonomy in Assistive Robotics. J. Hum.-Robot Interact. 9, 1, Article 2 (December 2019), 23 pages. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/3359614",
      "doi": "10.1145/3359614"
    },
    {
      "text": "Nicholas R. Jennings, Luc Moreau, David Nicholson, Sarvapali Ramchurn, Stephen Roberts, Tom Rodden, and Alex Rogers. 2014. Human-agent collectives. Communications of the ACM 57, 12, 80-88. DOI:https://doi.org/10.1145/2629559",
      "doi": "10.1145/2629559"
    },
    {
      "text": "Matthew Johnson, Jeffrey M. Bradshaw, Paul J. Feltovich, Catholijn M. Jonker, M. Birna van Riemsdijk, and Maarten Sierhuis. 2014. Coactive design: designing support for interdependence in joint activity. J. Hum.-Robot Interact. 3, 1 (February 2014), 43–69. DOI:https://doi.org/10.5898/JHRI.3.1.Johnson",
      "doi": "10.5898/JHRI.3.1.Johnson"
    },
    {
      "text": "Malte F. Jung, David Sirkin, Turgut M. Gür, and Martin Steinert. 2015. Displayed Uncertainty Improves Driving Experience and Behavior: The Case of Range Anxiety in an Electric Car. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2201–2210. DOI:10.1145/2702123.2702479",
      "doi": "10.1145/2702123.2702479"
    },
    {
      "text": "David B. Kaber and Mica R. Endsley. 2004. The effects of level of automation and adaptive automation on human performance, situation awareness and workload in a dynamic control task. Theoretical Issues in Ergonomics Science, 5, 2, 113-153. DOI:10.1080/1463922021000054335",
      "doi": ""
    },
    {
      "text": "Frank Kaptein, Joost Broekens, Koen Hindriks, and Mark Neerincx. 2017. Personalised self-explanation by robots: The role of goals versus beliefs in robot-action explanation for children and adults. In 26th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). Lisbon, Portugal, 676ś682. https://doi.org/10.1109/ROMAN.2017.8172376",
      "doi": "10.1109/ROMAN.2017.8172376"
    },
    {
      "text": "Merel Keijsers, Hussain Kazmi, Friederike Eyssel, and Christoph Bartneck. 2021. Teaching Robots a Lesson: Determinants of Robot Punishment. Int J of Soc Robotics 13, 41–54. DOI:10.1007/s12369-019-00608-w",
      "doi": ""
    },
    {
      "text": "Richard Kelley, Alireza Tavakkoli, Christopher King, Monica Nicolescu, Mircea Nicolescu, and George Bebis. 2008. Understanding human intentions via hidden markov models in autonomous mobile robots. In Proceedings of the 3rd ACM/IEEE international conference on Human robot interaction (HRI '08). Association for Computing Machinery, New York, NY, USA, 367–374. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/1349822.1349870",
      "doi": "10.1145/1349822.1349870"
    },
    {
      "text": "Paul T. Kidd, Mansour Rahimi, and Waldemar Karwowski. 1992. Design of human-centered robotic systems. In human robot interaction, pp. 225-241. London, UK: Taylor and Francis.",
      "doi": ""
    },
    {
      "text": "Sara Kiesler. 2005. Fostering common ground in human-robot interaction. In ROMAN 2005. IEEE International Workshop on Robot and Human Interactive Communication, IEEE, 729-734. DOI:10.1109/ROMAN.2005.1513866",
      "doi": ""
    },
    {
      "text": "Peter Y. Kim. 2020. Where We're Going, We Don't Need Drivers: Autonomous Vehicles and AI-Chaperone Liability. Cath. UL Rev. 69, 341.",
      "doi": ""
    },
    {
      "text": "Günther Knoblich, Stephen Butterfill, and Natalie Sebanz. 2011. Psychological research on joint action: theory and data. Psychology of learning and motivation, 54, 59-101.",
      "doi": ""
    },
    {
      "text": "Hideki, Kozima, Marek P. Michalowski, and Cocoro Nakagawa. 2009. Keepon. Int. J. of Soc. Robotics, 1, 1, 3-18.",
      "doi": ""
    },
    {
      "text": "Nicole C. Krämer, Astrid von der Pütten, and Sabrina Eimler. 2012. Human-agent and human-robot interaction theory: similarities to and differences from human-human interaction. In Human-computer interaction: The agency perspective, pp. 215-240. Springer, Berlin, Heidelberg.",
      "doi": ""
    },
    {
      "text": "Christopher Kutz. 2000. Acting together. Philosophical and Phenomenological Research, 1-31.",
      "doi": ""
    },
    {
      "text": "Minae Kwon, Sandy H. Huang, and Anca D. Dragan. 2018. Expressing Robot Incapability. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction (HRI '18). Association for Computing Machinery, New York, NY, USA, 87–95. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/3171221.3171276",
      "doi": ""
    },
    {
      "text": "Maria Kyrarini, Fotios Lygerakis, Akilesh Rajavenkatanarayanan, Christos Sevastopoulos, Harish R. Nambiappan, Kodur K. Chaitanya, Ashwin R. Babu, Joanne Mathew, and Fillia Makedon. 2021. A Survey of Robots in Healthcare. Technologies, 9, 1, 8. https://doi.org/10.3390/technologies9010008",
      "doi": ""
    },
    {
      "text": "David Landén, Fredrik Heintz, and Patrick Doherty. 2010. Complex task allocation in mixed-initiative delegation: A UAV case study. In International conference on principles and practice of multi-agent systems, 288-303. Springer, Berlin, Heidelberg.",
      "doi": "10.1007/978-3-642-25920-3_20"
    },
    {
      "text": "Florent Levillain and Elisabetta Zibetti. 2017. Behavioral objects: the rise of the evocative machines. J. Hum.-Robot Interact. 6, 1 (May 2017), 4–24. DOI:10.5898/JHRI.6.1.Levillain",
      "doi": "10.5898/JHRI.6.1.Levillain"
    },
    {
      "text": "Joseph C.R. Licklider. 1960. Man-computer symbiosis. IRE transactions on human factors in electronics, 1, 4-11.",
      "doi": ""
    },
    {
      "text": "Amanda Loudin. 2019. Novak Djokovic Used A.I. to Train for Wimbledon. Retrieved Sep 8, 2021 from https://onezero.medium.com/novak-djokovic-used-a-i-to-train-for-wimbledon-e22b62f7504a",
      "doi": ""
    },
    {
      "text": "Todd Lubart. 2005. How can computers be partners in the creative process: classification and commentary on the special issue. Int. J. of Human-Computer Studies, 63, 4-5, 365–369.",
      "doi": "10.1016/j.ijhcs.2005.04.002"
    },
    {
      "text": "Kirk Ludwig. 2020. What Is Minimally Cooperative Behavior?. In Minimal Cooperation and Shared Agency, 9-39. Springer, Cham.",
      "doi": ""
    },
    {
      "text": "Michal Luria, Rebecca Zheng, Bennett Huffman, Shuangni Huang, John Zimmerman, and Jodi Forlizzi. 2020. Social Boundaries for Personal Agents in the Interpersonal Space of the Home. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. DOI:https://doi.org/10.1145/3313831.3376311",
      "doi": "10.1145/3313831.3376311"
    },
    {
      "text": "Bertram F. Malle, Matthias Scheutz, Thomas Arnold, John Voiklis, and Corey Cusimano. 2015. Sacrifice one for the good of many? People apply different moral norms to human and robot agents. In 2015 10th ACM/IEEE International Conference on Human-Robot Interaction (HRI), IEEE, 117-124.",
      "doi": ""
    },
    {
      "text": "Maja J. Matarić. 2017. Socially assistive robotics: Human augmentation versus automation. Science Robotics, 2, 4.",
      "doi": ""
    },
    {
      "text": "Daniel McFarlane and Kara Latorella. 2002. The scope and importance of human interruption in human-computer interaction design. Human-Computer Interaction 17, 1 (Mar. 2002), 1–61. https://doi.org/10.1207/S15327051HCI1701_1",
      "doi": "10.1207/S15327051HCI1701_1"
    },
    {
      "text": "Jim Mainprice and Dmitry Berenson. 2013. Human-robot collaborative manipulation planning using early prediction of human motion. In 2013 IEEE/RSJ International Conference on Intelligent Robots and Systems, IEEE, 299-306. DOI:0.1109/IROS.2013.6696368",
      "doi": ""
    },
    {
      "text": "Jon McCormack, Toby Gifford, Patrick Hutchings, Maria Teresa Llano Rodriguez, Matthew Yee-King, and Mark d'Inverno. 2019. In a Silent Way: Communication Between AI and Improvising Musicians Beyond Sound. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Paper 38, 1–11. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/3290605.3300268",
      "doi": "10.1145/3290605.3300268"
    },
    {
      "text": "Giulio Mecacci and Filippo Santoni de Sio. 2020. Meaningful human control as reason-responsiveness: the case of dual-mode vehicles. Ethics and Information Technology, 22, 2, 103-115. DOI:10.1007/s10676-019-09519-w",
      "doi": "10.1007/s10676-019-09519-w"
    },
    {
      "text": "Marek P. Michalowski, Selma Šabanović, Carl DiSalvo, Didac Busquets, Laura M. Hiatt, Nik A. Melchior, and Reid Simmons. 2007. Socially distributed perception: Grace plays social tag at aaai 2005. Autonomous Robots, 22, 4, 385-397. DOI: 10.1007/s10514-006-9015-6",
      "doi": "10.1007/s10514-006-9015-6"
    },
    {
      "text": "Tim Miller. 2019. Explanation in artificial intelligence: Insights from the social sciences. Artificial Intelligence 267, 1-38. https://doi.org/10.1016/j.artint.2018.07.007",
      "doi": ""
    },
    {
      "text": "Christopher A. Miller and Raja Parasuraman. 2007. Designing for flexible interaction between humans and automation: Delegation interfaces for supervisory control. Human factors, 49, 1, 57-75. DOI:10.1518/001872007779598037",
      "doi": ""
    },
    {
      "text": "Tal Montal and Zvi Reich. 2017. I, robot. You, journalist. Who is the author? Authorship, bylines and full disclosure in automated journalism. Digital journalism, 5, 7, 829-849. DOI:10.1080/21670811.2016.1209083",
      "doi": ""
    },
    {
      "text": "Dylan Moore, Rebecca Currano, Michael Shanks, and David Sirkin. 2020. Defense Against the Dark Cars: Design Principles for Griefing of Autonomous Vehicles. Proceedings of the 2020 ACM/IEEE International Conference on Human-Robot Interaction. Association for Computing Machinery, New York, NY, USA, 201–209. DOI:10.1145/3319502.3374796",
      "doi": "10.1145/3319502.3374796"
    },
    {
      "text": "Bilge Mutlu, Toshiyuki Shiwa, Takayuki Kanda, Hiroshi Ishiguro, and Norihiro Hagita. 2009. Footing in human-robot conversations: how robots might shape participant roles using gaze cues. In Proceedings of the 4th ACM/IEEE international conference on Human robot interaction (HRI '09). Association for Computing Machinery, New York, NY, USA, 61–68. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/1514095.1514109",
      "doi": "10.1145/1514095.1514109"
    },
    {
      "text": "Stefanos Nikolaidis, Minae Kwon, Jodi Forlizzi, and Siddhartha Srinivasa. 2018. Planning with Verbal Communication for Human-Robot Collaboration. J. Hum.-Robot Interact. 7, 3, Article 22 (December 2018), 21 pages. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/3203305",
      "doi": "10.1145/3203305"
    },
    {
      "text": "Ingrid Nunes and Dietmar Jannach. 2017. A systematic review and taxonomy of explanations in decision support and recommender systems. UserModeling and User-Adapted Interaction 27, 3-5 (2017), 393–444. https://doi.org/10.1007/s11257-017-9195-0",
      "doi": "10.1007/s11257-017-9195-0"
    },
    {
      "text": "Dimitri Ognibene and Yiannis Demiris. 2013. Towards active event recognition. In Twenty-Third International Joint Conference on Artificial Intelligence.",
      "doi": "10.5555/2540128.2540487"
    },
    {
      "text": "Brian O'Neill, Andreya Piplica, Daniel Fuller, and Brian Magerko. 2011. A knowledge-based framework for the collaborative improvisation of scene introductions. In International Conference on Interactive Digital Storytelling, 85-96. Springer, Berlin, Heidelberg. DOI: 10.1007/978-3-642-25289-1_10",
      "doi": "10.1007/978-3-642-25289-1_10"
    },
    {
      "text": "Shwetak N. Patel, Jay W. Summet, and Khai N. Truong. 2009. Blindspot: Creating capture-resistant spaces. In Protecting Privacy in Video Surveillance, pp. 185-201. Springer, London. DOI: 10.1007/978-1-84882-301-3_11",
      "doi": ""
    },
    {
      "text": "Q. C. Pham, R. Madhavan, L. Righetti, W. Smart, and R. Chatila. 2018. The impact of robotics and automation on working conditions and employment. IEEE Robotics & Automation Magazine 25, 2, 126-128. DOI:10.1109/mra.2018.2822058",
      "doi": ""
    },
    {
      "text": "Elizabeth Phillips, Kristin E. Schaefer, Deborah R. Billings, Florian Jentsch, and Peter A. Hancock. 2016. Human-animal teams as an analog for future human-robot teams: influencing design and fostering trust. J. Hum.-Robot Interact. 5, 1 (March 2016), 100–125. DOI:https://doi.org/10.5898/JHRI.5.1.Phillips",
      "doi": ""
    },
    {
      "text": "Elizabeth Phillips, Xuan Zhao, Daniel Ullman, and Bertram F. Malle. 2018. What is Human-like?: Decomposing Robots’ Human-like Appearance Using the Anthropomorphic roBOT (ABOT) Database. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction (HRI ’18). ACM, New York, NY, USA, 105–113. https://doi.org/10.1145/3171221.3171268",
      "doi": ""
    },
    {
      "text": "James Pierce. 2019. Smart Home Security Cameras and Shifting Lines of Creepiness: A Design-Led Inquiry. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Paper 45, 1–14. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/3290605.3300275",
      "doi": "10.1145/3290605.3300275"
    },
    {
      "text": "Larissa Pschetz, Kruakae Pothong, and Chris Speed. 2019. Autonomous Distributed Energy Systems: Problematising the Invisible through Design, Drama and Deliberation. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Paper 387, 1–14. DOI:https://doi.org/10.1145/3290605.3300617",
      "doi": "10.1145/3290605.3300617"
    },
    {
      "text": "Samantha Reig, Michal Luria, Janet Z. Wang, Danielle Oltman, Elizabeth Jeanne Carter, Aaron Steinfeld, Jodi Forlizzi, and John Zimmerman. 2020. Not Some Random Agent: Multi-person Interaction with a Personalizing Service Robot. Proceedings of the 2020 ACM/IEEE International Conference on Human-Robot Interaction. Association for Computing Machinery, New York, NY, USA, 289–297. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/3319502.3374795",
      "doi": "10.1145/3319502.3374795"
    },
    {
      "text": "Laurel D. Riek, Tal-Chen Rabinowitch, Paul Bremner, Anthony G. Pipe, Mike Fraser, and Peter Robinson. 2010. Cooperative gestures: Effective signaling for humanoid robots. In 2010 5th ACM/IEEE International Conference on Human-Robot Interaction (HRI), IEEE, 61-68. DOI:10.1109/HRI.2010.5453266",
      "doi": ""
    },
    {
      "text": "A. Joy Rivera. 2014. A socio-technical systems approach to studying interruptions: Understanding the interrupter's perspective. Applied Ergonomics 45, 3 (May 2014), 747–756. DOI:https://doi.org/10.1016/j.apergo.2013.08.009",
      "doi": ""
    },
    {
      "text": "Stephanie Rosenthal, Manuela Veloso, and Anind K. Dey. 2012. Is someone in this office available to help me?. J. of Intelligent & Robotic Systems, 66, 1, 205-221. DOI:10.1007/s10846-011-9610-4",
      "doi": "10.1007/s10846-011-9610-4"
    },
    {
      "text": "Marco Rozendaal. 2016. Objects with intent: a new paradigm for interaction design. interactions 23, 3 (May + June 2016), 62–65. DOI:https://doi.org/10.1145/2911330",
      "doi": "10.1145/2911330"
    },
    {
      "text": "Marco C. Rozendaal, Boudewijn Boon, and Victor Kaptelinin. 2019. Objects with Intent: Designing Everyday Things as Collaborative Partners. ACM Trans. Comput.-Hum. Interact. 26, 4, Article 26 (July 2019), 33 pages. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/3325277",
      "doi": "10.1145/3325277"
    },
    {
      "text": "Martin Saerbeck and Christoph Bartneck. 2010. Perception of affect elicited by robot motion. In 2010 5th ACM/IEEE International Conference on Human-Robot Interaction (HRI), IEEE, 53-60. DOI:10.1109/HRI.2010.5453269",
      "doi": ""
    },
    {
      "text": "Kenji Sakita, Koichi Ogawara, Shinji Murakami, Kentaro Kawamura, and Katsushi Ikeuchi. 2004. Flexible cooperation between human and robot by interpreting human intention from gaze information. In IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)(IEEE Cat. No. 04CH37566), vol. 1, IEEE, 846-851. DOI:10.1109/IROS.2004.1389458.",
      "doi": ""
    },
    {
      "text": "Pericle Salvini, Gaetano Ciaravella, Wonpil Yu, Gabriele Ferri, Alessandro Manzi, Barbara Mazzolai, Cecilia Laschi, Sang-Rok Oh, and Paolo Dario. 2010. How safe are service robots in urban environments? Bullying a robot. In 19th international symposium in robot and human interactive communication, IEEE, 1-7. DOI:10.1109/ROMAN.2010.5654677",
      "doi": ""
    },
    {
      "text": "Santoni de Sio, Filippo, and Jeroen Van den Hoven. \"Meaningful human control over autonomous systems: A philosophical account.\" Frontiers in Robotics and AI 5 (2018): 15. DOI:10.3389/frobt.2018.00015",
      "doi": ""
    },
    {
      "text": "Paul Saulnier, Ehud Sharlin, and Saul Greenberg. 2011. Exploring minimal nonverbal interruption in HRI. In 2011 RO-MAN. IEEE, 79–86. https://doi.org/10.1109/ROMAN.2011.6005257",
      "doi": ""
    },
    {
      "text": "Jeremy Schiff, Marci Meingast, Deirdre K. Mulligan, Shankar Sastry, and Ken Goldberg. 2009. Respectful cameras: Detecting visual markers in real-time to address privacy concerns. In Protecting Privacy in Video Surveillance, 65-89. Springer, London. DOI:10.1007/978-1-84882-301-3_5",
      "doi": ""
    },
    {
      "text": "Natalie Sebanz, Harold Bekkering, and Günther Knoblich. 2006. Joint action: bodies and minds moving together. Trends in cognitive sciences, 10, 2, 70-76. DOI: 10.1016/j.tics.2005.12.009",
      "doi": ""
    },
    {
      "text": "Bernhard Sendhoff and Heiko Wersing. 2020. Cooperative Intelligence-A Humane Perspective. In 2020 IEEE International Conference on Human-Machine Systems (ICHMS), IEEE, 1-6. doi: 10.1109/ICHMS49158.2020.9209387.",
      "doi": ""
    },
    {
      "text": "Megha Sharma, Dale Hildebrandt, Gem Newman, James E. Young, and Rasit Eskicioglu. 2013. Communicating affect via flight path exploring use of the laban effort system for designing affective locomotion paths. In 2013 8th ACM/IEEE International Conference on Human-Robot Interaction (HRI), IEEE, 293-300. doi: 10.1109/HRI.2013.6483602.",
      "doi": ""
    },
    {
      "text": "David Sirkin, Brian Mok, Stephen Yang, and Wendy Ju. 2015. Mechanical Ottoman: Up Close and Personal. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction Extended Abstracts (HRI'15 Extended Abstracts). Association for Computing Machinery, New York, NY, USA, 297. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/2701973.2714391",
      "doi": "10.1145/2701973.2714391"
    },
    {
      "text": "Vasant Srinivasan and Leila Takayama. 2016. Help Me Please: Robot Politeness Strategies for Soliciting Help From Humans. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 4945–4955. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/2858036.2858217",
      "doi": "10.1145/2858036.2858217"
    },
    {
      "text": "Sonja Stange and Stefan Kopp. 2020. Effects of a Social Robot's Self-Explanations on How Humans Understand and Evaluate Its Behavior. Proceedings of the 2020 ACM/IEEE International Conference on Human-Robot Interaction. Association for Computing Machinery, New York, NY, USA, 619–627. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/3319502.3374802",
      "doi": "10.1145/3319502.3374802"
    },
    {
      "text": "Constantine Stephanidis, Gavriel Salvendy, Margherita Antona, Jessie YC Chen, Jianming Dong, Vincent G. Duffy, Xiaowen Fang 2019. Seven HCI grand challenges. Int. J. of Human–Computer Interaction, 35, 14, 1229-1269. DOI:10.1080/10447318.2019.1619259",
      "doi": ""
    },
    {
      "text": "Kristen Stubbs, David Wettergreen, and Illah Nourbakhsh. 2008. Using a robot proxy to create common ground in exploration tasks. In 2008 3rd ACM/IEEE International Conference on Human-Robot Interaction (HRI), IEEE, 375-382. doi: 10.1145/1349822.1349871",
      "doi": "10.1145/1349822.1349871"
    },
    {
      "text": "Dag Sverre Syrdal, Kerstin Dautenhahn, Kheng Lee Koay, and Michael L. Walters. 2009. The negative attitudes towards robots scale and reactions to robot behaviour in a live human-robot interaction study. In Proceedings new frontiers in human-robot interaction, a symposium at the AISB 2009 convention (pp. 1–8). Heriot Watt University, 8-9 April 2009, Edinburgh, Scotland.",
      "doi": ""
    },
    {
      "text": "Xiang Zhi Tan, Samantha Reig, Elizabeth J. Carter, and Aaron Steinfeld. 2019. From one to another: how robot-robot interaction affects users' perceptions following a transition between robots. In 2019 14th ACM/IEEE International Conference on Human-Robot Interaction (HRI), IEEE, 114-122. doi: 10.1109/HRI.2019.8673304",
      "doi": ""
    },
    {
      "text": "Xiang Zhi Tan, Marynel Vázquez, Elizabeth J. Carter, Cecilia G. Morales, and Aaron Steinfeld. 2018. Inducing Bystander Interventions During Robot Abuse with Social Mechanisms. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction (HRI '18). Association for Computing Machinery, New York, NY, USA, 169–177. DOI:10.1145/3171221.3171247",
      "doi": "10.1145/3171221.3171247"
    },
    {
      "text": "Jonas Togler, Fabian Hemmert, and Reto Wettach. Living interfaces: The thrifty faucet. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction, pages 43{44. ACM, 2009. ISBN 978-1-60558-493-5. doi:10.1145/1517664.1517680.",
      "doi": ""
    },
    {
      "text": "Deborah Tollefsen. 2005. Let's pretend! Children and joint action. Philosophy of the Social Sciences, 35, 1, 75-97.",
      "doi": ""
    },
    {
      "text": "Michael Tomasello and Malinda Carpenter. 2007. Shared intentionality. Developmental science 10, 1, 121-125.",
      "doi": ""
    },
    {
      "text": "Cristen Torrey, Susan R. Fussell, and Sara Kiesler. 2013. How a robot should give advice. In 2013 8th ACM/IEEE International Conference on Human-Robot Interaction (HRI), IEEE, 275-282. doi: 10.1109/HRI.2013.6483599.",
      "doi": ""
    },
    {
      "text": "Eric Topol. 2019. Deep Medicine: How artificial intelligence can make healthcare human again. Basic Books. New York.",
      "doi": ""
    },
    {
      "text": "Steven Umbrello. 2020. Meaningful human control over smart home systems: a value sensitive design approach. 40-65.",
      "doi": ""
    },
    {
      "text": "Rik van den Brule, Gijsbert Bijlstra, Ron Dotsch, Pim Haselager, and Daniël H. J. Wigboldus. 2016. Warning signals for poor performance improve human-robot interaction. J. Hum.-Robot Interact. 5, 2 (September 2016), 69–89. DOI:https://doi-org.tudelft.idm.oclc.org/10.5898/JHRI.5.2.Van_den_Brule",
      "doi": "10.5898/JHRI.5.2.Van_den_Brule"
    },
    {
      "text": "Jeroen van den Hoven. 1998. Moral responsibility, public office and information technology. In Public Administration in an Information Age: A Handbook, eds I. T. M. Snellen and W. B. H. J. Van de Donk (IOS Press), 579. Available at: https://books.google.nl/books?hl=nl&lr=&id=ehjvAgAAQBAJ&oi=fnd&p-g=PA97&ots=JSy2OH4ng0&sig=jiK842VhBsC_h9oHmsY2YGufgeQ&rediresc=y#v=onepage&q&f=false",
      "doi": ""
    },
    {
      "text": "J. J. Van der Waa, J. van Diggelen, M. Neerincx. 2018. The design and validation of an intuitive certainty measure. IUI 2018workshop on explainable smart systems. In: IUI 2018 workshop on explainable smart systems. ACM.",
      "doi": ""
    },
    {
      "text": "Manuela M. Veloso. 2018. The Increasingly Fascinating Opportunity for Human-Robot-AI Interaction: The CoBot Mobile Service Robots. J. Hum.-Robot Interact. 7, 1, Article 5 (May 2018), 2 pages. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/3209541",
      "doi": "10.1145/3209541"
    },
    {
      "text": "Dakuo Wang, Elizabeth Churchill, Pattie Maes, Xiangmin Fan, Ben Shneiderman, Yuanchun Shi, and Qianying Wang. 2020. From Human-Human Collaboration to Human-AI Collaboration: Designing AI Systems That Can Work Together with People. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (CHI EA '20). Association for Computing Machinery, New York, NY, USA, 1–6. DOI:https://doi-org.tudelft.idm.oclc.org/10.1145/3334480.3381069",
      "doi": "10.1145/3334480.3381069"
    },
    {
      "text": "Astrid Weiss, Nicole Mirnig, Ulrike Bruckenberger, Ewald Strasser, Manfred Tscheligi, Barbara Kühnlenz, Dirk Wollherr, and Bartlomiej Stanczyk. 2015. The interactive urban robot: user-centered development and final field trial of a direction requesting robot. J. of Behavioral Robotics, 6, 1. DOI:10.1515/pjbr-2015-0005",
      "doi": ""
    },
    {
      "text": "Katherine S. Welfare, Matthew R. Hallowell, Julie A. Shah, and Laurel D. Riek. 2019. Consider the human work experience when integrating robotics in the workplace. In 14th ACM/IEEE international conference on human-robot interaction (HRI), IEEE, 75-84. doi: 10.1109/HRI.2019.8673139",
      "doi": ""
    },
    {
      "text": "Julika Welge and Marc Hassenzahl. 2016. Better Than Human: About the Psychological Superpowers of Robots. In: Agah A., Cabibihan JJ., Howard A., Salichs M., He H. (eds) Social Robotics. ICSR 2016. Lecture Notes in Computer Science, vol 9979. Springer, Cham. https://doi.org/10.1007/978-3-319-47437-3_97",
      "doi": ""
    },
    {
      "text": "David Whitney, Miles Eldon, John Oberlin, and Stefanie Tellex. 2016. Interpreting multimodal referring expressions in real time. In IEEE International Conference on Robotics and Automation (ICRA), IEEE, 3331-3338. doi: 10.1109/ICRA.2016.7487507.",
      "doi": "10.1109/ICRA.2016.7487507"
    },
    {
      "text": "Tom Williams, Priscilla Briggs, and Matthias Scheutz. 2015. Covert robot-robot communication: human perceptions and implications for human-robot interaction. J. Hum.-Robot Interact. 4, 2 (September 2015), 24–49. DOI:https://doi-org.tudelft.idm.oclc.org/10.5898/JHRI.4.2.Williams",
      "doi": "10.5898/JHRI.4.2.Williams"
    },
    {
      "text": "H. James Wilson and Paul R. Daugherty. 2018. Collaborative intelligence: humans and AI are joining forces. Harvard Business Review 96, 4, 114-123.",
      "doi": ""
    },
    {
      "text": "Heather Wiltse. 2020. Revealing relations of fluid assemblages. Relating to Things: Design, Technology and the Artificial, 239-254.",
      "doi": ""
    },
    {
      "text": "Michael Wooldridge,and Nicholas R. Jennings. 1995. Intelligent agents: Theory and practice. The knowledge engineering review, 10, 2, 115-152.",
      "doi": ""
    },
    {
      "text": "Robert H. Wortham and Vivienne Rogers. 2017. The muttering robot: improving robot transparency though vocalisation of reactive plan execution.\" In 26th IEEE International Symposium on Robot and Human Interactive Communication (Ro-Man) Workshop on Agent Transparency for Human-Autonomy Teaming Effectiveness (Lisbon:). 2017.",
      "doi": ""
    },
    {
      "text": "Yuto Yamaji, Taisuke Miyake, Yuta Yoshiike, P. Ravindra S. De Silva, and Michio Okada. 2011. Stb: Child-dependent sociable trash box. Int. J. of Soc. Rob., 3, 4, 359-370. DOI:10.1007/s12369-011-0114-y",
      "doi": ""
    },
    {
      "text": "Rayoung Yang and Mark W. Newman. 2013. Learning from a learning thermostat: lessons for intelligent systems for the home. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (UbiComp '13). Association for Computing Machinery, New York, NY, USA, 93–102. DOI:https://doi.org/10.1145/2493432.2493489",
      "doi": "10.1145/2493432.2493489"
    },
    {
      "text": "Jichen Zhu, Antonios Liapis, Sebastian Risi, Rafael Bidarra, and G. Michael Youngblood. 2018. Explainable AI for designers: A human-centered perspective on mixed-initiative co-creation. In 2018 IEEE Conference on Computational Intelligence and Games (CIG), IEEE, 1-8. doi: 10.1109/CIG.2018.8490433",
      "doi": "10.1109/CIG.2018.8490433"
    }
  ]
}