{
  "doi": "10.1145/3491102.3502119",
  "title": "Meander Coil++: A Body-scale Wireless Power Transmission Using Safe-to-body and Energy-efficient Transmitter Coil",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2022,
  "badges": [],
  "abstract": "Wearable devices for life-logging and healthcare have been studied, but the need for frequent charging imposes inconvenience for long-term use. Integrating textile-based wireless chargers (i.e., coil) into clothing enables sustainable wearable computing by charging the on-body devices in use. However, the electromagnetic field generated by conventional coil chargers strongly interferes with human body, and the high resistance of conductive threads leads to inefficient power delivery. This paper presents Meander Coil++, enabling safe, energy-efficient, and body-scale wireless power delivery. Meander Coil++ uses a wiring pattern that suppresses electromagnetic exposure to the human body without compromising power delivery performance and a liquid-metal-based low-loss conductive cord. With these advancements, Meander Coil++ transmits a few watts of power to on-body devices at 25% DC-to-DC efficiency while complying with international safety guidelines regarding electromagnetic exposure. We envision Meander Coil++ can maintain multiple devices on body for weeks beyond the confines of their small battery capacity.",
  "authors": [
    {
      "name": "Ryo Takahashi",
      "institution": "The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659321532",
      "orcid": "missing"
    },
    {
      "name": "Wakako Yukita",
      "institution": "The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659950402",
      "orcid": "missing"
    },
    {
      "name": "Tomoyuki Yokota",
      "institution": "The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81758631357",
      "orcid": "missing"
    },
    {
      "name": "Takao Someya",
      "institution": "The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456635385",
      "orcid": "missing"
    },
    {
      "name": "Yoshihiro Kawahara",
      "institution": "The University of Tokyo, Japan",
      "img": "/do/10.1145/contrib-81100423171/rel-imgonly/bb10347-2.jpg",
      "acmid": "81100423171",
      "orcid": "0000-0002-0310-2577"
    }
  ],
  "references": [
    {
      "text": "[n. d.]. Body Tissue Dielectric Parameters. Retrieved March 1, 2021 from https://www.fcc.gov/general/body-tissue-dielectric-parameters",
      "doi": ""
    },
    {
      "text": "2019. Google Glass Enterprise Edition 2 drops to $999 and adds Qualcomm’s XR1. Retrieved March 1, 2021 from https://venturebeat.com/2019/05/20/google-glass-enterprise-edition-2-levels-up-with-qualcomms-xr1-and-smith-frames/",
      "doi": ""
    },
    {
      "text": "2020. Apple Watch Battery and Performance. Retrieved March 1, 2021 from https://support.apple.com/en-us/HT210551",
      "doi": ""
    },
    {
      "text": "2020. ICNIRP GUIDELINES. Retrieved March 1, 2021 from https://www.icnirp.org/cms/upload/publications/ICNIRPrfgdl2020.pdf",
      "doi": ""
    },
    {
      "text": "Lea Albaugh, Lining Yao, and Scott Hudson. 2019. Digital fabrication of soft actuated objects by machine knitting. Conference on Human Factors in Computing Systems - Proceedings (2019). https://doi.org/10.1145/3290607.3313270",
      "doi": ""
    },
    {
      "text": "Jokubas Ausra, Mingzheng Wu, Xin Zhang, Abraham Vázquez-guardado, Patrick Skelton, and Roberto Peralta. 2021. Platforms for Transcranial and Long-Range Optogenetics in Freely Moving Animals. 16 (2021). https://doi.org/10.1073/pnas.2025775118/-/DCSupplemental.Published",
      "doi": ""
    },
    {
      "text": "Yung Wey Chong, Widad Ismail, Kwangman Ko, and Chen Yi Lee. 2019. Energy Harvesting for Wearable Devices: A Review. IEEE Sensors Journal 19, 20 (2019), 9047–9062. https://doi.org/10.1109/JSEN.2019.2925638",
      "doi": ""
    },
    {
      "text": "Andreas Christ, Mark G. Douglas, John M. Roman, Emily B. Cooper, Alanson P. Sample, Benjamin H. Waters, Joshua R. Smith, and Niels Kuster. 2013. Evaluation of wireless resonant power transfer systems with human electromagnetic exposure limits. IEEE Transactions on Electromagnetic Compatibility 55, 2(2013), 265–274. https://doi.org/10.1109/TEMC.2012.2219870",
      "doi": ""
    },
    {
      "text": "Bruce Cook and I.J Lowe. 1982. A large-inductance, high-frequency, high-Q, series-tuned coil for NMR. Journal of Magnetic Resonance (1969) 49, 2 (9 1982), 346–349. https://doi.org/10.1016/0022-2364(82)90200-1",
      "doi": ""
    },
    {
      "text": "Christopher B. Cooper, Kuralamudhan Arutselvan, Ying Liu, Daniel Armstrong, Yiliang Lin, Mohammad Rashed Khan, Jan Genzer, and Michael D. Dickey. 2017. Stretchable Capacitive Sensors of Torsion, Strain, and Touch Using Double Helix Liquid Metal Fibers. Advanced Functional Materials 27, 20 (2017). https://doi.org/10.1002/adfm.201605630",
      "doi": ""
    },
    {
      "text": "Jasper de Winkel, Vito Kortbeek, Josiah Hester, and Przemysław Pawełczak. 2020. Battery-Free Game Boy. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 3 (9 2020), 1–34. https://doi.org/10.1145/3411839",
      "doi": "10.1145/3411839"
    },
    {
      "text": "Artem Dementyev, Hsin Liu Cindy Kao, Inrak Choi, Deborah Ajilo, Maggie Xu, Joseph A. Paradiso, Chris Schmandt, and Sean Follmer. 2016. Rovables: Miniature on-body robots as mobile wearables. UIST 2016 - Proceedings of the 29th Annual Symposium on User Interface Software and Technology (2016), 111–120. https://doi.org/10.1145/2984511.2984531",
      "doi": "10.1145/2984511.2984531"
    },
    {
      "text": "Michael D. Dickey. 2017. Stretchable and Soft Electronics using Liquid Metals. Advanced Materials 29, 27 (2017), 1–19. https://doi.org/10.1002/adma.201606425",
      "doi": ""
    },
    {
      "text": "Michael D. Dickey, Ryan C. Chiechi, Ryan J. Larsen, Emily A. Weiss, David A. Weitz, and George M. Whitesides. 2008. Eutectic gallium-indium (EGaIn): A liquid metal alloy for the formation of stable structures in microchannels at room temperature. Advanced Functional Materials 18, 7 (2008), 1097–1104. https://doi.org/10.1002/adfm.200701216",
      "doi": ""
    },
    {
      "text": "Yong Du, Kefeng Cai, Song Chen, Hongxia Wang, Shirley Z. Shen, Richard Donelson, and Tong Lin. 2015. Thermoelectric Fabrics: Toward Power Generating Clothing. Scientific Reports 5, 1 (3 2015), 6411. https://doi.org/10.1038/srep06411",
      "doi": ""
    },
    {
      "text": "Chaochao Dun, Corey A. Hewitt, Huihui Huang, David S. Montgomery, Junwei Xu, and David L. Carroll. 2015. Flexible thermoelectric fabrics based on self-assembled tellurium nanorods with a large power factor. Physical Chemistry Chemical Physics 17, 14 (2015), 8591–8595. https://doi.org/10.1039/C4CP05390G",
      "doi": ""
    },
    {
      "text": "Jun Gong, Yu Wu, Lei Yan, Teddy Seyed, and Xing-dong Yang. 2019. Tessutivo. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 29–41. https://doi.org/10.1145/3332165.3347897",
      "doi": "10.1145/3332165.3347897"
    },
    {
      "text": "Changyo Han, Ryo Takahashi, Yuchi Yahagi, and Takeshi Naemura. 2021. 3D Printing Firm Inflatables with Internal Tethers. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–7. https://doi.org/10.1145/3411763.3451613",
      "doi": "10.1145/3411763.3451613"
    },
    {
      "text": "C. K. Harnett. 2017. Tobiko: A Contact Array for Self-Configuring, Surface-Powered Sensors. (2017), 2024–2028. https://doi.org/10.1145/3025453.3025504",
      "doi": ""
    },
    {
      "text": "Akimasa Hirata, Fumihiro Ito, and Ilkka Laakso. 2013. Confirmation of quasi-static approximation in SAR evaluation for a wireless power transfer system. Physics in Medicine and Biology 58, 17 (2013). https://doi.org/10.1088/0031-9155/58/17/N241",
      "doi": ""
    },
    {
      "text": "Ali Kiaghadi, Morgan Baima, Jeremy Gummeson, Trisha Andrew, and Deepak Ganesan. 2018. Fabric as a Sensor: Towards unobtrusive sensing of human behavior with triboelectric textiles. SenSys 2018 - Proceedings of the 16th Conference on Embedded Networked Sensor Systems (2018), 199–210. https://doi.org/10.1145/3274783.3274845",
      "doi": "10.1145/3274783.3274845"
    },
    {
      "text": "André Kurs, Aristeidis Karalis, Robert Moffatt, J. D. Joannopoulos, Peter Fisher, and Marin Soljačić. 2007. Wireless power transfer via strongly coupled magnetic resonances. Science 317, 5834 (2007), 83–86. https://doi.org/10.1126/science.1143254",
      "doi": ""
    },
    {
      "text": "John Kymissis, Clyde Kendall, Joseph Paradiso, and Neil Gershenfeld. 1998. Parasitic power harvesting in shoes. In Digest of Papers. Second International Symposium on Wearable Computers (Cat. No.98EX215), Vol. 1998-Octob. IEEE Comput. Soc, 132–139. https://doi.org/10.1109/ISWC.1998.729539",
      "doi": ""
    },
    {
      "text": "Andreas Leber, Chaoqun Dong, Rajasundar Chandran, Tapajyoti Das Gupta, Nicola Bartolomei, and Fabien Sorin. 2020. Soft and stretchable liquid metal transmission lines as distributed probes of multimodal deformations. Nature Electronics 3, 6 (2020), 316–326. https://doi.org/10.1038/s41928-020-0415-y",
      "doi": ""
    },
    {
      "text": "Rongzhou Lin, Han Joon Kim, Sippanat Achavananthadith, Selman A. Kurt, Shawn C.C. Tan, Haicheng Yao, Benjamin C.K. Tee, Jason K.W. Lee, and John S. Ho. 2020. Wireless battery-free body sensor networks using near-field-enabled clothing. Nature Communications 11, 1 (2020), 1–10. https://doi.org/10.1038/s41467-020-14311-2",
      "doi": ""
    },
    {
      "text": "Qiuyu Lu, Chengpeng Mao, Liyuan Wang, and Haipeng Mi. 2016. LIME: LIquid MEtal Interfaces for Non-Rigid Interaction. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 449–452. https://doi.org/10.1145/2984511.2984562",
      "doi": "10.1145/2984511.2984562"
    },
    {
      "text": "Alex Mazursky, Shan Yuan Teng, Romain Nith, and Pedro Lopes. 2021. Magnetio: Passive yet interactive sof haptic patches anywhere. Conference on Human Factors in Computing Systems - Proceedings (2021). https://doi.org/10.1145/3411764.3445543",
      "doi": "10.1145/3411764.3445543"
    },
    {
      "text": "Paul D. Mitcheson, Eric M. Yeatman, G. Kondala Rao, Andrew S. Holmes, and Tim C. Green. 2008. Energy harvesting from human and machine motion for wireless electronic devices. Proc. IEEE 96, 9 (2008), 1457–1486. https://doi.org/10.1109/JPROC.2008.927494",
      "doi": ""
    },
    {
      "text": "Noor Mohammed, Rui Wang, Robert W Jackson, Yeonsik Noh, Jeremy Gummeson, and Sunghoon Ivan Lee. 2021. ShaZam. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 5, 2 (6 2021), 1–25. https://doi.org/10.1145/3463505",
      "doi": "10.1145/3463505"
    },
    {
      "text": "Vidya Narayanan, Kui Wu, Cem Yuksel, and James McCann. 2019. Visual knitting machine programming. ACM Transactions on Graphics 38, 4 (2019). https://doi.org/10.1145/3306346.3322995",
      "doi": "10.1145/3306346.3322995"
    },
    {
      "text": "Simiao Niu, Naoji Matsuhisa, Levent Beker, Jinxing Li, Sihong Wang, Jiechen Wang, Yuanwen Jiang, Xuzhou Yan, Youngjun Yun, William Burnett, Ada S. Y. Poon, Jeffery B.-H. Tok, Xiaodong Chen, and Zhenan Bao. 2019. A wireless body area sensor network based on stretchable passive tags. Nature Electronics 2, 8 (2019), 361–368. https://doi.org/10.1038/s41928-019-0286-2",
      "doi": ""
    },
    {
      "text": "Akihito Noda and Hiroyuki Shinoda. 2017. Frequency-division-multiplexed signal and power transfer for wearable devices networked via conductive embroideries on a cloth. IEEE MTT-S International Microwave Symposium Digest (2017), 537–540. https://doi.org/10.1109/MWSYM.2017.8058619",
      "doi": ""
    },
    {
      "text": "Andreas Port, Roger Luechinger, Loris Albisetti, Matija Varga, Josip Marjanovic, Jonas Reber, David Otto Brunner, and Klaas Paul Pruessmann. 2020. Detector clothes for MRI: A wearable array receiver based on liquid metal in elastic tubes. Scientific Reports 10, 1 (2020), 1–10. https://doi.org/10.1038/s41598-020-65634-5",
      "doi": ""
    },
    {
      "text": "E. Rehmi Post and Margaret Orth. 1997. Smart fabric, or ‘wearable clothing’. International Symposium on Wearable Computers, Digest of Papers (1997), 167–168. https://doi.org/10.1109/iswc.1997.629937",
      "doi": ""
    },
    {
      "text": "Deepak Ranjan Sahoo, Timothy Neate, Yutaka Tokuda, Jennifer Pearson, Simon Robinson, Sriram Subramanian, and Matt Jones. 2018. Tangible Drops: A Visio-Tactile Display Using Actuated Liquid-Metal Droplets. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173751",
      "doi": "10.1145/3173574.3173751"
    },
    {
      "text": "F. Satoi, H. Matsuki, S. Kikuchi, T. Seto, T. Satoh, H. Osada, and K. Seki. 1998. A new meander type contactless power transmission system - Active excitation with a characteristics of coil shape. IEEE Transactions on Magnetics 34, 4 PART 1 (1998), 2066–2068. https://doi.org/10.1109/20.706797",
      "doi": ""
    },
    {
      "text": "Rishi Shukla, Neev Kiran, Rui Wang, Jeremy Gummeson, and Sunghoon Ivan Lee. 2019. SkinnyPower: Enabling batteryless wearable sensors via intra-body power transfer. SenSys 2019 - Proceedings of the 17th Conference on Embedded Networked Sensor Systems (2019), 68–82. https://doi.org/10.1145/3356250.3360034",
      "doi": "10.1145/3356250.3360034"
    },
    {
      "text": "Wei Sun, Yanjun Chen, Simon Zhan, and Teng Han. 2021. Relectrode: A reconfigurable electrode for multi-purpose sensing based on microfluidics. Conference on Human Factors in Computing Systems - Proceedings (2021). https://doi.org/10.1145/3411764.3445652",
      "doi": "10.1145/3411764.3445652"
    },
    {
      "text": "Tetsu Sunohara, Akimasa Hirata, Ilkka Laakso, Valerio De Santis, and Teruo Onishi. 2015. Evaluation of nonuniform field exposures with coupling factors. Physics in Medicine and Biology 60, 20 (2015), 8129–8140. https://doi.org/10.1088/0031-9155/60/20/8129",
      "doi": ""
    },
    {
      "text": "Ryo Takahashi, Masaaki Fukumoto, Changyo Han, Takuya Sasatani, Yoshiaki Narusue, and Yoshihiro Kawahara. 2020. TelemetRing: A Batteryless and Wireless Ring-shaped Keyboard using Passive Inductive Telemetry. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 1161–1168. https://doi.org/10.1145/3379337.3415873",
      "doi": "10.1145/3379337.3415873"
    },
    {
      "text": "Ryo Takahashi, Takuya Sasatani, Fuminori Okuya, Yoshiaki Narusue, and Yoshihiro Kawahara. 2018. A Cuttable Wireless Power Transfer Sheet. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (2018), 1–25. https://doi.org/10.1145/3287068",
      "doi": "10.1145/3287068"
    },
    {
      "text": "Ryo Takahashi, Wakako Yukita, Takuya Sasatani, Tomoyuki Yokota, Takao Someya, and Yoshihiro Kawahara. 2021. Twin Meander Coil : Sensitive Readout of Battery-free On-body Wireless Sensors Using Body-scale Meander Coils. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 5, 4 (2021). https://doi.org/10.1145/3494996",
      "doi": "10.1145/3494996"
    },
    {
      "text": "Xi Tian, Pui Mun Lee, Yu Jun Tan, Tina L.Y. Wu, Haicheng Yao, Mengying Zhang, Zhipeng Li, Kian Ann Ng, Benjamin C.K. Tee, and John S. Ho. 2019. Wireless body sensor networks based on metamaterial textiles. Nature Electronics 2, 6 (2019), 243–251. https://doi.org/10.1038/s41928-019-0257-7",
      "doi": ""
    },
    {
      "text": "Dries Van Wageningen and Toine Staring. 2010. The Qi wireless power standard. Proceedings of EPE-PEMC 2010 - 14th International Power Electronics and Motion Control Conference(2010), 25–32. https://doi.org/10.1109/EPEPEMC.2010.5606673",
      "doi": ""
    },
    {
      "text": "Deepak Vasisht, Guo Zhang, Omid Abari, Hsiao-Ming Lu, Jacob Flanz, and Dina Katabi. 2018. In-body backscatter communication and localization. In Proceedings of the 2018 Conference of the ACM Special Interest Group on Data Communication. ACM, New York, NY, USA, 132–146. https://doi.org/10.1145/3230543.3230565",
      "doi": "10.1145/3230543.3230565"
    },
    {
      "text": "Anandghan Waghmare, Qiuyue Xue, Dingtian Zhang, Yuhui Zhao, Shivan Mittal, Nivedita Arora, Ceara Byrne, Thad Starner, and Gregory Abowd. 2020. UbiquiTouch: Self Sustaining Ubiquitous Touch Interfaces. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 1 (2020), 1–22. https://doi.org/10.1145/3380989",
      "doi": "10.1145/3380989"
    },
    {
      "text": "Irmandy Wicaksono, Carson I. Tucker, Tao Sun, Cesar A. Guerrero, Clare Liu, Wesley M. Woo, Eric J. Pence, and Canan Dagdeviren. 2020. A tailored, electronic textile conformable suit for large-scale spatiotemporal physiological sensing in vivo. npj Flexible Electronics 4, 1 (2020). https://doi.org/10.1038/s41528-020-0068-y",
      "doi": ""
    },
    {
      "text": "Paul Worgan and Mike Fraser. 2016. Garment level power distribution for wearables using inductive power transfer. Proceedings - 2016 9th International Conference on Human System Interactions, HSI 2016 (2016), 277–283. https://doi.org/10.1109/HSI.2016.7529644",
      "doi": ""
    },
    {
      "text": "Paul Worgan, Jarrod Knibbe, Mike Fraser, and Diego Martinez Plasencia. 2016. PowerShake: Power Transfer interactions for mobile devices. Conference on Human Factors in Computing Systems - Proceedings (2016), 4734–4745. https://doi.org/10.1145/2858036.2858569",
      "doi": "10.1145/2858036.2858569"
    },
    {
      "text": "Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: Pneumatically Actuated Soft Composite Materials for Shape Changing Interfaces. In Proceedings of the 26th annual ACM symposium on User interface software and technology. ACM, New York, NY, USA, 13–22. https://doi.org/10.1145/2501988.2502037",
      "doi": "10.1145/2501988.2502037"
    },
    {
      "text": "Tomoyuki Yokota, Yusuke Inoue, Yuki Terakawa, Jonathan Reeder, Martin Kaltenbrunner, Taylor Ware, Kejia Yang, Kunihiko Mabuchi, Tomohiro Murakawa, Masaki Sekino, Walter Voit, Tsuyoshi Sekitani, and Takao Someya. 2015. Ultraflexible, large-area, physiological temperature sensors for multipoint measurements. Proceedings of the National Academy of Sciences 112, 47 (11 2015), 14533–14538. https://doi.org/10.1073/pnas.1515650112",
      "doi": ""
    },
    {
      "text": "Tomoyuki Yokota, Takashi Nakamura, Hirofumi Kato, Marina Mochizuki, Masahiro Tada, Makoto Uchida, Sunghoon Lee, Mari Koizumi, Wakako Yukita, Akio Takimoto, and Takao Someya. 2020. A conformable imager for biometric authentication and vital sign measurement. Nature Electronics 3, 2 (2020), 113–121. https://doi.org/10.1038/s41928-019-0354-7",
      "doi": ""
    },
    {
      "text": "Mersedeh Zandvakili, Mohammad Mahdi Honari, Pedram Mousavi, and Dan Sameoto. 2017. Gecko-Gaskets for Multilayer, Complex, and Stretchable Liquid Metal Microwave Circuits and Antennas. Advanced Materials Technologies 2, 11 (2017), 1–5. https://doi.org/10.1002/admt.201700144",
      "doi": ""
    },
    {
      "text": "Meysam Zargham and P. Glenn Gulak. 2012. Maximum achievable efficiency in near-field coupled power-transfer systems. IEEE Transactions on Biomedical Circuits and Systems 6, 3 (2012), 228–245. https://doi.org/10.1109/TBCAS.2011.2174794",
      "doi": ""
    }
  ]
}