{
  "doi": "10.1145/3491102.3517664",
  "title": "Designing Tools and Interfaces for Ecological Restoration: An Investigation into the Opportunities and Constraints for Technological Interventions",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "As interest within the HCI community expands beyond urban settings, novel tools and devices are being developed to support more sustainable interactions with natural environments and inform conservation action. Yet little is known about the users of these devices, and how their requirements and priorities might affect the usability or operationalization of the devices in the real world. Using the ‘e-seed’, a biomimetic self-drilling interface as a ‘research probe’, we conducted a qualitative user study with 14 subject matter experts in areas like forestry and agriculture to understand the value and limits for devices and systems in ecological restoration and monitoring. We highlight unique challenges in existing ecological practices, opportunities for technological interventions, and the policies and economic constraints affecting the feasibility of such interventions. We present a set of critical design considerations for building and deploying novel devices in natural and semi-natural ecosystems and discuss implications for future research.",
  "authors": [
    {
      "name": "Aditi Maheshwari",
      "institution": "Accenture Labs, United States",
      "img": "/do/10.1145/contrib-99659700981/rel-imgonly/aditi.jpg",
      "acmid": "99659700981",
      "orcid": "0000-0001-9828-0570"
    },
    {
      "name": "Abhay Kumar Aggarwal",
      "institution": "Accenture Labs, United States and University of California, Berkeley, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233811",
      "orcid": "missing"
    },
    {
      "name": "Andreea Danielescu",
      "institution": "Accenture Labs, United States",
      "img": "/do/10.1145/contrib-81444607832/rel-imgonly/81444607832.png",
      "acmid": "81444607832",
      "orcid": "0000-0001-7460-2467"
    }
  ],
  "references": [
    {
      "text": "Advancing Sensor Technology to Monitor Wildfires | US EPA: https://www.epa.gov/sciencematters/advancing-sensor-technology-monitor-wildfires. Accessed: 2021-08-29.",
      "doi": ""
    },
    {
      "text": "Aeby, X., Poulin, A., Siqueira, G., Hausmann, M.K. and Nyström, G. 2021. Fully 3D Printed and Disposable Paper Supercapacitors. Advanced Materials. 33, 26 (Jul. 2021), 2101328. DOI:https://doi.org/10.1002/ADMA.202101328.",
      "doi": ""
    },
    {
      "text": "Ahn, J., Mysore, A., Zybko, K., Krumm, C., Thokala, S., Xing, X., Lian, M., Han, R., Mishra, S. and Hobbs, T. 2016. WildSense: Monitoring Interactions among Wild Deer in Harsh Outdoor Environments Using a Delay-Tolerant WSN. Journal of Sensors. 2016, (2016). DOI:https://doi.org/10.1155/2016/1693460.",
      "doi": ""
    },
    {
      "text": "Air Quality Egg - Science is Collaboration: https://airqualityegg.com/egg. Accessed: 2021-12-16.",
      "doi": ""
    },
    {
      "text": "Allan, B.M., Nimmo, D.G., Ierodiaconou, D., VanDerWal, J., Koh, L.P. and Ritchie, E.G. 2018. Futurecasting ecological research: the rise of technoecology. Ecosphere. 9, 5 (May 2018), e02163. DOI:https://doi.org/10.1002/ECS2.2163.",
      "doi": ""
    },
    {
      "text": "Anggarendra, R. and Brereton, M. Engaging Children with Nature through Environmental HCI. Proceedings of the 28th Australian Conference on Computer-Human Interaction - OzCHI ’16. DOI:https://doi.org/10.1145/3010915.",
      "doi": ""
    },
    {
      "text": "Annan, K. How to engage stakeholders and mainstream biodiversity? (CEPA Toolkit).",
      "doi": ""
    },
    {
      "text": "Aoki, P., Woodruff, A., Yellapragada, B. and Willett, W. 2017. Environmental protection and agency: Motivations, capacity, and goals in participatory sensing. CHI ’17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (2017), 3138–3150.",
      "doi": "10.1145/3025453.3025667"
    },
    {
      "text": "Aoki, P., Woodruff, A., Yellapragada, B. and Willett, W. Environmental Protection and Agency: Motivations, Capacity, and Goals in Participatory Sensing. DOI:https://doi.org/10.1145/3025453.3025667.",
      "doi": ""
    },
    {
      "text": "Aoki, P.M., Honicky, R.J., Mainwaring, A., Myers, C., Paulos, E., Subramanian, S. and Woodruff, A. 2009. A vehicle for research: Using street sweepers to explore the landscape of environmental community action. Conference on Human Factors in Computing Systems - Proceedings. (2009), 375–384. DOI:https://doi.org/10.1145/1518701.1518762.",
      "doi": ""
    },
    {
      "text": "Aoyama, L. and Huntsinger, L. 2019. Are Landowners, Managers, and Range Management Academics on the Same Page About Conservation? Rangelands. 41, 1 (2019), 61–69. DOI:https://doi.org/10.1016/j.rala.2018.10.001.",
      "doi": ""
    },
    {
      "text": "Balzotti, C.S., Petersen, S.L., Terry, R.E., Scherer, A.K. and Golden, C. 2010. Remote Sensing as a Tool for Tropical Ecology. Geography Compass. 4, 8 (Aug. 2010), 993–1012. DOI:https://doi.org/10.1111/J.1749-8198.2010.00367.X.",
      "doi": ""
    },
    {
      "text": "Bauer, J. and Aschenbruck, N. 2020. Towards a Low-cost RSSI-based Crop Monitoring. ACM Transactions on Internet of Things. 1, 4 (Jun. 2020), 1–26. DOI:https://doi.org/10.1145/3393667.",
      "doi": "10.1145/3393667"
    },
    {
      "text": "Berger-Tal, O. and Lahoz-Monfort, J.J. 2018. Conservation technology: The next generation. Conservation Letters. 11, 6 (Nov. 2018), e12458. DOI:https://doi.org/10.1111/CONL.12458.",
      "doi": ""
    },
    {
      "text": "Bernardet, U. 2018. Bio-inspired human-computer-interaction. Proceedings of the 32nd International BCS Human Computer Interaction Conference, HCI 2018. (2018). DOI:https://doi.org/10.14236/EWIC/HCI2018.86.",
      "doi": "10.14236/ewic/HCI2018.86"
    },
    {
      "text": "Brewer, R.S. 2014. Three Shifts for Sustainable HCI: Scalable, Sticky, and Multidisciplinary. A SIGCHI HCI & Sustainability community workshop. (2014).",
      "doi": ""
    },
    {
      "text": "Büscher, B. 2016. Nature 2.0: Exploring and theorizing the links between new media and nature conservation. New Media & Society. (May 2016), 1–18. DOI:https://doi.org/10.1177/1461444814545841.",
      "doi": ""
    },
    {
      "text": "Büscher, B., Koot, S. and Nelson, I.L. 2017. Introduction. Nature 2.0: New media, online activism and the cyberpolitics of environmental conservation. Geoforum. 79, (Feb. 2017), 111–113. DOI:https://doi.org/10.1016/J.GEOFORUM.2016.12.001.",
      "doi": ""
    },
    {
      "text": "Carlson, Tom Shultis, John Van Horn, J. 2016. Technology in Wilderness. International Journal of Wilderness. 22, 3 (2016).",
      "doi": ""
    },
    {
      "text": "Castillo, J.A., Smith-Ramírez, C. and Claramunt, V. 2021. Differences in stakeholder perceptions about native forest: implications for developing a restoration program. Restoration Ecology. 29, 1 (Jan. 2021). DOI:https://doi.org/10.1111/REC.13293.",
      "doi": ""
    },
    {
      "text": "Chambers, J.C., Allen, C.R. and Cushman, S.A. 2019. Operationalizing Ecological Resilience Concepts for Managing Species and Ecosystems at Risk. Frontiers in Ecology and Evolution. 7, (Jul. 2019), 241. DOI:https://doi.org/10.3389/FEVO.2019.00241.",
      "doi": ""
    },
    {
      "text": "Chowdhary, G., Gazzola, M., Krishnan, G., Soman, C. and Lovell, S. 2019. Soft Robotics as an Enabling Technology for Agroforestry Practice and Research. Sustainability 2019, Vol. 11, Page 6751. 11, 23 (Nov. 2019), 6751. DOI:https://doi.org/10.3390/SU11236751.",
      "doi": ""
    },
    {
      "text": "Clarke, R., Heitlinger, S., Foth, M., Disalvo, C., Light, A. and Forlano, L. More-than-Human Urban Futures: Speculative Participatory Design to Avoid Ecocidal Smart Cities. PDC. 18. DOI:https://doi.org/10.1145/3210604.3210641.",
      "doi": ""
    },
    {
      "text": "Conrad, C.C., Hilchey, K.G., Conrad, C.C., Hilchey, K.G. and Branch, W. 2010. A review of citizen science and community-based environmental monitoring: issues and opportunities. Environmental Monitoring and Assessment 2010 176:1. 176, 1 (Jul. 2010), 273–291. DOI:https://doi.org/10.1007/S10661-010-1582-5.",
      "doi": ""
    },
    {
      "text": "Costanza, E., Panchard, J., Zufferey, G., Nembrini, J., Freudiger, J., Huang, J. and Hubaux, J.P. 2010. SensorTune: A mobile auditory interface for DIY wireless sensor networks. Conference on Human Factors in Computing Systems - Proceedings. 4, (2010), 2317–2326. DOI:https://doi.org/10.1145/1753326.1753675.",
      "doi": "10.1145/1753326.1753675"
    },
    {
      "text": "Coulson, S. and Woods, M. 2021. Citizen Sensing: An Action-Orientated Framework for Citizen Science. Frontiers in Communication. 6, (2021), 64. DOI:https://doi.org/10.3389/FCOMM.2021.629700/BIBTEX.",
      "doi": ""
    },
    {
      "text": "Coulson, S., Woods, M. and EU, M.S. 2021. Citizen Sensing: An Action-Orientated Framework for Citizen Science. Frontiers in Communication. 6, (Apr. 2021), 64. DOI:https://doi.org/10.3389/FCOMM.2021.629700.",
      "doi": ""
    },
    {
      "text": "Coulson, S., Woods, M., Scott, M. and Hemment, D. 2018. Making Sense: Empowering participatory sensing with transformation design. The Design Journal. 21, 6 (Nov. 2018), 813–833. DOI:https://doi.org/10.1080/14606925.2018.1518111.",
      "doi": ""
    },
    {
      "text": "Coulton, P. and Lindley, J.G. 2019. More-Than Human Centred Design: Considering Other Things. The Design Journal. 22, 4 (Jul. 2019), 463–481. DOI:https://doi.org/10.1080/14606925.2019.1614320.",
      "doi": ""
    },
    {
      "text": "Coyle, S., Majidi, C., LeDuc, P. and Hsia, K.J. 2018. Bio-inspired soft robotics: Material selection, actuation, and design. Extreme Mechanics Letters. 22, (Jul. 2018), 51–59. DOI:https://doi.org/10.1016/J.EML.2018.05.003.",
      "doi": ""
    },
    {
      "text": "Dangel, U. 2016. The World's Forests. Turning Point in Timber Construction. De Gruyter. 12–15.",
      "doi": ""
    },
    {
      "text": "Datta, A., Anand, M.O. and Naniwadekar, R. 2008. Empty forests: Large carnivore and prey abundance in Namdapha National Park, north-east India. Biological Conservation. 141, 5 (May 2008), 1429–1435. DOI:https://doi.org/10.1016/J.BIOCON.2008.02.022.",
      "doi": ""
    },
    {
      "text": "Dema, T., Brereton, M., Cappadonna, J.L., Roe, P., Truskinger, A. and Zhang, J. 2017. Collaborative Exploration and Sensemaking of Big Environmental Sound Data. Computer Supported Cooperative Work: CSCW: An International Journal. 26, 4–6 (2017), 693–731. DOI:https://doi.org/10.1007/s10606-017-9286-9.",
      "doi": "10.1007/s10606-017-9286-9"
    },
    {
      "text": "Dema, T., Brereton, M. and Roe, P. 2019. Designing Participatory Sensing with Remote Communities to Conserve Endangered Species. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow. Scotland, 2019), 1–16.",
      "doi": "10.1145/3290605.3300894"
    },
    {
      "text": "Deterding, N.M. and Waters, M.C. 2021. Flexible Coding of In-depth Interviews: A Twenty-first-century Approach. Sociological Methods & Research. 50, 2 (May 2021), 708–739. DOI:https://doi.org/10.1177/0049124118799377.",
      "doi": ""
    },
    {
      "text": "Dillahunt, T., Becker, G., Mankoff, J. and Kraut, R. 2008. Motivating Environmentally Sustainable Behavior Changes with a Virtual Polar Bear. Workshop on Pervasive Persuasive Technology and Environmental Sustainability. (2008).",
      "doi": ""
    },
    {
      "text": "DiSalvo, C., Boehner, K., Knouf, N.A. and Sengers, P. 2009. Nourishing the ground for sustainable HCI. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, Apr. 2009), 385–394.",
      "doi": ""
    },
    {
      "text": "DiSalvo, C. and Lukens, J. 2012. Nonanthropocentrism and the Nonhuman in Design: Possibilities for Designing New Forms of Engagement With and Through Technology. From Social Butterfly to Engaged Citizen Eds. Marcus Foth, Laura Forlano, Christine Satchell, and Martin Gibbs. Cambridge: MIT Press. 421–435.",
      "doi": ""
    },
    {
      "text": "DiSalvo, C., Sengers, P. and Brynjarsdóttir, H. 2010. Mapping the landscape of sustainable HCI. Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10 (Atlanta, Georgia, 2010), 1975.",
      "doi": ""
    },
    {
      "text": "Dourish, P. 2010. HCI and Environmental Sustainability: The Politics of Design and the Design of Politics. Proceedings of the 8th ACM Conference on Designing Interactive Systems - DIS ’10. (2010). DOI:https://doi.org/10.1145/1858171.",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Van Dover, C.L. 2014. Ecological restoration in the deep sea: Desiderata. Marine Policy. 44, (Feb. 2014), 98–106. DOI:https://doi.org/10.1016/J.MARPOL.2013.07.006.",
      "doi": ""
    },
    {
      "text": "Duisebekova, K.S., Tuyakova, Z.N., Amanzholova, S.T., Sarsenova, Z.N., Duzbayev, N.T., Pyagay, V.T. and Aitmagambetov, A.Z. 2019. Environmental monitoring system for analysis of climatic and ecological changes using LoRa technology. ACM International Conference Proceeding Series. (Jun. 2019). DOI:https://doi.org/10.1145/3330431.3330446.",
      "doi": ""
    },
    {
      "text": "Dyo, V., Ellwood, S.A., Macdonald, D.W., Markham, A., Trigoni, N., Wohlers, R., Mascolo, C., Pásztor, B., Scellato, S. and Yousef, K. 2012. WILDSENSING: Design and deployment of a sustainable sensor network for wildlife monitoring. ACM Transactions on Sensor Networks (TOSN). 8, 4 (Sep. 2012), 1–33. DOI:https://doi.org/10.1145/2240116.2240118.",
      "doi": "10.1145/2240116.2240118"
    },
    {
      "text": "Elliot, R. 1997. Faking nature: the ethics of environmental restoration. (1997), 177.",
      "doi": ""
    },
    {
      "text": "Elliot, R. 1982. Faking Nature. Inquiry: An Interdisciplinary Journal of Philosophy. 25, 1 (1982). DOI:https://doi.org/10.1080/00201748208601955.",
      "doi": ""
    },
    {
      "text": "Falk, D.A. 2017. Restoration ecology, resilience, and the axes of change. Annals of the Missouri Botanical Garden. 102, 2 (Aug. 2017), 201–216. DOI:https://doi.org/10.3417/2017006.",
      "doi": ""
    },
    {
      "text": "Foley, J.A. 2005. Global Consequences of Land Use. Science. 309, 5734 (Jul. 2005), 570 LP – 574. DOI:https://doi.org/10.1126/science.1111772.",
      "doi": ""
    },
    {
      "text": "Forlano, L. 2016. Decentering the Human in the Design of Collaborative Cities. Design Issues. 32, 3 (2016), 42–54. DOI:https://doi.org/10.1162/DESI_a_00398.",
      "doi": ""
    },
    {
      "text": "Foth, M., Paulos, E., Satchell, C. and Dourish, P. 2009. Pervasive computing and environmental sustainability: Two conference workshops. IEEE Pervasive Computing. 8, 1 (Jan. 2009), 78–81. DOI:https://doi.org/10.1109/MPRV.2009.13.",
      "doi": "10.1109/MPRV.2009.13"
    },
    {
      "text": "Froehlich, J., Dillahunt, T., Klasnja, P., Mankoff, J., Consolvo, S., Harrison, B. and Landay, J.A. 2009. UbiGreen: Investigating a mobile tool for tracking and supporting green transportation habits. Conference on Human Factors in Computing Systems - Proceedings. (2009), 1043–1052. DOI:https://doi.org/10.1145/1518701.1518861.",
      "doi": ""
    },
    {
      "text": "Gaworecki, M. 2016. Grasslands in US Great Plains are being destroyed at “alarming rate”. Mongabay.",
      "doi": ""
    },
    {
      "text": "Goodman, E. Three Environmental Discourses in Human-Computer Interaction. CHI ’09 Extended Abstracts on Human Factors in Computing Systems. DOI:https://doi.org/10.1145/1520340.",
      "doi": ""
    },
    {
      "text": "Guerrero, A.M., Shoo, L., Iacona, G., Standish, R.J., Catterall, C.P., Rumpff, L., Bie, K. de, White, Z., Matzek, V. and Wilson, K.A. 2017. Using structured decision-making to set restoration objectives when multiple values and preferences exist. Restoration Ecology. 25, 6 (Nov. 2017), 858–865. DOI:https://doi.org/10.1111/REC.12591.",
      "doi": ""
    },
    {
      "text": "Haddaway, N.R., Kohl, C., Rebelo da Silva, N., Schiemann, J., Spök, A., Stewart, R., Sweet, J.B. and Wilhelm, R. 2017. A framework for stakeholder engagement during systematic reviews and maps in environmental management. Environmental Evidence. 6, 11 (2017). DOI:https://doi.org/10.1186/S13750-017-0089-8.",
      "doi": ""
    },
    {
      "text": "Häkkilä, J., Cheverst, K., Schöning, J., Bidwell, N.J., Robinson, S. and Colley, A. 2016. NatureCHI - Unobtrusive user experiences with technology in nature. Conference on Human Factors in Computing Systems - Proceedings. 07-12-May-2016, (May 2016), 3574–3580. DOI:https://doi.org/10.1145/2851581.2856495.",
      "doi": ""
    },
    {
      "text": "He, J., Martin, A., Lang, R. and Gross-Camp, N. 2021. Explaining success on community forestry through a lens of environmental justice: Local justice norms and practices in China. World Development. 142, (Jun. 2021), 105450. DOI:https://doi.org/10.1016/J.WORLDDEV.2021.105450.",
      "doi": ""
    },
    {
      "text": "He, K.S., Bradley, B.A., Cord, A.F., Rocchini, D., Tuanmu, M.N., Schmidtlein, S., Turner, W., Wegmann, M. and Pettorelli, N. 2015. Will remote sensing shape the next generation of species distribution models? Remote Sensing in Ecology and Conservation. 1, 1 (Oct. 2015), 4–18. DOI:https://doi.org/10.1002/RSE2.7.",
      "doi": ""
    },
    {
      "text": "Hefeeda, M. and Bagheri, M. 2007. Wireless sensor networks for early detection of forest fires. 2007 IEEE Internatonal Conference on Mobile Adhoc and Sensor Systems, MASS. (2007). DOI:https://doi.org/10.1109/MOBHOC.2007.4428702.",
      "doi": ""
    },
    {
      "text": "Heitlinger, S., Nick, B.-K. and Comber, R. Connected Seeds and Sensors: Co-designing Internet of Things for Sustainable Smart Cities with Urban Food-Growing Communities. DOI:https://doi.org/10.1145/3210604.3210620.",
      "doi": ""
    },
    {
      "text": "Hobbs, R.J. 2014. Managing the whole landscape: historical, hybrid, and novel ecosystems. Frontiers in Ecology and the Environment. 12, 10 (Dec. 2014), 557–564. DOI:https://doi.org/10.1890/130300.",
      "doi": ""
    },
    {
      "text": "Hou, J. 2006. Hybrid Landscapes: Toward an Inclusive Ecological Urbanism on Seattle's Central Waterfront. 94th ACSA Annual Meeting Proceedings, Getting Real (2006).",
      "doi": ""
    },
    {
      "text": "How to Do a Thematic Analysis of User Interviews | Interaction Design Foundation (IxDF): https://www.interaction-design.org/literature/article/how-to-do-a-thematic-analysis-of-user-interviews. Accessed: 2021-12-10.",
      "doi": ""
    },
    {
      "text": "Hwang, J., Jeong, Y., Park, J.M., Lee, K.H., Hong, J.W. and Choi, J. 2015. Biomimetics: forecasting the future of science, engineering, and medicine. International Journal of Nanomedicine. 10, (Sep. 2015), 5701. DOI:https://doi.org/10.2147/IJN.S83642.",
      "doi": ""
    },
    {
      "text": "Jaakkola Elisa and Alakärppä Ismo 2018. Human Nature-Interaction: Observations in Berlin's City Parks. Workshop on HCI Outdoors: Understanding Human-Computer Interaction in the Outdoors at CHI. (Apr. 2018).",
      "doi": ""
    },
    {
      "text": "Jiang, Q., Kresin, F., Bregt, A.K., Kooistra, L., Pareschi, E., Van Putten, E., Volten, H. and Wesseling, J. 2016. Citizen Sensing for Improved Urban Environmental Monitoring. Journal of Sensors. 2016, (2016). DOI:https://doi.org/10.1155/2016/5656245.",
      "doi": ""
    },
    {
      "text": "K.C., A. 2017. Community Forestry Management and its Role in Biodiversity Conservation in Nepal. Global Exposition of Wildlife Management. (Mar. 2017). DOI:https://doi.org/10.5772/65926.",
      "doi": ""
    },
    {
      "text": "Katz, E. 1991. Restoration and Redesign: The Ethical Significance of Human Intervention in Nature. Restoration & Management Notes. 9, 2 (1991), 90–96.",
      "doi": ""
    },
    {
      "text": "Katz, E. 2009. The big lie: human restoration of nature. Readings in the Philosophy of Technology. D. M. Kaplan, ed.",
      "doi": ""
    },
    {
      "text": "Kays, R., Crofoot, M.C., Jetz, W. and Wikelski, M. 2015. Terrestrial animal tracking as an eye on life and planet. Science. 348, 6240 (2015). DOI:https://doi.org/10.1126/science.aaa2478.",
      "doi": ""
    },
    {
      "text": "Kim, N.S., Lee, K. and Ryu, J.H. 2015. Study on IoT based wild vegetation community ecological monitoring system. 2015 Seventh International Conference on Ubiquitous and Future Networks. (2015), 311–316. DOI:https://doi.org/10.1109/ICUFN.2015.7182556.",
      "doi": ""
    },
    {
      "text": "Kim, S., Laschi, C. and Trimmer, B. 2013. Soft robotics: a bioinspired evolution in robotics. Trends in Biotechnology. 31, 5 (May 2013), 287–294. DOI:https://doi.org/10.1016/J.TIBTECH.2013.03.002.",
      "doi": ""
    },
    {
      "text": "Kobayashi, H., Nakamura, K., Hirose, M., Sezaki, K., Fujiwara, A. and Saito, K. 2013. Tele echo tube: Beyond cultural and imaginable boundaries. MM 2013 - Proceedings of the 2013 ACM Multimedia Conference. (2013), 173–182. DOI:https://doi.org/10.1145/2502081.2502125.",
      "doi": ""
    },
    {
      "text": "Kobayashi, H., Ueoka, R. and Hirose, M. 2009. Wearable forest clothing system: Beyond human-computer interaction. ACM SIGGRAPH 2009 Art Gallery, SIGGRAPH ’09. (2009), 300–306. DOI:https://doi.org/10.1145/1667265.1667267.",
      "doi": "10.1145/1667265.1667267"
    },
    {
      "text": "Kobayashi, H.H. 2015. Human–Computer–Biosphere Interaction: Toward a Sustainable Society. More Playful User Interfaces: Interfaces that Invite Social and Physical Interaction. A. Nijholt, ed. Springer Singapore. 97–119.",
      "doi": ""
    },
    {
      "text": "Kuznetsov, S., Odom, W., Pierce, J. and Paulos, E. 2011. Nurturing natural sensors. Proceedings of the 13th international conference on Ubiquitous computing - UbiComp ’11 (Beijing, China, 2011), 227.",
      "doi": "10.1145/2030112.2030144"
    },
    {
      "text": "Lahoz-Monfort, J.J. and Magrath, M.J.L. 2021. A Comprehensive Overview of Technologies for Species and Habitat Monitoring and Conservation. BioScience. 71, 10 (Oct. 2021), 1038–1062. DOI:https://doi.org/10.1093/BIOSCI/BIAB073.",
      "doi": ""
    },
    {
      "text": "Lew, T.T.S., Park, M., Cui, J. and Strano, M.S. 2021. Plant Nanobionic Sensors for Arsenic Detection. Advanced Materials. 33, 1 (Jan. 2021), 2005683. DOI:https://doi.org/10.1002/ADMA.202005683.",
      "doi": ""
    },
    {
      "text": "Light, A. 2006. Ecological citizenship: The democratic promise of restoration. The Humane Metropolis: People and Nature in the 21st-Century City. (2006), 169–181.",
      "doi": ""
    },
    {
      "text": "Light, A. 2007. Restorative Relationships: From Artifacts to Natural Systems. Healing Natures, Repairing Relationships: New Perspectives on Restoring Ecological Spaces and Consciousness. R.L. France, ed. Green Frigate Books.",
      "doi": ""
    },
    {
      "text": "Liu, J., Byrne, D. and Devendorf, L. 2018. Design for collaborative survival: An inquiry into human-fungi relationships. Conference on Human Factors in Computing Systems - Proceedings. 2018-April, (Apr. 2018). DOI:https://doi.org/10.1145/3173574.3173614.",
      "doi": "10.1145/3173574.3173614"
    },
    {
      "text": "Liu, S.-Y., Bardzell, S. and Bardzell, J. Symbiotic Encounters: HCI and Sustainable Agriculture. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 13. DOI:https://doi.org/10.1145/3290605.",
      "doi": ""
    },
    {
      "text": "Liu, S.Y. 2019. Designing with, through, and for human-nature interaction. DIS 2019 Companion - Companion Publication of the 2019 ACM Designing Interactive Systems Conference. (Jun. 2019), 101–104. DOI:https://doi.org/10.1145/3301019.3324874.",
      "doi": "10.1145/3301019.3324874"
    },
    {
      "text": "Liu, S.Y.C., Bardzell, S. and Bardzell, J. 2018. Out of control: Reframing sustainable HCI using permaculture. ACM International Conference Proceeding Series. (May 2018). DOI:https://doi.org/10.1145/3232617.3232625.",
      "doi": ""
    },
    {
      "text": "Luo, D., Gu, J., Qin, F., Wang, G. and Yao, L. 2020. E-seed: Shape-changing interfaces that self drill. UIST 2020 - Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (2020), 45–57.",
      "doi": "10.1145/3379337.3415855"
    },
    {
      "text": "Luuppala, L.S. ECOLOGICAL RESTORATION: Conceptual Analysis and Ethical Implications.",
      "doi": ""
    },
    {
      "text": "Madliger, C.L., Love, O.P., Nguyen, V.M., Haddaway, N.R. and Cooke, S.J. 2021. Researcher perspectives on challenges and opportunities in conservation physiology revealed from an online survey. Conservation Physiology. 9, 1 (Jan. 2021). DOI:https://doi.org/10.1093/CONPHYS/COAB030.",
      "doi": ""
    },
    {
      "text": "Mankoff, J., Matthews, D., Fussell, S.R. and Johnson, M. 2007. Leveraging social networks to motivate individuals to reduce their ecological footprints. Proceedings of the Annual Hawaii International Conference on System Sciences. (2007). DOI:https://doi.org/10.1109/HICSS.2007.325.",
      "doi": ""
    },
    {
      "text": "Martin, D.M. 2017. Ecological restoration should be redefined for the twenty-first century. Restoration Ecology. 25, 5 (Sep. 2017), 668–673. DOI:https://doi.org/10.1111/REC.12554.",
      "doi": ""
    },
    {
      "text": "Marvin, D.C., Koh, L.P., Lynam, A.J., Wich, S., Davies, A.B., Krishnamurthy, R., Stokes, E., Starkey, R. and Asner, G.P. 2016. Integrating technologies for scalable ecology and conservation. Global Ecology and Conservation. 7, (Jul. 2016), 262–275. DOI:https://doi.org/10.1016/J.GECCO.2016.07.002.",
      "doi": ""
    },
    {
      "text": "Milner-Gulland, E.J., Ibbett, H., Wilfred, P., Ngoteya, H.C. and Lestari, P. 2020. Understanding local resource users’ behaviour, perspectives and priorities to underpin conservation practice. Conservation Research, Policy and Practice. (Apr. 2020), 63–81. DOI:https://doi.org/10.1017/9781108638210.005.",
      "doi": ""
    },
    {
      "text": "Mo, L., He, Y., Liu, Y., Zhao, J., Tang, S.J., Li, X.Y. and Dai, G. 2009. Canopy closure estimates with GreenOrbs: Sustainable sensing in the forest. Proceedings of the 7th ACM Conference on Embedded Networked Sensor Systems, SenSys 2009. (2009), 99–112. DOI:https://doi.org/10.1145/1644038.1644049.",
      "doi": ""
    },
    {
      "text": "Molina-Pico, A., Cuesta-Frau, D., Araujo, A., Alejandre, J. and Rozas, A. 2016. Forest Monitoring and Wildland Early Fire Detection by a Hierarchical Wireless Sensor Network. Journal of Sensors. 2016, (2016). DOI:https://doi.org/10.1155/2016/8325845.",
      "doi": ""
    },
    {
      "text": "Nature 2.0: the political economy of conservation in online and Southern African environments | NWO: https://www.nwo.nl/en/projects/451-11-010-0. Accessed: 2021-12-14.",
      "doi": ""
    },
    {
      "text": "Norton, J., Raturi, A., Nardi, B., Prost, S., McDonald, S., Pargman, D., Bates, O., Normark, M., Tomlinson, B., Herbig, N. and Dombrowski, L. 2017. A grand challenge for HCI. Interactions. 24, 6 (Oct. 2017), 50–55. DOI:https://doi.org/10.1145/3137095.",
      "doi": "10.1145/3137095"
    },
    {
      "text": "Noss, R. 2008. Context Matters: Considerations for Large-Scale Conservation - Conservation. Conservation magazine (Summer), Nature.",
      "doi": ""
    },
    {
      "text": "Nucleário: Biodegradable seed planter that could help advance reforestation projects in Brazil and beyond – Life & Soul Magazine: https://lifeandsoulmagazine.com/2020/04/24/nucleario-biodegradable-seed-planter-that-could-help-advance-reforestation-projects-in-brazil-and-beyond/. Accessed: 2021-09-02.",
      "doi": ""
    },
    {
      "text": "O'Donoghue, P. and Rutz, C. 2016. Real-time anti-poaching tags could help prevent imminent species extinctions. Journal of Applied Ecology. 53, 1 (Feb. 2016), 5–10. DOI:https://doi.org/10.1111/1365-2664.12452.",
      "doi": ""
    },
    {
      "text": "Odom, W. 2010. “Mate, we don't need a chip to tell us the soil's dry”: Opportunities for designing interactive systems to support urban food production. DIS 2010 - Proceedings of the 8th ACM Conference on Designing Interactive Systems. (2010), 232–235. DOI:https://doi.org/10.1145/1858171.1858211.",
      "doi": "10.1145/1858171.1858211"
    },
    {
      "text": "Olufunke Anuoluwapo, O., Olatutu Opeyemi, A. and Author, C. 2019. The Role of Information and Communications Technology (ICT) In Environmental Sustainability. IOSR Journal of Environmental Science. 13, 2 (2019), 13–18. DOI:https://doi.org/10.9790/2402-1302021318.",
      "doi": ""
    },
    {
      "text": "Palagi, S. and Fischer, P. 2018. Bioinspired microrobots. Nature Reviews Materials 2018 3:6. 3, 6 (May 2018), 113–124. DOI:https://doi.org/10.1038/s41578-018-0016-9.",
      "doi": ""
    },
    {
      "text": "Palmer, J. 2021. Collaboration is key to scaling conservation technologies (commentary). Mongabay.",
      "doi": ""
    },
    {
      "text": "Park, S., Kwon, R., Yun, S., Ganser, J., Kim, H. and Anthony, S. 2018. Forestry monitoring system using lora and drone. ACM International Conference Proceeding Series. (Jun. 2018). DOI:https://doi.org/10.1145/3227609.3227677.",
      "doi": ""
    },
    {
      "text": "Paulos, E., Honicky, R. and Hooker, B. 2009. Citizen Science. Handbook of Research on Urban Informatics. (2009), 414–436. DOI:https://doi.org/10.4018/978-1-60566-152-0.CH028:",
      "doi": ""
    },
    {
      "text": "Perring, M.P., Standish, R.J., Price, J.N., Craig, M.D., Erickson, T.E., Ruthrof, K.X., Whiteley, A.S., Valentine, L.E. and Hobbs, R.J. 2015. Advances in restoration ecology: rising to the challenges of the coming decades. Ecosphere. 6, 8 (Aug. 2015), 1–25. DOI:https://doi.org/10.1890/ES15-00121.1.",
      "doi": ""
    },
    {
      "text": "De Pinto, A., Cenacchi, N., Robertson, R., Kwon, H.Y., Thomas, T., Koo, J., Begeladze, S. and Kumar, C. 2020. The Role of Crop Production in the Forest Landscape Restoration Approach—Assessing the Potential Benefits of Meeting the Bonn Challenge. Frontiers in Sustainable Food Systems. 4, (May 2020), 61. DOI:https://doi.org/10.3389/FSUFS.2020.00061/BIBTEX.",
      "doi": ""
    },
    {
      "text": "Piro, B., Tran, H.V. and Thu, V.T. 2020. Sensors Made of Natural Renewable Materials: Efficiency, Recyclability or Biodegradability—The Green Electronics. Sensors (Basel, Switzerland). 20, 20 (Oct. 2020), 1–58. DOI:https://doi.org/10.3390/S20205898.",
      "doi": ""
    },
    {
      "text": "Pollard, E. (Ernest), Yates, T.J. (Tina J.., Institute of Terrestrial Ecology. and Joint Nature Conservation Committee (Great Britain) 1993. Monitoring butterflies for ecology and conservation: the British butterfly monitoring scheme. (1993), 274.",
      "doi": ""
    },
    {
      "text": "Polys, N., Sforza, P. and Munsell, J. 2020. PlantShoe: Botanical Detectives. HCI Outdoors: Theory, Design, Methods and Applications. D.S. McCrickard, M. Jones, and T.L. Stelter, eds. Springer International Publishing.",
      "doi": ""
    },
    {
      "text": "Portocarrero, E., Dublon, G., Paradiso, J. and Bove, M. V. 2015. ListenTree: Audio-haptic display in the natural environment. Conference on Human Factors in Computing Systems - Proceedings. 18, (Apr. 2015), 395–398. DOI:https://doi.org/10.1145/2702613.2725437.",
      "doi": ""
    },
    {
      "text": "Pritchard, H. and Gabrys, J. 2016. From Citizen Sensing to Collective Monitoring: Working through the Perceptive and Affective Problematics of Environmental Pollution. GeoHumanities. 2, 2 (Jul. 2016), 354–371. DOI:https://doi.org/10.1080/2373566X.2016.1234355.",
      "doi": ""
    },
    {
      "text": "Qamar, I.P.S., Stawarz, K., Robinson, S., Goguey, A., Coutrix, C. and Roudaut, A. 2020. Morphino: A Nature-Inspired Tool for the Design of Shape-Changing Interfaces. Proceedings of the 2020 ACM Designing Interactive Systems Conference. (2020). DOI:https://doi.org/10.1145/3357236.",
      "doi": "10.1145/3357236.3395453"
    },
    {
      "text": "Raghavan, B. and Pargman, D. 2017. Means and ends in human-computer interaction: Sustainability through disintermediation. Conference on Human Factors in Computing Systems - Proceedings. 2017-May, (2017), 786–796. DOI:https://doi.org/10.1145/3025453.3025542.",
      "doi": "10.1145/3025453.3025542"
    },
    {
      "text": "Rathnayake, C., Joshi, S. and Cerratto-Pargman, T. 2020. Mapping the current landscape of citizen-driven environmental monitoring: a systematic literature review. Sustainability: Science, Practice and Policy. 16, 1 (Dec. 2020), 326–334. DOI:https://doi.org/10.1080/15487733.2020.1829845.",
      "doi": ""
    },
    {
      "text": "Remy, C., Bates, O., Dix, A., Thomas, V., Hazas, M., Friday, A. and Huang, E.M. 2018. Evaluation beyond Usability: Validating Sustainable HCI Research. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. (2018). DOI:https://doi.org/10.1145/3173574.",
      "doi": "10.1145/3173574.3173790"
    },
    {
      "text": "Ridge, J.T. and Johnston, D.W. 2020. Unoccupied Aircraft Systems (UAS) for Marine Ecosystem Restoration. Frontiers in Marine Science. 7, (2020), 438. DOI:https://doi.org/10.3389/fmars.2020.00438.",
      "doi": ""
    },
    {
      "text": "Rundel, P.W., Graham, E.A., Allen, M.F., Fisher, J.C. and Harmon, T.C. 2009. Environmental sensor networks in ecological research. New Phytologist. 182, 3 (May 2009), 589–607. DOI:https://doi.org/10.1111/J.1469-8137.2009.02811.X.",
      "doi": ""
    },
    {
      "text": "Salvatore, G.A., Sülzle, J., Dalla Valle, F., Cantarella, G., Robotti, F., Jokic, P., Knobelspies, S., Daus, A., Büthe, L., Petti, L., Kirchgessner, N., Hopf, R., Magno, M. and Tröster, G. 2017. Biodegradable and Highly Deformable Temperature Sensors for the Internet of Things. Advanced Functional Materials. 27, 35 (Sep. 2017). DOI:https://doi.org/10.1002/ADFM.201702390.",
      "doi": ""
    },
    {
      "text": "Save Water in the Plant with this Bio-Inspired Technology | Healthcare Packaging: https://www.healthcarepackaging.com/issues/sustainability/article/21648003/save-water-in-the-plant-with-this-bioinspired-technology. Accessed: 2021-12-16.",
      "doi": ""
    },
    {
      "text": "Saxena, M., Jain, K. and Saxena, R. 2021. Green Synthesized Nanomaterial-based Colorimetric Sensors for Detection of Environmental Toxicants. ChemNanoMat. 7, 4 (Apr. 2021), 392–414. DOI:https://doi.org/10.1002/CNMA.202100012.",
      "doi": ""
    },
    {
      "text": "Schnier, T., Beale, R., Yao, X., Hendley, B. and Byrne, W. 2021. Nature Inspired Creative Design – Bringing Together Ideas from Nature, Computer Science, Engineering, Art and Design. Designing for the 21st Century. (Sep. 2021), 192–204. DOI:https://doi.org/10.4324/9781315264660-14.",
      "doi": ""
    },
    {
      "text": "Sengers, P., Boehner, K. and Knouf, N. 2009. Sustainable HCI Meets Third Wave HCI: 4 Themes. CHI. (2009).",
      "doi": ""
    },
    {
      "text": "Silberman, M.S., Nathan, L., Knowles, B., Bendor, R., Clear, A., Håkansson, M., Dillahunt, T. and Mankoff, J. 2014. Next steps for Sustainable HCI. Interactions. 21, 5 (2014), 66–69. DOI:https://doi.org/10.1145/2651820.",
      "doi": "10.1145/2651820"
    },
    {
      "text": "Silberman, M.S., Nathan, L.P., Blevis, E., Busse, D., Huang, E., Preist, C., Nardi, B.A. and Mann, S. 2014. What have we learned? A SIGCHI HCI & sustainability workshop. Conference on Human Factors in Computing Systems - Proceedings. (2014), 143–146. DOI:https://doi.org/10.1145/2559206.2559238.",
      "doi": ""
    },
    {
      "text": "Smith, N., Bardzell, S. and Bardzell, J. 2017. Designing for cohabitation: Naturecultures, hybrids, and decentering the human in design. Conference on Human Factors in Computing Systems - Proceedings. 2017-May, (May 2017), 1714–1725. DOI:https://doi.org/10.1145/3025453.3025948.",
      "doi": "10.1145/3025453.3025948"
    },
    {
      "text": "Snyder, E.G., Watkins, T.H., Solomon, P.A., Thoma, E.D., Williams, R.W., Hagler, G.S.W., Shelow, D., Hindin, D.A., Kilaru, V.J. and Preuss, P.W. 2013. The changing paradigm of air pollution monitoring. Environmental Science and Technology. 47, 20 (Oct. 2013), 11369–11377. DOI:https://doi.org/10.1021/ES4022602.",
      "doi": ""
    },
    {
      "text": "Solutions – Biomimicry Institute: https://biomimicry.org/solutions/. Accessed: 2021-12-16.",
      "doi": ""
    },
    {
      "text": "Stachew, E., Houette, T. and Gruber, P. 2021. Root Systems Research for Bioinspired Resilient Design: A Concept Framework for Foundation and Coastal Engineering. Frontiers in Robotics and AI. 8, (Apr. 2021), 109. DOI:https://doi.org/10.3389/FROBT.2021.548444/BIBTEX.",
      "doi": ""
    },
    {
      "text": "Sullivan, B.L., Wood, C.L., Iliff, M.J., Bonney, R.E., Fink, D. and Kelling, S. 2009. eBird: A citizen-based bird observation network in the biological sciences. Biological Conservation. 142, 10 (Oct. 2009), 2282–2292. DOI:https://doi.org/10.1016/J.BIOCON.2009.05.006.",
      "doi": ""
    },
    {
      "text": "The Biomimicry Institute - Examples of nature-inspired sustainable design: https://biomimicry.org/biomimicry-examples/. Accessed: 2021-09-01.",
      "doi": ""
    },
    {
      "text": "Thomas, V., Remy, C. and Bates, O. 2017. The limits of HCD: Reimagining the anthropocentricity of ISO 9241-210. LIMITS 2017 - Proceedings of the 2017 Workshop on Computing Within Limits. (Jun. 2017), 85–92. DOI:https://doi.org/10.1145/3080556.3080561.",
      "doi": "10.1145/3080556.3080561"
    },
    {
      "text": "Timpane-Padgham, B.L., Beechie, T. and Klinger, T. 2017. A systematic review of ecological attributes that confer resilience to climate change in environmental restoration. PLoS ONE. 12, 3 (Mar. 2017). DOI:https://doi.org/10.1371/JOURNAL.PONE.0173812.",
      "doi": ""
    },
    {
      "text": "Towards new frontiers for distributed environmental monitoring based on an ecosystem of plant seed-like soft robots | I-Seed Project | H2020 | CORDIS | European Commission: https://cordis.europa.eu/project/id/101017940. Accessed: 2021-09-02.",
      "doi": ""
    },
    {
      "text": "Upadhaya, S., Arbuckle, J.G. and Schulte, L.A. 2021. Developing farmer typologies to inform conservation outreach in agricultural landscapes. Land Use Policy. 101, (Feb. 2021), 105157. DOI:https://doi.org/10.1016/J.LANDUSEPOL.2020.105157.",
      "doi": ""
    },
    {
      "text": "Value Sensitive Design | The MIT Press: https://mitpress.mit.edu/books/value-sensitive-design. Accessed: 2021-09-04.",
      "doi": ""
    },
    {
      "text": "Vella, K., Ploderer, B. and Brereton, M. 2021. Human-nature relations in urban gardens: Explorations with camera traps. Conference on Human Factors in Computing Systems - Proceedings. (May 2021). DOI:https://doi.org/10.1145/3411764.3445438.",
      "doi": ""
    },
    {
      "text": "Viccaro, M. and Caniani, D. Forest, Agriculture, and Environmental Protection as Path to Sustainable Development. Natural Resources Research. 28. DOI:https://doi.org/10.1007/s11053-019-09497-2.",
      "doi": ""
    },
    {
      "text": "Vogler, D., Macey, S. and Sigouin, A. 2007. Stakeholder Analysis in Environmental and Conservation Planning. Lessons in Conservation, NCEP. 7, (2007), 5–16.",
      "doi": ""
    },
    {
      "text": "Wade, M.R., Gurr, G.M. and Wratten, S.D. 2007. Ecological restoration of farmland: progress and prospects. Philosophical Transactions of the Royal Society B: Biological Sciences. 363, 1492 (Feb. 2007), 831–847. DOI:https://doi.org/10.1098/RSTB.2007.2186.",
      "doi": ""
    },
    {
      "text": "Wall, J., Wittemyer, G., Klinkenberg, B. and Douglas-Hamilton, I. 2014. Novel opportunities for wildlife conservation and research with real-time monitoring. Ecological Applications. 24, 4 (2014), 593–601. DOI:https://doi.org/10.1890/13-1971.1.",
      "doi": ""
    },
    {
      "text": "What are tree cocoons? And how can they help with reforestation? | World Economic Forum: https://www.weforum.org/agenda/2020/07/tree-cocoons-reforestation-harsh-climates/. Accessed: 2021-09-02.",
      "doi": ""
    },
    {
      "text": "Wiersum, K.F. 2004. SOCIAL AND COLLABORATIVE FORESTRY | Social and Community Forestry. Encyclopedia of Forest Sciences. J. Burley, ed. Elsevier. 1136–1143.",
      "doi": ""
    },
    {
      "text": "Wood, C., Sullivan, B., Iliff, M., Fink, D. and Kelling, S. 2011. eBird: Engaging Birders in Science and Conservation. PLOS Biology. 9, 12 (2011), e1001220. DOI:https://doi.org/10.1371/JOURNAL.PBIO.1001220.",
      "doi": ""
    },
    {
      "text": "World Wildlife Day: 5 ways ICTs are helping to protect wildlife - ITU News: https://news.itu.int/world-wildlife-day-5-ways-icts-are-helping-to-protect-wildlife/. Accessed: 2022-01-07.",
      "doi": ""
    },
    {
      "text": "Yao, L., Ou, J., Cheng, C.Y., Steiner, H., Wang, W., Wang, G. and Ishii, H. 2015. Biologic: Natto cells as nanoactuators for shape changing interfaces. Conference on Human Factors in Computing Systems - Proceedings. 2015-April, (Apr. 2015), 1–10. DOI:https://doi.org/10.1145/2702123.2702611.",
      "doi": ""
    },
    {
      "text": "Yoo, D., Huldtgren, A., Woelfer, J.P., Hendry, D.G. and Friedman, B. 2013. A Value Sensitive Action-Reflection Model: Evolving a co-design space with stakeholder and designer prompts. Conference on Human Factors in Computing Systems - Proceedings. (2013), 419–428. DOI:https://doi.org/10.1145/2470654.2470715.",
      "doi": "10.1145/2470654.2470715"
    },
    {
      "text": "Zhang, C., Zhou, J., Sun, L. and Jin, G. 2019. Pillbot: A soft origami robot inspired by pill bugs. ACM International Conference Proceeding Series. (Sep. 2019), 673–678. DOI:https://doi.org/10.1145/3366194.3366315.",
      "doi": ""
    },
    {
      "text": "Zviedris, R., Elsts, A., Strazdins, G., Mednis, A. and Selavo, L. 2010. LynxNet: Wild animal monitoring using sensor networks. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). 6511 LNCS, (2010), 170–173. DOI:https://doi.org/10.1007/978-3-642-17520-6_18.",
      "doi": ""
    }
  ]
}