{
  "doi": "10.1145/3491102.3517633",
  "title": "Patch-O: Deformable Woven Patches for On-body Actuation",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2022,
  "badges": [],
  "abstract": "We present Patch-O, a novel deformable interface devised as a woven patch that enables diverse movement-based interactions adaptive to garments or on-skin wearing. Patch-O interfaces are uniquely detachable and relocatable soft actuation units that can be sewn or attached to clothing or skin at various locations. To optimize the morphing effect while preserving a slim form factor, we introduce a construction approach that integrates actuators at a structural level and varies the texture and stiffness of the woven substrate locally. We implement three basic actuation primitives, including bending, expanding, and shrinking, and experiment with aggregation parameters to exhaustively extend the design space. A final workshop study inviting textile practitioners to create personalized designs of Patch-O provides insights into the expressiveness of the approach for wearable interactions. We conclude with three applications inspired by users’ designs and showcase the aesthetic and functional usages enabled by the deformable woven patches.",
  "tags": [
    "Fashion/Clothing",
    "Wearable Computers",
    "Fabrication"
  ],
  "authors": [
    {
      "name": "Pin-Sung Ku",
      "institution": "Information Science, Cornell University, United States and Hybrid Body Lab, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161133",
      "orcid": "missing"
    },
    {
      "name": "Kunpeng Huang",
      "institution": "Electrical and Computer Engineering, Cornell University, United States and Hybrid Body Lab, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659763057",
      "orcid": "missing"
    },
    {
      "name": "Cindy Hsin-Liu Kao",
      "institution": "Human Centered Design, Cornell University, United States and Hybrid Body Lab, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658636925",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Roland Aigner, Andreas Pointner, Thomas Preindl, Patrick Parzer, and Michael Haller. 2020. Embroidered resistive pressure sensors: A novel approach for textile interfaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376305"
    },
    {
      "text": "Lea Albaugh, Scott Hudson, and Lining Yao. 2019. Digital Fabrication of Soft Actuated Objects by Machine Knitting. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 184, 13 pages. https://doi.org/10.1145/3290605.3300414",
      "doi": "10.1145/3290605.3300414"
    },
    {
      "text": "K.M. Babu. 2015. Natural textile fibres: Animal and silk fibres. Woodhead Publishing. https://doi.org/10.1016/b978-1-84569-931-4.00003-9",
      "doi": ""
    },
    {
      "text": "Joanna Berzowska and Marcelo Coelho. 2005. Kukkia and vilkas: Kinetic electronic garments. In Ninth IEEE International Symposium on Wearable Computers (ISWC’05). IEEE, 82–85.",
      "doi": "10.1109/ISWC.2005.29"
    },
    {
      "text": "Joanna Berzowska and Di Mainstone. 2008. SKORPIONS: kinetic electronic garments. In ACM SIGGRAPH 2008 talks. 1–1.",
      "doi": "10.1145/1401032.1401091"
    },
    {
      "text": "Joanna Berzowska and Maksim Skorobogatiy. 2010. Karma chameleon: bragg fiber jacquard-woven photonic textiles. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction. 297–298.",
      "doi": "10.1145/1709886.1709950"
    },
    {
      "text": "E. Bonderover and S. Wagner. 2004. A woven inverter circuit for e-textile applications. IEEE Electron Device Letters 25, 5, 295–297. https://doi.org/10.1109/LED.2004.826537",
      "doi": ""
    },
    {
      "text": "L. Buechley. 2006. A Construction Kit for Electronic Textiles. In 2006 10th IEEE International Symposium on Wearable Computers. 83–90. https://doi.org/10.1109/ISWC.2006.286348",
      "doi": ""
    },
    {
      "text": "Justin Chan and Shyamnath Gollakota. 2017. Data Storage and Interaction Using Magnetized Fabric. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 655–663. https://doi.org/10.1145/3126594.3126620",
      "doi": "10.1145/3126594.3126620"
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory: A practical guide through qualitative analysis. sage.",
      "doi": ""
    },
    {
      "text": "Laura Devendorf and Chad Di Lauro. 2019. Adapting Double Weaving and Yarn Plying Techniques for Smart Textiles Applications. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (Tempe, Arizona, USA) (TEI ’19). ACM, New York, NY, USA, 77–85. https://doi.org/10.1145/3294109.3295625",
      "doi": "10.1145/3294109.3295625"
    },
    {
      "text": "Laura Devendorf, Joanne Lo, Noura Howell, Jung Lin Lee, Nan-Wei Gong, M. Emre Karagozler, Shiho Fukuhara, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. ”I Don’T Want to Wear a Screen”: Probing Perceptions of and Possibilities for Dynamic Displays on Clothing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 6028–6039. https://doi.org/10.1145/2858036.2858192",
      "doi": "10.1145/2858036.2858192"
    },
    {
      "text": "Anuj Dhawan, Tushar K. Ghosh, Abdelfattah M. Seyam, and John F. Muth. 2004. Woven Fabric-Based Electrical Circuits: Part II: Yarn and Fabric Structures to Reduce Crosstalk Noise in Woven Fabric-Based Circuits. Textile Research Journal 74, 11 (2004), 955–960. https://doi.org/10.1177/004051750407401103",
      "doi": ""
    },
    {
      "text": "Anuj Dhawan, Abdelfattah Seyam, Tushar Ghosh, and John Muth. 2004. Woven Fabric-Based Electrical Circuits: Part I: Evaluating Interconnect Methods. Textile Research Journal 74 (10 2004), 913–919. https://doi.org/10.1177/004051750407401011",
      "doi": ""
    },
    {
      "text": "Mikhaila Friske, Shanel Wu, and Laura Devendorf. 2019. AdaCAD: Crafting Software For Smart Textiles Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 345, 13 pages. https://doi.org/10.1145/3290605.3300575",
      "doi": "10.1145/3290605.3300575"
    },
    {
      "text": "Maas Goudswaard, Abel Abraham, Bruna Goveia da Rocha, Kristina Andersen, and Rong-Hao Liang. 2020. FabriClick: Interweaving Pushbuttons into Fabrics Using 3D Printing and Digital Embroidery. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 379–393.",
      "doi": "10.1145/3357236.3395569"
    },
    {
      "text": "Bruna Goveia da Rocha, Oscar Tomico, Panos Markopoulos, and Daniel Tetteroo. 2020. Crafting Research Products through Digital Machine Embroidery. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 341–350.",
      "doi": "10.1145/3357236.3395443"
    },
    {
      "text": "Rachael Granberry, Kevin Eschen, Brad Holschuh, and Julianna Abel. 2019. Functionally Graded Knitted Actuators with NiTi-Based Shape Memory Alloys for Topographically Self-Fitting Wearables. Advanced Materials Technologies(2019).",
      "doi": ""
    },
    {
      "text": "Nur Al-huda Hamdan, Simon Voelker, and Jan Borchers. 2018. Sketch&Stitch: Interactive Embroidery for E-textiles. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 82, 13 pages. https://doi.org/10.1145/3173574.3173656",
      "doi": "10.1145/3173574.3173656"
    },
    {
      "text": "Nur Al-huda Hamdan, Adrian Wagner, Simon Voelker, Jürgen Steimle, and Jan Borchers. 2019. Springlets: Expressive, Flexible and Silent On-Skin Tactile Interfaces. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 488.",
      "doi": "10.1145/3290605.3300718"
    },
    {
      "text": "Shiqing He and Eytan Adar. 2020. Plotting with Thread: Fabricating Delicate Punch Needle Embroidery with XY Plotters. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 1047–1057.",
      "doi": "10.1145/3357236.3395540"
    },
    {
      "text": "Noura Howell, Laura Devendorf, Rundong Tian, Tomás Vega Galvez, Nan-Wei Gong, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. Biosignals as social cues: Ambiguity and emotional interpretation in social displays of skin conductance. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. 865–870.",
      "doi": "10.1145/2901790.2901850"
    },
    {
      "text": "Kunpeng Huang, Md Tahmidul Islam Molla, Kat Roberts, Aditi Galada, Pin-Sung Ku, and Cindy Hsin-Liu Kao. 2021. Delocalizing Strain in Interconnected Joints of On-SkinInterfaces. In Proceedings of the 25rd International Symposium on Wearable Computers.",
      "doi": ""
    },
    {
      "text": "Kunpeng Huang, Ruojia Sun, Ximeng Zhang, Md Tahmidul Islam Molla, Margaret Dunne, Francois Guimbretiere, and Cindy Hsin-Liu Kao. 2021. WovenProbe: Probing Possibilities for Weaving Fully-Integrated On-Skin Systems Deployable in the Field. In Designing Interactive Systems Conference 2021. 1143–1158.",
      "doi": "10.1145/3461778.3462105"
    },
    {
      "text": "Scott E Hudson. 2014. Printing teddy bears: a technique for 3D printing of soft interactive objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 459–468.",
      "doi": "10.1145/2556288.2557338"
    },
    {
      "text": "Fujiwara Dai Issey Miyake. 1997. A-POC Queen Textile. Retrieved Jan 15, 2020 from https://www.moma.org/collection/works/100361.",
      "doi": ""
    },
    {
      "text": "Hsin-Liu Kao, Deborah Ajilo, Oksana Anilionyte, Artem Dementyev, Inrak Choi, Sean Follmer, and Chris Schmandt. 2017. Exploring interactions and perceptions of kinetic wearables. In Proceedings of the 2017 Conference on Designing Interactive Systems. 391–396.",
      "doi": "10.1145/3064663.3064686"
    },
    {
      "text": "Thorsten Karrer, Moritz Wittenhagen, Leonhard Lichtschlag, Florian Heller, and Jan Borchers. 2011. Pinstripe: Eyes-Free Continuous Input on Interactive Clothing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 1313–1322. https://doi.org/10.1145/1978942.1979137",
      "doi": "10.1145/1978942.1979137"
    },
    {
      "text": "Pooja Khurana. 2007. Introduction to Fashion Technology. Laxmi Publications Pvt Limited. https://books.google.com/books?id=3Jwj69FnNRYC",
      "doi": ""
    },
    {
      "text": "Jin Hee Kim, Kunpeng Huang, Simone White, Melissa Conroy, and Cindy Hsin-Liu Kao. 2021. KnitDermis: Fabricating Tactile On-Body Interfaces Through Machine Knitting. In Designing Interactive Systems Conference 2021. 1183–1200.",
      "doi": ""
    },
    {
      "text": "Y. Kim, H. Kim, and H. Yoo. 2010. Electrical Characterization of Screen-Printed Circuits on the Fabric. IEEE Transactions on Advanced Packaging 33, 1 (Feb 2010), 196–205. https://doi.org/10.1109/TADVP.2009.2034536",
      "doi": ""
    },
    {
      "text": "Espen Knoop and Jonathan Rossiter. 2015. The tickler: a compliant wearable tactile display for stroking and tickling. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. 1133–1138.",
      "doi": "10.1145/2702613.2732749"
    },
    {
      "text": "Marion Koelle, Swamy Ananthanarayan, and Susanne Boll. 2020. Social acceptability in HCI: A survey of methods, measures, and design strategies. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3313831.3376162"
    },
    {
      "text": "Tomomi Kono and Keita Watanabe. 2017. Filum: A sewing technique to alter textile shapes. In Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology. 39–41.",
      "doi": "10.1145/3131785.3131797"
    },
    {
      "text": "Kristi Kuusk, Marjan Kooroshnia, and Jussi Mikkonen. 2015. Crafting Butterfly Lace: Conductive Multi-Color Sensor-Actuator Structure(UbiComp/ISWC’15 Adjunct). Association for Computing Machinery, New York, NY, USA, 595–600. https://doi.org/10.1145/2800835.2801669",
      "doi": ""
    },
    {
      "text": "Joanne Leong, Patrick Parzer, Florian Perteneder, Teo Babic, Christian Rendl, Anita Vogl, Hubert Egger, Alex Olwal, and Michael Haller. 2016. proCover: sensory augmentation of prosthetic limbs using smart textile covers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 335–346.",
      "doi": "10.1145/2984511.2984572"
    },
    {
      "text": "Jason Lin, Jasmine Zhou, and Helen Koo. 2015. Enfold: clothing for people with cerebral palsy. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers. 563–566.",
      "doi": "10.1145/2800835.2801671"
    },
    {
      "text": "J.M. Matthews. 1924. The Textile Fibers, Their Physical, Microscopical and Chemical Properties. Wiley. https://books.google.com/books?id=Sf41AQAAIAAJ",
      "doi": ""
    },
    {
      "text": "Sachith Muthukumarana, Don Samitha Elvitigala, Juan Pablo Forero Cortes, Denys JC Matthies, and Suranga Nanayakkara. 2020. Touch me gently: recreating the perception of touch using a shape-memory alloy matrix. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376491"
    },
    {
      "text": "Sachith Muthukumarana, Moritz Alexander Messerschmidt, Denys JC Matthies, Jürgen Steimle, Philipp M Scholl, and Suranga Nanayakkara. 2021. ClothTiles: A Prototyping Platform to Fabricate Customized Actuators on Clothing using 3D Printing and Shape-Memory Alloys. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445613"
    },
    {
      "text": "Sara Nabil, Jan Kučera, Nikoletta Karastathi, David S Kirk, and Peter Wright. 2019. Seamless Seams: Crafting Techniques for Embedding Fabrics with Interactive Actuation. In Proceedings of the 2019 on Designing Interactive Systems Conference. 987–999.",
      "doi": "10.1145/3322276.3322369"
    },
    {
      "text": "Alex Olwal, Jon Moeller, Greg Priest-Dorman, Thad Starner, and Ben Carroll. 2018. I/O Braid: Scalable Touch-Sensitive Lighted Cords Using Spiraling, Repeating Sensing Textiles and Fiber Optics. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 485–497. https://doi.org/10.1145/3242587.3242638",
      "doi": "10.1145/3242587.3242638"
    },
    {
      "text": "Maggie Orth, J. R. Smith, E. R. Post, J. A. Strickon, and E. B. Cooper. 1998. Musical Jacket. In ACM SIGGRAPH 98 Electronic Art and Animation Catalog (Orlando, Florida, USA) (SIGGRAPH ’98). ACM, New York, NY, USA, 38–. https://doi.org/10.1145/281388.281456",
      "doi": "10.1145/281388.281456"
    },
    {
      "text": "Jifei Ou, Daniel Oran, Don D. Haddad, Joesph Paradiso, and Hiroshi Ishii. 2019. SensorKnit: Architecting Textile Sensors with Machine Knitting. 3D Printing and Additive Manufacturing 6 (03 2019), 1–11. https://doi.org/10.1089/3dp.2018.0122",
      "doi": ""
    },
    {
      "text": "Patrick Parzer, Florian Perteneder, Kathrin Probst, Christian Rendl, Joanne Leong, Sarah Schuetz, Anita Vogl, Reinhard Schwoediauer, Martin Kaltenbrunner, Siegfried Bauer, 2018. RESi: A Highly Flexible, Pressure-Sensitive, Imperceptible Textile Interface Based on Resistive Yarns. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology. 745–756.",
      "doi": "10.1145/3242587.3242664"
    },
    {
      "text": "Patrick Parzer, Adwait Sharma, Anita Vogl, Jürgen Steimle, Alex Olwal, and Michael Haller. 2017. SmartSleeve: real-time sensing of surface and deformation gestures on flexible, interactive textiles, using a hybrid gesture detection pipeline. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. 565–577.",
      "doi": "10.1145/3126594.3126652"
    },
    {
      "text": "Hannah Perner-Wilson, Leah Buechley, and Mika Satomi. 2010. Handcrafting Textile Interfaces from a Kit-of-No-Parts. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction(Funchal, Portugal) (TEI ’11). Association for Computing Machinery, New York, NY, USA, 61–68. https://doi.org/10.1145/1935701.1935715",
      "doi": "10.1145/1935701.1935715"
    },
    {
      "text": "Laura Perovich, Philippa Mothersill, and Jennifer Broutin Farah. 2014. Awakened apparel: embedded soft actuators for expressive fashion and functional garments. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction. 77–80.",
      "doi": "10.1145/2540930.2540958"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 4216–4227. https://doi.org/10.1145/2858036.2858176",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Stefan Schneegass, Mariam Hassib, Bo Zhou, Jingyuan Cheng, Fernando Seoane, Oliver Amft, Paul Lukowicz, and Albrecht Schmidt. 2015. SimpleSkin: Towards Multipurpose Smart Garments(UbiComp/ISWC’15 Adjunct). Association for Computing Machinery, New York, NY, USA, 241–244. https://doi.org/10.1145/2800835.2800935",
      "doi": ""
    },
    {
      "text": "Ruojia Sun, Ryosuke Onese, Margaret Dunne, Andrea Ling, Amanda Denham, and Hsin-Liu (Cindy) Kao. 2020. Weaving a Second Skin: Exploring Opportunities for Crafting On-Skin Interfaces Through Weaving. In Proceedings of the 2020 ACM Conference on Designing Interactive Systems (Eindhoven, The Netherlands) (DIS ’20). ACM.",
      "doi": "10.1145/3357236.3395548"
    },
    {
      "text": "Oscar Tomico, Mascha van Zijverden, Tom Fejér, Yiyu Chen, Eef Lubbers, Meerthe Heuvelings, Sonia Aïssaoui, and Verena Schepperheyn. 2013. Crafting wearables: interaction design meets fashion design. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. 2875–2876.",
      "doi": ""
    },
    {
      "text": "Vasiliki Tsaknaki. 2021. The Breathing Wings: An Autobiographical Soma Design Exploration of Touch Qualities through Shape-Change Materials. In Designing Interactive Systems Conference 2021. 1266–1279.",
      "doi": "10.1145/3461778.3462054"
    },
    {
      "text": "Guanyun Wang, Tingyu Cheng, Youngwook Do, Humphrey Yang, Ye Tao, Jianzhe Gu, Byoungkwon An, and Lining Yao. 2018. Printed paper actuator: A low-cost reversible actuation and sensing method for shape changing interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3174143"
    },
    {
      "text": "P. Weigle. 1978. Double Weave. Watson-Guptill Publications. https://books.google.com/books?id=3blBAQAAIAAJ",
      "doi": ""
    },
    {
      "text": "R. Wijesiriwardana, K. Mitcham, and T. Dias. 2004. Fibre-meshed transducers based real time wearable physiological information monitoring system. In Eighth International Symposium on Wearable Computers, Vol. 1. 40–47. https://doi.org/10.1109/ISWC.2004.20",
      "doi": "10.1109/ISWC.2004.20"
    },
    {
      "text": "Michele A. Williams, Asta Roseway, Chris O’Dowd, Mary Czerwinski, and Meredith Ringel Morris. 2015. SWARM: An Actuated Wearable for Mediating Affect. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (Stanford, California, USA) (TEI ’15). Association for Computing Machinery, New York, NY, USA, 293–300. https://doi.org/10.1145/2677199.2680565",
      "doi": "10.1145/2677199.2680565"
    },
    {
      "text": "Tony Wu, Shiho Fukuhara, Nicholas Gillian, Kishore Sundara-Rajan, and Ivan Poupyrev. 2020. ZebraSense: A Double-sided Textile Touch Sensor for Smart Clothing. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 662–674.",
      "doi": "10.1145/3379337.3415886"
    },
    {
      "text": "Haoran Xie, Hiromu Matsuzaki, and Takuma Torii. 2020. xClothes: augmenting human thermoregulation using shape changing clothes. In Proceedings of the 11th Augmented Human International Conference. 1–8.",
      "doi": "10.1145/3396339.3396400"
    },
    {
      "text": "Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: pneumatically actuated soft composite materials for shape changing interfaces. In Proceedings of the 26th annual ACM symposium on User interface software and Technology. 13–22.",
      "doi": "10.1145/2501988.2502037"
    },
    {
      "text": "Lining Yao, Jifei Ou, Chin-Yi Cheng, Helene Steiner, Wen Wang, Guanyun Wang, and Hiroshi Ishii. 2015. BioLogic: natto cells as nanoactuators for shape changing interfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1–10.",
      "doi": "10.1145/2702123.2702611"
    },
    {
      "text": "Yuka Yoshioka and Ghassan E. Jabbour. 2006. Desktop inkjet printer as a tool to print conducting polymers. Synthetic Metals 156, 11 (2006), 779 – 783. https://doi.org/10.1016/j.synthmet.2006.03.013",
      "doi": ""
    },
    {
      "text": "C. Zeagler, S. Gilliland, H. Profita, and T. Starner. 2012. Textile Interfaces: Embroidered Jog-Wheel, Beaded Tilt Sensor, Twisted Pair Ribbon, and Sound Sequins. In 2012 16th International Symposium on Wearable Computers. 60–63. https://doi.org/10.1109/ISWC.2012.29",
      "doi": "10.1109/ISWC.2012.29"
    },
    {
      "text": "Christoph Zysset, Kunigunde Cherenack, Thomas Kinkeldei, and Gerhard Tröster. 2010. Weaving integrated circuits into textiles. In International Symposium on Wearable Computers (ISWC) 2010. IEEE, 1–8.",
      "doi": ""
    }
  ]
}