{
  "doi": "10.1145/3491102.3517742",
  "title": "Unpacking Invisible Work Practices, Constraints, and Latent Power Relationships in Child Welfare through Casenote Analysis",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-22",
  "year": 2022,
  "badges": [],
  "abstract": "Caseworkers are trained to write detailed narratives about families in Child-Welfare (CW) which informs collaborative high-stakes decision-making. Unlike other administrative data, these narratives offer a more credible source of information with respect to workers’ interactions with families as well as underscore the role of systemic factors in decision-making. SIGCHI researchers have emphasized the need to understand human discretion at the street-level to be able to design human-centered algorithms for the public sector. In this study, we conducted computational text analysis of casenotes at a child-welfare agency in the midwestern United States and highlight patterns of invisible street-level discretionary work and latent power structures that have direct implications for algorithm design. Casenotes offer a unique lens for policymakers and CW leadership towards understanding the experiences of on-the-ground caseworkers. As a result of this study, we highlight how street-level discretionary work needs to be supported by sociotechnical systems developed through worker-centered design. This study offers the first computational inspection of casenotes and introduces them to the SIGCHI community as a critical data source for studying complex sociotechnical systems.",
  "authors": [
    {
      "name": "Devansh Saxena",
      "institution": "Department of Computer Science, Marquette University, United States",
      "img": "/do/10.1145/contrib-99659487679/rel-imgonly/maggie_dev57-53-copy1_copy.jpg",
      "acmid": "99659487679",
      "orcid": "0000-0001-5566-7409"
    },
    {
      "name": "Seh Young Moon",
      "institution": "University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233958",
      "orcid": "missing"
    },
    {
      "name": "Dahlia Shehata",
      "institution": "University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237616",
      "orcid": "missing"
    },
    {
      "name": "Shion Guha",
      "institution": "Faculty of Information, University of Toronto, Canada",
      "img": "/do/10.1145/contrib-81502671625/rel-imgonly/headshot-2019-crop.png",
      "acmid": "81502671625",
      "orcid": "0000-0003-0073-2378"
    }
  ],
  "references": [
    {
      "text": "J Khadijah Abdurahman. 2021. Calculating the Souls of Black Folk: Predictive Analytics in the New York City Administration for Children’s Services. Columbia Journal of Race and Law 11, 4 (2021), 75–110.",
      "doi": ""
    },
    {
      "text": "Rediet Abebe, Solon Barocas, Jon Kleinberg, Karen Levy, Manish Raghavan, and David G Robinson. 2020. Roles for computing in social change. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency. 252–260.",
      "doi": "10.1145/3351095.3372871"
    },
    {
      "text": "Mark S. Ackerman. 2000. The Intellectual Challenge of CSCW: The Gap between Social Requirements and Technical Feasibility. Hum.-Comput. Interact. 15, 2 (Sept. 2000), 179–203.",
      "doi": "10.1207/S15327051HCI1523_5"
    },
    {
      "text": "Libby S Adler. 2001. The meanings of permanence: A critical analysis of the Adoption and Safe Families Act of 1997. Harv. J. on Legis. 38(2001), 1.",
      "doi": ""
    },
    {
      "text": "Social Security Administration. 2021. State-specific data. https://www.ssa.gov/OACT/babynames/limits.html",
      "doi": ""
    },
    {
      "text": "Ali Alkhatib and Michael Bernstein. 2019. Street-Level Algorithms: A Theory at the Gaps Between Policy and Decisions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 530.",
      "doi": "10.1145/3290605.3300760"
    },
    {
      "text": "Asbjørn Ammitzbøll Flügge, Thomas Hildebrandt, and Naja Holten Møller. 2021. Street-Level Algorithms and AI in Bureaucratic Decision-Making: A Caseworker Perspective. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–23.",
      "doi": "10.1145/3449114"
    },
    {
      "text": "Mark Andrejevic. 2019. Automating surveillance. Surveillance & Society 17, 1/2 (2019), 7–13.",
      "doi": ""
    },
    {
      "text": "Maria Antoniak, David Mimno, and Karen Levy. 2019. Narrative paths and negotiation of power in birth stories. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–27.",
      "doi": "10.1145/3359190"
    },
    {
      "text": "Maria Antoniak, David Mimno, and Karen Levy. 2019. Narrative Paths and Negotiation of Power in Birth Stories. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 27.",
      "doi": "10.1145/3359190"
    },
    {
      "text": "Cecilia Aragon, Shion Guha, Marina Kogan, Michael Muller, and Gina Neff. 2022. Human-Centered Data Science: An Introduction. MIT Press.",
      "doi": ""
    },
    {
      "text": "Karla Badillo-Urquiola, Xinru Page, and Pamela Wisniewski. 2019. Risk vs. Restriction: The Digital Divide between Providing a Sense of Normalcy and Keeping Foster Teens Safe Online. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": "10.1145/3290605.3300497"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. In Proceedings of the SIGCHI conference on human factors in computing systems. 675–684.",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Eric PS Baumer, David Mimno, Shion Guha, Emily Quan, and Geri K Gay. 2017. Comparing grounded theory and topic modeling: Extreme divergence or unlikely convergence?Journal of the Association for Information Science and Technology 68, 6(2017), 1397–1410.",
      "doi": ""
    },
    {
      "text": "S Bekaert, E Paavilainen, H Scheke, A Baldacchino, E Jouet, L Zablocka-Zytka, B Bachi, F Bartoli, G Carra, RM Cioni, 2021. Family members’ perspectives of child protection services, a metasynthesis of the literature. Children and Youth Services Review(2021), 106094.",
      "doi": ""
    },
    {
      "text": "Bruce K Berger. 2005. Power over, power with, and power to relations: Critical reflections on public relations, the dominant coalition, and activism. Journal of Public Relations Research 17, 1 (2005), 5–28.",
      "doi": ""
    },
    {
      "text": "Joan M Blakey, Sonya J Leathers, Michelle Lawler, Tyreasa Washington, Chiralaine Natschke, Tonya Strand, and Quenette Walton. 2012. A review of how states are addressing placement stability. Children and Youth Services Review 34, 2 (2012), 369–378.",
      "doi": ""
    },
    {
      "text": "Susanne Bødker, Christian Dindler, and Ole Sejer Iversen. 2017. Tying knots: Participatory infrastructuring at work. Computer Supported Cooperative Work (CSCW) 26, 1-2 (2017), 245–273.",
      "doi": "10.1007/s10606-017-9268-y"
    },
    {
      "text": "Emily Adlin Bosk. 2018. What counts? quantification, worker judgment, and divergence in child welfare decision making. Human Service Organizations: Management, Leadership & Governance 42, 2(2018), 205–224.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Anna Brown, Alexandra Chouldechova, Emily Putnam-Hornstein, Andrew Tobin, and Rhema Vaithianathan. 2019. Toward Algorithmic Accountability in Public Services: A Qualitative Study of Affected Community Perspectives on Algorithmic Decision-making in Child Welfare Services. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 41.",
      "doi": "10.1145/3290605.3300271"
    },
    {
      "text": "Per Ms Brown and Per Jeremy. 2021. Caring for Children in Foster Care: The Challenges and How to Overcome Them. Child Abuse & Neglect Conference: Prevention, Assessment, and Treatment (2021).",
      "doi": ""
    },
    {
      "text": "Justin B Bullock, Jesper Rosenberg Hansen, and David J Houston. 2018. Sector Differences in Employee’s Perceived Importance of Income and Job Security: Can These be Found Across the Contexts of Countries, Cultures, and Occupations?International Public Management Journal 21, 2 (2018), 243–271.",
      "doi": ""
    },
    {
      "text": "Kimberly Bundy-Fazioli, Katharine Briar-Lawson, and Eric R Hardiman. 2009. A qualitative examination of power between child welfare workers and parents. British Journal of Social Work 39, 8 (2009), 1447–1464.",
      "doi": ""
    },
    {
      "text": "United States Census Bureau. 2016. File B: Surnames occurring 100 or more times. https://www.census.gov/topics/population/genealogy/data/2010_surnames.html",
      "doi": ""
    },
    {
      "text": "Peter André Busch and Helle Zinner Henriksen. 2018. Digital discretion: A systematic literature review of ICT and street-level discretion. Information Polity 23, 1 (2018), 3–28.",
      "doi": "10.3233/IP-170050"
    },
    {
      "text": "Marilyn Callahan and Karen Swift. 2018. The paradox of risk assessment, child safety and empowerment in child welfare. In Revitalising communities in a globalising world. Routledge, 67–77.",
      "doi": ""
    },
    {
      "text": "Michael J Camasso and Radha Jagannathan. 2013. Decision making in child protective services: A risky business?Risk analysis 33, 9 (2013), 1636–1649.",
      "doi": ""
    },
    {
      "text": "Sarah Carnochan, Megan Moore, and Michael J Austin. 2013. Achieving placement stability. Journal of Evidence-Based Social Work 10, 3 (2013), 235–253.",
      "doi": ""
    },
    {
      "text": "Sarah Carnochan, Sarah Taylor, Anne Abramson-Madden, Meekyung Han, Sonja Rashid, Jennifer Maney, Sarah Teuwen, and Michael J Austin. 2006. Child welfare and the courts: An exploratory study of the relationship between two complex systems. Journal of Public Child Welfare 1, 1 (2006), 117–136.",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Zhiyuan Lin, Erica L Goodman, Stephanie Zerwas, and Munmun De Choudhury. 2016. Quantifying and predicting mental illness severity in online pro-eating disorder communities. In Proceedings of the 19th ACM conference on computer-supported cooperative work & social computing. 1171–1184.",
      "doi": "10.1145/2818048.2819973"
    },
    {
      "text": "Stevie Chancellor, Jessica Annette Pater, Trustin Clear, Eric Gilbert, and Munmun De Choudhury. 2016. #thyghgapp: Instagram Content Moderation and Lexical Variation in Pro-Eating Disorder Communities. In Proceedings of the 19th ACM conference on computer-supported cooperative work & social computing(CSCW ’16). Association for Computing Machinery, New York, NY, USA, 1201–1213.",
      "doi": "10.1145/2818048.2819963"
    },
    {
      "text": "Hao-Fei Cheng, Logan Stapleton, Ruiqi Wang, Paige Bullock, Alexandra Chouldechova, Zhiwei Steven Steven Wu, and Haiyi Zhu. 2021. Soliciting Stakeholders’ Fairness Notions in Child Maltreatment Predictive Systems. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3411764.3445308"
    },
    {
      "text": "Ka Ho Brian Chor, Gary M McClelland, Dana A Weiner, Neil Jordan, and John S Lyons. 2015. Out-of-home placement decision-making and outcomes in child welfare: A longitudinal study. Administration and Policy in Mental Health and Mental Health Services Research 42, 1 (2015), 70–86.",
      "doi": ""
    },
    {
      "text": "Alexandra Chouldechova, Diana Benavides-Prado, Oleksandr Fialko, and Rhema Vaithianathan. 2018. A case study of algorithm-assisted decision making in child maltreatment hotline screening decisions. In Conference on Fairness, Accountability and Transparency. PMLR, 134–148.",
      "doi": ""
    },
    {
      "text": "Kevin Clancy, Joseph Chudzik, Aleksandra J Snowden, and Shion Guha. 2022. Reconciling data-driven crime analysis with human-centered algorithms. Cities 124(2022), 103604.",
      "doi": ""
    },
    {
      "text": "Elysia V Clemens, Kristin Klopfenstein, Matt Tis, and Trent L Lalonde. 2017. Educational stability policy and the interplay between child welfare placements and school moves. Children and Youth Services Review 83 (2017), 209–217.",
      "doi": ""
    },
    {
      "text": "Rob Comber, Shaowen Bardzell, Jeffrey Bardzell, Mike Hazas, and Michael Muller. 2020. Announcing a new CHI subcommittee: Critical and Sustainable Computing. ACM Interactions (July 2020). https://interactions.acm.org/blog/view/announcing-a-new-chi-subcommittee-critical-and-sustainable-computing",
      "doi": "10.1145/3407228"
    },
    {
      "text": "Victoria A Copeland. 2021. “It’s the Only System We’ve Got”: Exploring Emergency Response Decision-Making in Child Welfare. Columbia Journal of Race and Law 11, 3 (2021), 43–74.",
      "doi": ""
    },
    {
      "text": "John W. Creswell and Dana L. Miller. 2000. Determining Validity in Qualitative Inquiry. Theory Into Practice 39, 3 (2000), 124–130.",
      "doi": ""
    },
    {
      "text": "Stephanie Cuccaro-Alamin, Regan Foust, Rhema Vaithianathan, and Emily Putnam-Hornstein. 2017. Risk assessment and decision making in child protective services: Predictive risk modeling in context. Children and Youth Services Review 79 (2017), 291–298.",
      "doi": ""
    },
    {
      "text": "Hannah Curtis. 2020. Dimensions of Discomfort: Examining Child Welfare Professionals’ Approach Toward Gender Diverse Foster Youth. University of Washington.",
      "doi": ""
    },
    {
      "text": "Maria De-Arteaga, Riccardo Fogliato, and Alexandra Chouldechova. 2020. A Case for Humans-in-the-Loop: Decisions in the Presence of Erroneous Algorithmic Scores. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376638"
    },
    {
      "text": "Ramit Debnath, Sarah Darby, Ronita Bardhan, Kamiar Mohaddes, and Minna Sunikka-Blank. 2020. Grounded reality meets machine learning: A deep-narrative analysis framework for energy policy research. Energy Research & Social Science 69 (2020), 101704.",
      "doi": ""
    },
    {
      "text": "Ramona W Denby, Mark F Testa, Keith A Alford, Chad L Cross, and Jesse A Brinson. 2017. Protective factors as mediators and moderators of risk effects on perceptions of child well-being in kinship care. Child Welfare 95, 4 (2017), 111–136.",
      "doi": ""
    },
    {
      "text": "Alan J Dettlaff, Stephanie L Rivaux, Donald J Baumann, John D Fluke, Joan R Rycraft, and Joyce James. 2011. Disentangling substantiation: The influence of race, income, and risk on the substantiation decision in child welfare. Children and Youth Services Review 33, 9 (2011), 1630–1637.",
      "doi": ""
    },
    {
      "text": "Lynn Dombrowski, Adriana Alvarado Garcia, and Jessica Despard. 2017. Low-wage precarious workers’ sociotechnical practices working towards addressing wage theft. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 4585–4598.",
      "doi": "10.1145/3025453.3025633"
    },
    {
      "text": "Lynn Dombrowski, Gillian R Hayes, Melissa Mazmanian, and Amy Voida. 2014. E-government intermediaries and the challenges of access and trust. ACM Transactions on Computer-Human Interaction (TOCHI) 21, 2(2014), 1–22.",
      "doi": "10.1145/2559985"
    },
    {
      "text": "Andy Dow, Rob Comber, and John Vines. 2018. Between grassroots and the hierarchy: Lessons learned from the design of a public services directory. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3174016"
    },
    {
      "text": "Joe Duffy and Mary Elizabeth Collins. 2010. Macro impacts on caseworker decision-making in child welfare: A cross-national comparison. European Journal of Social Work 13, 1 (2010), 35–54.",
      "doi": ""
    },
    {
      "text": "Andrea Lane Eastman, Lisa Schelbe, and Jacquelyn McCroskey. 2019. A content analysis of case records: Two-generations of child protective services involvement. Children and Youth Services Review 99 (2019), 308–318.",
      "doi": ""
    },
    {
      "text": "Raquel T Ellis. 2010. Child welfare workers’ perceptions of juvenile court influence on child welfare practices. Journal of public child welfare 4, 2 (2010), 158–173.",
      "doi": ""
    },
    {
      "text": "Virginia Eubanks. 2018. Automating inequality: How high-tech tools profile, police, and punish the poor. St. Martin’s Press.",
      "doi": "10.5555/3208509"
    },
    {
      "text": "Sergio Fernandez and Hal G Rainey. 2017. Managing successful organizational change in the public sector. In Debating public administration. Routledge, 7–26.",
      "doi": ""
    },
    {
      "text": "Capacity Building Center for States. 2018. Child Protective Services: A Guide for Caseworkers. https://www.childwelfare.gov/pubPDFs/cps2018.pdf",
      "doi": ""
    },
    {
      "text": "Sarah E Fox, Vera Khovanskaya, Clara Crivellaro, Niloufar Salehi, Lynn Dombrowski, Chinmay Kulkarni, Lilly Irani, and Jodi Forlizzi. 2020. Worker-Centered Design: Expanding HCI Methods for Supporting Labor. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": ""
    },
    {
      "text": "Mahita Gajanan. 2020. The Heartbreaking Story Behind Netflix’s Documentary Series The Trials of Gabriel Fernandez. Time.com (Mar 2020). https://time.com/5790549/gabriel-fernandez-netflix-documentary/",
      "doi": ""
    },
    {
      "text": "Jennifer M Geiger, Megan Hayes Piel, and Francie J Julien-Chinn. 2017. Improving relationships in child welfare practice: Perspectives of foster care providers. Child and Adolescent Social Work Journal 34, 1 (2017), 23–33.",
      "doi": ""
    },
    {
      "text": "Jennifer M Geiger and Lisa Schelbe. 2021. Assessment in Child Welfare Practice. In The Handbook on Child Welfare Practice. Springer, 195–217.",
      "doi": ""
    },
    {
      "text": "Jennifer M Geiger and Lisa Schelbe. 2021. Foster Care Placement. In The Handbook on Child Welfare Practice. Springer, 219–248.",
      "doi": ""
    },
    {
      "text": "Rebecca Giallo, Holly Rominov, Catherine Fisher, Kirsty Evans, and Ali Fogarty. 2020. Preservation and reunification for families of young children: case file review of a home-visiting program. Journal of reproductive and infant psychology (2020), 1–13.",
      "doi": ""
    },
    {
      "text": "Fabrizio Gilardi, Charles R. Shipan, and Bruno Wüest. 2021. Policy Diffusion: The Issue-Definition Stage. American Journal of Political Science 65, 1 (2021), 21–35.",
      "doi": ""
    },
    {
      "text": "Connie Golsteijn, Sarah Gallacher, Licia Capra, and Yvonne Rogers. 2016. Sens-Us: Designing innovative civic technology for the public good. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. 39–49.",
      "doi": "10.1145/2901790.2901877"
    },
    {
      "text": "Stuart Gray, Kirsten Cater, Chloe Meineck, Rachel Hahn, Debbie Watson, and Tom Metcalfe. 2019. trove: A digitally enhanced memory box for looked after and adopted children. In Proceedings of the 18th ACM International Conference on Interaction Design and Children. ACM, 458–463.",
      "doi": "10.1145/3311927.3325305"
    },
    {
      "text": "Ben Green and Yiling Chen. 2020. Algorithmic risk assessments can alter human decision-making processes in high-stakes government contexts. arXiv preprint arXiv:2012.05370(2020).",
      "doi": ""
    },
    {
      "text": "Travis Greene, Galit Shmueli, Jan Fell, Ching-Fu Lin, Mark L Shope, and Han-Wei Liu. 2020. The Hidden Inconsistencies Introduced by Predictive Algorithms in Judicial Decision Making. arXiv preprint arXiv:2012.00289(2020).",
      "doi": ""
    },
    {
      "text": "Nina Grgić-Hlača, Christoph Engel, and Krishna P Gummadi. 2019. Human decision making with machine assistance: An experiment on bailing and jailing. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–25.",
      "doi": ""
    },
    {
      "text": "Shion Guha, Eric Baumer, and Geri Gay. 2018. Regrets, I’ve Had a Few: When Regretful Experiences Do (and Don’t) Compel Users to Leave Facebook. In Proceedings of the 2018 ACM Conference on Supporting Groupwork. 166–177. https://doi.org/10.1145/3148330.3148338",
      "doi": "10.1145/3148330.3148338"
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Rob Comber. 2019. The right to the sustainable smart city. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300517"
    },
    {
      "text": "Naja Holten Møller, Irina Shklovski, and Thomas T Hildebrandt. 2020. Shifting concepts of value: Designing algorithmic decision-support systems for public services. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. 1–12.",
      "doi": "10.1145/3419249.3420149"
    },
    {
      "text": "Inger Sofie Dahlø Husby, Tor Slettebø, and Randi Juul. 2018. Partnerships with children in child welfare: The importance of trust and pedagogical support. Child & Family Social Work 23, 3 (2018), 443–450.",
      "doi": ""
    },
    {
      "text": "C. Hutto and Eric Gilbert. 2014. VADER: A Parsimonious Rule-Based Model for Sentiment Analysis of Social Media Text. In Eighth International Conference on Weblogs and Social Media (ICWSM-14).",
      "doi": ""
    },
    {
      "text": "Karoliina Isoaho, Daria Gritsenko, and Eetu Mäkelä. 2021. Topic Modeling and Text Analysis for Qualitative Policy Research. Policy Studies Journal 49, 1 (2021), 300–324.",
      "doi": ""
    },
    {
      "text": "Merav Jedwab, Anusha Chatterjee, and Terry V Shaw. 2018. Caseworkers’ insights and experiences with successful reunification. Children and Youth Services Review 86 (2018), 56–63.",
      "doi": ""
    },
    {
      "text": "Merav Jedwab, Yanfeng Xu, and Terry V Shaw. 2020. Kinship care first? Factors associated with placement moves in out-of-home care. Children and Youth Services Review 115 (2020), 105104.",
      "doi": ""
    },
    {
      "text": "Laura Johnson, Beth Sapiro, Catherine Buttner, and Judy L Postmus. 2018. Ambiguous agency as a diagnostic of power: Efforts of child welfare providers to promote responsible agency among youth involved in sex trades. Journal of Aggression, Maltreatment & Trauma 27, 6 (2018), 577–597.",
      "doi": ""
    },
    {
      "text": "Lisa M Johnson, Becky F Antle, and Anita P Barbee. 2009. Addressing disproportionality and disparity in child welfare: Evaluation of an anti-racism training for community service providers. Children and Youth Services Review 31, 6 (2009), 688–696.",
      "doi": ""
    },
    {
      "text": "Randi Juul and Inger Sofie Dahlø Husby. 2020. Collaboration and conversations with children in Child Welfare Services—Parents’ viewpoint. Child & Family Social Work 25 (2020), 9–17.",
      "doi": ""
    },
    {
      "text": "Carol Kellison. 2019. ” How Can You Send Me Back to the Same Place?” A Qualitative Examination of the Professional Perspectives on the Implementation of Intensive Family Reunification Services into the Missouri Model of Juvenile Justice. Ph. D. Dissertation. Southeast Missouri State University.",
      "doi": ""
    },
    {
      "text": "Vera Khovanskaya, Phoebe Sengers, and Lynn Dombrowski. 2020. Bottom-Up Organizing with Tools from On High: Understanding the Data Practices of Labor Organizers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376185"
    },
    {
      "text": "Vera D Khovanskaya. 2021. The Tools of Management: Data Practices for Worker Advocacy. Ph. D. Dissertation. Cornell University.",
      "doi": ""
    },
    {
      "text": "Raymond S Kirk, Mimi M Kim, and Diane P Griffith. 2005. Advances in the reliability and validity of the North Carolina Family Assessment Scale. Journal of Human Behavior in the Social Environment 11, 3-4(2005), 157–176.",
      "doi": ""
    },
    {
      "text": "Brianne H Kothari, Kelly D Chandler, Andrew Waugh, Kara K McElvaine, Jamie Jaramillo, and Shannon Lipscomb. 2021. Retention of child welfare caseworkers: The role of case severity and workplace resources. Children and Youth Services Review 126 (2021), 106039.",
      "doi": ""
    },
    {
      "text": "Michael A Lawson, Tania Alameda-Lawson, and Edward Byrnes. 2017. Analyzing the validity of the Adult-Adolescent parenting inventory for low-income populations. Research on Social Work Practice 27, 4 (2017), 441–455.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee. 2018. Understanding perception of algorithmic decisions: Fairness, trust, and emotion in response to algorithmic management. Big Data & Society 5, 1 (2018), 2053951718756684.",
      "doi": ""
    },
    {
      "text": "Per LÊgreid. 2017. Transcending new public management: the transformation of public sector reforms. Routledge.",
      "doi": ""
    },
    {
      "text": "Ann Light and Anna Seravalli. 2019. The breakdown of the municipality as caring platform: lessons for co-design and co-learning in the age of platform capitalism. CoDesign 15, 3 (2019), 192–211.",
      "doi": ""
    },
    {
      "text": "Michael Lipsky. 2010. Street-level bureaucracy: Dilemmas of the individual in public service. Russell Sage Foundation.",
      "doi": ""
    },
    {
      "text": "Thomas Lodato and Carl DiSalvo. 2018. Institutional constraints: the forms and limits of participatory design in the public realm. In Proceedings of the 15th Participatory Design Conference: Full Papers-Volume 1. 1–12.",
      "doi": "10.1145/3210586.3210595"
    },
    {
      "text": "John S Lyons. 2014. Use of the Child and Adolescent Needs and Strengths (CANS) in Child Welfare in the United States.",
      "doi": ""
    },
    {
      "text": "Anthony N Maluccio, Frank Ainsworth, and June Thoburn. 2000. Child welfare outcome research in the United States, the United Kingdom, and Australia.Child Welfare League of America.",
      "doi": ""
    },
    {
      "text": "Nicola McConnell, Matt Barnard, and Julie Taylor. 2017. Caring Dads Safer Children: Families’ perspectives on an intervention for maltreating fathers.Psychology of Violence 7, 3 (2017), 406.",
      "doi": ""
    },
    {
      "text": "Amanda Meng, Carl DiSalvo, and Ellen Zegura. 2019. Collaborative data work towards a caring democracy. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359144"
    },
    {
      "text": "Ines Mergel, R Karl Rethemeyer, and Kimberley Isett. 2016. Big data in public affairs. Public Administration Review 76, 6 (2016), 928–937.",
      "doi": ""
    },
    {
      "text": "Mario Molina and Filiz Garip. 2019. Machine Learning for Sociology. Annual Review of Sociology 45, 1 (2019), 27–45.",
      "doi": ""
    },
    {
      "text": "Terry D Moore, Thomas P McDonald, and Kari Cronbaugh-Auld. 2016. Assessing risk of placement instability to aid foster care placement decision making. Journal of Public Child Welfare 10, 2 (2016), 117–131.",
      "doi": ""
    },
    {
      "text": "Michael Muller, Shion Guha, Eric PS Baumer, David Mimno, and N Sadat Shami. 2016. Machine learning and grounded theory method: Convergence, divergence, and combination. In Proceedings of the 19th International Conference on Supporting Group Work. ACM, 3–8.",
      "doi": "10.1145/2957276.2957280"
    },
    {
      "text": "Dong Nguyen, Maria Liakata, Simon DeDeo, Jacob Eisenstein, David Mimno, Rebekah Tromble, and Jane Winters. 2020. How We Do Things With Words: Analyzing Text as Social and Cultural Data. Frontiers in Artificial Intelligence 3 (2020), 62.",
      "doi": ""
    },
    {
      "text": "Amy E Nourie. 2021. Child Welfare Abolition: Critical Theories, Human Rights, and Heteronormativity. Journal of Human Rights and Social Work(2021), 1–10.",
      "doi": ""
    },
    {
      "text": "Matthew C. Nowlin. 2016. Modeling Issue Definitions Using Quantitative Text Analysis. Policy Studies Journal 44, 3 (2016), 309–331.",
      "doi": ""
    },
    {
      "text": "Uniersity of Buffalo News. 2020. UB receives $800,000 NSF/Amazon grant to improve AI fairness in foster care. http://www.buffalo.edu/ubnow/stories/2020/02/grant-ai-foster-care.html",
      "doi": ""
    },
    {
      "text": "Yotam Ophir, Dror Walter, and Eleanor R Marchant. 2020. A Collaborative Way of Knowing: Bridging Computational Communication Research and Grounded Theory Ethnography. Journal of Communication 70, 3 (2020), 447–472.",
      "doi": ""
    },
    {
      "text": "Juho Pääkkönen, Matti Nelimarkka, Jesse Haapoja, and Airi Lampinen. 2020. Bureaucracy as a Lens for Analyzing and Designing Algorithmic Systems. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376780"
    },
    {
      "text": "Keri LM Pinna, Lynn K Lewis, Canan Karatekin, Angela Lamb-Onyiga, Ashley Hirilall, and Sabrina D Jones. 2015. Evidence-based parenting programs for maltreating parents: Views of child protective services caseworkers. Journal of public child welfare 9, 4 (2015), 362–381.",
      "doi": ""
    },
    {
      "text": "Gordon Pon, Kevin Gosine, and Doret Phillips. 2011. Immediate response: Addressing anti-Native and anti-Black racism in child welfare. International Journal of Child, Youth and Family Studies 2, 3/4(2011), 385–409.",
      "doi": ""
    },
    {
      "text": "Rajendra Rambajue and Christopher OĆonnor. 2021. Intersectional individualization: toward a theoretical framework for youth transitioning out of the child welfare system. Journal of Public Child Welfare(2021), 1–21.",
      "doi": ""
    },
    {
      "text": "Trine Rask Nielsen and Naja Holten Møller. 2022. Data as a Lens for Understanding what Constitutes Credibility in Asylum Decision-making. Proceedings of the ACM on Human-Computer Interaction 6, GROUP(2022), 1–23.",
      "doi": "10.1145/3492825"
    },
    {
      "text": "Diane Boyd Rauber. 2009. From the courthouse to the statehouse: Parents as partners in child welfare. Child Law Practice 28, 10 (2009), 149–156.",
      "doi": ""
    },
    {
      "text": "Jennifer A Reich. 2012. Fixing families: Parents, power, and the child welfare system. Routledge.",
      "doi": ""
    },
    {
      "text": "Samantha Robertson, Tonya Nguyen, and Niloufar Salehi. 2021. Modeling Assumptions Clash with the Real World: Transparency, Equity, and Community Challenges for Student Assignment Algorithms. arXiv preprint arXiv:2101.10367(2021).",
      "doi": ""
    },
    {
      "text": "Samantha Robertson and Niloufar Salehi. 2020. What If I Don’t Like Any Of The Choices? The Limits of Preference Elicitation for Participatory Algorithm Design. arXiv preprint arXiv:2007.06718(2020).",
      "doi": ""
    },
    {
      "text": "SaintA. 2021. Child Welfare Case Manager. https://www.milwaukeejobs.com/job/detail/35323239/Child-Welfare-Case-Manager-1000-Sign-on-Bonus",
      "doi": ""
    },
    {
      "text": "Maarten Sap, Marcella Cindy Prasettio, Ari Holtzman, Hannah Rashkin, and Yejin Choi. 2017. Connotation Frames of Power and Agency in Modern Films. In Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing. Association for Computational Linguistics, 2329–2334.",
      "doi": ""
    },
    {
      "text": "Devansh Saxena, Karla Badillo-Urquiola, Pamela Wisniewski, and Shion Guha. 2020. Child Welfare System: Interaction of Policy, Practice and Algorithms. In Companion of the 2020 ACM International Conference on Supporting Group Work. 119–122.",
      "doi": "10.1145/3323994.3369888"
    },
    {
      "text": "Devansh Saxena, Karla Badillo-Urquiola, Pamela Wisniewski, and Shion Guha. 2021. A Framework of High-Stakes Algorithmic Decision-Making for the Public Sector Developed through a Case Study of Child-Welfare. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021).",
      "doi": "10.1145/3476089"
    },
    {
      "text": "Devansh Saxena, Karla Badillo-Urquiola, Pamela J Wisniewski, and Shion Guha. 2020. A Human-Centered Review of Algorithms used within the US Child Welfare System. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376229"
    },
    {
      "text": "Devansh Saxena, Charlie Repaci, Melanie Sage, and Shion Guha. 2022. How to Train a (Bad) Algorithmic Caseworker: A Quantitative Deconstruction of Risk Assessments in Child Welfare. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3491101.3519771"
    },
    {
      "text": "Nicole Shadowen, Thomas Lodato, and Daria Loi. 2020. Participatory governance in smart cities: Future scenarios and opportunities. In International Conference on Human-Computer Interaction. Springer, 443–463.",
      "doi": "10.1007/978-3-030-50344-4_32"
    },
    {
      "text": "Gabriel Tobin Smith, Valerie B Shapiro, Rachel Wagner Sperry, and Paul A LeBuffe. 2014. A strengths-based approach to supervised visitation in child welfare. Child Care in Practice 20, 1 (2014), 98–119.",
      "doi": ""
    },
    {
      "text": "Starhawk. 1987. Truth or dare: Encounters with power, authority, and mystery. Harper & Row.",
      "doi": ""
    },
    {
      "text": "Clare Tilbury. 2005. Counting family support. Child & Family Social Work 10, 2 (2005), 149–157.",
      "doi": ""
    },
    {
      "text": "Austin L Toombs, Andy Dow, John Vines, Colin M Gray, Barbara Dennis, Rachel Clarke, and Ann Light. 2018. Designing for Everyday Care in Communities. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems. 391–394.",
      "doi": "10.1145/3197391.3197394"
    },
    {
      "text": "James Topitzes, Timothy Grove, Erika E Meyer, Stacey M Pangratz, and Caitlin M Sprague. 2019. Trauma-responsive child welfare services: A mixed methods study assessing safety, stability, and permanency. Journal of Child Custody 16, 3 (2019), 291–312.",
      "doi": ""
    },
    {
      "text": "Frank E Vandervort, Robbin Pott Gonzalez, and Katlheen Coulborn Faller. 2008. Legal ethics and high child welfare worker turnover: An unexplored connection. Children and Youth Services Review 30, 5 (2008), 546–563.",
      "doi": ""
    },
    {
      "text": "Michael Veale, Max Van Kleek, and Reuben Binns. 2018. Fairness and accountability design needs for algorithmic support in high-stakes public sector decision-making. In Proceedings of the 2018 chi conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3173574.3174014"
    },
    {
      "text": "Eran Vigoda-Gadot and Itai Beeri. 2011. Change-oriented organizational citizenship behavior in public administration: The power of leadership and the cost of organizational politics. Journal of Public Administration Research and Theory 22, 3 (2011), 573–596.",
      "doi": ""
    },
    {
      "text": "Amy Voida, Lynn Dombrowski, Gillian R Hayes, and Melissa Mazmanian. 2014. Shared values/conflicting logics: working around e-government systems. In Proceedings of the sigchi conference on human factors in computing systems. 3583–3592.",
      "doi": "10.1145/2556288.2556971"
    },
    {
      "text": "Hanna M Wallach. 2006. Topic modeling: beyond bag-of-words. In Proceedings of the 23rd international conference on Machine learning. ACM, 977–984.",
      "doi": "10.1145/1143844.1143967"
    },
    {
      "text": "Hanna M. Wallach. 2006. Topic Modeling: Beyond Bag-of-Words. In Proceedings of the 23rd International Conference on Machine Learning (Pittsburgh, Pennsylvania, USA) (ICML ’06). Association for Computing Machinery, New York, NY, USA, 977–984. https://doi.org/10.1145/1143844.1143967",
      "doi": "10.1145/1143844.1143967"
    },
    {
      "text": "Cedric Deslandes Whitney, Teresa Naval, Elizabeth Quepons, Simrandeep Singh, Steven R Rick, and Lilly Irani. 2021. HCI Tactics for Politics from Below: Meeting the Challenges of Smart Cities. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3411764.3445314"
    },
    {
      "text": "Children’s Wisconsin. 2021. Family Case Manager - Child Welfare. https://indeedhi.re/3yun3aj",
      "doi": ""
    },
    {
      "text": "Jason Yan, Melanie Sage, Seventy F Hall, Yuhao Du, and Kenneth Joseph. 2021. A Computational Social Science Approach to Understanding Predictors of Chafee Service Receipt. arXiv preprint arXiv:2111.14901(2021).",
      "doi": ""
    },
    {
      "text": "Aleš Završnik. 2019. Algorithmic justice: Algorithms and big data in criminal justice settings. European Journal of Criminology(2019), 1477370819876762.",
      "doi": ""
    },
    {
      "text": "Marc A Zimmerman. 2013. Resiliency theory: A strengths-based approach to research and practice for adolescent health.",
      "doi": ""
    }
  ]
}