{
  "doi": "10.1145/3491102.3517548",
  "title": "Effects of Field of View on Egocentric Distance Perception in Virtual Reality",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2022,
  "badges": [],
  "abstract": "We performed a mixed-design study with 56 participants to compare the effect of horizontal FOV (hfov) and vertical FOV (vfov) on egocentric distance perception in four different realistic virtual environments (VEs). We also compared VE attributes of indoor/outdoor and cluttered/uncluttered. The participants blind-walked towards four different targets at 3m, 4m, 5m, and 6m distance while wearing a backpack computer and a wide FOV head-mounted display (HMD). The combinations of 165°, 110° and 45° hfovs, and 110° and 35° vfovs was simulated in the same HMD. The results indicated more accurate distance judgement with larger hfov with no significant effect of vfov. More accurate distance judgement in indoor VEs compared to outdoor VEs was observed. Also, participants judged distances more accurately in cluttered environments versus uncluttered environments. These results highlight that the environment is important in distance-critical VR applications and wider hfov should be considered for an improved distance judgment.",
  "tags": [
    "horizontal FOV",
    "indoor",
    "distance perception",
    "field of view",
    "VR",
    "FOV",
    "clutter",
    "virtual environment",
    "virtual reality",
    "outdoor",
    "vertical FOV"
  ],
  "authors": [
    {
      "name": "Sina Masnadi",
      "institution": "University of Central Florida, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701244",
      "orcid": "missing"
    },
    {
      "name": "Kevin Pfeil",
      "institution": "University of Central Florida, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81554220156",
      "orcid": "missing"
    },
    {
      "name": "Jose-Valentin T Sera-Josef",
      "institution": "Computer Science, University of Central Florida, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702301",
      "orcid": "missing"
    },
    {
      "name": "Joseph LaViola",
      "institution": "University of Central Florida, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100283513",
      "orcid": "0000-0003-1186-4130"
    }
  ],
  "references": [
    {
      "text": "Jeffrey Andre and Sheena Rogers. 2006. Using verbal and blind-walking distance estimates to investigate the two visual systems hypothesis. Perception & Psychophysics 68, 3 (2006), 353–361.",
      "doi": ""
    },
    {
      "text": "Lauren E Buck, Mary K Young, and Bobby Bodenheimer. 2018. A comparison of distance estimation in HMD-based virtual environments with different HMD-based conditions. ACM Transactions on Applied Perception (TAP) 15, 3 (2018), 1–15.",
      "doi": "10.1145/3196885"
    },
    {
      "text": "Sarah H Creem-Regehr, Jeanine K Stefanucci, William B Thompson, Nathan Nash, and Michael McCardell. 2015. Egocentric distance perception in the oculus rift (dk2). In Proceedings of the ACM SIGGRAPH Symposium on Applied Perception. 47–50.",
      "doi": "10.1145/2804408.2804422"
    },
    {
      "text": "Sarah H Creem-Regehr, Peter Willemsen, Amy A Gooch, and William B Thompson. 2005. The influence of restricted viewing conditions on egocentric distance perception: Implications for real and virtual indoor environments. Perception 34, 2 (2005), 191–204.",
      "doi": ""
    },
    {
      "text": "Ilja T Feldstein, Felix M Kölsch, and Robert Konrad. 2020. Egocentric Distance Perception: A Comparative Study Investigating Differences Between Real and Virtual Environments. Perception 49, 9 (2020), 940–967.",
      "doi": ""
    },
    {
      "text": "Leah Findlater and Joanna McGrenere. 2008. Impact of Screen Size on Performance, Awareness, and User Satisfaction with Adaptive Graphical User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 1247–1256. https://doi.org/10.1145/1357054.1357249",
      "doi": "10.1145/1357054.1357249"
    },
    {
      "text": "Michael Geuss, Jeanine Stefanucci, Sarah Creem-Regehr, and William B. Thompson. 2010. Can I Pass? Using Affordances to Measure Perceived Size in Virtual Environments. In Proceedings of the 7th Symposium on Applied Perception in Graphics and Visualization (Los Angeles, California) (APGV ’10). Association for Computing Machinery, New York, NY, USA, 61–64. https://doi.org/10.1145/1836248.1836259",
      "doi": "10.1145/1836248.1836259"
    },
    {
      "text": "Timofey Y. Grechkin, Tien Dat Nguyen, Jodie M. Plumert, James F. Cremer, and Joseph K. Kearney. 2010. How Does Presentation Method and Measurement Protocol Affect Distance Estimation in Real and Virtual Environments?ACM Trans. Appl. Percept. 7, 4, Article 26 (July 2010), 18 pages. https://doi.org/10.1145/1823738.1823744",
      "doi": "10.1145/1823738.1823744"
    },
    {
      "text": "Jinghui Hou, Yujung Nam, Wei Peng, and Kwan Min Lee. 2012. Effects of screen size, viewing angle, and players’ immersion tendencies on game experience. Computers in Human Behavior 28, 2 (2012), 617–623. https://doi.org/10.1016/j.chb.2011.11.007",
      "doi": "10.1016/j.chb.2011.11.007"
    },
    {
      "text": "Victoria Interrante, Brian Ries, Jason Lindquist, Michael Kaeding, and Lee Anderson. 2008. Elucidating factors that can facilitate veridical spatial perception in immersive virtual environments. Presence: Teleoperators and Virtual Environments 17, 2(2008), 176–198.",
      "doi": "10.1162/pres.17.2.176"
    },
    {
      "text": "J Adam Jones, David M Krum, and Mark T Bolas. 2016. Vertical field-of-view extension and walking characteristics in head-worn virtual environments. ACM Transactions on Applied Perception (TAP) 14, 2 (2016), 1–17.",
      "doi": "10.1145/2983631"
    },
    {
      "text": "J. Adam Jones, J. Edward Swan, Gurjot Singh, Eric Kolstad, and Stephen R. Ellis. 2008. The Effects of Virtual Reality, Augmented Reality, and Motion Parallax on Egocentric Depth Perception. In Proceedings of the 5th Symposium on Applied Perception in Graphics and Visualization (Los Angeles, California) (APGV ’08). Association for Computing Machinery, New York, NY, USA, 9–14. https://doi.org/10.1145/1394281.1394283",
      "doi": "10.1145/1394281.1394283"
    },
    {
      "text": "J Adam Jones, J Edward Swan II, and Mark Bolas. 2013. Peripheral stimulation and its effect on perceived spatial scale in virtual environments. IEEE transactions on visualization and computer graphics 19, 4(2013), 701–710.",
      "doi": "10.1109/TVCG.2013.37"
    },
    {
      "text": "P. R. Jones and G. Ometto. 2018. Degraded Reality: Using VR/AR to simulate visual impairments. In 2018 IEEE Workshop on Augmented and Virtual Realities for Good (VAR4Good). 1–4.",
      "doi": ""
    },
    {
      "text": "Jonathan W. Kelly, Lucia A. Cherep, and Zachary D. Siegel. 2017. Perceived Space in the HTC Vive. ACM Trans. Appl. Percept. 15, 1, Article 2 (July 2017), 16 pages. https://doi.org/10.1145/3106155",
      "doi": "10.1145/3106155"
    },
    {
      "text": "Joshua M Knapp and Jack M Loomis. 2004. Limited field of view of head-mounted displays is not the cause of distance underestimation in virtual environments. Presence: Teleoperators & Virtual Environments 13, 5(2004), 572–577.",
      "doi": "10.1162/1054746042545238"
    },
    {
      "text": "Benjamin R Kunz, Leah Wouters, Daniel Smith, William B Thompson, and Sarah H Creem-Regehr. 2009. Revisiting the effect of quality of graphics on distance judgments in virtual environments: A comparison of verbal reports and blind walking. Attention, Perception, & Psychophysics 71, 6 (2009), 1284–1293.",
      "doi": ""
    },
    {
      "text": "Joseph J LaViola Jr, Ernst Kruijff, Ryan P McMahan, Doug Bowman, and Ivan P Poupyrev. 2017. 3D user interfaces: theory and practice. Addison-Wesley Professional.",
      "doi": ""
    },
    {
      "text": "Markus Leyrer, Sally A. Linkenauger, Heinrich H. Bülthoff, Uwe Kloos, and Betty Mohler. 2011. The Influence of Eye Height and Avatars on Egocentric Distance Estimates in Immersive Virtual Environments. In Proceedings of the ACM SIGGRAPH Symposium on Applied Perception in Graphics and Visualization (Toulouse, France) (APGV ’11). Association for Computing Machinery, New York, NY, USA, 67–74. https://doi.org/10.1145/2077451.2077464",
      "doi": "10.1145/2077451.2077464"
    },
    {
      "text": "Bochao Li, Anthony Nordman, James Walker, and Scott A Kuhl. 2016. The effects of artificially reduced field of view and peripheral frame stimulation on distance judgments in HMDs. In Proceedings of the ACM Symposium on Applied Perception. 53–56.",
      "doi": "10.1145/2931002.2931013"
    },
    {
      "text": "Bochao Li, James Walker, and Scott A Kuhl. 2018. The effects of peripheral vision and light stimulation on distance judgments through hmds. ACM Transactions on Applied Perception (TAP) 15, 2 (2018), 1–14.",
      "doi": "10.1145/3165286"
    },
    {
      "text": "Bochao Li, Ruimin Zhang, Anthony Nordman, and Scott A Kuhl. 2015. The effects of minification and display field of view on distance judgments in real and HMD-based environments. In Proceedings of the ACM SIGGRAPH Symposium on Applied Perception. 55–58.",
      "doi": "10.1145/2804408.2804427"
    },
    {
      "text": "Andrea Loftus, Susannah Murphy, Isla McKenna, and Mark Mon-Williams. 2004. Reduced fields of view are neither necessary nor sufficient for distance underestimation but reduce precision and may cause calibration problems. Experimental brain research 158, 3 (2004), 328–335.",
      "doi": ""
    },
    {
      "text": "Jack M Loomis and John W Philbeck. 2008. Measuring spatial perception with spatial updating and action. In Carnegie Symposium on Cognition, 2006, Pittsburgh, PA, US. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Sina Masnadi, Kevin P Pfeil, Jose-Valentin T Sera-Josef, and Joseph J LaViola. 2021. Field of View Effect on Distance Perception in Virtual Reality. In 2021 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, 542–543.",
      "doi": ""
    },
    {
      "text": "S. Masnadi, B. Williamson, A. N. V. González, and J. J. LaViola. 2020. VRiAssist: An Eye-Tracked Virtual Reality Low Vision Assistance Tool. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). 808–809.",
      "doi": ""
    },
    {
      "text": "Betty J. Mohler, Sarah H. Creem-Regehr, and William B. Thompson. 2006. The Influence of Feedback on Egocentric Distance Judgments in Real and Virtual Environments. In Proceedings of the 3rd Symposium on Applied Perception in Graphics and Visualization (Boston, Massachusetts, USA) (APGV ’06). Association for Computing Machinery, New York, NY, USA, 9–14. https://doi.org/10.1145/1140491.1140493",
      "doi": "10.1145/1140491.1140493"
    },
    {
      "text": "Betty J Mohler, Sarah H Creem-Regehr, William B Thompson, and Heinrich H Bülthoff. 2010. The Effect of Viewing a Self-Avatar on Distance Judgments in an HMD-Based Virtual Environment. Presence: Teleoperators and Virtual Environments 19, 3(2010), 230–242. https://doi.org/10.1162/pres.19.3.230 arXiv:https://doi.org/10.1162/pres.19.3.230",
      "doi": "10.1162/pres.19.3.230"
    },
    {
      "text": "Karla Paraiso and Victoria Interrante. 2017. Can Virtual Human Entourage Elements Facilitate Accurate Distance Judgments in VR?. In Virtual Reality and Augmented Reality, Jernej Barbic, Mirabelle D’Cruz, Marc Erich Latoschik, Mel Slater, and Patrick Bourdot (Eds.). Springer International Publishing, Cham, 119–133.",
      "doi": ""
    },
    {
      "text": "Kevin Pfeil, Sina Masnadi, Jacob Belga, Jose-Valentin T Sera-Josef, and Joseph LaViola. 2021. Distance perception with a video see-through head-mounted display. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–9.",
      "doi": "10.1145/3411764.3445223"
    },
    {
      "text": "Kevin Pfeil, Pamela J. Wisniewski, and Joseph J. Laviola Jr.2020. The Effects of Gender and the Presence of Third-Party Humans on Telepresence Camera Height Preferences. In ACM Symposium on Applied Perception 2020 (Virtual Event, USA) (SAP ’20). Association for Computing Machinery, New York, NY, USA, Article 13, 10 pages. https://doi.org/10.1145/3385955.3407924",
      "doi": ""
    },
    {
      "text": "Jodie M. Plumert, Joseph K. Kearney, James F. Cremer, and Kara Recker. 2005. Distance Perception in Real and Virtual Environments. ACM Trans. Appl. Percept. 2, 3 (July 2005), 216–233. https://doi.org/10.1145/1077399.1077402",
      "doi": "10.1145/1077399.1077402"
    },
    {
      "text": "E. D. Ragan, C. Wilkes, Y. Cao, and D. A. Bowman. 2012. The effects of virtual character animation on spatial judgments. In 2012 IEEE Virtual Reality Workshops (VRW). 141–142.",
      "doi": "10.1109/VR.2012.6180921"
    },
    {
      "text": "Rebekka S. Renner, Boris M. Velichkovsky, and Jens R. Helmert. 2013. The Perception of Egocentric Distances in Virtual Environments - A Review. ACM Comput. Surv. 46, 2, Article 23 (Dec. 2013), 40 pages. https://doi.org/10.1145/2543581.2543590",
      "doi": "10.1145/2543581.2543590"
    },
    {
      "text": "Cynthia S. Sahm, Sarah H. Creem-Regehr, William B. Thompson, and Peter Willemsen. 2005. Throwing versus Walking as Indicators of Distance Perception in Similar Real and Virtual Environments. ACM Trans. Appl. Percept. 2, 1 (Jan. 2005), 35–45. https://doi.org/10.1145/1048687.1048690",
      "doi": "10.1145/1048687.1048690"
    },
    {
      "text": "Stevens Sue. 2007. Test distance vision using a Snellen chart.Community Eye Health 20, 63 (2007), 52.",
      "doi": ""
    },
    {
      "text": "William B. Thompson, Peter Willemsen, Amy A. Gooch, Sarah H. Creem-Regehr, Jack M. Loomis, and Andrew C. Beall. 2004. Does the Quality of the Computer Graphics Matter when Judging Distances in Visually Immersive Environments?Presence: Teleoperators and Virtual Environments 13, 5(2004), 560–571. https://doi.org/10.1162/1054746042545292",
      "doi": "10.1162/1054746042545292"
    },
    {
      "text": "Koorosh Vaziri, Maria Bondy, Amanda Bui, and Victoria Interrante. 2021. Egocentric Distance Judgments in Full-Cue Video-See-Through VR Conditions are No Better than Distance Judgments to Targets in a Void. In 2021 IEEE Virtual Reality and 3D User Interfaces (VR). IEEE, 1–9.",
      "doi": ""
    },
    {
      "text": "Koorosh Vaziri, Peng Liu, Sahar Aseeri, and Victoria Interrante. 2017. Impact of Visual and Experiential Realism on Distance Perception in VR Using a Custom Video See-through System. In Proceedings of the ACM Symposium on Applied Perception (Cottbus, Germany) (SAP ’17). Association for Computing Machinery, New York, NY, USA, Article 8, 8 pages. https://doi.org/10.1145/3119881.3119892",
      "doi": "10.1145/3119881.3119892"
    },
    {
      "text": "Peter Willemsen, Mark B. Colton, Sarah H. Creem-Regehr, and William B. Thompson. 2004. The Effects of Head-Mounted Display Mechanics on Distance Judgments in Virtual Environments. In Proceedings of the 1st Symposium on Applied Perception in Graphics and Visualization (Los Angeles, California, USA) (APGV ’04). Association for Computing Machinery, New York, NY, USA, 35–38. https://doi.org/10.1145/1012551.1012558",
      "doi": "10.1145/1012551.1012558"
    },
    {
      "text": "Peter Willemsen, Mark B. Colton, Sarah H. Creem-Regehr, and William B. Thompson. 2009. The Effects of Head-Mounted Display Mechanical Properties and Field of View on Distance Judgments in Virtual Environments. ACM Trans. Appl. Percept. 6, 2, Article 8 (March 2009), 14 pages. https://doi.org/10.1145/1498700.1498702",
      "doi": "10.1145/1498700.1498702"
    },
    {
      "text": "Bing Wu, Teng Leng Ooi, and Zijiang J He. 2004. Perceiving distance accurately by a directional process of integrating ground information. Nature 428, 6978 (2004), 73–77.",
      "doi": ""
    },
    {
      "text": "Yuhang Zhao, Edward Cutrell, Christian Holz, Meredith Ringel Morris, Eyal Ofek, and Andrew D Wilson. 2019. SeeingVR: A set of tools to make virtual reality more accessible to people with low vision. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300341"
    }
  ]
}