{
  "doi": "10.1145/3491102.3501932",
  "title": "Math Augmentation: How Authors Enhance the Readability of Formulas using Novel Visual Design Practices",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "With the increasing growth and impact of machine learning and other math-intensive fields, it is more important than ever to broaden access to mathematical notation. Can new visual and interactive displays help a wider readership successfully engage with notation? This paper provides the first detailed qualitative analysis of math augmentation—the practice of embellishing notation with novel visual design patterns to improve its readability. We present two qualitative studies of the practice of math augmentation. First is an analysis of 1.1k augmentations to 281 formulas in 47 blogs, textbooks, and other documents containing mathematical expressions. Second is an interview study with 12 authors who had previously designed custom math augmentations (“maugs”). This paper contributes a comprehensive inventory of the kinds of maugs that appear in math documents, and a detailed account of how authors’ tools ought to be redesigned to support efficient creation of math augmentations. These studies open a critical new design space for HCI researchers and interface designers.",
  "authors": [
    {
      "name": "Andrew Head",
      "institution": "Allen Institute for AI, United States",
      "img": "/do/10.1145/contrib-99658703835/rel-imgonly/img_13703.jpg",
      "acmid": "99658703835",
      "orcid": "0000-0002-1523-3347"
    },
    {
      "name": "Amber Xie",
      "institution": "UC Berkeley, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236752",
      "orcid": "missing"
    },
    {
      "name": "Marti A. Hearst",
      "institution": "UC Berkeley, United States",
      "img": "/do/10.1145/contrib-81100612246/rel-imgonly/marti_small.jpg",
      "acmid": "81100612246",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Thomasenia Lott Adams. 2003. Reading mathematics: More than words can say. The Reading Teacher 56, 8 (2003).",
      "doi": ""
    },
    {
      "text": "Lara Alcock and Nicola Wilkinson. 2011. e-Proofs: Design of a Resource to Support Proof Comprehension in Mathematics. Educational Designer 1, 4 (2011).",
      "doi": ""
    },
    {
      "text": "Andrew M.H. Alexander. Exponential Improvements. http://www.andrusia.com/math/complex-numbers/eulers-identity.pdf Last accessed December 27, 2021.",
      "doi": ""
    },
    {
      "text": "Sriram Karthik Badam, Zhicheng Liu, and Niklas Elmqvist. 2019. Elastic Documents: Coupling Text and Tables through Contextual Visualizations for Enhanced Document Reading. IEEE Transactions on Visualization and Computer Graphics 25, 1 (2019).",
      "doi": "10.1109/TVCG.2018.2865119"
    },
    {
      "text": "Sergio Basurco. Isaac Hayes Wallpaper Generator - Volumetric light scattering, 1 of 2. https://chuckleplant.github.io/2017/05/28/light-shafts.html Last accessed December 27, 2021.",
      "doi": ""
    },
    {
      "text": "Tali Benyon. Build your own Tensorflow. https://taliesin.ai/projects/edu/indaba-2019/ Last accessed December 27, 2021.",
      "doi": ""
    },
    {
      "text": "Chris Bryan, Kwan-Liu Ma, and Jonathan Woodring. 2017. Temporal Summary Images: An Approach to Narrative Visualization via Interactive Annotation Generation and Placement. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2017).",
      "doi": "10.1109/TVCG.2016.2598876"
    },
    {
      "text": "Carrie J. Cai and Philip J. Guo. 2019. Software Developers Learning Machine Learning: Motivations, Hurdles, and Desires. In Proceedings of the Symposium on Visual Languages and Human-Centric Computing.",
      "doi": ""
    },
    {
      "text": "David P. Carlisle. Thecolorpackage, CTAN-Archive.",
      "doi": ""
    },
    {
      "text": "Rowan Cockett, Lindsey Heagy, and Doug Oldenburg. 2016. Pixels and their neighbors: Finite volume. The Leading Edge 35, 8 (2016).",
      "doi": ""
    },
    {
      "text": "Matthew Conlen and Jeffrey Heer. 2018. Idyll: A Markup Language for Authoring and Publishing Interactive Articles on the Web. In Proceedings of the Symposium on User Interface Software and Technology.",
      "doi": "10.1145/3242587.3242600"
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2008. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory (3rd ed.). SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Yancarlos Diaz, Gavin Nishizawa, Behrooz Mansouri, Kenny Davila, and Richard Zanibbi. 2021. The MathDeck Formula Editor: Interactive Formula Entry Combining LaTeX, Structure Editing, and Search. In Proceedings of the CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3411763.3451564"
    },
    {
      "text": "Pierre Dragicevic, Yvonne Jansen, Abhraneel Sarma, Matthew Kay, and Fanny Chevalier. 2019. Increasing the Transparency of Research Papers with Explorable Multiverse Analyses. In Proceedings of the CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3290605.3300295"
    },
    {
      "text": "Anton N. Dragunov and Jonathan L. Herlocker. 2003. Designing intelligent and dynamic interfaces for communicating mathematics. In Proceedings of the International Conference on Intelligent User Interfaces.",
      "doi": ""
    },
    {
      "text": "Emily Eisenberg and Sophie Alpert. KaTeX. https://katex.org Last accessed September 16, 2020.",
      "doi": ""
    },
    {
      "text": "Tong Ge, Yue Zhao, Bongshin Lee, Donghao Ren, Baoquan Chen, and Yunhai Wang. 2020. Canis: A High‐Level Language for Data‐Driven Chart Animations. Computer Graphics Forum 39 (2020).",
      "doi": ""
    },
    {
      "text": "Gabriel Goh. 2017. Why momentum really works. Distill 2, 4 (2017). http://distill.pub/2017/momentum",
      "doi": ""
    },
    {
      "text": "Sam Greydanus and Chris Olah. 2019. The Paths Perspective on Value Learning. In Distill. https://distill.pub/2019/paths-perspective-on-value-learning",
      "doi": ""
    },
    {
      "text": "Bobby He, Balaji Lakshminarayanan, and Yee Whye Teh. Bayesian Deep Ensembles via the Neural Tangent Kernel, NeurIPs Poster Presentation. https://nips.cc/virtual/2020/protected/poster_0b1ec366924b26fc98fa7b71a9c249cf.html Last accessed December 30, 2021.",
      "doi": ""
    },
    {
      "text": "Andrew Head, Codanda Appachu, Marti A. Hearst, and Björn Hartmann. 2015. Tutorons: Generating context-relevant, on-demand explanations and demonstrations of online code. In Proceedings of the Symposium on Visual Languages and Human-Centric Computing.",
      "doi": ""
    },
    {
      "text": "Andrew Head, Kyle Lo, Dongyeop Kang, Raymond Fok, Sam Skjonsberg, Daniel S. Weld, and Marti A. Hearst. 2021. Augmenting Scientific Papers with Just-in-Time, Position-Sensitive Definitions of Terms and Symbols. In Proceedings of the CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3411764.3445648"
    },
    {
      "text": "Fred Hohman, Matthew Conlen, Jeffrey Heer, and Duen Horng Chau. 2020. Communicating with Interactive Articles. distill.pub.",
      "doi": ""
    },
    {
      "text": "Fred Hohman, Andrew Head, Rich Caruana, Robert DeLine, and Steven M. Drucker. 2019. Gamut: A design probe to understand how data scientists understand machine learning models. In Proceedings of the CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3290605.3300809"
    },
    {
      "text": "Fred Hohman and other contributors. 2020. Awesome Mathematical Notation Design. https://github.com/fredhohman/awesome-mathematical-notation-design",
      "doi": ""
    },
    {
      "text": "Ole Holsti. 1969. Content Analysis for the Social Sciences and Humanities. Addison-Wesley.",
      "doi": ""
    },
    {
      "text": "Jessica Hullman and Nicholas Diakopoulos. 2011. Visualization Rhetoric: Framing Effects in Narrative Visualization. IEEE Transactions on Visualization and Computer Graphics 17(2011).",
      "doi": ""
    },
    {
      "text": "Jessical Hullman, Nicholas Diakopoulos, and Eytan Adar. 2013. Contextifier: automatic generation of annotated stock visualizations. In Proceedings of the CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/2470654.2481374"
    },
    {
      "text": "Jessica Hullman, Yea-Seul Kim, Frances Nguyen, Lauren Speers, and Maneesh Agrawala. 2018. Improving Comprehension of Measurements Using Concrete Re-expression Strategies. In Proceedings of the CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3173574.3173608"
    },
    {
      "text": "Ankit Jain, Isaac Liu, Ankur Sarda, and Piero Molino. Food Discovery with Uber Eats: Using Graph Learning to Power Recommendations. https://eng.uber.com/uber-eats-graph-learning/ Last accessed December 30, 2021.",
      "doi": ""
    },
    {
      "text": "Anthony R. Jansen, Kim Marriott, and Greg Yelland. 1999. Perceiving structure in mathematical expressions. In Proceedings of the Conference of the Cognitive Science Society.",
      "doi": ""
    },
    {
      "text": "Seokbin Kang, Ekta Shokeen, Virginia L. Byrne, Leyla Norooz, Elizabeth M. Bonsignore, Caro Williams-Pierce, and Jon Froehlich. 2020. ARMath: Augmenting Everyday Life with Math Learning. In Proceedings of the CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3313831.3376252"
    },
    {
      "text": "Dae Hyun Kim, Enamul Hoque, Juho Kim, and Maneesh Agrawala. 2018. Facilitating Document Reading by Linking Text and Tables. In Proceedings of the Symposium on User Interface Software and Technology.",
      "doi": "10.1145/3242587.3242617"
    },
    {
      "text": "Hwiyeon Kim, Juyoung Oh, Yunha Han, Sungahn Ko, Matthew Brehmer, and Bum Chul Kwon. 2019. Thumbnails for Data Stories: A Survey of Current Practices. In Proceedings of the IEEE Visualization Conference.",
      "doi": ""
    },
    {
      "text": "Donald Ervin Knuth. 1986. Computers & Typesetting, Vol. A: The TeX book. Addison-Wesley Longman Publishing Co., Inc.",
      "doi": ""
    },
    {
      "text": "Andrea Kohlhase, Michael Kohlhase, and Taweechai Ouypornkochagorn. 2018. Discourse Phenomena in Mathematical Documents. In Intelligent Computer Mathematics, Florian Rabe, William M. Farmer, Grant O. Passmore, and Abdou Youssef (Eds.).",
      "doi": ""
    },
    {
      "text": "Ha-kyung Kong, Wenjie Zhu, Zhicheng Liu, and Karrie Karahalios. 2019. Understanding Visual Cues in Visualizations Accompanied by Audio Narrations. In Proceedings of the CHI Conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "Nicholas Kong, Marti A. Hearst, and Maneesh Agrawala. 2014. Extracting references between text and charts via crowdsourcing. In Proceedings of the CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/2556288.2557241"
    },
    {
      "text": "David Landy and Robert L. Goldstone. 2007. Formal notations are diagrams: Evidence from a production task. Memory & Cognition 35(2007).",
      "doi": ""
    },
    {
      "text": "Shahid Latif, Zheng Zhou, Yoon Kim, Fabian Beck, and Nam Wook Kim. 2021. Kori: Interactive Synthesis of Text and Charts in Data Documents. In Proceedings of the IEEE Visualization Conference.",
      "doi": ""
    },
    {
      "text": "Junhua Lu, Wei Chen, Hui Ye, Jie Wang, Honghui Mei, Yuhui Gu, Yingcai Wu, Xiaolong Luke Zhang, and Kwan-Liu Ma. 2021. Automatic Generation of Unit Visualization-based Scrollytelling for Impromptu Data Facts Delivery. In Proceedings of the IEEE Pacific Visualization Symposium (PacificVis).",
      "doi": ""
    },
    {
      "text": "Lars Madsen, Will Robertson, and Joseph Wright. The mathtools package, CTAN-Archive, ctan.org.",
      "doi": ""
    },
    {
      "text": "Chenlin Meng, Lantao Yu, Yang Song, Jiaming Song, and Stefano Ermon. Autoregressive Score Matching, NeurIPs Poster Presentation. https://nips.cc/virtual/2020/protected/poster_4a4526b1ec301744aba9526d78fcb2a6.html Last accessed December 30, 2021.",
      "doi": ""
    },
    {
      "text": "Michael Moor, Max Horn, Bastian Rieck, and Karsten Borgwardt. Topological Autoencoders, ICML Poster Presentation. https://icml.cc/virtual/2020/poster/5851 Last accessed December 30, 2021.",
      "doi": ""
    },
    {
      "text": "Jousef Murad. Derivation of the Navier-Stokes Equations. https://www.youtube.com/watch?v=zWdnf3Uh1RE Last accessed December 30, 2021.",
      "doi": ""
    },
    {
      "text": "Magnus Österholm. 2006. Characterizing Reading Comprehension of Mathematical Texts. Educational Studies in Mathematics 63 (2006).",
      "doi": ""
    },
    {
      "text": "Ari Pakman, Yueqi Wang, Catalin Mitelut, and JinHyung Lee. Neural Clustering Processes, ICML Poster Presentation (slide 27). https://icml.cc/virtual/2020/poster/6425 Last accessed December 30, 2021.",
      "doi": ""
    },
    {
      "text": "Victor Powell. Image Kernels Explained Visually. https://setosa.io/ev/image-kernels/ Last accessed December 30, 2021.",
      "doi": ""
    },
    {
      "text": "Edward Raff. 2020. Inside Deep Learning: Math, Algorithms, Models. Manning.",
      "doi": ""
    },
    {
      "text": "Donghao Ren, M. Brehmer, Bongshin Lee, Tobias Höllerer, and E. Choe. 2017. ChartAccent: Annotation for data-driven storytelling. In Proceedings of the IEEE Pacific Visualization Symposium (PacificVis).",
      "doi": ""
    },
    {
      "text": "Nicholas Rougeux. Byrne’s Euclid. https://www.c82.net/euclid/book1 Last accessed December 30, 2021.",
      "doi": ""
    },
    {
      "text": "Grant Sanderson. Manim. https://3b1b.github.io/manim/",
      "doi": ""
    },
    {
      "text": "Nazmus Saquib, Rubaiat Habib Kazi, Li-yi Wei, Gloria Mark, and Deb Roy. 2021. Constructing Embodied Algebra by Sketching. In Proceedings of the CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3411764.3445460"
    },
    {
      "text": "Alper Sarikaya, M. Correll, L. Bartram, Melanie K. Tory, and Danyel Fisher. 2019. What Do We Talk About When We Talk About Dashboards?IEEE Transactions on Visualization and Computer Graphics 25(2019).",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan and Jeffrey Heer. 2014. Authoring Narrative Visualizations with Ellipsis. Computer Graphics Forum 33 (2014).",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2017. Vega-Lite: A Grammar of Interactive Graphics. In IEEE Transactions on Visualization and Computer Graphics, Vol. 23.",
      "doi": ""
    },
    {
      "text": "Mary D. Shepherd and Carla V. D. Sande. 2014. Reading mathematics for understanding—From novice to expert. The Journal of Mathematical Behavior 35 (2014).",
      "doi": ""
    },
    {
      "text": "Arjun Srinivasan, Steven Drucker, Alex Endert, and John Stasko. 2019. Augmenting Visualizations with Interactive Data Facts to Facilitate Interpretation and Communication. IEEE Transactions on Visualization and Computer Graphics 25(2019).",
      "doi": "10.1109/TVCG.2018.2865145"
    },
    {
      "text": "Edward Tufte. 1985. The visual display of quantitative information. Graphics Press.",
      "doi": "10.5555/33404"
    },
    {
      "text": "Bret Victor. Tangle: a JavaScript library for reactive documents. http://worrydream.com/Tangle/ Last accessed August 15, 2021.",
      "doi": ""
    },
    {
      "text": "Theresa E. Wege, Sophie Batchelor, Matthew Inglis, Honali Mistry, and Dirk Schlimm. 2020. Iconicity in Mathematical Notation: Commutativity and Symmetry. Journal of Numerical Cognition 6 (2020).",
      "doi": ""
    },
    {
      "text": "Katherine Ye, Wode Ni, Max Krieger, Dor Ma’ayan, Jenna Wise, Jonathan Aldrich, Joshua Sunshine, and Keenan Crane. 2020. Penrose: from mathematical notation to beautiful diagrams. ACM Transactions on Graphics (TOG) 39 (2020).",
      "doi": "10.1145/3386569.3392375"
    },
    {
      "text": "Hsin I. Yung and Fred Paas. 2015. Effects of Computer-Based Visual Representation on Mathematics Learning and Cognitive Load. J. Educ. Technol. Soc. 18 (2015).",
      "doi": ""
    },
    {
      "text": "Robert C. Zeleznik, Andrew Bragdon, Ferdi Adeputra, and Hsu-Sheng Ko. 2010. Hands-on math: a page-based multi-touch and pen desktop for technical work and problem solving. In Proceedings of the Symposium on User Interface Software and Technology.",
      "doi": "10.1145/1866029.1866035"
    }
  ]
}