{
  "doi": "10.1145/3491102.3501878",
  "title": "TapType: Ten-finger text entry on everyday surfaces via Bayesian inference",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "Despite the advent of touchscreens, typing on physical keyboards remains most efficient for entering text, because users can leverage all fingers across a full-size keyboard for convenient typing. As users increasingly type on the go, text input on mobile and wearable devices has had to compromise on full-size typing. In this paper, we present TapType, a mobile text entry system for full-size typing on passive surfaces—without an actual keyboard. From the inertial sensors inside a band on either wrist, TapType decodes and relates surface taps to a traditional QWERTY keyboard layout. The key novelty of our method is to predict the most likely character sequences by fusing the finger probabilities from our Bayesian neural network classifier with the characters’ prior probabilities from an n-gram language model. In our online evaluation, participants on average typed 19 words per minute with a character error rate of 0.6% after 30 minutes of training. Expert typists thereby consistently achieved more than 25 WPM at a similar error rate. We demonstrate applications of TapType in mobile use around smartphones and tablets, as a complement to interaction in situated Mixed Reality outside visual control, and as an eyes-free mobile text input method using an audio feedback-only interface.",
  "authors": [
    {
      "name": "Paul Streli",
      "institution": "Department of Computer Science, ETH Zürich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701493",
      "orcid": "0000-0002-3334-7727"
    },
    {
      "name": "Jiaxi Jiang",
      "institution": "Department of Computer Science, ETH Zürich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237070",
      "orcid": "missing"
    },
    {
      "name": "Andreas Rene Fender",
      "institution": "Department of Computer Science, ETH Zürich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959192157",
      "orcid": "0000-0002-5903-0736"
    },
    {
      "name": "Manuel Meier",
      "institution": "Department of Computer Science, ETH Zürich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701008",
      "orcid": "missing"
    },
    {
      "name": "Hugo Romat",
      "institution": "Department of Computer Science, ETH Zürich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658993819",
      "orcid": "0000-0002-9194-8889"
    },
    {
      "name": "Christian Holz",
      "institution": "Department of Computer Science, ETH Zürich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597100",
      "orcid": "0000-0001-9655-9519"
    }
  ],
  "references": [
    {
      "text": "Shlomo Argamon, Moshe Koppel, James W Pennebaker, and Jonathan Schler. 2007. Mining the blogosphere: Age, gender and the varieties of self-expression. First Monday (2007).",
      "doi": ""
    },
    {
      "text": "Neil Band, Tim GJ Rudner, Qixuan Feng, Angelos Filos, Zachary Nado, Michael W Dusenberry, Ghassen Jerfel, Dustin Tran, and Yarin Gal. 2021. Benchmarking Bayesian Deep Learning on Diabetic Retinopathy Detection Tasks. In NeurIPS 2021 Workshop on Distribution Shifts: Connecting Methods and Applications.",
      "doi": ""
    },
    {
      "text": "Austin R. Benson and Jon Kleinberg. 2018. Found Graph Data and Planted Vertex Covers. In Advances in Neural Information Processing Systems.",
      "doi": ""
    },
    {
      "text": "Charles Blundell, Julien Cornebise, Koray Kavukcuoglu, and Daan Wierstra. 2015. Weight uncertainty in neural network. In International Conference on Machine Learning. PMLR, 1613–1622.",
      "doi": ""
    },
    {
      "text": "Tom B Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, 2020. Language models are few-shot learners. In Neural Information Processing Systems.",
      "doi": ""
    },
    {
      "text": "Stanley F. Chen and Joshua Goodman. 1996. An Empirical Study of Smoothing Techniques for Language Modeling. In Proceedings of the 34th Annual Meeting on Association for Computational Linguistics (Santa Cruz, California) (ACL ’96). Association for Computational Linguistics, USA, 310–318. https://doi.org/10.3115/981863.981904",
      "doi": ""
    },
    {
      "text": "Stanley F Chen and Joshua Goodman. 1999. An empirical study of smoothing techniques for language modeling. Computer Speech & Language 13, 4 (1999), 359–394.",
      "doi": "10.1006/csla.1999.0128"
    },
    {
      "text": "Lung-Pan Cheng, Eyal Ofek, Christian Holz, Hrvoje Benko, and Andrew D Wilson. 2017. Sparse haptic proxy: Touch feedback in virtual environments using a general passive prop. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3718–3728.",
      "doi": "10.1145/3025453.3025753"
    },
    {
      "text": "Siddhartha Chib and Edward Greenberg. 1995. Understanding the metropolis-hastings algorithm. The American Statistician 49, 4 (1995), 327–335.",
      "doi": ""
    },
    {
      "text": "Nick Craswell, Arjen P de Vries, and Ian Soboroff. 2005. Overview of the TREC 2005 Enterprise Track. In TREC, Vol. 5. 199–205.",
      "doi": ""
    },
    {
      "text": "Armen Der Kiureghian and Ove Ditlevsen. 2009. Aleatory or epistemic? Does it matter?Structural Safety 31, 2 (2009), 105–112.",
      "doi": ""
    },
    {
      "text": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. Bert: Pre-training of deep bidirectional transformers for language understanding. In North American Chapter of the Association for Computational Linguistics.",
      "doi": ""
    },
    {
      "text": "Vivek Dhakal, Anna Maria Feit, Per Ola Kristensson, and Antti Oulasvirta. 2018. Observations on Typing from 136 Million Keystrokes. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174220",
      "doi": "10.1145/3173574.3174220"
    },
    {
      "text": "Akshay Raj Dhamija, Manuel Günther, and Terrance E Boult. 2018. Reducing network agnostophobia. In Neural Information Processing Systems.",
      "doi": ""
    },
    {
      "text": "John J Dudley, Keith Vertanen, and Per Ola Kristensson. 2018. Fast and precise touch-based text entry for head-mounted augmented reality with variable occlusion. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 6(2018), 1–40.",
      "doi": "10.1145/3232163"
    },
    {
      "text": "Jacqui Fashimpaur, Kenrick Kin, and Matt Longest. 2020. PinchType: Text Entry for Virtual and Augmented Reality Using Comfortable Thumb to Fingertip Pinches. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3334480.3382888",
      "doi": "10.1145/3334480.3382888"
    },
    {
      "text": "Anna Maria Feit, Daryl Weir, and Antti Oulasvirta. 2016. How we type: Movement strategies and performance in everyday typing. In Proceedings of the 2016 chi conference on human factors in computing systems. 4262–4273.",
      "doi": "10.1145/2858036.2858233"
    },
    {
      "text": "Leah Findlater, Jacob O Wobbrock, and Daniel Wigdor. 2011. Typing on flat glass: examining ten-finger expert typing patterns on touch surfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems. 2453–2462.",
      "doi": "10.1145/1978942.1979301"
    },
    {
      "text": "Shaona Ghosh and Per Ola Kristensson. 2017. Neural networks for text correction and completion in keyboard decoding. arXiv preprint arXiv:1709.06429(2017).",
      "doi": ""
    },
    {
      "text": "Mikael Goldstein, Robert Book, Gunilla Alsiö, and Silvia Tessa. 1999. Non-keyboard QWERTY touch typing: a portable input interface for the mobile user. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 32–39.",
      "doi": "10.1145/302979.302984"
    },
    {
      "text": "Joshua Goodman, Gina Venolia, Keith Steury, and Chauncey Parker. 2002. Language modeling for soft keyboards. In Proceedings of the 7th international conference on Intelligent user interfaces. 194–195.",
      "doi": "10.1145/502716.502753"
    },
    {
      "text": "Mitchell Gordon, Tom Ouyang, and Shumin Zhai. 2016. WatchWriter: Tap and gesture typing on a smartwatch miniature keyboard with statistical decoding. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 3817–3821.",
      "doi": "10.1145/2858036.2858242"
    },
    {
      "text": "Yizheng Gu, Chun Yu, Zhipeng Li, Zhaoheng Li, Xiaoying Wei, and Yuanchun Shi. 2020. QwertyRing: Text Entry on Physical Surfaces Using a Ring. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 4, Article 128 (Dec. 2020), 29 pages. https://doi.org/10.1145/3432204",
      "doi": "10.1145/3432204"
    },
    {
      "text": "Chuan Guo, Geoff Pleiss, Yu Sun, and Kilian Q Weinberger. 2017. On calibration of modern neural networks. In International Conference on Machine Learning. PMLR, 1321–1330.",
      "doi": ""
    },
    {
      "text": "Sean Gustafson, Christian Holz, and Patrick Baudisch. 2011. Imaginary phone: learning imaginary interfaces by transferring spatial memory from a familiar device. In Proceedings of the 24th annual ACM symposium on User interface software and technology. 283–292.",
      "doi": "10.1145/2047196.2047233"
    },
    {
      "text": "Trevor Hastie, Robert Tibshirani, and Jerome Friedman. 2009. The elements of statistical learnin. Cited on (2009), 33.",
      "doi": ""
    },
    {
      "text": "Kenneth Heafield. 2011. KenLM: Faster and Smaller Language Model Queries. In Proceedings of the Sixth Workshop on Statistical Machine Translation. Association for Computational Linguistics, Edinburgh, Scotland, 187–197. https://www.aclweb.org/anthology/W11-2123",
      "doi": ""
    },
    {
      "text": "Juan David Hincapié-Ramos, Xiang Guo, Paymahn Moghadasian, and Pourang Irani. 2014. Consumed endurance: a metric to quantify arm fatigue of mid-air interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1063–1072.",
      "doi": "10.1145/2556288.2557130"
    },
    {
      "text": "Jonggi Hong, Seongkook Heo, Poika Isokoski, and Geehyuk Lee. 2015. SplitBoard: A Simple Split Soft Keyboard for Wristwatch-Sized Touch Screens. Association for Computing Machinery, New York, NY, USA, 1233–1236. https://doi.org/10.1145/2702123.2702273",
      "doi": ""
    },
    {
      "text": "Brent Edward Insko, M Meehan, M Whitton, and F Brooks. 2001. Passive haptics significantly enhances virtual environments. Ph.D. Dissertation. University of North Carolina at Chapel Hill.",
      "doi": ""
    },
    {
      "text": "Sujin Jang, Wolfgang Stuerzlinger, Satyajit Ambike, and Karthik Ramani. 2017. Modeling cumulative arm fatigue in mid-air interaction based on perceived exertion and kinetics of arm motion. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3328–3339.",
      "doi": "10.1145/3025453.3025523"
    },
    {
      "text": "Laurent Valentin Jospin, Wray Buntine, Farid Boussaid, Hamid Laga, and Mohammed Bennamoun. 2020. Hands-on Bayesian Neural Networks–a Tutorial for Deep Learning Users. arXiv preprint arXiv:2007.06823(2020).",
      "doi": ""
    },
    {
      "text": "Alex Kendall and Yarin Gal. 2017. What uncertainties do we need in bayesian deep learning for computer vision?. In Neural Information Processing Systems.",
      "doi": ""
    },
    {
      "text": "Sunjun Kim, Jeongmin Son, Geehyuk Lee, Hwan Kim, and Woohun Lee. 2013. TapBoard: making a touch screen keyboard more touchable. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 553–562.",
      "doi": "10.1145/2470654.2470733"
    },
    {
      "text": "Yoon Sang Kim, Byung Seok Soh, and Sang-Goog Lee. 2005. A New Wearable Input Device: SCURRY. IEEE Transactions on Industrial Electronics 52, 6 (2005), 1490–1499.",
      "doi": ""
    },
    {
      "text": "Diederik P Kingma and Jimmy Ba. 2015. Adam: A method for stochastic optimization. In International Conference on Learning Representations.",
      "doi": ""
    },
    {
      "text": "Durk P Kingma, Tim Salimans, and Max Welling. 2015. Variational dropout and the local reparameterization trick. Neural Information Processing Systems 28 (2015), 2575–2583.",
      "doi": ""
    },
    {
      "text": "Per-Ola Kristensson and Shumin Zhai. 2005. Relaxing stylus typing precision by geometric pattern matching. In Proceedings of the 10th international conference on Intelligent user interfaces. 151–158.",
      "doi": "10.1145/1040830.1040867"
    },
    {
      "text": "Minkyung Lee, Woontack Woo, 2003. ARKB: 3D vision-based Augmented Reality Keyboard.. In ICAT.",
      "doi": ""
    },
    {
      "text": "Luis A. Leiva, Alireza Sahami, Alejandro Catala, Niels Henze, and Albrecht Schmidt. 2015. Text Entry on Tiny QWERTY Soft Keyboards. Association for Computing Machinery, New York, NY, USA, 669–678. https://doi.org/10.1145/2702123.2702388",
      "doi": ""
    },
    {
      "text": "Frank Chun Yat Li, Richard T Guy, Koji Yatani, and Khai N Truong. 2011. The 1line keyboard: a QWERTY layout in a single line. In Proceedings of the 24th annual ACM symposium on User interface software and technology. 461–470.",
      "doi": ""
    },
    {
      "text": "Andrew L. Maas, Raymond E. Daly, Peter T. Pham, Dan Huang, Andrew Y. Ng, and Christopher Potts. 2011. Learning Word Vectors for Sentiment Analysis. In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, Portland, Oregon, USA, 142–150. http://www.aclweb.org/anthology/P11-1015",
      "doi": "10.5555/2002472.2002491"
    },
    {
      "text": "I. Scott MacKenzie. 2015. A Note on Calculating Text Entry Speed. https://www.yorku.ca/mack/RN-TextEntrySpeed.html#:~:text=Words%20Per%20Minute&text=The%20transformation%20requires%20multiplying%20the,using%20actual%20words%20per%20minute.",
      "doi": ""
    },
    {
      "text": "I Scott MacKenzie and R William Soukoreff. 2003. Phrase sets for evaluating text entry techniques. In CHI’03 extended abstracts on Human factors in computing systems. 754–755.",
      "doi": ""
    },
    {
      "text": "Anders Markussen, Mikkel Rønne Jakobsen, and Kasper Hornbæk. 2014. Vulture: a mid-air word-gesture keyboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1073–1082.",
      "doi": "10.1145/2556288.2556964"
    },
    {
      "text": "Manuel Meier, Paul Streli, Andreas Fender, and Christian Holz. 2021. TapID: Rapid Touch Interaction in Virtual Reality using Wearable Sensing. In 2021 IEEE Virtual Reality and 3D User Interfaces (VR). IEEE, 519–528.",
      "doi": ""
    },
    {
      "text": "Robert C Moore and Will Lewis. 2010. Intelligent selection of language model training data. (2010).",
      "doi": ""
    },
    {
      "text": "Mahdi Pakdaman Naeini, Gregory F. Cooper, and Milos Hauskrecht. 2015. Obtaining Well Calibrated Probabilities Using Bayesian Binning. In Proceedings of the Twenty-Ninth AAAI Conference on Artificial Intelligence (Austin, Texas) (AAAI’15). AAAI Press, 2901–2907.",
      "doi": "10.5555/2888116.2888120"
    },
    {
      "text": "Hermann Ney, Ute Essen, and Reinhard Kneser. 1994. On structuring probabilistic dependences in stochastic language modelling. Computer Speech & Language 8, 1 (1994), 1–38. https://doi.org/10.1006/csla.1994.1001",
      "doi": ""
    },
    {
      "text": "Jianmo Ni, Jiacheng Li, and Julian McAuley. 2019. Justifying recommendations using distantly-labeled reviews and fine-grained aspects. In Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP). 188–197.",
      "doi": ""
    },
    {
      "text": "Stephen Oney, Chris Harrison, Amy Ogan, and Jason Wiese. 2013. ZoomBoard: A Diminutive Qwerty Soft Keyboard Using Iterative Zooming for Ultra-Small Devices. Association for Computing Machinery, New York, NY, USA, 2799–2802. https://doi.org/10.1145/2470654.2481387",
      "doi": ""
    },
    {
      "text": "Ryan Qin, Suwen Zhu, Yu-Hao Lin, Yu-Jung Ko, and Xiaojun Bi. 2018. Optimal-t9: An optimized t9-like keyboard for small touchscreen devices. In Proceedings of the 2018 ACM International Conference on Interactive Surfaces and Spaces. 137–146.",
      "doi": "10.1145/3279778.3279786"
    },
    {
      "text": "Daniel R Rashid and Noah A Smith. 2008. Relative keyboard input system. In Proceedings of the 13th international conference on Intelligent user interfaces. 397–400.",
      "doi": "10.1145/1378773.1378839"
    },
    {
      "text": "D Raj Reddy 1977. Speech understanding systems: A summary of results of the five-year research effort. department of computer science.",
      "doi": ""
    },
    {
      "text": "Mark Richardson, Matt Durasoff, and Robert Wang. 2020. Decoding Surface Touch Typing from Hand-Tracking. Association for Computing Machinery, New York, NY, USA, 686–696. https://doi.org/10.1145/3379337.3415816",
      "doi": "10.1145/3379337.3415816"
    },
    {
      "text": "Dovid Schick. 2021. Tap Strap QWERYY Keyboard. https://www.linkedin.com/feed/update/urn:li:activity:6820359705433640960/",
      "doi": ""
    },
    {
      "text": "Weinan Shi, Chun Yu, Xin Yi, Zhen Li, and Yuanchun Shi. 2018. TOAST: Ten-finger eyes-free typing on touchable surfaces. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 1 (2018), 1–23.",
      "doi": "10.1145/3191765"
    },
    {
      "text": "Kumar Shridhar, Felix Laumann, and Marcus Liwicki. 2019. A comprehensive guide to bayesian convolutional neural network with variational inference. arXiv preprint arXiv:1901.02731(2019).",
      "doi": ""
    },
    {
      "text": "Andreas Stolcke, Jing Zheng, Wen Wang, and Victor Abrash. 2011. SRILM at sixteen: Update and outlook. In Proceedings of IEEE automatic speech recognition and understanding workshop, Vol. 5.",
      "doi": ""
    },
    {
      "text": "Paul Streli and Christian Holz. 2021. CapContact: Super-Resolution Contact Areas from Capacitive Touchscreens. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445621",
      "doi": ""
    },
    {
      "text": "Ryo Takahashi, Masaaki Fukumoto, Changyo Han, Takuya Sasatani, Yoshiaki Narusue, and Yoshihiro Kawahara. 2020. TelemetRing: A Batteryless and Wireless Ring-Shaped Keyboard Using Passive Inductive Telemetry. Association for Computing Machinery, New York, NY, USA, 1161–1168. https://doi.org/10.1145/3379337.3415873",
      "doi": "10.1145/3379337.3415873"
    },
    {
      "text": "Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. 2017. Attention is all you need. In Neural Information Processing Systems. 5998–6008.",
      "doi": ""
    },
    {
      "text": "Keith Vertanen. [n.d.]. Challenging Twitter phrase set. Sentences from twitter designed to be challenging to recognize. 213 out-of-vocabulary phrases, 194 in-vocabulary phrases.https://keithv.com/data/twitter-phrases.zip",
      "doi": ""
    },
    {
      "text": "Keith Vertanen. [n.d.]. Vocab 100K. English word vocabulary of 100K words.https://keithv.com/data/vocab_100k.txt",
      "doi": ""
    },
    {
      "text": "Keith Vertanen, Crystal Fletcher, Dylan Gaines, Jacob Gould, and Per Ola Kristensson. 2018. The Impact of Word, Multiple Word, and Sentence Input on Virtual Keyboard Decoding Performance. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174200",
      "doi": "10.1145/3173574.3174200"
    },
    {
      "text": "Keith Vertanen, Dylan Gaines, Crystal Fletcher, Alex M Stanage, Robbie Watling, and Per Ola Kristensson. 2019. VelociWatch: Designing and evaluating a virtual keyboard for the input of challenging text. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300821"
    },
    {
      "text": "Keith Vertanen, Haythem Memmi, Justin Emge, Shyam Reyal, and Per Ola Kristensson. 2015. VelociTap: Investigating fast mobile text entry using sentence-based decoding of touchscreen keyboard input. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 659–668.",
      "doi": "10.1145/2702123.2702135"
    },
    {
      "text": "Nicolas Villar, Daniel Cletheroe, Greg Saul, Christian Holz, Tim Regan, Oscar Salandin, Misha Sra, Hui-Shyong Yeo, William Field, and Haiyan Zhang. 2018. Project Zanzibar: A Portable and Flexible Tangible Interaction Platform. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174089",
      "doi": "10.1145/3173574.3174089"
    },
    {
      "text": "Daryl Weir, Henning Pohl, Simon Rogers, Keith Vertanen, and Per Ola Kristensson. 2014. Uncertain Text Entry on Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2307–2316. https://doi.org/10.1145/2556288.2557412",
      "doi": "10.1145/2556288.2557412"
    },
    {
      "text": "Andrew Gordon Wilson and Pavel Izmailov. 2020. Bayesian deep learning and a probabilistic perspective of generalization. In Neural Information Processing Systems.",
      "doi": ""
    },
    {
      "text": "Ian H Witten and Timothy C Bell. 1991. The zero-frequency problem: Estimating the probabilities of novel events in adaptive text compression. Ieee transactions on information theory 37, 4 (1991), 1085–1094.",
      "doi": ""
    },
    {
      "text": "Pui Chung Wong, Kening Zhu, and Hongbo Fu. 2018. FingerT9: Leveraging Thumb-to-Finger Interaction for Same-Side-Hand Text Entry on Smartwatches. Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3173574.3173752",
      "doi": "10.1145/3173574.3173752"
    },
    {
      "text": "Mengwei Xu, Feng Qian, Qiaozhu Mei, Kang Huang, and Xuanzhe Liu. 2018. Deeptype: On-device deep learning for input personalization service with minimal privacy concern. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (2018), 1–26.",
      "doi": "10.1145/3287075"
    },
    {
      "text": "Zheer Xu, Weihao Chen, Dongyang Zhao, Jiehui Luo, Te-Yen Wu, Jun Gong, Sicheng Yin, Jialun Zhai, and Xing-Dong Yang. 2020. BiTipText: Bimanual Eyes-Free Text Entry on a Fingertip Keyboard. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376306",
      "doi": ""
    },
    {
      "text": "Zheer Xu, Pui Chung Wong, Jun Gong, Te-Yen Wu, Aditya Shekhar Nittala, Xiaojun Bi, Jürgen Steimle, Hongbo Fu, Kening Zhu, and Xing-Dong Yang. 2019. TipText: eyes-free text entry on a fingertip keyboard. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 883–899.",
      "doi": "10.1145/3332165.3347865"
    },
    {
      "text": "Xin Yi, Chun Yu, Weijie Xu, Xiaojun Bi, and Yuanchun Shi. 2017. COMPASS: Rotational Keyboard on Non-Touch Smartwatches. Association for Computing Machinery, New York, NY, USA, 705–715. https://doi.org/10.1145/3025453.3025454",
      "doi": "10.1145/3025453.3025454"
    },
    {
      "text": "Xin Yi, Chun Yu, Mingrui Zhang, Sida Gao, Ke Sun, and Yuanchun Shi. 2015. ATK: Enabling Ten-Finger Freehand Typing in Air Based on 3D Hand Tracking Data. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology(Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 539–548. https://doi.org/10.1145/2807442.2807504",
      "doi": "10.1145/2807442.2807504"
    },
    {
      "text": "Jiaming Zeng, Adam Lesnikowski, and Jose M Alvarez. 2018. The relevance of bayesian layer positioning to model uncertainty in deep bayesian active learning. Workshop on Neural Information Processing Systems (2018).",
      "doi": ""
    },
    {
      "text": "Mingrui Ray Zhang and Shumin Zhai. 2021. PhraseFlow: Designs and Empirical Studies of Phrase-Level Input. Association for Computing Machinery, New York, NY, USA.",
      "doi": "10.1145/3411764.3445166"
    },
    {
      "text": "Suwen Zhu, Tianyao Luo, Xiaojun Bi, and Shumin Zhai. 2018. Typing on an invisible keyboard. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3174013"
    }
  ]
}