{
  "doi": "10.1145/3491102.3517700",
  "title": "Community Dynamics in Technospiritual Interventions: Lessons Learned from a Church-based mHealth Pilot",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-23",
  "year": 2022,
  "badges": [],
  "abstract": "HCI researchers have increasingly examined how social context shapes health behaviors. Much of this work operates at the interpersonal level. Communities such as churches play important roles in supporting wellbeing and addressing health inequities. While some work has investigated creating digital health tools for religious populations, few have explicitly focused on the incorporation of community support in the form of prayer support. Embedding health interventions in any community has the potential to support or challenge the community’s dynamics. We report on findings from interviews with 17 church members who used a church-based mHealth application over a 4-week period and provide guidelines for developers based on these results. Through their use of the system, participants characterized several community dynamics including a desire for social intimacy, communicating care, creating opportunities for fellowship, maintaining privacy and discretion, and building community connections, and how these dynamics influence their aspirations for a church-based health app.",
  "tags": [
    "faith-based",
    "social capital",
    "technospiritual",
    "community dynamics",
    "mHealth",
    "African American",
    "historically marginalized communities",
    "Black"
  ],
  "authors": [
    {
      "name": "Teresa K. O'Leary",
      "institution": "Khoury College of Computer Sciences, Northeastern University, United States and Bouvé College of Health Sciences, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659432615",
      "orcid": "0000-0002-8447-3889"
    },
    {
      "name": "Dhaval Parmar",
      "institution": "Khoury College of Computer and Information Sciences, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658628011",
      "orcid": "missing"
    },
    {
      "name": "Stefan Olafsson",
      "institution": "Khoury College of Computer and Information Sciences, Northeastern University, United States",
      "img": "/do/10.1145/contrib-99659318611/rel-imgonly/so-thumb.jpg",
      "acmid": "99659318611",
      "orcid": "missing"
    },
    {
      "name": "Michael Paasche-Orlow",
      "institution": "School of Medicine, Boston University, United States and Boston Medical Center, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384611488",
      "orcid": "0000-0002-9276-7190"
    },
    {
      "name": "Timothy Bickmore",
      "institution": "Northeastern University, United States",
      "img": "/do/10.1145/contrib-81100360895/rel-imgonly/81100360895.jpg",
      "acmid": "81100360895",
      "orcid": "0000-0002-2676-9788"
    },
    {
      "name": "Andrea G Parker",
      "institution": "School of Interactive Computing, Georgia Tech, United States and School of Public Health, Emory University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556858356",
      "orcid": "0000-0002-2362-7717"
    }
  ],
  "references": [
    {
      "text": "Phil Adams, Eric PS Baumer, and Geri Gay. 2014. Staccato Social Support in Mobile Health Applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 653–662. https://doi.org/10.1145/2556288.2557297",
      "doi": "10.1145/2556288.2557297"
    },
    {
      "text": "Asam Almohamed and Dhaval Vyas. 2019. Rebuilding Social Capital in Refugees and Asylum Seekers. ACM Transactions on Computer Human Interaction 26, 6, Article 41 (Nov 2019), 30 pages. https://doi.org/10.1145/3364996",
      "doi": "10.1145/3364996"
    },
    {
      "text": "Asam Almohamed, Dhaval Vyas, and Jinglan Zhang. 2017. Rebuilding Social Capital: Engaging Newly Arrived Refugees in Participatory Design. In Proceedings of the 29th Australian Conference on Computer-Human Interaction (Brisbane, Queensland, Australia) (OZCHI ’17). Association for Computing Machinery, New York, NY, USA, 59–67. https://doi.org/10.1145/3152771.3152778",
      "doi": "10.1145/3152771.3152778"
    },
    {
      "text": "Kelly A Aschbrenner, John A Naslund, Amy A Gorin, Kim T Mueser, Emily A Scherer, Mark Viron, Allison Kinney, and Stephen J Bartels. 2018. Peer support and mobile health technology targeting obesity-related cardiovascular risk in young adults with serious mental illness: Protocol for a randomized controlled trial. Contemporary clinical trials 74 (2018), 97–106.",
      "doi": ""
    },
    {
      "text": "Sulin Ba and Lei Wang. 2013. Digital health communities: The effect of their motivation mechanisms. Decision Support Systems 55, 4 (2013), 941–947. https://doi.org/10.1016/j.dss.2013.01.003 1. Social Media Research and Applications 2. Theory and Applications of Social Networks.",
      "doi": "10.1016/j.dss.2013.01.003"
    },
    {
      "text": "Elizabeth Bales and William Griswold. 2011. Interpersonal Informatics: Making Social Influence Visible. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI EA ’11). Association for Computing Machinery, New York, NY, USA, 2227–2232. https://doi.org/10.1145/1979742.1979924",
      "doi": "10.1145/1979742.1979924"
    },
    {
      "text": "Genevieve Bell. 2006. No More SMS from Jesus: Ubicomp, Religion and Techno-spiritual Practices. In UbiComp 2006: Ubiquitous Computing, Pal Dourish and Adrian Friday (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 141–158.",
      "doi": ""
    },
    {
      "text": "Lisa F Berkman, Thomas Glass, 2000. Social integration, social networks, social support, and health. Social epidemiology 1, 6 (2000), 137–173.",
      "doi": ""
    },
    {
      "text": "Shlomo Berkovsky, Jill Freyne, and Mac Coombe. 2012. Physical activity motivating games: be active and get your own reward. ACM Transactions on Computer-Human Interaction (TOCHI) 19, 4(2012), 1–41.",
      "doi": "10.1145/2395131.2395139"
    },
    {
      "text": "Timothy Bickmore, Daniel Schulman, and George Shaw. 2009. DTask and LiteBody: Open Source, Standards-Based Tools for Building Web-Deployed Embodied Conversational Agents. In Intelligent Virtual Agents, Zsófia Ruttkay, Michael Kipp, Anton Nijholt, and Hannes Högni Vilhjálmsson (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 425–431.",
      "doi": ""
    },
    {
      "text": "Glenn A. Bowen. 2006. Grounded Theory and Sensitizing Concepts. International Journal of Qualitative Methods 5, 3 (2006), 12–23. https://doi.org/10.1177/160940690600500304 arXiv:https://doi.org/10.1177/160940690600500304",
      "doi": ""
    },
    {
      "text": "Ronald L Braithwaite, Sandra E Taylor, and Henrie M Treadwell. 2009. Health issues in the Black community. John Wiley & Sons, New York, NY.",
      "doi": ""
    },
    {
      "text": "LaPrincess C Brewer, Sarah Jenkins, Kandace Lackore, Jacqueline Johnson, Clarence Jones, Lisa A Cooper, Carmen Radecki Breitkopf, Sharonne N Hayes, and Christi Patten. 2018. mHealth intervention promoting cardiovascular health among African-Americans: recruitment and baseline characteristics of a pilot study. JMIR Research Protocols 7, 1 (2018), e31. https://doi.org/10.2196/resprot.8842",
      "doi": ""
    },
    {
      "text": "LaPrincess C Brewer, Ashok Kumbamu, Christina Smith, Sarah Jenkins, Clarence Jones, Sharonne N Hayes, Lora Burke, Lisa A Cooper, and Christi A Patten. 2020. A cardiovascular health and wellness mobile health intervention among church-going African Americans: Formative evaluation of the FAITH! app. JMIR Formative Research 4, 11 (2020), e21450. https://doi.org/10.2196/21450",
      "doi": ""
    },
    {
      "text": "Marci Kramish Campbell, Marlyn Allicock Hudson, Ken Resnicow, Natasha Blakeney, Amy Paxton, and Monica Baskin. 2007. Church-Based Health Promotion Interventions: Evidence and Lessons Learned. Annual Review of Public Health 28, 1 (2007), 213–234. https://doi.org/10.1146/annurev.publhealth.28.021406.144016 arXiv:https://doi.org/10.1146/annurev.publhealth.28.021406.144016PMID: 17155879.",
      "doi": ""
    },
    {
      "text": "Justine Cassell. 2001. Embodied Conversational Agents: Representation and Intelligence in User Interfaces. AI Magazine 22, 4 (Dec. 2001), 67–83. https://doi.org/10.1609/aimag.v22i4.1593",
      "doi": "10.5555/567363.567368"
    },
    {
      "text": "Justine Cassell, Hannes Högni Vilhjálmsson, and Timothy Bickmore. 2004. BEAT: the Behavior Expression Animation Toolkit. In Life-Like Characters: Tools, Affective Functions, and Applications, Helmut Prendinger and Mitsuru Ishizuka (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 163–185. https://doi.org/10.1007/978-3-662-08373-4_8",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2021. Mobile Fact Sheet: Who owns cellphones and smartphones. https://www.pewresearch.org/internet/fact-sheet/mobile/?menuItem=d40cde3f-c455-4f0e-9be0-0aefcdaeee00#who-owns-cellphones-and-smartphones",
      "doi": ""
    },
    {
      "text": "Yiong Huak Chan. 2019. Evaluation of a technology-based peer-support intervention program for preventing postnatal depression (part 1): randomized controlled trial. J Med Internet Res 21, 8 (2019), e12410.",
      "doi": ""
    },
    {
      "text": "Huan Chen, Yanling Chai, Le Dong, Wenyi Niu, and Puhong Zhang. 2018. Effectiveness and appropriateness of mHealth interventions for maternal and child health: systematic review. JMIR mHealth and uHealth 6, 1 (2018), e7.",
      "doi": ""
    },
    {
      "text": "Alexander Cho, Roxana G. Herrera, Luis Chaidez, and Adilene Uriostegui. 2019. The “Comadre” Project: An Asset-Based Design Approach to Connecting Low-Income Latinx Families to Out-of-School Learning Opportunities. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300837",
      "doi": ""
    },
    {
      "text": "Elena Cyrus, Rachel Clarke, Dexter Hadley, Zoran Bursac, Mary Jo Trepka, Jessy G Dévieux, Ulas Bagci, Debra Furr-Holden, Makella Coudray, Yandra Mariano, 2020. The impact of COVID-19 on African American communities in the United States. Health Equity 4, 1 (2020), 476–483.",
      "doi": ""
    },
    {
      "text": "Kathryn Pitkin Derose, Sarah A. Fox, Elena Reigadas, and Jennifer Hawes-Dawson. 2000. Church-Based Telephone Mammography Counseling with Peer Counselors. Journal of Health Communication 5, 2 (2000), 175–188. https://doi.org/10.1080/108107300406884 arXiv:https://doi.org/10.1080/108107300406884PMID: 11010348.",
      "doi": ""
    },
    {
      "text": "Elizabeth Dias. 2021. Facebook’s Next Target: The Religious Experience. https://www.nytimes.com/2021/07/25/us/facebook-church.html",
      "doi": ""
    },
    {
      "text": "Jessa Dickinson, Jalon Arthur, Maddie Shiparski, Angalia Bianca, Alejandra Gonzalez, and Sheena Erete. 2021. Amplifying Community-led Violence Prevention as a Counter to Structural Oppression. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–28.",
      "doi": "10.1145/3449279"
    },
    {
      "text": "Jessa Dickinson, Mark Díaz, Christopher A. Le Dantec, and Sheena Erete. 2019. “The Cavalry Ain’t Coming in to Save Us”: Supporting Capacities and Relationships through Civic Tech. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 123 (Nov 2019), 21 pages. https://doi.org/10.1145/3359225",
      "doi": "10.1145/3359225"
    },
    {
      "text": "Tawanna R. Dillahunt. 2014. Fostering Social Capital in Economically Distressed Communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 531–540. https://doi.org/10.1145/2556288.2557123",
      "doi": "10.1145/2556288.2557123"
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social Justice-Oriented Interaction Design: Outlining Key Design Strategies and Commitments. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). Association for Computing Machinery, New York, NY, USA, 656–671. https://doi.org/10.1145/2901790.2901861",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Nicole B. Ellison, Charles Steinfield, and Cliff Lampe. 2007. The Benefits of Facebook “Friends”: Social Capital and College Students’ Use of Online Social Network Sites. Journal of Computer-Mediated Communication 12, 4 (2007), 1143–1168. https://doi.org/10.1111/j.1083-6101.2007.00367.x arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1083-6101.2007.00367.x",
      "doi": ""
    },
    {
      "text": "Sheena L Erete. 2014. Community, group and individual: A framework for designing community technologies. The Journal of Community Informatics 10, 1 (2014), 13 pages.",
      "doi": ""
    },
    {
      "text": "Malin Eriksson. 2011. Social capital and health – implications for health promotion. Global Health Action 4, 1 (2011), 5611. https://doi.org/10.3402/gha.v4i0.5611 arXiv:https://doi.org/10.3402/gha.v4i0.5611PMID: 21311607.",
      "doi": ""
    },
    {
      "text": "Betty R Ferrell, George Handzo, Tina Picchi, Christina Puchalski, and William E Rosa. 2020. The urgency of spiritual care: COVID-19 and the critical need for whole-person palliation. Journal of pain and symptom management 60, 3 (2020), e7–e11.",
      "doi": ""
    },
    {
      "text": "Centers for Disease Control and Prevention. 2018. Well-Being Concepts. https://www.cdc.gov/hrqol/wellbeing.htm#three",
      "doi": ""
    },
    {
      "text": "Sarah Fox and Christopher Le Dantec. 2014. Community Historians: Scaffolding Community Engagement through Culture and Heritage. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 785–794. https://doi.org/10.1145/2598510.2598563",
      "doi": "10.1145/2598510.2598563"
    },
    {
      "text": "Aakash Gautam, Deborah Tatar, and Steve Harrison. 2020. Crafting, Communality, and Computing: Building on Existing Strengths To Support a Vulnerable Population. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376647",
      "doi": "10.1145/3313831.3376647"
    },
    {
      "text": "Daniel Gooch, Blaine A. Price, Anna Klis-Davies, and Julie Webb. 2021. A Design Exploration of Health-Related Community Displays. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 85 (Apr 2021), 22 pages. https://doi.org/10.1145/3449159",
      "doi": "10.1145/3449159"
    },
    {
      "text": "Joseph G Grzywacz and Juliana Fuqua. 2000. The social ecology of health: Leverage points and linkages. Behavioral medicine 26, 3 (2000), 101–115.",
      "doi": ""
    },
    {
      "text": "Michael Gurstein. 2007. What is community informatics (and why does it matter)? Vol. 2. Polimetrica, Monza, Italy.",
      "doi": ""
    },
    {
      "text": "Myeunghee Han and Eunjoo Lee. 2018. Effectiveness of Mobile Health Application Use to Improve Health Behavior Changes: A Systematic Review of Randomized Controlled Trials. Healthcare Informatics Research 24, 3 (2018), 207–226. https://doi.org/10.4258/hir.2018.24.3.207",
      "doi": ""
    },
    {
      "text": "Laura C. Hanson, Tonya D. Armstrong, Melissa A. Green, Michelle Hayes, Stacie Peacock, Sharon Elliot-Bynum, Moses V. Goldmon, Giselle Corbie-Smith, and Jo Anne Earp. 2013. Circles of Care: Development and Initial Evaluation of a Peer Support Model for African Americans With Advanced Cancer. Health Education & Behavior 40, 5 (2013), 536–543. https://doi.org/10.1177/1090198112461252 arXiv:https://doi.org/10.1177/1090198112461252PMID: 23077156.",
      "doi": ""
    },
    {
      "text": "Christina Harrington, Sheena Erete, and Anne Marie Piper. 2019. Deconstructing community-based collaborative design: Towards more equitable participatory design engagements. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–25.",
      "doi": "10.1145/3359318"
    },
    {
      "text": "Danetta Hendricks Sloan, Theodora Peters, Kimberly S. Johnson, Janice V. Bowie, Yang Ting, and Rebecca Aslakson. 2016. Church-Based Health Promotion Focused on Advance Care Planning and End-of-Life Care at Black Baptist Churches: A Cross-Sectional Survey. Journal of Palliative Medicine 19, 2 (2016), 190–194. https://doi.org/10.1089/jpm.2015.0319 arXiv:https://doi.org/10.1089/jpm.2015.0319PMID: 26840855.",
      "doi": ""
    },
    {
      "text": "Evan Hill, Ainara Tiefenthäler, Christiaan Triebert, Drew Jordan, Haley Willis, and Robin Stein. 2020. How George Floyd Was Killed In Police Custody. https://www.nytimes.com/2020/05/31/us/george-floyd-investigation.html",
      "doi": ""
    },
    {
      "text": "The White House. 2021. FACT SHEET: President Biden Reestablishes the White House Office of Faith-Based and Neighborhood Partnerships. https://www.whitehouse.gov/briefing-room/statements-releases/2021/02/14/fact-sheet-president-biden-reestablishes-the-white-house-office-of-faith-based-and-neighborhood-partnerships",
      "doi": ""
    },
    {
      "text": "Joey Chiao-Yin Hsiao and Tawanna R Dillahunt. 2018. Technology to support immigrant access to social capital and adaptation to a new country. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–21.",
      "doi": ""
    },
    {
      "text": "Evan Imber-Black. 2020. Rituals in the time of COVID-19: imagination, responsiveness, and the human spirit. Family process 59, 3 (2020), 912–921.",
      "doi": ""
    },
    {
      "text": "Farnaz Irannejad Bisafar, Lina Itzel Martinez, and Andrea G. Parker. 2018. Social Computing-Driven Activism in Youth Empowerment Organizations: Challenges and Opportunities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173757",
      "doi": "10.1145/3173574.3173757"
    },
    {
      "text": "Farnaz Irannejad Bisafar, Aditya Ponnada, Ameneh Shamekhi, and Andrea G. Parker. 2017. A Sociotechnical Study of a Community-Based Rewards Program: Insights on Building Social, Financial and Human Capital. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 55 (Dec 2017), 21 pages. https://doi.org/10.1145/3134690",
      "doi": "10.1145/3134690"
    },
    {
      "text": "Wayne B. Jonas and Elena Rosenbaum. 2021. The Case for Whole-Person Integrative Care. Medicina 57, 7 (2021), 12. https://doi.org/10.3390/medicina57070677",
      "doi": ""
    },
    {
      "text": "Ayana Jordan, Theresa Babuscio, Charla Nich, and Kathleen M. Carroll. 2021. A feasibility study providing substance use treatment in the Black church. Journal of Substance Abuse Treatment 124 (2021), 108218. https://doi.org/10.1016/j.jsat.2020.108218",
      "doi": ""
    },
    {
      "text": "Anne Marie Kanstrup and Pernille Bertelsen. 2019. Design for Healthy Horizons in a Local Community: Digital Relations in a Neighbourhood with Health Challenges. In Proceedings of the 9th International Conference on Communities & Technologies - Transforming Communities (Vienna, Austria) (C&T ’19). Association for Computing Machinery, New York, NY, USA, 41–50. https://doi.org/10.1145/3328320.3328370",
      "doi": "10.1145/3328320.3328370"
    },
    {
      "text": "Avleen Kaur, C. Estelle Smith, and Loren Terveen. 2021. Sway Together, Stay Together: Visualizing Spiritual Support Networks Through the SoulGarden Prototype. In Companion Publication of the 2021 Conference on Computer Supported Cooperative Work and Social Computing. Association for Computing Machinery, New York, NY, USA, 84–88. https://doi.org/10.1145/3462204.3481774",
      "doi": "10.1145/3462204.3481774"
    },
    {
      "text": "Elizabeth Kaziunas, Michael S. Klinkman, and Mark S. Ackerman. 2019. Precarious Interventions: Designing for Ecologies of Care. Proceedings of the ACM on Human-Computer Interaction 3, CSCW, Article 113 (Nov 2019), 27 pages. https://doi.org/10.1145/3359215",
      "doi": "10.1145/3359215"
    },
    {
      "text": "John P Kretzmann and John McKnight. 1993. Building communities from the inside out: a path toward finding and mobilizing a community’s assets. Center for Urban Affairs and Policy Research, Neighborhood Innovations, Chicago, IL, USA.",
      "doi": ""
    },
    {
      "text": "Ariana Y. Lahijani, Adrian R. King, Mary M. Gullatte, Monique Hennink, and Robert A. Bednarczyk. 2021. HPV Vaccine Promotion: The church as an agent of change. Social Science & Medicine 268 (2021), 113375. https://doi.org/10.1016/j.socscimed.2020.113375",
      "doi": ""
    },
    {
      "text": "Kristie J. Lancaster, Antoinette M. Schoenthaler, Sara A. Midberry, Sheldon O. Watts, Matthew R. Nulty, Helen V. Cole, Elizabeth Ige, William Chaplin, and Gbenga Ogedegbe. 2014. Rationale and design of Faith-based Approaches in the Treatment of Hypertension (FAITH), a lifestyle intervention targeting blood pressure control among black church members. American Heart Journal 167, 3 (2014), 301–307. https://doi.org/10.1016/j.ahj.2013.10.026",
      "doi": ""
    },
    {
      "text": "Thomas M. Lasater, Diane M. Becker, Martha N. Hill, and Kim M. Gans. 1997. Synthesis of findings and issues from religious-based cardiovascular disease prevention trials. Annals of Epidemiology 7, 7, Supplement (1997), S46–S53. https://doi.org/10.1016/S1047-2797(97)80007-5",
      "doi": ""
    },
    {
      "text": "Daisy Le, Linda Aldoory, Mary A Garza, Craig S Fryer, Robin Sawyer, and Cheryl L Holt. 2018. A spiritually-based text messaging program to increase cervical cancer awareness among African American women: design and development of the CervixCheck pilot study. JMIR Formative Research 2, 1 (2018), e5. https://doi.org/10.2196/formative.8112",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec and Sarah Fox. 2015. Strangers at the Gate: Gaining Access, Building Rapport, and Co-Constructing Community-Based Research. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 1348–1358. https://doi.org/10.1145/2675133.2675147",
      "doi": "10.1145/2675133.2675147"
    },
    {
      "text": "Mikyung Lee, Hyeonkyeong Lee, Youlim Kim, Junghee Kim, Mikyeong Cho, Jaeun Jang, and Hyoeun Jang. 2018. Mobile app-based health promotion programs: a systematic review of the literature. International journal of environmental research and public health 15, 12(2018), 2838.",
      "doi": ""
    },
    {
      "text": "Victor R. Lee, Joel R. Drake, Ryan Cain, and Jeffrey Thayne. 2015. Opportunistic Uses of the Traditional School Day through Student Examination of Fitbit Activity Tracker Data. In Proceedings of the 14th International Conference on Interaction Design and Children (Boston, Massachusetts) (IDC ’15). Association for Computing Machinery, New York, NY, USA, 209–218. https://doi.org/10.1145/2771839.2771861",
      "doi": "10.1145/2771839.2771861"
    },
    {
      "text": "R. Craig Lefebvre and Alexandra S. Bornkessel. 2013. Digital Social Networks and Health. Circulation 127, 17 (2013), 1829–1836. https://doi.org/10.1161/CIRCULATIONAHA.112.000897 arXiv:https://www.ahajournals.org/doi/pdf/10.1161/CIRCULATIONAHA.112.000897",
      "doi": ""
    },
    {
      "text": "Calvin A Liang, Sean A Munson, and Julie A Kientz. 2021. Embracing Four Tensions in Human-Computer Interaction Research with Marginalized People. ACM Transactions on Computer-Human Interaction (TOCHI) 28, 2(2021), 1–47.",
      "doi": "10.1145/3443686"
    },
    {
      "text": "Henry Louis Gates Jr.2021. To Understand America, You Need to Understand the Black Church. https://time.com/5939921/henry-lous-gates-american-history-black-church/",
      "doi": ""
    },
    {
      "text": "Andrew Macvean and Judy Robertson. 2013. Understanding Exergame Users’ Physical Activity, Motivation and Behavior over Time. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 1251–1260. https://doi.org/10.1145/2470654.2466163",
      "doi": "10.1145/2470654.2466163"
    },
    {
      "text": "Khalid Majrashi. 2018. User need and experience of Hajj mobile and ubiquitous systems: Designing for the largest religious annual gathering. Cogent Engineering 5, 1 (2018), 1480303.",
      "doi": ""
    },
    {
      "text": "Alison Mathie and Gord Cunningham. 2003. From clients to citizens: Asset-based community development as a strategy for community-driven development. Development in practice 13, 5 (2003), 474–486.",
      "doi": ""
    },
    {
      "text": "Wylie McNabb, Michael Quinn, Jean Kerver, Sandy Cook, and Theodore Karrison. 1997. The PATHWAYS Church-Based Weight Loss Program for Urban African-American Women at Risk for Diabetes. Diabetes Care 20, 10 (1997), 1518–1523. https://doi.org/10.2337/diacare.20.10.1518 arXiv:https://care.diabetesjournals.org/content/20/10/1518.full.pdf",
      "doi": ""
    },
    {
      "text": "Marilyn Mellowes. 2021. The Black Church. https://www.pbs.org/wgbh/americanexperience/features/godinamerica-black-church",
      "doi": ""
    },
    {
      "text": "Andrew D. Miller and Elizabeth D. Mynatt. 2014. StepStream: A School-Based Pervasive Social Fitness System for Everyday Adolescent Health. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2823–2832. https://doi.org/10.1145/2556288.2557190",
      "doi": "10.1145/2556288.2557190"
    },
    {
      "text": "William R Miller and Stephen Rollnick. 2012. Motivational interviewing: Helping people change. Guilford press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Gregorio A Millett, Austin T Jones, David Benkeser, Stefan Baral, Laina Mercer, Chris Beyrer, Brian Honermann, Elise Lankiewicz, Leandro Mena, Jeffrey S Crowley, 2020. Assessing differential impacts of COVID-19 on black communities. Annals of epidemiology 47 (2020), 37–44.",
      "doi": ""
    },
    {
      "text": "Besheer Mohamed. 2021. 10 new findings about faith among Black Americans. https://www.pewresearch.org/fact-tank/2021/02/16/10-new-findings-about-faith-among-black-americans/",
      "doi": ""
    },
    {
      "text": "Elizabeth L. Murnane, Tara G. Walker, Beck Tench, Stephen Voida, and Jaime Snyder. 2018. Personal Informatics in Interpersonal Contexts: Towards the Design of Technology That Supports the Social Ecologies of Long-Term Mental Health Management. Proceedings of the ACM on Human-Computer Interaction 2, CSCW, Article 127 (Nov 2018), 27 pages. https://doi.org/10.1145/3274396",
      "doi": "10.1145/3274396"
    },
    {
      "text": "Larry Murphy. 2000. Down by the riverside: readings in African American Religion. Vol. 8. NYU Press, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Felix Naughton, Sarah Hopewell, Neal Lathia, Rik Schalbroeck, Chloë Brown, Cecilia Mascolo, Andy McEwen, and Stephen Sutton. 2016. A context-sensing mobile phone app (Q sense) for smoking cessation: a mixed-methods study. JMIR mHealth and uHealth 4, 3 (2016), e5787.",
      "doi": ""
    },
    {
      "text": "Vatican News. 2019. “Click to Pray eRosary” – wearable smart device to pray the rosary for peace. https://www.vaticannews.va/en/vatican-city/news/2019-10/click-pray-rosary-smart-digital-device-world-peace.html",
      "doi": ""
    },
    {
      "text": "Robert L Newton Jr, Leah A Carter, William Johnson, Dachuan Zhang, Sandra Larrivee, Betty M Kennedy, Melissa Harris, and Daniel S Hsia. 2018. A church-based weight loss intervention in African American adults using text messages (LEAN Study): cluster randomized controlled trial. Journal of Medical Internet Research 20, 8 (2018), e256. https://doi.org/10.2196/jmir.9816",
      "doi": ""
    },
    {
      "text": "Stefan Olafsson, Dhaval Parmar, Everlyne Kimani, Teresa K. O’Leary, and Timothy Bickmore. 2021. ‘More like a Person than Reading Text in a Machine’: Characterizing User Choice of Embodied Agents vs. Conventional GUIs on Smartphones. Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3411763.3451664",
      "doi": ""
    },
    {
      "text": "Teresa K. O’Leary, Elizabeth Stowell, Jessica A. Hoffman, Michael Paasche-Orlow, Timothy Bickmore, and Andrea G. Parker. 2021. Examining the Intersections of Race, Religion & Community Technologies: A Photovoice Study. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 698, 19 pages. https://doi.org/10.1145/3411764.3445418",
      "doi": "10.1145/3411764.3445418"
    },
    {
      "text": "Teresa K. O’Leary, Elizabeth Stowell, Everlyne Kimani, Dhaval Parmar, Stefan Olafsson, Jessica Hoffman, Andrea G. Parker, Michael K. Paasche-Orlow, and Timothy Bickmore. 2020. Community-Based Cultural Tailoring of Virtual Agents. In Proceedings of the 20th ACM International Conference on Intelligent Virtual Agents (Virtual Event, Scotland, UK) (IVA ’20). Association for Computing Machinery, New York, NY, USA, Article 43, 8 pages. https://doi.org/10.1145/3383652.3423875",
      "doi": "10.1145/3383652.3423875"
    },
    {
      "text": "World Health Organization. 2022. Constitution of the World Health Organization. https://www.who.int/about/governance/constitution",
      "doi": ""
    },
    {
      "text": "Wenjing Pan, Cuihua Shen, and Bo Feng. 2017. You Get What You Give: Understanding Reply Reciprocity and Social Capital in Online Health Support Forums. Journal of Health Communication 22, 1 (2017), 45–52. https://doi.org/10.1080/10810730.2016.1250845 arXiv:https://doi.org/10.1080/10810730.2016.1250845PMID: 28027009.",
      "doi": ""
    },
    {
      "text": "Andrea Parker, Vasudhara Kantroo, Hee Rin Lee, Miguel Osornio, Mansi Sharma, and Rebecca Grinter. 2012. Health Promotion as Activism: Building Community Capacity to Effect Social Change. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 99–108. https://doi.org/10.1145/2207676.2207692",
      "doi": "10.1145/2207676.2207692"
    },
    {
      "text": "Andrea G. Parker, Herman Saksono, Jessica A. Hoffman, and Carmen Castaneda-Sceppa. 2018. A Community Health Orientation for Wellness Technology Design & Delivery. In Designing Healthcare That Works, Mark S. Ackerman, Sean P. Goggins, Thomas Herrmann, Michael Prilla, and Christian Stary (Eds.). Academic Press, Cambridge, MA, USA, 59–76. https://doi.org/10.1016/B978-0-12-812583-0.00004-3",
      "doi": ""
    },
    {
      "text": "Lucy Pei and Bonnie Nardi. 2019. We Did It Right, But It Was Still Wrong: Toward Assets-Based Design. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290607.3310434",
      "doi": "10.1145/3290607.3310434"
    },
    {
      "text": "Jane Peterson, Jan R. Atwood, and Bernice Yates. 2002. Key Elements for Church-Based Health Promotion Programs: Outcome-Based Literature Review. Public Health Nursing 19, 6 (2002), 401–411. https://doi.org/10.1046/j.1525-1446.2002.19602.x arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1046/j.1525-1446.2002.19602.x",
      "doi": ""
    },
    {
      "text": "Thanh-Mai Phan and Svetlana Yarosh. 2016. Sustaining Reciprocity: Generating Social Capital within Peer-Support Communities. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion (San Francisco, California, USA) (CSCW ’16 Companion). Association for Computing Machinery, New York, NY, USA, 369–372. https://doi.org/10.1145/2818052.2869115",
      "doi": "10.1145/2818052.2869115"
    },
    {
      "text": "Erika Shehan Poole, Andrew D. Miller, Yan Xu, Elsa Eiriksdottir, Richard Catrambone, and Elizabeth D. Mynatt. 2011. The Place for Ubiquitous Computing in Schools: Lessons Learned from a School-Based Intervention for Youth Physical Activity. In Proceedings of the 13th International Conference on Ubiquitous Computing (Beijing, China) (UbiComp ’11). Association for Computing Machinery, New York, NY, USA, 395–404. https://doi.org/10.1145/2030112.2030165",
      "doi": "10.1145/2030112.2030165"
    },
    {
      "text": "Ken Resnicow, Debbie Coleman Wallace, Alice Jackson, Ann Digirolamo, Erica Odom, Terry Wang, William N. Dudley, Marsha Davis, Diane Mitchell, and Tom Baranowski. 2000. Dietary change through African American churches: Baseline results and program description of the eat for life trial. Journal of Cancer Education 15, 3 (2000), 156–163. https://doi.org/10.1080/08858190009528685 arXiv:https://www.tandfonline.com/doi/pdf/10.1080/08858190009528685PMID: 11019764.",
      "doi": ""
    },
    {
      "text": "Yasmyne Ronquillo, Arlen Meyers, and Scott J. Korvek. 2021. Digital Health. StatPearls Publishing, Treasure Island (FL), Treasure Island, FL. http://europepmc.org/books/NBK470260",
      "doi": ""
    },
    {
      "text": "Herman Saksono, Carmen Castaneda-Sceppa, Jessica Hoffman, Vivien Morris, Magy Seif El-Nasr, and Andrea G. Parker. 2020. Storywell: Designing for Family Fitness App Motivation by Using Social Rewards and Reflection. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376686",
      "doi": "10.1145/3313831.3376686"
    },
    {
      "text": "Herman Saksono, Carmen Castaneda-Sceppa, Jessica Hoffman, Magy Seif El-Nasr, Vivien Morris, and Andrea G. Parker. 2018. Family Health Promotion in Low-SES Neighborhoods: A Two-Month Study of Wearable Activity Tracking. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173883",
      "doi": "10.1145/3173574.3173883"
    },
    {
      "text": "Carmen D. Samuel-Hodge, Thomas C. Keyserling, Sola Park, Larry F. Johnston, Ziya Gizlice, and Shrikant I. Bangdiwala. 2009. A Randomized Trial of a Church-Based Diabetes Self-management Program for African Americans With Type 2 Diabetes. The Diabetes Educator 35, 3 (2009), 439–454. https://doi.org/10.1177/0145721709333270 arXiv:https://doi.org/10.1177/0145721709333270PMID: 19383882.",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, W. Keith Edwards, and Rebecca E. Grinter. 2017. Intersectional HCI: Engaging Identity through Gender, Race, and Class. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 5412–5427. https://doi.org/10.1145/3025453.3025766",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "John B. Schorling, Julienne Roach, Marjorie Siegel, Natalie Baturka, Dawn E. Hunt, Thomas M. Guterbock, and Herbert L. Stewart. 1997. A Trial of Church-Based Smoking Cessation Interventions for Rural African Americans. Preventive Medicine 26, 1 (1997), 92–101. https://doi.org/10.1006/pmed.1996.9988",
      "doi": ""
    },
    {
      "text": "C Estelle Smith, Avleen Kaur, Katie Z Gach, Loren Terveen, Mary Jo Kreitzer, and Susan O’Conner-Von. 2021. What is Spiritual Support and How Might It Impact the Design of Online Communities?Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–42.",
      "doi": ""
    },
    {
      "text": "C Estelle Smith, Zachary Levonian, Haiwei Ma, Robert Giaquinto, Gemma Lein-Mcdonough, Zixuan Li, Susan O’Conner-Von, and Svetlana Yarosh. 2020. ” I Cannot Do All of This Alone” Exploring Instrumental and Prayer Support in Online Health Communities. ACM Transactions on Computer-Human Interaction (TOCHI) 27, 5(2020), 1–41.",
      "doi": "10.1145/3402855"
    },
    {
      "text": "Elizabeth Stowell, Mercedes C. Lyson, Herman Saksono, Reneé C. Wurth, Holly Jimison, Misha Pavel, and Andrea G. Parker. 2018. Designing and Evaluating MHealth Interventions for Vulnerable Populations: A Systematic Review. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–17. https://doi.org/10.1145/3173574.3173589",
      "doi": "10.1145/3173574.3173589"
    },
    {
      "text": "Elizabeth Stowell, Teresa K. O’Leary, Everlyne Kimani, Michael K. Paasche-Orlow, Timothy Bickmore, and Andrea G. Parker. 2020. Investigating Opportunities for Crowdsourcing in Church-Based Health Interventions: A Participatory Design Study. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376833",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 2014. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Sage Publications, Inc., Thousand Oaks, CA, USA.",
      "doi": ""
    },
    {
      "text": "Robert Joseph Taylor, Linda M Chatters, and Jeff Levin. 2003. Religion in the lives of African Americans: Social, psychological, and health perspectives. Sage Publications, Thousand Oaks.",
      "doi": ""
    },
    {
      "text": "Unity Technologies. 2022. Unity Real-Time Development Platform. https://unity.com/",
      "doi": ""
    },
    {
      "text": "Hayley Thomas, Geoffrey Mitchell, Justin Rich, and Megan Best. 2018. Definition of whole person care in general practice in the English language literature: a systematic review. BMJ open 8, 12 (2018), e023758.",
      "doi": ""
    },
    {
      "text": "Andreas Triantafyllidis, Haridimos Kondylakis, Konstantinos Votis, Dimitrios Tzovaras, Nicos Maglaveras, and Kazem Rahimi. 2019. Features, outcomes, and challenges in mobile health interventions for patients living with chronic diseases: A review of systematic reviews. International Journal of Medical Informatics 132 (2019), 103984. https://doi.org/10.1016/j.ijmedinf.2019.103984",
      "doi": ""
    },
    {
      "text": "Kim M Unertl, Chris L Schaefbauer, Terrance R Campbell, Charles Senteio, Katie A Siek, Suzanne Bakken, and Tiffany C Veinot. 2016. Integrating community-based participatory research and informatics approaches to improve the engagement and health of underserved populations. Journal of the American Medical Informatics Association 23, 1(2016), 60–73.",
      "doi": ""
    },
    {
      "text": "Amy Voida, Ellie Harmon, and Ban Al-Ani. 2011. Homebrew Databases: Complexities of Everyday Information Management in Nonprofit Organizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 915–924. https://doi.org/10.1145/1978942.1979078",
      "doi": "10.1145/1978942.1979078"
    },
    {
      "text": "Amy Voida, Ellie Harmon, and Ban Al-Ani. 2012. Bridging between Organizations and the Public: Volunteer Coordinators’ Uneasy Relationship with Social Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1967–1976. https://doi.org/10.1145/2207676.2208341",
      "doi": ""
    },
    {
      "text": "Fabian Wahle, Tobias Kowatsch, Elgar Fleisch, Michael Rufer, and Steffi Weidt. 2016. Mobile sensing and support for people with depression: a pilot trial in the wild. JMIR mHealth and uHealth 4, 3 (2016), e5960.",
      "doi": ""
    },
    {
      "text": "Sara Wilcox, Marilyn Laken, Thaje Anderson, Melissa Bopp, Deborah Bryant, Rickey Carter, Octavia Gethers, Jeannette Jordan, Lottie McClorin, Kathleen O’Rourke, Allen W. Parrott, Rosetta Swinton, and Antronette Yancey. 2007. The Health-e-AME Faith-Based Physical Activity Initiative: Description and Baseline Findings. Health Promotion Practice 8, 1 (2007), 69–78. https://doi.org/10.1177/1524839905278902 arXiv:https://doi.org/10.1177/1524839905278902PMID: 16885511.",
      "doi": ""
    },
    {
      "text": "Marisol Wong-Villacres, Aakash Gautam, Deborah Tatar, and Betsy DiSalvo. 2021. Reflections on Assets-Based Design: A Journey Towards A Collective of Assets-Based Thinkers. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–32.",
      "doi": "10.1145/3479545"
    },
    {
      "text": "Susan P. Wyche, Paul M. Aoki, and Rebecca E. Grinter. 2008. Re-Placing Faith: Reconsidering the Secular-Religious Use Divide in the United States and Kenya. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 11–20. https://doi.org/10.1145/1357054.1357057",
      "doi": "10.1145/1357054.1357057"
    },
    {
      "text": "Susan P. Wyche, Kelly E. Caine, Benjamin Davison, Micheal Arteaga, and Rebecca E. Grinter. 2008. Sun Dial: Exploring Techno-Spiritual Design through a Mobile Islamic Call to Prayer Application. In CHI ’08 Extended Abstracts on Human Factors in Computing Systems (Florence, Italy) (CHI EA ’08). Association for Computing Machinery, New York, NY, USA, 3411–3416. https://doi.org/10.1145/1358628.1358866",
      "doi": "10.1145/1358628.1358866"
    },
    {
      "text": "Susan P. Wyche, Gillian R. Hayes, Lonnie D. Harvel, and Rebecca E. Grinter. 2006. Technology in Spiritual Formation: An Exploratory Study of Computer Mediated Religious Communications. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work (Banff, Alberta, Canada) (CSCW ’06). Association for Computing Machinery, New York, NY, USA, 199–208. https://doi.org/10.1145/1180875.1180908",
      "doi": "10.1145/1180875.1180908"
    }
  ]
}