{
  "doi": "10.1145/3491102.3517626",
  "title": "Super Size Me: Interface Size, Identity and Embodiment in Digital Musical Instrument Design",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "Digital interfaces are shrinking, driven by pressures of mass production and consumer culture, and often accompanied by a discourse of control, precision or convenience. Meanwhile, human bodies remain the same size, and the changing size of interfaces has implications for the formation of user identities. Drawing on embodied cognition, effort and entanglement theories of HCI, we explored the impact of interface size on the co-constitution of humans and technology. We designed an oversized digital musical instrument and invited musicians to use the instrument to create original performances. We found that both the performances and the musicians’ self-perception were influenced by the large size of the instrument, shining new light on the ways in which designing technology is designing humans and in turn culture.",
  "tags": [
    "embodiment",
    "digital musical instrument",
    "interaction",
    "entanglement",
    "effort",
    "size",
    "interface design"
  ],
  "authors": [
    {
      "name": "Lia Mice",
      "institution": "Centre for Digital Music, Queen Mary University of London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239063",
      "orcid": "missing"
    },
    {
      "name": "Andrew P. McPherson",
      "institution": "Centre for Digital Music, Queen Mary University of London, United Kingdom",
      "img": "/do/10.1145/contrib-81421599247/rel-imgonly/andrew.jpg",
      "acmid": "81421599247",
      "orcid": "0000-0001-9323-9069"
    }
  ],
  "references": [
    {
      "text": "2019. Products of interest. Computer Music Journal 43, 4 (2019), 94–109. https://www.muse.jhu.edu/article/773089",
      "doi": "10.1162/comj_r_00538"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking stock and outlining an agenda for design. In Proceedings of the Special-Interest Group on Computer-Human Interaction Conference on Human Factors in Computing Systems. 1301–1310.",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Eliot Bates. 2012. The social life of musical instruments. Ethnomusicology (2012), 363–395.",
      "doi": ""
    },
    {
      "text": "S. M. Astrid Bin. 2018. The Show Must Go Wrong: Towards an Understanding of Audience Perception of Error in Digital Musical Instrument Performance. Ph.D. Dissertation. Queen Mary University of London, London, UK.",
      "doi": ""
    },
    {
      "text": "Graeme Browning and Robert J. Teather. 2014. Screen scaling: Effects of screen scale on moving target selection. The ACM Conference on Human Factors in Computing Systems (2014), 2053–2058. https://doi.org/10.1145/2559206.2581227",
      "doi": "10.1145/2559206.2581227"
    },
    {
      "text": "Benjamin Carey and Andrew Johnston. 2016. Reflection On Action in NIME Research: Two Complementary Perspectives. In Proceedings of the International Conference on New Interfaces for Musical Expression. Brisbane.",
      "doi": ""
    },
    {
      "text": "Kim Cascone. 2000. The aesthetics of failure:“post-digital” tendencies in contemporary computer music. Computer Music Journal(2000), 12–18.",
      "doi": ""
    },
    {
      "text": "Brigid Mary Costello. 2020. Paying attention to rhythm in HCI: Some thoughts on methods. 32nd Australian Conference on Human-Computer Interaction (2020), 471–480.",
      "doi": "10.1145/3441000.3441005"
    },
    {
      "text": "Sofia Dahl, Frédéric Bevilacqua, Roberto Bresin, Martin Clayton, Laura Leante, Isabella Poggi, and Nicholas Rasamimanana. 2010. Gestures in performance. In Musical gestures: Sound, movement, and meaning, Rolf Inge Godøy and Marc Leman (Eds.). Routledge, Chapter 3, 36–68.",
      "doi": ""
    },
    {
      "text": "Peter Dalsgaard and Lone Koefoed Hansen. 2008. Performing perception—Staging aesthetics of interaction. ACM Transactions on Computer-Human Interaction 15 (2008), 1–33.",
      "doi": "10.1145/1453152.1453156"
    },
    {
      "text": "Jessica T DeCuir-Gunby, Patricia L Marshall, and Allison W McCulloch. 2011. Developing and using a codebook for the analysis of interview data: An example from a professional development research project. Field Methods 23, 2 (2011), 1–33.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2001. Where the Action Is. MIT Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger. 2019. Entanglement HCI the next wave?ACM Transactions on Computer-Human Interaction 27, Article 2 (November 2019), 27 pages. https://dl.acm.org/doi/10.1145/3364998",
      "doi": ""
    },
    {
      "text": "Emma Frid, Hans Lindetorp, Kjetil Falkenberg Hansen, Ludvig Elblaus, and Roberto Bresin. 2019. Sound forest: Evaluation of an accessible multisensory music installation. In CHI ’19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300907"
    },
    {
      "text": "Shaun Gallagher. 2005. How the Body Shapes the Mind. Oxford University Press, Oxford.",
      "doi": ""
    },
    {
      "text": "Sarah-Indriyati Hardjowirogo. 2017. Instrumentality. On the construction of instrumental identity. Springer Singapore, Singapore, 9–24. https://doi.org/10.1007/978-981-10-2951-6_2",
      "doi": ""
    },
    {
      "text": "David Harel. 1979. Meeting the Universe Halfway: Quantum Physics and the Entanglement of Matter and Meaning. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Martin Heidegger. 1962. Being and Time (John Macquarrie and Edward Robinson, Trans.). Harper & Row, New York.",
      "doi": ""
    },
    {
      "text": "Simon Holland, Katie Wilkie, Paul Mulholland, and Allan Seago. 2013. Music Interaction: Understanding Music and Human-Computer Interaction. Springer, 1–28.",
      "doi": ""
    },
    {
      "text": "Sarah Homewood, Amanda Karlsson, and Anna Vallgarda. 2020. Removal as a method: A fourth-wave HCI approach to understanding the experience of self-tracking. In Proceedings of the 2020 ACM Conference on Designing Interactive Systems. 1779–1791.",
      "doi": "10.1145/3357236.3395425"
    },
    {
      "text": "Sarah Homewood, Marika Medemyr, Ranten Fagerberg, and Susan Kozel. 2021. Tracing conceptions of the body in HCI: From user to more-than-human. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445656"
    },
    {
      "text": "Kristina Höök. 2018. Designing with the Body: Somaesthetic Interaction Design. MIT Press.",
      "doi": ""
    },
    {
      "text": "Don Ihde. 2022. Human beginnings and music. Sound and Affect: Voice, Music, World(2022), 99–107. https://dl.acm.org/doi/10.1145/3411764.3445656",
      "doi": ""
    },
    {
      "text": "David A. Jaffe and Julius O. Smith. 1983. Extensions of the Karplus-Strong plucked-string algorithm. Computer Music Journal(1983).",
      "doi": ""
    },
    {
      "text": "Sergi Jordà. 2001. Instruments and Players: Some Thoughts on Digital Lutherie. Journal of New Music Research 33 (2001), 321–341.",
      "doi": ""
    },
    {
      "text": "Ki Joon Kim, S. Shyam Sundar, and Eunil Park. 2011. The effects of screen-size and communication modality on psychology of mobile device users. CHI’11 Extended Abstracts on Human Factors in Computing Systems (2011), 1207–1212.",
      "doi": ""
    },
    {
      "text": "Volker Krefeld and Michel Waisvisz. 1990. The hand in the web: An interview with Michel Waisvisz. Computer Music Journal 14, 2 (1990), 28–33.",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 1996. On actor-network theory: A few clarifications. Soziale Welt (1996), 369–381. http://www.jstor.org/stable/40878163",
      "doi": ""
    },
    {
      "text": "Marc Leman. 2008. Embodied Music Cognition and Mediation Technology. MIT Press.",
      "doi": "10.5555/1296232"
    },
    {
      "text": "Micheline Lesaffre, Pieter-Jan Maes, and Marc Leman. 2017. The Routledge Companion to Embodied Music Interaction. Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Lian Loke and Thecla Schiphorst. 2018. The somatic turn in human-computer interaction. Contemporary Music Review 25 (2018), 54–5863.",
      "doi": ""
    },
    {
      "text": "Thor Magnusson. 2009. Of epistemic tools: Musical instruments as cognitive extensions. Organised Sound 14, 2 (2009), 168–176.",
      "doi": "10.1017/S1355771809000272"
    },
    {
      "text": "Thor Magnusson. 2010. Designing constraints: Composing and performing with digital musical systems. Computer Music Journal(2010), 62–73.",
      "doi": ""
    },
    {
      "text": "Adnan Marquez-Borbon. 2016. Perceptual learning and the emergence of performer-instrument interactions with digital music systems. In Proceedings of a body of knowledge - Embodied cognition and the arts conference. Irvine.",
      "doi": ""
    },
    {
      "text": "Andrew P. McPherson, Fabio Morreale, and Jacob Harrison. 2019. Musical instruments for novices: Comparing NIME, HCI and crowdfunding approaches. Springer.",
      "doi": ""
    },
    {
      "text": "Lia Mice and Andrew P. McPherson. 2019. Embodied cognition in performers of large acoustic instruments as a method of designing new large digital musical instruments. In Proceedings of the 14th International Symposium on Computer Music Multidisciplinary Research. Marseille.",
      "doi": ""
    },
    {
      "text": "Giulio Moro, S. M. Astrid Bin, Robert H. Jack, Christian Heinrichs, and Andrew P. McPherson. 2016. Making high-performance embedded instruments with Bela and Pure Data. Proceedings of the International Conference on Live Interfaces (2016), 6948–6959.",
      "doi": ""
    },
    {
      "text": "Tom Mudd, Simon Holland, and Paul Mulholland. 2019. Nonlinear dynamical processes in musical interactions: Investigating the role of nonlinear dynamics in supporting surprise and exploration in interactions with digital musical instruments. International Journal of Human-Computer Studies 128 (2019), 27–40. https://doi.org/10.1016/j.ijhcs.2019.02.008",
      "doi": "10.1016/j.ijhcs.2019.02.008"
    },
    {
      "text": "Max Neupert and Clemens Wegener. 2019. Interacting with digital resonators by acoustic excitation. In Proceedings of the 16th Sound & Music Computing Conference. Málaga, 80–81.",
      "doi": ""
    },
    {
      "text": "Luc Nijs, Micheline Lesaffre, and Marc Leman. 2009. The musical instrument as a natural extension of the musician. The 5th Conference of Interdisciplinary Musicology (2009), 132–133.",
      "doi": ""
    },
    {
      "text": "Donald A. Norman and Stephen W. Draper (Eds.). 1986. User Centered System Design: New Perspectives on Human-Computer Interaction (1st. ed.). CRC Press, Hillsdale, N.J.",
      "doi": ""
    },
    {
      "text": "Jimmie Paloranta, Anders Lundström, Ludvig Elblaus, Roberto Bresin, and Emma Frid. 2016. Interaction with a large sized augmented string instrument intended for a public setting. Sound and Music Computing 2016(2016), 388–395.",
      "doi": ""
    },
    {
      "text": "Miller Puckette. 1997. Pure Data: Another integrated computer music environment. In Proceedings of the Second Intercollege Computer Music Concerts. Tachikawa, 37–41.",
      "doi": ""
    },
    {
      "text": "Johan Redström. 2006. Towards user design? On the shift from object to user as the subject of design. Design Studies 27(2006), 123–139.",
      "doi": ""
    },
    {
      "text": "Jennifer A. Rode. 2011. A theoretical agenda for feminist HCI. Interacting with Computers(2011), 393–400.",
      "doi": ""
    },
    {
      "text": "Matthew Rodger, Paul Stapleton, Maarten Walstijn, Miguel Ortiz, and Laurel S. Pardue. 2020. What makes a good musical instrument? A matter of processes, ecologies and specificities. In Proceedings of the International Conference on New Interfaces for Musical Expression. 405–410.",
      "doi": ""
    },
    {
      "text": "Gery W. Ryan and H. Russell Bernard. 2003. Techniques to identify themes. Field Methods (2003), 85–109.",
      "doi": ""
    },
    {
      "text": "Joel Ryan. 1991. Some remarks on musical instrument design at STEIM. Contemporary Music Review(1991), 3–17. https://doi.org/10.1080/07494469100640021",
      "doi": ""
    },
    {
      "text": "Jonathan De Souza. 2017. Music at Hand: Instruments, Bodies, and Cognition. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Katta Speil. 2021. The bodies of TEI – Investigating norms and assumptions in the design of embodied interaction. TEI ’21: Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction (2021), 1–19. https://doi.org/10.1145/3430524.3440651",
      "doi": "10.1145/3430524.3440651"
    },
    {
      "text": "Lucy Suchman. 1979. Plans and Situated Actions. University Press, Cambridge.",
      "doi": "10.5555/1212951"
    },
    {
      "text": "David Sudnow. 1979. Talk’s Body: A Meditation Between Two Keyboards (1st. ed.). Alfred A. Knopf, Inc., New York.",
      "doi": ""
    },
    {
      "text": "Björn van der Hoort, Arvid Guterstam, and H. Henrik Ehrsson. 2011. Being Barbie: The size of one’s own body determines the perceived size of the world. Plos One (2011). https://doi.org/10.1371/journal.pone.0020195",
      "doi": ""
    },
    {
      "text": "Peter-Paul Verbeek. 2015. Beyond interaction: A short introduction to mediation theory. Interactions 22(2015), 26–31.",
      "doi": "10.1145/2751314"
    },
    {
      "text": "Roel Vertegaal, Tamas Ungvary, and Michael Kieslinger. 1996. Towards a musician’s cockpit: Transducers, feedback and musical function. In Proceedings of the 1996 International Computer Music Conference, Vol. 96. 308–311.",
      "doi": ""
    },
    {
      "text": "Simon Waters. 2013. Touching at a distance: Resistance, tactility, proxemics and the development of a hybrid virtual/physical performance system. Contemporary Music Review(2013), 119–134. https://doi.org/10.1080/07494467.2013.775818",
      "doi": ""
    },
    {
      "text": "Simon Waters. 2021. The entanglements which make instruments musical: Rediscovering sociality. Journal of New Music Research 50 (March 2021), 133-146 pages. https://doi.org/10.1080/09298215.2021.1899247",
      "doi": ""
    },
    {
      "text": "Johannes Zagermann, Ulrike Pfeil, Daniel Fink, Philipp von Bauer, and Harald Reiterer. 2017. Memory in motion: The influence of gesture- and touch-based input modalities on spatial memory. CHI’16: CHI Conference on Human Factors in Computing Systems (2017), 1899–1910.",
      "doi": ""
    },
    {
      "text": "Johannes Zagermann, Ulrike Pfeil, Roman Rädle, Hans-Christian Jetter, Clemens Klokmose, and Harald Reiterer. 2016. When tablets meet tabletops: The effect of tabletop size on around-the-table collaboration with personal tablets. CHI’16: CHI Conference on Human Factors in Computing Systems (2016). https://doi.org/10.1145/2858036.2858224",
      "doi": "10.1145/2858036.2858224"
    }
  ]
}