{
  "doi": "10.1145/3491102.3517562",
  "title": "Bringing Patient Mannequins to Life: 3D Projection Enhances Nursing Simulation",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "Mannequin-based simulations are widely used to train novice nurses. However, current mannequins have no dynamic facial expressions, which decreases the mannequins’ fidelity and impacts students’ learning outcomes and experience. This study proposes a projection-based AR system for overlaying dynamic facial expressions on a mannequin and implements the system in a stroke simulation. Thirty-six undergraduate nursing students participated in the study and were equally divided into the control (without the system) and experimental group (with the system). The participants’ gaze behavior, simulation performance, and subjective evaluation were measured. Results illustrated that the participants focused more on the face-animated mannequin than the traditional mannequin during the simulation. Nursing experts believed that the face-animated mannequin increased the participants’ performance in recognizing deviations but decreased their performance in seeking additional information. Moreover, the participants reported that the face-animated mannequin was more interactive and helpful for performing appropriate assessments than the traditional mannequin.",
  "authors": [
    {
      "name": "Guoyang Zhou",
      "institution": "School of Industrial Engineering, Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261793",
      "orcid": "missing"
    },
    {
      "name": "Amy Nagle",
      "institution": "School of Nursing, Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240014",
      "orcid": "missing"
    },
    {
      "name": "George Takahashi",
      "institution": "Purdue Envision Center, Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238391",
      "orcid": "missing"
    },
    {
      "name": "Tera Hornbeck",
      "institution": "School of Nursing, Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234176",
      "orcid": "missing"
    },
    {
      "name": "Ann Loomis",
      "institution": "School of Nursing, Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235192",
      "orcid": "missing"
    },
    {
      "name": "Beth Smith",
      "institution": "School of Nursing, Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237871",
      "orcid": "missing"
    },
    {
      "name": "Bradley Duerstock",
      "institution": "Weldon School of Biomedical Engineering, Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100625763",
      "orcid": "missing"
    },
    {
      "name": "Denny Yu",
      "institution": "School of Industrial Engineering, Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659246649",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "James S. Aber, Irene Marzolff, and Johannes B. Ries. 2010. Chapter 3 - Photogrammetry. In Small-Format Aerial Photography, James S. Aber, Irene Marzolff, and Johannes B. Ries (Eds.). Elsevier, Amsterdam, 23–39. https://doi.org/10.1016/B978-0-444-53260-2.10003-1",
      "doi": ""
    },
    {
      "text": "Eleni Adamopoulou and Lefteris Moussiades. 2020. An Overview of Chatbot Technology. Artificial Intelligence Applications and Innovations: 16th IFIP WG 12.5 International Conference, AIAI 2020, Neos Marmaras, Greece, June 5–7, 2020, Proceedings, Part II 584 (06 May 2020), 373–383. https://doi.org/10.1007/978-3-030-49186-4_31 PMC7256567[pmcid].",
      "doi": ""
    },
    {
      "text": "Katie Anne Adamson, Paula Gubrud, Stephanie Sideras, and Kathie Lasater. 2012. Assessing the Reliability, Validity, and Use of the Lasater Clinical Judgment Rubric: Three Approaches. Journal of Nursing Education 51, 2 (2012), 66–73. https://doi.org/10.3928/01484834-20111130-03",
      "doi": ""
    },
    {
      "text": "Mohsen Adib-Hajbaghery and Najmeh Sharifi. 2017. Effect of simulation training on the development of nurses and nursing students’ critical thinking: A systematic literature review. Nurse Education Today 50(2017), 17–24. https://doi.org/10.1016/j.nedt.2016.12.011",
      "doi": ""
    },
    {
      "text": "Michelle Aebersold, Terri Voepel-Lewis, Leila Cherara, Monica Weber, Christina Khouri, Robert Levine, and Alan R. Tait. 2018. Interactive Anatomy-Augmented Virtual Simulation Training. Clinical simulation in nursing 15 (Feb 2018), 34–41. https://doi.org/10.1016/j.ecns.2017.09.008 PMC5978424[pmcid].",
      "doi": ""
    },
    {
      "text": "Ehsan Azimi, Alexander Winkler, Emerson Tucker, Long Qian, Jayfus Doswell, Nassir Navab, and Peter Kazanzides. 2018. Can Mixed-Reality Improve the Training of Medical Procedures?. In 2018 40th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). 4065–4068. https://doi.org/10.1109/EMBC.2018.8513387",
      "doi": ""
    },
    {
      "text": "Ushasree Bobba, Ashok Munivenkatappa, and Amit Agrawal. 2019. Speech and Language Dysfunctions in Patients with Cerebrocortical Disorders Admitted in a Neurosurgical Unit. Asian journal of neurosurgery 14, 1 (2019), 87–89. https://doi.org/10.4103/ajns.AJNS_240_17 PMC6417298[pmcid].",
      "doi": ""
    },
    {
      "text": "M. Borys and M. Plechawska-Wójcik. 2017. Eye-tracking metrics in perception and visual attention research.",
      "doi": ""
    },
    {
      "text": "Allana M. Brown. 2015. Simulation in Undergraduate Mental Health Nursing Education: A Literature Review. Clinical Simulation in Nursing 11, 10 (2015), 445–449. https://doi.org/10.1016/j.ecns.2015.08.003",
      "doi": ""
    },
    {
      "text": "Zenobia CY Chan. 2013. A qualitative study on non-verbal sensitivity in nursing students. Journal of Clinical Nursing 22, 13-14 (2013), 1941–1950. https://doi.org/10.1111/j.1365-2702.2012.04324.x",
      "doi": ""
    },
    {
      "text": "Feng-Qin Chen, Yu-Fei Leng, Jian-Feng Ge, Dan-Wen Wang, Cheng Li, Bin Chen, and Zhiling Sun. 2020. Effectiveness of Virtual Reality in Nursing Education: Meta-Analysis. Journal of Medical Internet Research 22 (2020).",
      "doi": ""
    },
    {
      "text": "Pietro Cipresso, Irene Alice Chicchi Giglioli, Mariano Alcañiz Raya, and Giuseppe Riva. 2018. The Past, Present, and Future of Virtual and Augmented Reality Research: A Network and Cluster Analysis of the Literature. Frontiers in Psychology 9 (2018). https://doi.org/10.3389/fpsyg.2018.02086",
      "doi": ""
    },
    {
      "text": "Pietro Cipresso, Irene Alice Chicchi Giglioli, Mariano Alcañiz Raya, and Giuseppe Riva. 2018. The Past, Present, and Future of Virtual and Augmented Reality Research: A Network and Cluster Analysis of the Literature. Frontiers in psychology 9 (06 Nov 2018), 2086–2086. https://doi.org/10.3389/fpsyg.2018.02086 PMC6232426[pmcid].",
      "doi": ""
    },
    {
      "text": "Avivit Golan Cohen, Eliezer Kitai, Shaul Ben David, and Amitai Ziv. 2014. Standardized Patient–Based Simulation Training as a Tool to Improve the Management of Chronic Disease. Simulation in Healthcare 9, 1 (2014). https://journals.lww.com/simulationinhealthcare/Fulltext/2014/02000/Standardized_Patient_Based_Simulation_Training_as.6.aspx",
      "doi": ""
    },
    {
      "text": "Salam Daher, Jason Hochreiter, Nahal Norouzi, Laura Gonzalez, Gerd Bruder, and Greg Welch. 2018. Physical-Virtual Agents for Healthcare Simulation. In Proceedings of the 18th International Conference on Intelligent Virtual Agents (Sydney, NSW, Australia) (IVA ’18). Association for Computing Machinery, New York, NY, USA, 99–106. https://doi.org/10.1145/3267851.3267876",
      "doi": "10.1145/3267851.3267876"
    },
    {
      "text": "Rashmi Datta, KK Upadhyay, and CN Jaideep. 2012. Simulation and its role in medical education. Medical Journal Armed Forces India 68, 2 (2012), 167–172. https://doi.org/10.1016/S0377-1237(12)60040-9",
      "doi": ""
    },
    {
      "text": "Parvati Dev, Wm.Leroy Heinrichs, and Patricia Youngblood. 2011. CliniSpace™: A Multiperson 3D Online Immersive Training Environment Accessible through a Browser. Studies in health technology and informatics 163 (01 2011), 173–9.",
      "doi": ""
    },
    {
      "text": "Xianghua Ding, Yanqi Jiang, Xiankang Qin, Yunan Chen, Wenqiang Zhang, and Lizhe Qi. 2019. Reading Face, Reading Health: Exploring Face Reading Technologies for Everyday Health. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300435",
      "doi": ""
    },
    {
      "text": "Eric S. Donkor. 2018. Stroke in the 21(st) Century: A Snapshot of the Burden, Epidemiology, and Quality of Life. Stroke research and treatment 2018 (27 Nov 2018), 3238165–3238165. https://doi.org/10.1155/2018/3238165 PMC6288566[pmcid].",
      "doi": ""
    },
    {
      "text": "Shanna Fealy, Donovan Jones, Alison Hutton, Kristen Graham, Liz McNeill, Linda Sweet, and Michael Hazelton. 2019. The integration of immersive virtual reality in tertiary nursing and midwifery education: A scoping review. Nurse Education Today 79(2019), 14–19. https://doi.org/10.1016/j.nedt.2019.05.002",
      "doi": ""
    },
    {
      "text": "Howard S. Friedman. 1979. Nonverbal Communication Between Patients and Medical Practitioners. Journal of Social Issues 35, 1 (1979), 82–99. https://doi.org/10.1111/j.1540-4560.1979.tb00790.x",
      "doi": ""
    },
    {
      "text": "Yaohua Gu, Zhijie Zou, and Xiaoli Chen. 2017. The Effects of vSIM for Nursing™ as a Teaching Strategy on Fundamentals of Nursing Education in Undergraduates. Clinical Simulation in Nursing 13, 4 (2017), 194–197. https://doi.org/10.1016/j.ecns.2017.01.005",
      "doi": ""
    },
    {
      "text": "Judith A. Hall, Jinni A. Harrigan, and Robert Rosenthal. 1995. Nonverbal behavior in clinician—patient interaction. Applied and Preventive Psychology 4, 1 (1995), 21–37. https://doi.org/10.1016/S0962-1849(05)80049-6",
      "doi": ""
    },
    {
      "text": "Jorunn A. Handeland, Andreas Prinz, Else Mari R. Ekra, and Mariann Fossum. 2021. The role of manikins in nursing students’ learning: A systematic review and thematic metasynthesis. Nurse Education Today 98(2021), 104661. https://doi.org/10.1016/j.nedt.2020.104661",
      "doi": ""
    },
    {
      "text": "Stephen G. Henry, Andrea Fuhrel-Forbis, Mary A.M. Rogers, and Susan Eggly. 2012. Association between nonverbal communication during clinical interactions and outcomes: A systematic review and meta-analysis. Patient Education and Counseling 86, 3 (2012), 297–315. https://doi.org/10.1016/j.pec.2011.07.006",
      "doi": ""
    },
    {
      "text": "Tsung-yen Hsieh, Brian Cervenka, Raj Dedhia, Edward Bradley Strong, and Toby Steele. 2018. Assessment of a Patient-Specific, 3-Dimensionally Printed Endoscopic Sinus and Skull Base Surgical Model. JAMA Otolaryngology–Head and Neck Surgery 144, 7 (07 2018), 574–579. https://doi.org/10.1001/jamaoto.2018.0473",
      "doi": ""
    },
    {
      "text": "Cynthia Huang, Jonathan Thomas, Abdullah Alismail, Avi Cohen, Waleed Almutairi, Noha Daher, Michael Terry, and Laren Tan. 2018. The use of augmented reality glasses in central line simulation: ”see one, simulate many, do one competently, and teach everyone”. Advances in Medical Education and Practice Volume 9 (05 2018), 357–363. https://doi.org/10.2147/AMEP.S160704",
      "doi": ""
    },
    {
      "text": "Yuchi Huang and Saad M. Khan. 2017. DyadGAN: Generating Facial Expressions in Dyadic Interactions. In 2017 IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW). 2259–2266. https://doi.org/10.1109/CVPRW.2017.280",
      "doi": ""
    },
    {
      "text": "C.L. Huston, B. Phillips, P. Jeffries, C. Todero, J. Rich, P. Knecht, S. Sommer, and M.P. Lewis. 2018. The academic-practice gap: Strategies for an enduring problem. Nursing Forum 53, 1 (2018), 27–34. https://doi.org/10.1111/nuf.12216 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/nuf.12216",
      "doi": ""
    },
    {
      "text": "Muna Irfan, Nauman Tariq, Haitham Hussein, Lisa Fitzgerald-Swenson, Danielle Hart, and Ezgi Tiryaki. 2015. Stroke Code Simulation for Medical Education. MedEdPORTAL 11(2015). https://doi.org/10.15766/mep_2374-8265.10009",
      "doi": ""
    },
    {
      "text": "Robert J.K. Jacob and Keith S. Karn. 2003. Commentary on Section 4 - Eye Tracking in Human-Computer Interaction and Usability Research: Ready to Deliver the Promises. In The Mind’s Eye, J. Hyönä, R. Radach, and H. Deubel (Eds.). North-Holland, Amsterdam, 573–605. https://doi.org/10.1016/B978-044451020-4/50031-1",
      "doi": ""
    },
    {
      "text": "Carole E. Jenson and Diane McNally Forsyth. 2012. Virtual Reality Simulation: Using Three-dimensional Technology to Teach Nursing Students. CIN: Computers, Informatics, Nursing 30, 6 (2012). https://journals.lww.com/cinjournal/Fulltext/2012/06000/Virtual_Reality_Simulation__Using.6.aspx",
      "doi": ""
    },
    {
      "text": "Michelle K. Jetha and Sidney J. Segalowitz. 2012. Chapter 3 - Social and Emotional Development. In Adolescent Brain Development, Michelle K. Jetha and Sidney J. Segalowitz (Eds.). Academic Press, San Diego, 25–52. https://doi.org/10.1016/B978-0-12-397916-2.00003-7",
      "doi": ""
    },
    {
      "text": "Jussi M. Kärkkäinen, Giuliano Sandri, Emanuel R. Tenorio, Amy Alexander, Karen Bjellum, Jane Matsumoto, Jonathan Morris, Bernardo C. Mendes, Randall R. DeMartino, and Gustavo S. Oderich. 2019. Simulation of Endovascular Aortic Repair Using 3D Printed Abdominal Aortic Aneurysm Model and Fluid Pump. CardioVascular and Interventional Radiology 42, 11 (01 Nov 2019), 1627–1634. https://doi.org/10.1007/s00270-019-02257-y",
      "doi": ""
    },
    {
      "text": "Dawn O. Kleindorfer, Rosie Miller, Charles J. Moomaw, Kathleen Alwell, Joseph P. Broderick, Jane Khoury, Daniel Woo, Matthew L. Flaherty, Tarek Zakaria, and Brett M. Kissela. 2007. Designing a Message for Public Education Regarding Stroke. Stroke 38, 10 (2007), 2864–2868. https://doi.org/10.1161/STROKEAHA.107.484329",
      "doi": ""
    },
    {
      "text": "Konstantinos Koukourikos, Areti Tsaloglidou, Lambrini Kourkouta, Ioanna V. Papathanasiou, Christos Iliadis, Aikaterini Fratzana, and Aspasia Panagiotou. 2021. Simulation in Clinical Nursing Education. Acta informatica medica : AIM : journal of the Society for Medical Informatics of Bosnia & Herzegovina : casopis Drustva za medicinsku informatiku BiH 29, 1 (Mar 2021), 15–20. https://doi.org/10.5455/aim.2021.29.15-20 PMC8116070[pmcid].",
      "doi": ""
    },
    {
      "text": "Lambrini Kourkouta and Ioanna V. Papathanasiou. 2014. Communication in nursing practice. Materia socio-medica 26, 1 (Feb 2014), 65–67. https://doi.org/10.5455/msm.2014.26.65-67 PMC3990376[pmcid].",
      "doi": ""
    },
    {
      "text": "Yanika Kowitlawakul, Yeow Leng Chow, Zakir Hussian Abdul Salam, and Jeanette Ignacio. 2015. Exploring the use of standardized patients for simulation-based learning in preparing advanced practice nurses. Nurse Education Today 35, 7 (2015), 894–899. https://doi.org/10.1016/j.nedt.2015.03.004",
      "doi": ""
    },
    {
      "text": "Kathie Lasater. 2007. High-Fidelity Simulation and the Development of Clinical Judgment: Students’ Experiences. The Journal of nursing education 46 (07 2007), 269–76. https://doi.org/10.3928/01484834-20070601-06",
      "doi": ""
    },
    {
      "text": "Kathie Lasater, Ann E Nielsen, Mary Stock, and Tanya L Ostrogorsky. 2015. Evaluating the Clinical Judgment of Newly Hired Staff Nurses. Journal of continuing education in nursing 46, 12 (December 2015), 563—571. https://doi.org/10.3928/00220124-20151112-09",
      "doi": ""
    },
    {
      "text": "Kay Lawrence, DeAnne K. Hilfinger Messias, and Melanie L. Cason. 2018. Practice of high fidelity simulation use in baccalaureate nursing programs. Nursing Forum 53, 4 (2018), 504–510. https://doi.org/10.1111/nuf.12279",
      "doi": ""
    },
    {
      "text": "Jaewoon Lee, Yeonjin Kim, Myeong-Hyeon Heo, Dongho Kim, and Byeong-Seok Shin. 2015. Real-Time Projection-Based Augmented Reality System for Dynamic Objects in the Performing Arts. Symmetry 7, 1 (2015), 182–192. https://doi.org/10.3390/sym7010182",
      "doi": ""
    },
    {
      "text": "Jin Lee and Pok-Ja Oh. 2015. Effects of the Use of High-Fidelity Human Simulation in Nursing Education: A Meta-Analysis. The Journal of nursing education 54, 9 (September 2015), 501—507. https://doi.org/10.3928/01484834-20150814-04",
      "doi": ""
    },
    {
      "text": "Kim Leighton. 2015. Development of the Clinical Learning Environment Comparison Survey. Clinical Simulation in Nursing 11, 1 (2015), 44–51. https://doi.org/10.1016/j.ecns.2014.11.002 SI: Works of Doctoral Students and Recent Graduates.",
      "doi": ""
    },
    {
      "text": "Yang-Mei Li, Hong-Zhi Yang, Wei-Bing Guan, Qian-Shan Ke, Min Dai, He-Ping Xie, and Shi-Jun Zhang. 2008. Therapeutic effect of traditional Chinese medicine on coagulation disorder and accompanying intractable jaundice in hepatitis B virus-related liver cirrhosis patients. World journal of gastroenterology 14, 39 (21 Oct 2008), 6060–6064. https://doi.org/10.3748/wjg.14.6060 PMC2760192[pmcid].",
      "doi": ""
    },
    {
      "text": "Ci-Jyun Liang, Charles Start, Hanna Boley, Vineet R. Kamat, Carol C. Menassa, and Michelle Aebersold. 2020. Enhancing stroke assessment simulation experience in clinical training using augmented reality. Virtual Reality (09 Oct 2020). https://doi.org/10.1007/s10055-020-00475-1",
      "doi": ""
    },
    {
      "text": "Kartik Logishetty, Luke Western, Ruairidh Morgan, Farhad Iranpour, Justin P. Cobb, and Edouard Auvinet. 2019. Can an Augmented Reality Headset Improve Accuracy of Acetabular Cup Orientation in Simulated THA? A Randomized Trial. Clinical Orthopaedics and Related Research® 477, 5(2019). https://journals.lww.com/clinorthop/Fulltext/2019/05000/Can_an_Augmented_Reality_Headset_Improve_Accuracy.44.aspx",
      "doi": ""
    },
    {
      "text": "Christine L. Mai, Demian Szyld, and Jeffrey B. Cooper. 2019. 53 - Simulation in Pediatric Anesthesia. In A Practice of Anesthesia for Infants and Children (Sixth Edition) (sixth edition ed.), Charles J. Coté, Jerrold Lerman, and Brian J. Anderson (Eds.). Elsevier, Philadelphia, 1204–1211.e2. https://doi.org/10.1016/B978-0-323-42974-0.00053-7",
      "doi": ""
    },
    {
      "text": "Guido Makransky, Thomas S. Terkildsen, and Richard E. Mayer. 2019. Adding immersive virtual reality to a science lab simulation causes more presence but less learning. Learning and Instruction 60 (2019), 225–236. https://doi.org/10.1016/j.learninstruc.2017.12.007",
      "doi": ""
    },
    {
      "text": "Rana Halabi Najjar, Bret Lyman, and Nick Miehl. 2015. Nursing Students’ Experiences with High-Fidelity Simulation. International Journal of Nursing Education Scholarship 12, 1(2015), 27–35. https://doi.org/doi:10.1515/ijnes-2015-0010",
      "doi": ""
    },
    {
      "text": "Marcus B. Nicol and Amanda G. Thrift. 2005. Knowledge of risk factors and warning signs of stroke. Vascular health and risk management 1, 2 (2005), 137–147. https://doi.org/10.2147/vhrm.1.2.137.64085 PMC1993942[pmcid].",
      "doi": ""
    },
    {
      "text": "Azlisham Mohd Nor, John Davis, Bas Sen, Dean Shipsey, Stephen J Louw, Alexander G Dyker, Michelle Davis, and Gary A Ford. 2005. The Recognition of Stroke in the Emergency Room (ROSIER) scale: development and validation of a stroke recognition instrument. The Lancet Neurology 4, 11 (2005), 727–734. https://doi.org/10.1016/S1474-4422(05)70201-5",
      "doi": ""
    },
    {
      "text": "Roohangiz Norouzinia, Maryam Aghabarari, Maryam Shiri, Mehrdad Karimi, and Elham Samami. 2015. Communication Barriers Perceived by Nurses and Patients. Global journal of health science 8, 6 (28 Sep 2015), 65–74. https://doi.org/10.5539/gjhs.v8n6p65 PMC4954910[pmcid].",
      "doi": ""
    },
    {
      "text": "Pok-Ja Oh, Kyeong Deok Jeon, and Myung Suk Koh. 2015. The effects of simulation-based learning using standardized patients in nursing students: A meta-analysis. Nurse Education Today 35, 5 (2015), e6–e15. https://doi.org/10.1016/j.nedt.2015.01.019",
      "doi": ""
    },
    {
      "text": "Dinker. Pai. 2018. Use of simulation for undergraduate medical education. International Journal of Advanced Medical and Health Research 5, 1(2018), 3–6. https://doi.org/10.4103/IJAMR.IJAMR_63_17",
      "doi": ""
    },
    {
      "text": "Kenneth M. Prkachin. 2009. Assessing pain by facial expression: facial expression as nexus. Pain research & management 14, 1 (2009), 53–58. https://doi.org/10.1155/2009/542964 PMC2706565[pmcid].",
      "doi": ""
    },
    {
      "text": "Iulian Radu. 2014. Augmented reality in education: a meta-review and cross-media analysis. Personal and Ubiquitous Computing 18, 6 (01 Aug 2014), 1533–1543. https://doi.org/10.1007/s00779-013-0747-y",
      "doi": ""
    },
    {
      "text": "Lauryn R. Rochlen, Robert Levine, and Alan R. Tait. 2017. First-Person Point-of-View-Augmented Reality for Central Line Insertion Training: A Usability and Feasibility Study. Simulation in healthcare : journal of the Society for Simulation in Healthcare 12, 1 (Feb 2017), 57–62. https://doi.org/10.1097/SIH.0000000000000185 PMC5285452[pmcid].",
      "doi": ""
    },
    {
      "text": "Daniel Salber and Joëlle Coutaz. 1993. Applying the Wizard of Oz technique to the study of multimodal systems. In Human-Computer Interaction, Leonard J. Bass, Juri Gornostaev, and Claus Unger (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 219–230.",
      "doi": ""
    },
    {
      "text": "Joseph Samosky, Douglas Nelson, Bo Wang, Russell Bregman, Andrew Hosmer, Brandon Mikulis, and Robert Weaver. 2012. BodyExplorerAR: Enhancing a mannequin medical simulator with sensing and projective augmented reality for exploring dynamic anatomy and physiology. Proceedings of the 6th International Conference on Tangible, Embedded and Embodied Interaction, TEI 2012, 263–270. https://doi.org/10.1145/2148131.2148187",
      "doi": "10.1145/2148131.2148187"
    },
    {
      "text": "Zohreh Sharafi, Zéphyrin Soh, and Yann-Gaël Guéhéneuc. 2015. A systematic literature review on the usage of eye-tracking in software engineering. Information and Software Technology 67 (2015), 79–107. https://doi.org/10.1016/j.infsof.2015.06.008",
      "doi": "10.1016/j.infsof.2015.06.008"
    },
    {
      "text": "Shefaly Shorey and Esperanza Debby Ng. 2021. The use of virtual reality simulation among nursing students and registered nurses: A systematic review. Nurse Education Today 98(2021), 104662. https://doi.org/10.1016/j.nedt.2020.104662",
      "doi": ""
    },
    {
      "text": "Oxford Medical Simulation. 2018. Virtual Reality Nursing Simulation. https://oxfordmedicalsimulation.com/product/vr-nursing-simulation/",
      "doi": ""
    },
    {
      "text": "Chase Tenewitz, Rebecca T. Le, Mauricio Hernandez, Saif Baig, and Travis E. Meyer. 2021. Systematic review of three-dimensional printing for simulation training of interventional radiology trainees. 3D Printing in Medicine 7, 1 (21 Apr 2021), 10. https://doi.org/10.1186/s41205-021-00102-y",
      "doi": ""
    },
    {
      "text": "Janelle L Theisen and Kristin E Sandau. 2013. Competency of new graduate nurses: a review of their weaknesses and strategies for success. Journal of continuing education in nursing 44, 9 (September 2013), 406—414. https://doi.org/10.3928/00220124-20130617-38",
      "doi": ""
    },
    {
      "text": "Mark Thielen, Rohan Joshi, Frank Delbressine, Sidarto Bambang Oetomo, and Loe Feijs. 2017. An innovative design for cardiopulmonary resuscitation manikins based on a human-like thorax and embedded flow sensors. Proceedings of the Institution of Mechanical Engineers. Part H, Journal of engineering in medicine 231, 3 (Mar 2017), 243–249. https://doi.org/10.1177/0954411917691555 PMC5363502[pmcid].",
      "doi": ""
    },
    {
      "text": "I. O. Torres and N. De Luccia. 2017. A simulator for training in endovascular aneurysm repair: The use of three dimensional printers. European Journal of Vascular and Endovascular Surgery 54, 2 (01 Aug 2017), 247–253. https://doi.org/10.1016/j.ejvs.2017.05.011",
      "doi": ""
    },
    {
      "text": "Tom Tullis and Bill Albert. 2013. Chapter 7 - Behavioral and Physiological Metrics. In Measuring the User Experience (Second Edition) (second edition ed.), Tom Tullis and Bill Albert (Eds.). Morgan Kaufmann, Boston, 163–186. https://doi.org/10.1016/B978-0-12-415781-1.00007-8",
      "doi": ""
    },
    {
      "text": "UbiSim. 2016. A Complete Virtual Simulation Lab. https://www.ubisimvr.com/vr-platform/",
      "doi": ""
    },
    {
      "text": "Judith A. Vessey and Karen Huss. 2002. Using standardized patients in advanced practice nursing education. Journal of Professional Nursing 18, 1 (2002), 29–35. https://doi.org/10.1053/jpnu.2002.30898",
      "doi": ""
    },
    {
      "text": "Ulrich von Zadow, Sandra Buron, Tina Harms, Florian Behringer, Kai Sostmann, and Raimund Dachselt. 2013. SimMed: Combining Simulation and Interactive Tabletops for Medical Education. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 1469–1478. https://doi.org/10.1145/2470654.2466196",
      "doi": "10.1145/2470654.2466196"
    },
    {
      "text": "Esther L. Wanko Keutchafo, Jane Kerr, and Mary Ann Jarvis. 2020. Evidence of nonverbal communication between nurses and older adults: a scoping review. BMC nursing 19 (16 Jun 2020), 53–53. https://doi.org/10.1186/s12912-020-00443-9 PMC7298765[pmcid].",
      "doi": ""
    },
    {
      "text": "Robert Ward and Naomi Jane Scott. 2018. Cues to mental health from men’s facial appearance. Journal of Research in Personality 75 (2018), 26–36. https://doi.org/10.1016/j.jrp.2018.04.007",
      "doi": ""
    },
    {
      "text": "Hanna Wüller, Jonathan Behrens, Marcus Garthaus, Sara Marquard, and Hartmut Remmers. 2019. A scoping review of augmented reality in nursing. BMC Nursing 18, 1 (16 May 2019), 19. https://doi.org/10.1186/s12912-019-0342-2",
      "doi": ""
    },
    {
      "text": "Liqiong Yang, Xiangling Chen, Quanhao Guo, Jing Zhang, Man Luo, Xiaqing Chen, Yanxia Wen, Xianwei Zou, and Fan Xu. 2022. Changes in facial expressions in patients with Parkinson’s disease during the phonation test and their correlation with disease severity. Computer Speech and Language 72 (2022), 101286. https://doi.org/10.1016/j.csl.2021.101286",
      "doi": "10.1016/j.csl.2021.101286"
    },
    {
      "text": "Şengül Üzen Cura, Vildan Kocatepe, Dilek Yıldırım, Hilalnur Küçükakgün, Selma Atay, and Vesile Ünver. 2020. Examining Knowledge, Skill, Stress, Satisfaction, and Self-Confidence Levels of Nursing Students in Three Different Simulation Modalities. Asian Nursing Research 14, 3 (2020), 158–164. https://doi.org/10.1016/j.anr.2020.07.001",
      "doi": ""
    }
  ]
}