{
  "doi": "10.1145/3491102.3502093",
  "title": "Designing for Speech Practice Systems: How Do User-Controlled Voice Manipulation and Model Speakers Impact Self-Perceptions of Voice?",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "Can you speak the way you desire without feeling the pressure to conform to standards of speaking? In this study, we investigated the impact of user-controlled voice manipulation and listening to recordings of model speakers on self-perceptions of voice and speech. Quantitative analysis showed that there was a significant improvement in the perceived confidence of tone by listening to model speakers, but there were no significant improvements due to voice manipulation. Qualitative analysis of interviews revealed that participants responded positively to the visual and auditory feedback provided by the voice manipulation software. The participants also evaluated the quality of model speakers to decide whether or not they wanted to refer to them for speech practice. Based on the results of these analyses, we summarized the design implications for a speech practice system that would allow further investigation of the impact of the system on self-perceptions of speech performance.",
  "authors": [
    {
      "name": "Lisa Orii",
      "institution": "Paul G. Allen School of Computer Science & Engineering, University of Washington, United States",
      "img": "/do/10.1145/contrib-99659701103/rel-imgonly/lisa_orii_1mb.jpg",
      "acmid": "99659701103",
      "orcid": "missing"
    },
    {
      "name": "Nami Ogawa",
      "institution": "The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658985510",
      "orcid": "missing"
    },
    {
      "name": "Yuji Hatada",
      "institution": "The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659355393",
      "orcid": "missing"
    },
    {
      "name": "Takuji Narumi",
      "institution": "The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331500452",
      "orcid": "0000-0002-9010-1491"
    }
  ],
  "references": [
    {
      "text": "2020. Definitions. https://transstudent.org/about/definitions/",
      "doi": ""
    },
    {
      "text": "Alex A Ahmed. 2018. Trans competent interaction design: A qualitative study on voice, identity, and technology. Interacting with Computers 30, 1 (2018), 53–71.",
      "doi": ""
    },
    {
      "text": "Alex A. Ahmed. 2019. Bridging Social Critique and Design: Building a Health Informatics Tool for Transgender Voice. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3290607.3299077",
      "doi": "10.1145/3290607.3299077"
    },
    {
      "text": "Rindy C Anderson and Casey A Klofstad. 2012. Preference for leaders with masculine voices holds in the case of feminine leadership roles. PloS one 7, 12 (2012), e51216.",
      "doi": ""
    },
    {
      "text": "Jean-Julien Aucouturier, Petter Johansson, Lars Hall, Rodrigo Segnini, Lolita Mercadié, and Katsumi Watanabe. 2016. Covert digital manipulation of vocal emotion alter speakers’ emotional states in a congruent direction. Proceedings of the National Academy of Sciences 113, 4 (2016), 948–953.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1997. Self-efficacy: the exercise of control. W. H. Freeman and Company, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Mary Beard. 2017. Women & power: a manifesto. Profile Books.",
      "doi": ""
    },
    {
      "text": "Alicia Bolívar-Cruz and Domingo Verano-Tacoronte. 2018. Self-assessment of the oral presentation competence: Effects of gender and student’s performance. Studies in Educational Evaluation 59 (2018), 94–101.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Mark Christianson, Christopher Hoskins, and Atsuko Watanabe. 2009. Evaluating the effectiveness of a video-recording based self-assessment system for academic speaking. Language Research Bulletin 24 (2009), 1–15.",
      "doi": ""
    },
    {
      "text": "Anna Chur-Hansen. 2001. The self-evaluation of medical communication skills. Higher Education Research & Development 20, 1 (2001), 71–79.",
      "doi": ""
    },
    {
      "text": "John A Daly, Anita L Vangelisti, Heather L Neel, and P Daniel Cavanaugh. 1989. Pre-performance concerns associated with public speaking anxiety. Communication Quarterly 37, 1 (1989), 39–53.",
      "doi": ""
    },
    {
      "text": "Ionut Damian, Chiew Seng (Sean) Tan, Tobias Baur, Johannes Schöning, Kris Luyten, and Elisabeth André. 2015. Augmenting Social Interactions: Realtime Behavioural Feedback Using Social Signal Processing Techniques. Association for Computing Machinery, New York, NY, USA, 565–574. https://doi.org/10.1145/2702123.2702314",
      "doi": ""
    },
    {
      "text": "Antonella D’Amico and Maurizio Cardaci. 2003. Relations among perceived self-efficacy, self-esteem, and school achievement. Psychological Reports 92, 3 (2003), 745–754.",
      "doi": ""
    },
    {
      "text": "Luc De Grez, Martin Valcke, and Irene Roozen. 2012. How effective are self-and peer assessment of oral presentation skills compared with teachers’ assessments?Active Learning in Higher Education 13, 2 (2012), 129–142.",
      "doi": ""
    },
    {
      "text": "Fiona Dermody. 2016. Multimodal Positive Computing System for Public Speaking with Real-Time Feedback. In Proceedings of the 18th ACM International Conference on Multimodal Interaction (Tokyo, Japan) (ICMI ’16). Association for Computing Machinery, New York, NY, USA, 541–545. https://doi.org/10.1145/2993148.2997616",
      "doi": ""
    },
    {
      "text": "Laura Di Giunta, Guido Alessandri, Maria Gerbino, Paula Luengo Kanacri, Antonio Zuffiano, and Gian Vittorio Caprara. 2013. The determinants of scholastic achievement: The contribution of personality traits, self-esteem, and academic self-efficacy. Learning and individual Differences 27 (2013), 102–108.",
      "doi": ""
    },
    {
      "text": "Sean D Hayes, Peter RE Crocker, and Kent C Kowalski. 1999. Gender differences in physical self-perceptions, global self-esteem and physical activity: Evaluation of the physical self-perception profile model. Journal of Sport Behavior 22, 1 (1999), 1.",
      "doi": ""
    },
    {
      "text": "Gregg R Henriques and Lawrence G Calhoun. 1999. Gender and ethnic differences in the relationship between body esteem and self-esteem. The journal of psychology 133, 4 (1999), 357–368.",
      "doi": ""
    },
    {
      "text": "Young Mi Kim, Fitri Putjuk, Endang Basuki, and Adrienne Kols. 2000. Self-assessment and peer review: improving Indonesian service providers’ communication with clients. International Family Planning Perspectives 26 (2000), 4–12.",
      "doi": ""
    },
    {
      "text": "Casey A Klofstad, Rindy C Anderson, and Susan Peters. 2012. Sounds like a winner: voice pitch influences perception of leadership capacity in both men and women. Proceedings of the Royal Society B: Biological Sciences 279, 1738(2012), 2698–2704.",
      "doi": ""
    },
    {
      "text": "Kazutaka Kurihara, Masataka Goto, Jun Ogata, Yosuke Matsusaka, and Takeo Igarashi. 2007. Presentation Sensei: A Presentation Training System Using Speech and Image Processing. In Proceedings of the 9th International Conference on Multimodal Interfaces (Nagoya, Aichi, Japan) (ICMI ’07). Association for Computing Machinery, New York, NY, USA, 358–365. https://doi.org/10.1145/1322192.1322256",
      "doi": "10.1145/1322192.1322256"
    },
    {
      "text": "John Lane, Andrew M Lane, and Anna Kyprianou. 2004. Self-efficacy, self-esteem and their impact on academic performance. Social Behavior and Personality: an international journal 32, 3(2004), 247–256.",
      "doi": ""
    },
    {
      "text": "Ioana M Latu, Marianne Schmid Mast, Joris Lammers, and Dario Bombari. 2013. Successful female leaders empower women’s behavior in leadership tasks. Journal of Experimental Social Psychology 49, 3 (2013), 444–448.",
      "doi": ""
    },
    {
      "text": "Penelope Lockwood. 2006. “Someone Like Me can be Successful”: Do College Students Need Same-Gender Role Models?Psychology of Women Quarterly 30, 1 (2006), 36–46. https://doi.org/10.1111/j.1471-6402.2006.00260.x arXiv:https://doi.org/10.1111/j.1471-6402.2006.00260.x",
      "doi": ""
    },
    {
      "text": "Stephen Lucas and Paul Stob. 2004. The art of public speaking. McGraw-Hill Education, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Beverley K Mendelson and Donna R White. 1985. Development of self-body-esteem in overweight youngsters.Developmental Psychology 21, 1 (1985), 90.",
      "doi": ""
    },
    {
      "text": "Asta Meškauskienė and Andrius Guoba. 2016. The Impact of assessment and selfassessment methods of learning achievements and progress on adolescent self-esteem building. Pedagogika 124, 4 (2016), 160–171.",
      "doi": ""
    },
    {
      "text": "Jane R Mort and Daniel J Hansen. 2010. First-year pharmacy students’ self-assessment of communication skills and the impact of video review. American Journal of Pharmaceutical Education 74, 5 (2010).",
      "doi": ""
    },
    {
      "text": "Kana Naruse, Shinnosuke Takamichi, Tomohiro Tanikawa, Shigeo Yoshida, Takuji Narumi, and Michitaka Hirose. 2019. Estimating Confidence in Voices Using Crowdsourcing for Alleviating Tension with Altered Auditory Feedback. In Proceedings of Asian CHI Symposium 2019: Emerging HCI Research Collection (Glasgow, Scotland, United Kingdom) (AsianHCI ’19). Association for Computing Machinery, New York, NY, USA, 15–22. https://doi.org/10.1145/3309700.3338418",
      "doi": "10.1145/3309700.3338418"
    },
    {
      "text": "Gregory Nash, Gail Crimmins, and Florin Oprescu. 2016. If first-year students are afraid of public speaking assessments what can teachers do to alleviate such anxiety?Assessment & Evaluation in Higher Education 41, 4 (2016), 586–600.",
      "doi": ""
    },
    {
      "text": "Anastasia Papanthymou and Maria Darra. 2018. Student Self-Assessment in Higher Education: The International Experience and The Greek Example.World journal of education 8, 6 (2018), 130–146.",
      "doi": ""
    },
    {
      "text": "Dirtya Sunyi Paradewari. 2017. Investigating students’ self-efficacy of public speaking. International Journal of Education and Research 5, 10 (2017), 97–105.",
      "doi": ""
    },
    {
      "text": "Judy C Pearson, Jeffrey T Child, and David H Kahl Jr. 2006. Preparation meeting opportunity: How do college students prepare for public speeches?Communication Quarterly 54, 3 (2006), 351–366.",
      "doi": ""
    },
    {
      "text": "Cecilia Pettersson. 2018. Psychological well-being, improved self-confidence, and social capacity: bibliotherapy from a user perspective. Journal of Poetry Therapy 31, 2 (2018), 124–134.",
      "doi": ""
    },
    {
      "text": "Farhan Raja. 2017. Anxiety Level in Students of Public Speaking: Causes and Remedies.Journal of education and educational development 4, 1(2017), 94–110.",
      "doi": ""
    },
    {
      "text": "Sian M Ritchie. 2016. Self-assessment of video-recorded presentations: Does it improve skills?Active Learning in Higher Education 17, 3 (2016), 207–221.",
      "doi": ""
    },
    {
      "text": "Morris Rosenberg. 1986. Conceiving the self. Krieger Publishing, Malabar, FL, USA.",
      "doi": ""
    },
    {
      "text": "Steve Rubin, Floraine Berthouzoz, Gautham J. Mysore, and Maneesh Agrawala. 2015. Capture-Time Feedback for Recording Scripted Narration. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 191–199. https://doi.org/10.1145/2807442.2807464",
      "doi": "10.1145/2807442.2807464"
    },
    {
      "text": "Klaus R Scherer, Harvey London, and Jared J Wolf. 1973. The voice of confidence: Paralinguistic cues and audience evaluation. Journal of Research in Personality 7, 1 (1973), 31–44.",
      "doi": ""
    },
    {
      "text": "Jan Schneider, Dirk Börner, Peter van Rosmalen, and Marcus Specht. 2015. Presentation Trainer, Your Public Speaking Multimodal Coach. In Proceedings of the 2015 ACM on International Conference on Multimodal Interaction (Seattle, Washington, USA) (ICMI ’15). Association for Computing Machinery, New York, NY, USA, 539–546. https://doi.org/10.1145/2818346.2830603",
      "doi": "10.1145/2818346.2830603"
    },
    {
      "text": "Dale H Schunk. 1987. Peer models and children’s behavioral change. Review of educational research 57, 2 (1987), 149–174.",
      "doi": ""
    },
    {
      "text": "Ralf Schwarzer, Matthias Jerusalem, 1995. Generalized self-efficacy scale. Measures in health psychology: A user’s portfolio. Causal and control beliefs 1, 1 (1995), 35–37.",
      "doi": ""
    },
    {
      "text": "Clive R Seligman, G Richard Tucker, and Wallace E Lambert. 1972. The effects of speech style and other attributes on teachers’ attitudes toward pupils1. Language in Society 1, 1 (1972), 131–142.",
      "doi": ""
    },
    {
      "text": "Susan Sonnenschein and Grover J Whitehurst. 1980. The development of communication: When a bad model makes a good teacher. Journal of Experimental Child Psychology 29, 3 (1980), 371–390.",
      "doi": ""
    },
    {
      "text": "Piotr Sorokowski, David Puts, Janie Johnson, Olga Żółkiewicz, Anna Oleszkiewicz, Agnieszka Sorokowska, Marta Kowal, Barbara Borkowska, and Katarzyna Pisanski. 2019. Voice of authority: professionals lower their vocal frequencies when giving expert advice. Journal of Nonverbal Behavior 43, 2 (2019), 257–269.",
      "doi": ""
    },
    {
      "text": "Andrew Stuart and Joseph Kalinowski. 2004. The perception of speech naturalness of post-therapeutic and altered auditory feedback speech of adults with mild and severe stuttering. Folia Phoniatrica et Logopaedica 56, 6 (2004), 347–357.",
      "doi": ""
    },
    {
      "text": "Andrew Stuart, Joseph Kalinowski, Michael P Rastatter, Tim Saltuklaroglu, and Vikram Dayalu. 2004. Investigations of the impact of altered auditory feedback in-the-ear devices on the speech of people who stutter: initial fitting and 4-month follow-up. International Journal of Language & Communication Disorders 39, 1(2004), 93–113.",
      "doi": ""
    },
    {
      "text": "Chunming Tai. 2012. Undergraduate business and management students’ experiences of being involved in assessment. (2012).",
      "doi": ""
    },
    {
      "text": "M. Iftekhar Tanveer, Emy Lin, and Mohammed (Ehsan) Hoque. 2015. Rhema: A Real-Time In-Situ Intelligent Interface to Help People with Public Speaking. In Proceedings of the 20th International Conference on Intelligent User Interfaces(Atlanta, Georgia, USA) (IUI ’15). Association for Computing Machinery, New York, NY, USA, 286–295. https://doi.org/10.1145/2678025.2701386",
      "doi": "10.1145/2678025.2701386"
    },
    {
      "text": "Cara C Tigue, Diana J Borak, Jillian JM O’Connor, Charles Schandl, and David R Feinberg. 2012. Voice pitch influences voting behavior. Evolution and Human Behavior 33, 3 (2012), 210–216.",
      "doi": ""
    },
    {
      "text": "Ingo R Titze, Jan G Svec, and Peter S Popolo. 2003. Vocal dose measures. The Journal of Speech, Language, and Hearing Research (JSLHR) 46, 4(2003), 919–932.",
      "doi": ""
    },
    {
      "text": "H. Trinh, R. Asadi, D. Edge, and T. Bickmore. 2017. RoboCOP: A Robotic Coach for Oral Presentations. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 2, Article 27 (June 2017), 24 pages. https://doi.org/10.1145/3090092",
      "doi": "10.1145/3090092"
    },
    {
      "text": "Ellen L Usher and Frank Pajares. 2006. Sources of academic and self-regulatory efficacy beliefs of entering middle school students. Contemporary educational psychology 31, 2 (2006), 125–141.",
      "doi": ""
    },
    {
      "text": "Xingbo Wang, Haipeng Zeng, Yong Wang, Aoyu Wu, Zhida Sun, Xiaojuan Ma, and Huamin Qu. 2020. VoiceCoach: Interactive Evidence-Based Training for Voice Modulation Skills in Public Speaking. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376726",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. Association for Computing Machinery, New York, NY, USA, 143–146. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "MS Yoo, YJ Son, YS Kim, and JH Park. 2009. Video-based self-assessment: Implementation and evaluation in an undergraduate nursing course. Nurse education today 29, 6 (2009), 585–589.",
      "doi": ""
    }
  ]
}