{
  "doi": "10.1145/3491102.3501925",
  "title": "EmoGlass: an End-to-End AI-Enabled Wearable Platform for Enhancing Self-Awareness of Emotional Health",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2022,
  "badges": [],
  "abstract": "Often, emotional disorders are overlooked due to their lack of awareness, resulting in potential mental issues. Recent advances in sensing and inference technology provide a viable path to wearable facial-expression-based emotion recognition. However, most prior work has explored only laboratory settings and few platforms are geared towards end-users in everyday lives or provide personalized emotional suggestions to promote self-regulation. We present EmoGlass, an end-to-end wearable platform that consists of emotion detection glasses and an accompanying mobile application. Our single-camera-mounted glasses can detect seven facial expressions based on partial face images. We conducted a three-day out-of-lab study (N=15) to evaluate the performance of EmoGlass. We iterated on the design of the EmoGlass application for effective self-monitoring and awareness of users’ daily emotional states. We report quantitative and qualitative findings, based on which we discuss design recommendations for future work on sensing and enhancing awareness of emotional health.",
  "authors": [
    {
      "name": "Zihan Yan",
      "institution": "College of Computer Science and Technology, Zhejiang University, China and UCLA HCI Research, University of California, Los Angeles, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659948837",
      "orcid": "0000-0001-5298-4839"
    },
    {
      "name": "Yufei Wu",
      "institution": "School of Earth Sciences, Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238640",
      "orcid": "missing"
    },
    {
      "name": "Yang Zhang",
      "institution": "Electrical and Computer Engineering, University of California, Los Angeles, United States",
      "img": "/do/10.1145/contrib-81548025596/rel-imgonly/yang.jpg",
      "acmid": "81548025596",
      "orcid": "0000-0003-2472-6968"
    },
    {
      "name": "Xiang 'Anthony' Chen",
      "institution": "UCLA HCI Research, University of California, Los Angeles, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659468135",
      "orcid": "0000-0002-8527-1744"
    }
  ],
  "references": [
    {
      "text": "Ralph Adolphs. 2002. Recognizing emotion from facial expressions: psychological and neurological mechanisms. Behavioral and cognitive neuroscience reviews 1, 1 (2002), 21–62.",
      "doi": ""
    },
    {
      "text": "Md Shad Akhtar, Asif Ekbal, and Erik Cambria. 2020. How Intense Are You? Predicting Intensities of Emotions and Sentiments using Stacked Ensemble [Application Notes]. IEEE Computational Intelligence Magazine 15, 1 (2020), 64–75. https://doi.org/10.1109/MCI.2019.2954667",
      "doi": "10.1109/MCI.2019.2954667"
    },
    {
      "text": "Hiroaki Aoki, Ayumi Ohnishi, Naoya Isoyama, Tsutomu Terada, and Masahiko Tsukamoto. 2021. FaceRecGlasses: A Wearable System for Recognizing Self Facial Expressions Using Compact Wearable Cameras. In Augmented Humans Conference 2021 (Rovaniemi, Finland) (AHs’21). Association for Computing Machinery, New York, NY, USA, 55–65. https://doi.org/10.1145/3458709.3458983",
      "doi": ""
    },
    {
      "text": "Mouath Aouayeb, Wassim Hamidouche, Catherine Soladié, Kidiyo Kpalma, and Renaud Séguier. 2021. Learning Vision Transformer with Squeeze and Excitation for Facial Expression Recognition. CoRR abs/2107.03107(2021), 1–13. arxiv:2107.03107https://arxiv.org/abs/2107.03107",
      "doi": ""
    },
    {
      "text": "Akshay Asthana, Stefanos Zafeiriou, Shiyang Cheng, and Maja Pantic. 2014. Incremental face alignment in the wild. In Proceedings of the IEEE conference on computer vision and pattern recognition. IEEE, IEEE, 1859–1866.",
      "doi": "10.1109/CVPR.2014.240"
    },
    {
      "text": "Anthony P Atkinson, Mary L Tunstall, and Winand H Dittrich. 2007. Evidence for distinct contributions of form and motion information to the recognition of emotions from body gestures. Cognition 104, 1 (2007), 59–72.",
      "doi": ""
    },
    {
      "text": "M Avalle, V Belotti, M Frascio, and R Razzoli. 2021. Development of a wearable device for the early diagnosis of neurodegenerative diseases. IOP Conference Series: Materials Science and Engineering 1038, 1 (feb 2021), 012033. https://doi.org/10.1088/1757-899x/1038/1/012033",
      "doi": ""
    },
    {
      "text": "Areej Babiker, Ibrahima Faye, Kristin Prehn, and Aamir Malik. 2015. Machine learning to differentiate between positive and negative emotions using pupil diameter. Frontiers in psychology 6 (2015), 1921.",
      "doi": ""
    },
    {
      "text": "Serdar Baltaci and Didem Gokcay. 2016. Stress detection in human–computer interaction: Fusion of pupil dilation and facial temperature features. International Journal of Human–Computer Interaction 32, 12(2016), 956–966.",
      "doi": ""
    },
    {
      "text": "Lisa Feldman Barrett. 2006. Valence is a basic building block of emotional life. Journal of Research in Personality 40, 1 (2006), 35–55.",
      "doi": ""
    },
    {
      "text": "Lisa Feldman Barrett, Ralph Adolphs, Stacy Marsella, Aleix M Martinez, and Seth D Pollak. 2019. Emotional expressions reconsidered: Challenges to inferring emotion from human facial movements. Psychological science in the public interest 20, 1 (2019), 1–68.",
      "doi": ""
    },
    {
      "text": "Lisa Feldman Barrett, James Gross, Tamlin Conner Christensen, and Michael Benvenuto. 2001. Knowing what you’re feeling and knowing what to do about it: Mapping the relation between emotion differentiation and emotion regulation. Cognition and Emotion 15, 6 (2001), 713–724. https://doi.org/10.1080/02699930143000239 arXiv:https://doi.org/10.1080/02699930143000239",
      "doi": ""
    },
    {
      "text": "Abdelkareem Bedri, Diana Li, Rushil Khurana, Kunal Bhuwalka, and Mayank Goel. 2020. FitByte: Automatic Diet Monitoring in Unconstrained Situations Using Multimodal Sensing on Eyeglasses. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376869",
      "doi": "10.1145/3313831.3376869"
    },
    {
      "text": "M. Berking and P. Wupperman. 2012. Emotion regulation and mental health: recent findings, current challenges, and future directions.Current Opinion in Psychiatry 25, 2 (2012), 128.",
      "doi": ""
    },
    {
      "text": "Taryn Bipat, Maarten Willem Bos, Rajan Vaish, and Andrés Monroy-Hernández. 2019. Analyzing the Use of Camera Glasses in the Wild. Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3290605.3300651",
      "doi": ""
    },
    {
      "text": "Zana Buçinca, Maja Barbara Malaya, and Krzysztof Z Gajos. 2021. To trust or to think: cognitive forcing functions can reduce overreliance on AI in AI-assisted decision-making. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–21.",
      "doi": "10.1145/3449287"
    },
    {
      "text": "Tuochao Chen, Yaxuan Li, Songyun Tao, Hyunchul Lim, Mose Sakashita, Ruidong Zhang, Francois Guimbretiere, and Cheng Zhang. 2021. NeckFace: Continuously Tracking Full Facial Expressions on Neck-mounted Wearables. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 5, 2 (2021), 1–31.",
      "doi": "10.1145/3494977"
    },
    {
      "text": "Tuochao Chen, Benjamin Steeper, Kinan Alsheikh, Songyun Tao, François Guimbretière, and Cheng Zhang. 2020. C-Face: Continuously Reconstructing Facial Expressions by Deep Learning Contours of the Face with Ear-Mounted Miniature Cameras. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 112–125. https://doi.org/10.1145/3379337.3415879",
      "doi": "10.1145/3379337.3415879"
    },
    {
      "text": "George Chernyshov, Kirill Ragozin, Benjamin Tag, and Kai Kunze. 2019. EOG Glasses: An Eyewear Platform for Cognitive and Social Interaction Assessments in the Wild. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei, Taiwan) (MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, Article 67, 5 pages. https://doi.org/10.1145/3338286.3344418",
      "doi": "10.1145/3338286.3344418"
    },
    {
      "text": "Elizabeth Chervonsky and Caroline Hunt. 2017. Suppression and expression of emotion in social and interpersonal outcomes: A meta-analysis.Emotion 17, 4 (2017), 669.",
      "doi": ""
    },
    {
      "text": "Fernando De la Torre, Joan Campoy, Zara Ambadar, and Jeffrey F Cohn. 2007. Temporal segmentation of facial behavior. In 2007 IEEE 11th International Conference on Computer Vision. IEEE, IEE, IEEE, 1–8.",
      "doi": ""
    },
    {
      "text": "A. Dhall, R. Goecke, Simon Lucey, and T. Gedeon. 2011. Acted Facial Expressions In The Wild Database. ANU Computer Science Technical Report Series TR-CS, 11(2011), 02.",
      "doi": ""
    },
    {
      "text": "Fifth Edition 2013. Diagnostic and statistical manual of mental disorders. Am Psychiatric Assoc 21(2013), 992 pages.",
      "doi": ""
    },
    {
      "text": "Paul Ekman. 1992. An argument for basic emotions. Cognition and Emotion 6, 3-4 (1992), 169–200. https://doi.org/10.1080/02699939208411068 arXiv:https://doi.org/10.1080/02699939208411068",
      "doi": ""
    },
    {
      "text": "Mohamed Elgharib, Mallikarjun B. R., Ayush Tewari, Hyeongwoo Kim, Wentao Liu, Hans-Peter Seidel, and Christian Theobalt. 2019. EgoFace: Egocentric Face Performance Capture and Videorealistic Reenactment. CoRR abs/1905.10822(2019), 10 pages. arXiv:1905.10822http://arxiv.org/abs/1905.10822",
      "doi": ""
    },
    {
      "text": "Everysight LTD. 2021. Rapter - Everysight. Everysight LTD. Accessed: 2021-09-07.",
      "doi": ""
    },
    {
      "text": "Steven R Forness, Loretta A Serna, Elizabeth Nielsen, Katina Lambros, Mary Johnell Hale, and Kenneth A Kavale. 2000. A model for early detection and primary prevention of emotional or behavioral disorders. Education and treatment of children 23, 3 (2000), 325–345.",
      "doi": ""
    },
    {
      "text": "Jon Froehlich, Tawanna Dillahunt, Predrag Klasnja, Jennifer Mankoff, Sunny Consolvo, Beverly Harrison, and James A. Landay. 2009. UbiGreen: Investigating a Mobile Tool for Tracking and Supporting Green Transportation Habits. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 1043–1052. https://doi.org/10.1145/1518701.1518861",
      "doi": "10.1145/1518701.1518861"
    },
    {
      "text": "Jose Maria Garcia-Garcia, Victor M. R. Penichet, and Maria D. Lozano. 2017. Emotion Detection: A Technology Review. In Proceedings of the XVIII International Conference on Human Computer Interaction (Cancun, Mexico) (Interacción ’17). Association for Computing Machinery, New York, NY, USA, Article 8, 8 pages. https://doi.org/10.1145/3123818.3123852",
      "doi": "10.1145/3123818.3123852"
    },
    {
      "text": "Anna Gruebler and Kenji Suzuki. 2014. Design of a wearable device for reading positive expressions from facial emg signals. IEEE Transactions on affective computing 5, 3 (2014), 227–237.",
      "doi": ""
    },
    {
      "text": "Han Wen Guo, Yu Shun Huang, Jen Chien Chien, and Jiann Shing Shieh. 2015. Short-term analysis of heart rate variability for emotion recognition via a wearable ECG device. In 2015 International Conference on Intelligent Informatics and Biomedical Sciences (ICIIBMS). IEEE, IEEE, 262–265. https://doi.org/10.1109/ICIIBMS.2015.7439542",
      "doi": ""
    },
    {
      "text": "Cheng He, Yun-jin Yao, and Xue-song Ye. 2017. An Emotion Recognition System Based on Physiological Signals Obtained by Wearable Sensors. In Wearable Sensors and Robots, Canjun Yang, G. S. Virk, and Huayong Yang (Eds.). Springer Singapore, Singapore, 15–25.",
      "doi": ""
    },
    {
      "text": "Nazia Hossain and Mahmuda Nazin. 2018. EmoVoice: Finding My Mood from My Voice Signal. In Proceedings of the 2018 ACM International Joint Conference and 2018 International Symposium on Pervasive and Ubiquitous Computing and Wearable Computers (Singapore, Singapore) (UbiComp ’18). Association for Computing Machinery, New York, NY, USA, 1826–1828. https://doi.org/10.1145/3267305.3277832",
      "doi": "10.1145/3267305.3277832"
    },
    {
      "text": "Jie Hu and Kenneth J Gruber. 2008. Positive and negative affect and health functioning indicators among older adults with chronic illnesses. Issues in mental health nursing 29, 8 (2008), 895–911.",
      "doi": ""
    },
    {
      "text": "Qianyi Huang, Wei Wang, and Qian Zhang. 2017. Your glasses know your diet: Dietary monitoring using electromyography sensors. IEEE Internet of Things Journal 4, 3 (2017), 705–712.",
      "doi": ""
    },
    {
      "text": "Kevin Hung, C. C. Lee, and Sheung-On Choy. 2015. Ubiquitous Health Monitoring: Integration of Wearable Sensors, Novel Sensing Techniques, and Body Sensor Networks. Springer International Publishing, Cham, 319–342. https://doi.org/10.1007/978-3-319-12817-7_15",
      "doi": ""
    },
    {
      "text": "Iqram Hussain and Se Jin Park. 2020. HealthSOS: Real-Time Health Monitoring System for Stroke Prognostics. IEEE Access 8(2020), 213574–213586.",
      "doi": ""
    },
    {
      "text": "Yasha Iravantchi, Yang Zhang, Evi Bernitsas, Mayank Goel, and Chris Harrison. 2019. Interferi: Gesture Sensing Using On-Body Acoustic Interferometry. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300506",
      "doi": "10.1145/3290605.3300506"
    },
    {
      "text": "P Kalaiselvi and S Nithya. 2013. Face recognition system under varying lighting conditions. IOSR Journal of Computer Engineering (IOSRJCE) 14, 3 (2013), 79–88.",
      "doi": ""
    },
    {
      "text": "Kai Kang and Xin Ma. 2019. Convolutional Gate Recurrent Unit for Video Facial Expression Recognition in the Wild. In 2019 Chinese Control Conference (CCC). IEEE, IEEE, 7623–7628. https://doi.org/10.23919/ChiCC.2019.8866235",
      "doi": ""
    },
    {
      "text": "Maryam Karimi. 2021. A Review of Emotions Makes up The Bulk of Life. International Journal of Advanced Studies in Humanities and Social Science 10, 3(2021), 156–160.",
      "doi": ""
    },
    {
      "text": "Neelam Kaushik, Takashi Sasaki, Yoshiki Takahashi, Toru Nakazawa, and Kazuhiro Hane. 2017. MEMS-based retinal-imaging system for visual health monitoring. In 24th International Display Workshops, IDW 2017. International Display Workshops, International Display Workshops, Sendai, Japan, 1319–1321.",
      "doi": ""
    },
    {
      "text": "Neelam Kaushik, Takashi Sasaki, Yoshiki Takahashi, Toru Nakazawa, and Kazuhiro Hane. 2019. MEMS-based wearable eyeglasses for eye health monitoring. Biomedical Physics & Engineering Express 6, 1 (2019), 015006.",
      "doi": ""
    },
    {
      "text": "Suleman Khan, M Hammad Javed, Ehtasham Ahmed, Syed AA Shah, and Syed Umaid Ali. 2019. Facial recognition using convolutional neural networks and implementation on smart glasses. In 2019 International Conference on Information Science and Communication Technology (ICISCT). IEEE, IEEE, IEEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Dawon Kim and Yosoon Choi. 2021. Applications of Smart Glasses in Applied Sciences: A Systematic Review. Applied Sciences 11, 11 (2021), 4956.",
      "doi": ""
    },
    {
      "text": "Jina Kim, Daeun Lee, and Eunil Park. 2021. Machine Learning for Mental Health in Social Media: Bibliometric Study. J Med Internet Res 23, 3 (2021), e24870.",
      "doi": ""
    },
    {
      "text": "Kavitha Kolappa, David C Henderson, and Sandeep P Kishore. 2013. No physical health without mental health: lessons unlearned?",
      "doi": ""
    },
    {
      "text": "Marcin Kopaczka, Raphael Kolk, and Dorit Merhof. 2018. A fully annotated thermal face database and its application for thermal facial expression recognition. In 2018 IEEE International Instrumentation and Measurement Technology Conference (I2MTC). IEEE, IEEE, 1–6. https://doi.org/10.1109/I2MTC.2018.8409768",
      "doi": ""
    },
    {
      "text": "Uros Krcadinac, Philippe Pasquier, Jelena Jovanovic, and Vladan Devedzic. 2013. Synesketch: An open source library for sentence-based emotion recognition. IEEE Transactions on Affective Computing 4, 3 (2013), 312–325.",
      "doi": "10.1109/T-AFFC.2013.18"
    },
    {
      "text": "Hao Li, Laura Trutoiu, Kyle Olszewski, Lingyu Wei, Tristan Trutna, Pei-Lun Hsieh, Aaron Nicholls, and Chongyang Ma. 2015. Facial performance sensing head-mounted display. ACM Transactions on Graphics (ToG) 34, 4 (2015), 1–9.",
      "doi": "10.1145/2766939"
    },
    {
      "text": "Jing Li, Yang Mi, Gongfa Li, and Zhaojie Ju. 2019. CNN-Based Facial Expression Recognition from Annotated RGB-D Images for Human–Robot Interaction. International Journal of Humanoid Robotics 16, 04 (2019), 1941002. https://doi.org/10.1142/S0219843619410020 arXiv:https://doi.org/10.1142/S0219843619410020",
      "doi": ""
    },
    {
      "text": "Yong Li, Jiabei Zeng, Shiguang Shan, and Xilin Chen. 2018. Occlusion aware facial expression recognition using cnn with attention mechanism. IEEE Transactions on Image Processing 28, 5 (2018), 2439–2450.",
      "doi": ""
    },
    {
      "text": "Wang Yan Li Ming, Peng Xiujiao. 2018. Facial Expression Recognition Based on Improved Dictionary Learning and Sparse Representation. Journal of System Simulation 30, 1, Article 28(2018), 8 pages. https://doi.org/10.16182/j.issn1004731x.joss.201801004",
      "doi": ""
    },
    {
      "text": "Sheng-Fu Liang, Chin-En Kuo, Yi-Chieh Lee, Wen-Chieh Lin, Yen-Chen Liu, Peng-Yu Chen, Fu-Yin Cherng, and Fu-Zen Shaw. 2015. Development of an EOG-based automatic sleep-monitoring eye mask. IEEE Transactions on Instrumentation and Measurement 64, 11(2015), 2977–2985.",
      "doi": ""
    },
    {
      "text": "Xi Lu, Xiaohang Liu, and Erik Stolterman Bergqvist. 2019. ”It Sounds like She is Sad”: Introducing a Biosensing Prototype That Transforms Emotions into Real-Time Music and Facilitates Social Interaction. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems(Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312784",
      "doi": ""
    },
    {
      "text": "Guorong Ma, Chu Wang, Yanli Jia, Jiawei Wang, Bingren Zhang, Chanchan Shen, Hongying Fan, Bing Pan, and Wei Wang. 2018. Electrocardiographic and electrooculographic responses to external emotions and their transitions in bipolar i and ii disorders. International journal of environmental research and public health 15, 5(2018), 884.",
      "doi": ""
    },
    {
      "text": "Katsutoshi Masai, Yuta Sugiura, Masa Ogata, Kai Kunze, Masahiko Inami, and Maki Sugimoto. 2016. Facial Expression Recognition in Daily Life by Embedded Photo Reflective Sensors on Smart Eyewear. In Proceedings of the 21st International Conference on Intelligent User Interfaces (Sonoma, California, USA) (IUI ’16). Association for Computing Machinery, New York, NY, USA, 317–326. https://doi.org/10.1145/2856767.2856770",
      "doi": "10.1145/2856767.2856770"
    },
    {
      "text": "Daniel McDuff, Abdelrahman Mahmoud, Mohammad Mavadati, May Amr, Jay Turcot, and Rana el Kaliouby. 2016. AFFDEX SDK: A Cross-Platform Real-Time Multi-Face Expression Recognition Toolkit. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 3723–3726. https://doi.org/10.1145/2851581.2890247",
      "doi": "10.1145/2851581.2890247"
    },
    {
      "text": "Susan Mineka, David Watson, and Lee Anna Clark. 1998. Comorbidity of anxiety and unipolar mood disorders. Annual review of psychology 49, 1 (1998), 377–412.",
      "doi": ""
    },
    {
      "text": "Ali Mollahosseini, Behzad Hasani, and Mohammad H. Mahoor. 2019. AffectNet: A Database for Facial Expression, Valence, and Arousal Computing in the Wild. IEEE Transactions on Affective Computing 10, 1 (2019), 18–31. https://doi.org/10.1109/TAFFC.2017.2740923",
      "doi": "10.1109/TAFFC.2017.2740923"
    },
    {
      "text": "Nima Mousavi, Henrique Siqueira, Pablo Barros, Bruno Fernandes, and Stefan Wermter. 2016. Understanding how deep neural networks learn face expressions. In 2016 International Joint Conference on Neural Networks (IJCNN). IEEE, IEEE, IEEE, 227–234.",
      "doi": ""
    },
    {
      "text": "Thangaraj Munusamy, Ravindran Karuppiah, Nor Faizal A Bahuri, Sutharshan Sockalingam, Chun Yoong Cham, and Vicknes Waran. 2021. Telemedicine via smart glasses in critical care of the neurosurgical patient—COVID-19 pandemic preparedness and response in neurosurgery. World Neurosurgery 145(2021), e53–e60.",
      "doi": ""
    },
    {
      "text": "Elizabeth L. Murnane, Xin Jiang, Anna Kong, Michelle Park, Weili Shi, Connor Soohoo, Luke Vink, Iris Xia, Xin Yu, John Yang-Sammataro, Grace Young, Jenny Zhi, Paula Moya, and James A. Landay. 2020. Designing Ambient Narrative-Based Interfaces to Reflect and Motivate Physical Activity. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376478",
      "doi": "10.1145/3313831.3376478"
    },
    {
      "text": "Bahareh Nakisa, Mohammad Naim Rastgoo, Andry Rakotonirainy, Frederic Maire, and Vinod Chandran. 2018. Long Short Term Memory Hyperparameter Optimization for a Neural Network Based Emotion Recognition Framework. IEEE Access 6(2018), 49325–49338. https://doi.org/10.1109/ACCESS.2018.2868361",
      "doi": ""
    },
    {
      "text": "Grzegorz J. Nalepa, Krzysztof Kutt, Barbara Giżycka, Paweł Jemioło, and Szymon Bobek. 2019. Analysis and Use of the Emotional Context with Wearable Devices for Games and Intelligent Assistants. Sensors 19, 11 (2019), 24 pages. https://doi.org/10.3390/s19112509",
      "doi": ""
    },
    {
      "text": "OmniVision Technologies Inc.2009. 5 Megapixel image sensor, OV5647 datasheet, V1.0.",
      "doi": ""
    },
    {
      "text": "World Health Organization 2001. Mental disorders affect one in four people. World Health Report. Accessed: 2021-08-27.",
      "doi": ""
    },
    {
      "text": "Christian Peter, Eric Ebert, and Helmut Beikirch. 2005. A Wearable Multi-sensor System for Mobile Acquisition of Emotion-Related Physiological Data. In Affective Computing and Intelligent Interaction, Jianhua Tao, Tieniu Tan, and Rosalind W. Picard (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 691–698.",
      "doi": ""
    },
    {
      "text": "Christian Peter, Eric Ebert, and Helmut Beikirch. 2005. A Wearable Multi-sensor System for Mobile Acquisition of Emotion-Related Physiological Data. In Affective Computing and Intelligent Interaction, Jianhua Tao, Tieniu Tan, and Rosalind W. Picard (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 691–698.",
      "doi": ""
    },
    {
      "text": "Carolyn R Pool. 1997. Up with emotional health.Educational leadership 54, 8 (1997), 12–14.",
      "doi": ""
    },
    {
      "text": "Kanlaya Rattanyu, Michiko Ohkura, and Makoto Mizukawa. 2010. Emotion monitoring from physiological signals for service robots in the living space. In ICCAS 2010. IEEE, IEEE, 580–583. https://doi.org/10.1109/ICCAS.2010.5669914",
      "doi": ""
    },
    {
      "text": "Rainer Reisenzein, Markus Studtmann, and Gernot Horstmann. 2013. Coherence between emotion and facial expression: Evidence from laboratory experiments. Emotion Review 5, 1 (2013), 16–23.",
      "doi": ""
    },
    {
      "text": "James A Russell. 1994. Is there universal recognition of emotion from facial expression? A review of the cross-cultural studies.Psychological bulletin 115, 1 (1994), 102.",
      "doi": ""
    },
    {
      "text": "Mohammad Nasser Saadatzi, Faezeh Tafazzoli, Karla Conn Welch, and James Henry Graham. 2016. EmotiGO: Bluetooth-enabled eyewear for unobtrusive physiology-based emotion recognition. In 2016 IEEE International Conference on Automation Science and Engineering (CASE). IEEE, IEEE, 903–909. https://doi.org/10.1109/COASE.2016.7743498",
      "doi": "10.1109/COASE.2016.7743498"
    },
    {
      "text": "Stanisław Saganowski, Anna Dutkowiak, Adam Dziadek, Maciej Dzieżyc, Joanna Komoszyńska, Weronika Michalska, Adam Polak, Michał Ujma, and Przemysław Kazienko. 2020. Emotion Recognition Using Wearables: A Systematic Literature Review - Work-in-progress. In 2020 IEEE International Conference on Pervasive Computing and Communications Workshops (PerCom Workshops). IEEE, IEEE, 1–6. https://doi.org/10.1109/PerComWorkshops48775.2020.9156096",
      "doi": ""
    },
    {
      "text": "Najmeh Samadiani, Guangyan Huang, Borui Cai, Wei Luo, Chi-Hung Chi, Yong Xiang, and Jing He. 2019. A Review on Automatic Facial Expression Recognition Systems Assisted by Multimodal Sensor Data. Sensors 19, 8 (2019), 27 pages. https://doi.org/10.3390/s19081863",
      "doi": ""
    },
    {
      "text": "Anvita Saxena, Ashish Khanna, and Deepak Gupta. 2020. Emotion Recognition and Detection Methods: A Comprehensive Survey. Journal of Artificial Intelligence and Systems 2 (01 2020), 53–79. https://doi.org/10.33969/AIS.2020.21005",
      "doi": ""
    },
    {
      "text": "Philip Schmidt, Attila Reiss, Robert Dürichen, and Kristof Van Laerhoven. 2019. Wearable-based affect recognition—A review. Sensors 19, 19 (2019), 4079.",
      "doi": ""
    },
    {
      "text": "Philip Schmidt, Attila Reiss, Robert Dürichen, and Kristof Van Laerhoven. 2018. Labelling Affective States ”in the Wild”: Practical Guidelines and Lessons Learned. In Proceedings of the 2018 ACM International Joint Conference and 2018 International Symposium on Pervasive and Ubiquitous Computing and Wearable Computers (Singapore, Singapore) (UbiComp ’18). Association for Computing Machinery, New York, NY, USA, 654–659. https://doi.org/10.1145/3267305.3267551",
      "doi": "10.1145/3267305.3267551"
    },
    {
      "text": "Andrea Sciarrone, Igor Bisio, Chiara Garibotto, Fabio Lavagetto, Mehrnaz Hamedani, Valeria Prada, Silvia Stara, Angelo Schenone, Federico Boero, and Gianluca Gambari. 2020. NeuroGlasses: A Wearable Prototype for Early Detection of Neurological Symptoms. In 2020 5th International Conference on Smart and Sustainable Technologies (SpliTech). IEEE, IEEE, 1–6. https://doi.org/10.23919/SpliTech49282.2020.9243713",
      "doi": ""
    },
    {
      "text": "Solos Technology Limited. 2021. Solos Smart Glasses: One for All Glasses for Smart People. Solos Technology Limited. Accessed: 2021-09-07.",
      "doi": ""
    },
    {
      "text": "Weinan Song, Yuan Liang, Jiawei Yang, Kun Wang, and Lei He. 2021. T-Net: Learning Feature Representation With Task-Specific Supervision For Biomedical Image Analysis. In 2021 IEEE 18th International Symposium on Biomedical Imaging (ISBI). IEEE, IEEE, 1924–1928. https://doi.org/10.1109/ISBI48211.2021.9433945",
      "doi": ""
    },
    {
      "text": "Benjamin Tag, Jamie A Ward, Yuji Uema, and Kai Kunze. 2019. Eyewear 2019: Third Workshop on Eyewear Computing - Focus: Social Interactions. In Adjunct Proceedings of the 2019 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2019 ACM International Symposium on Wearable Computers (London, United Kingdom) (UbiComp/ISWC ’19 Adjunct). Association for Computing Machinery, New York, NY, USA, 616–618. https://doi.org/10.1145/3341162.3347761",
      "doi": "10.1145/3341162.3347761"
    },
    {
      "text": "MM Tugade, LF Barrett, and JJ Gross. 2006. Matters of feeling precisely: Emotional granularity and emotion regulation. Unpublished manuscript 0, 0 (2006), 0 pages.",
      "doi": ""
    },
    {
      "text": "Md. Zia Uddin, Mohammed Mehedi Hassan, Ahmad Almogren, Mansour Zuair, Giancarlo Fortino, and Jim Torresen. 2017. A facial expression recognition system using robust face features from depth videos and deep learning. Computers & Electrical Engineering 63 (2017), 114–125. https://doi.org/10.1016/j.compeleceng.2017.04.019",
      "doi": "10.1016/j.compeleceng.2017.04.019"
    },
    {
      "text": "K Vijayalakshmi, S Uma, R Bhuvanya, and Annamalai Suresh. 2018. A demand for wearable devices in health care. International Journal of Engineering and Technology 7, 1.7(2018), 01–04.",
      "doi": ""
    },
    {
      "text": "Kun-Ching Wang. 2014. The Feature Extraction Based on Texture Image Information for Emotion Sensing in Speech. Sensors 14, 9 (2014), 16692–16714. https://doi.org/10.3390/s140916692",
      "doi": ""
    },
    {
      "text": "Hao Wu, Jinghao Feng, Xuejin Tian, Edward Sun, Yunxin Liu, Bo Dong, Fengyuan Xu, and Sheng Zhong. 2020. EMO: Real-Time Emotion Recognition from Single-Eye Images for Resource-Constrained Eyewear Devices. In Proceedings of the 18th International Conference on Mobile Systems, Applications, and Services (Toronto, Ontario, Canada) (MobiSys ’20). Association for Computing Machinery, New York, NY, USA, 448–461. https://doi.org/10.1145/3386901.3388917",
      "doi": "10.1145/3386901.3388917"
    },
    {
      "text": "Zhenbo Yu, Guangcan Liu, Qingshan Liu, and Jiankang Deng. 2018. Spatio-temporal convolutional features with nested LSTM for facial expression recognition. Neurocomputing 317(2018), 50–57. https://doi.org/10.1016/j.neucom.2018.07.028",
      "doi": ""
    },
    {
      "text": "Haris Zacharatos, Christos Gatzoulis, and Yiorgos L. Chrysanthou. 2014. Automatic Emotion Recognition Based on Body Movement Analysis: A Survey. IEEE Computer Graphics and Applications 34, 6 (2014), 35–45. https://doi.org/10.1109/MCG.2014.106",
      "doi": ""
    },
    {
      "text": "Matthew D. Zeiler and Rob Fergus. 2014. Visualizing and Understanding Convolutional Networks. In Computer Vision – ECCV 2014, David Fleet, Tomas Pajdla, Bernt Schiele, and Tinne Tuytelaars (Eds.). Springer International Publishing, Cham, 818–833.",
      "doi": ""
    },
    {
      "text": "Haoqi Zhang, Andrés Monroy-Hernández, Aaron Shaw, Sean Munson, Elizabeth Gerber, Benjamin Hill, Peter Kinnaird, Shelly Farnham, and Patrick Minder. 2014. WeDo: End-To-End Computer Supported Collective Action. Proceedings of the International AAAI Conference on Web and Social Media 8, 1 (May 2014), 639–642. https://ojs.aaai.org/index.php/ICWSM/article/view/14567",
      "doi": ""
    },
    {
      "text": "Rui Zhang and Oliver Amft. 2017. Monitoring chewing and eating in free-living using smart eyeglasses. IEEE journal of biomedical and health informatics 22, 1(2017), 23–32.",
      "doi": ""
    },
    {
      "text": "Fangqing Zhengren, George Chernyshov, Dingding Zheng, and Kai Kunze. 2019. Cognitive Load Assessment from Facial Temperature Using Smart Eyewear. In Adjunct Proceedings of the 2019 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2019 ACM International Symposium on Wearable Computers (London, United Kingdom) (UbiComp/ISWC ’19 Adjunct). Association for Computing Machinery, New York, NY, USA, 657–660. https://doi.org/10.1145/3341162.3348391",
      "doi": "10.1145/3341162.3348391"
    },
    {
      "text": "Lei Zhong, Changmin Bai, Jianfeng Li, Tong Chen, and Shigang Li. 2020. Facial Expression Recognition Method Based on a Part-Based Temporal Convolutional Network with a Graph-Structured Representation. In Artificial Neural Networks and Machine Learning – ICANN 2020, Igor Farkaš, Paolo Masulli, and Stefan Wermter (Eds.). Springer International Publishing, Cham, 609–620.",
      "doi": "10.1007/978-3-030-61609-0_48"
    },
    {
      "text": "Tie Hua Zhou, Gong Liang Hu, and Ling Wang. 2019. Psychological disorder identifying method based on emotion perception over social networks. International journal of environmental research and public health 16, 6(2019), 953.",
      "doi": ""
    }
  ]
}