{
  "doi": "10.1145/3491102.3517514",
  "title": "“I need to be professional until my new team uses emoji, GIFs, or memes first’’: New Collaborators’ Perspectives on Using Non-Textual Communication in Virtual Workspaces",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2022,
  "badges": [],
  "abstract": "Virtual workspaces rapidly increased during the COVID-19 pandemic, and for many new collaborators, working remotely was their first introduction to their colleagues. Building rapport is essential for a healthy work environment, and while this can be achieved through non-textual responses within chat-based systems (e.g., emoji, GIF, stickers, memes), those non-textual responses are typically associated with personal relationships and informal settings. We studied the experiences of new collaborators (questionnaire N=49; interview N=14) in using non-textual responses to communicate with unacquainted teams and the effect of non-textual responses on new collaborators’ interpersonal bonds. We found new collaborators selectively and progressively use non-textual responses to establish interpersonal bonds. Moreover, the use of non-textual responses has exposed several limitations when used on various platforms. We conclude with design recommendations such as expanding the scope of interpretable non-textual responses and reducing selection time.",
  "tags": [
    "Virtual workspaces",
    "Computer-mediated Communication",
    "Non-textual Communication"
  ],
  "authors": [
    {
      "name": "Esha Shandilya",
      "institution": "School of Information, Rochester Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233267",
      "orcid": "missing"
    },
    {
      "name": "Mingming Fan",
      "institution": "Computational Media and Arts Thrust, The Hong Kong University of Science and Technology (Guangzhou), China and Division of Integrative Systems and Design, The Hong Kong University of Science and Technology, China",
      "img": "/do/10.1145/contrib-81482645714/rel-imgonly/official-photo-rit-mingming-fan.jpg",
      "acmid": "81482645714",
      "orcid": "0000-0002-0356-4712"
    },
    {
      "name": "Garreth W. Tigwell",
      "institution": "School of Information, Rochester Institute of Technology, United States",
      "img": "/do/10.1145/contrib-99659067691/rel-imgonly/img_20170512_13473021.09.44.jpg",
      "acmid": "99659067691",
      "orcid": "0000-0002-3123-6361"
    }
  ],
  "references": [
    {
      "text": "2022. Slack is your digital HQ. https://www.slack.com/.",
      "doi": ""
    },
    {
      "text": "2022. Use emoji on your iPhone, iPad, and iPod touch. https://support.apple.com/en-us/HT202332.",
      "doi": ""
    },
    {
      "text": "2022. WhatsApp. https://www.whatsapp.com/.",
      "doi": ""
    },
    {
      "text": "AAUW. 2020. The Future Workforce: More Diverse than Ever. (2020). https://www.aauw.org/resources/article/future-workforce-diverse/",
      "doi": ""
    },
    {
      "text": "Sarah Alismail and Hengwei Zhang. 2018. The use of emoji in electronic user experience questionnaire: An exploratory case study. In Proceedings of the 51st Hawaii International Conference on System Sciences. https://doi.org/10.24251/HICSS.2018.427",
      "doi": ""
    },
    {
      "text": "Qiyu Bai, Qi Dan, Zhe Mu, and Maokun Yang. 2019. A systematic review of emoji: Current research and future perspectives. Frontiers in psychology 10 (2019), 2221. https://doi.org/10.3389/fpsyg.2019.02221",
      "doi": ""
    },
    {
      "text": "Jeremy N Bailenson. 2021. Nonverbal overload: A theoretical argument for the causes of Zoom fatigue. Technology, Mind, and Behavior 2, 1 (2021). https://doi.org/10.1037/TMB0000030",
      "doi": ""
    },
    {
      "text": "Saeideh Bakhshi, David A Shamma, Lyndon Kennedy, Yale Song, Paloma De Juan, and Joseph’Jofish’ Kaye. 2016. Fast, cheap, and good: Why animated GIFs engage us. In Proceedings of the 2016 chi conference on human factors in computing systems. 575–586. https://doi.org/10.1145/2858036.2858532",
      "doi": "10.1145/2858036.2858532"
    },
    {
      "text": "Marjorie A Bayes. 1972. Behavioral cues of interpersonal warmth.Journal of Consulting and clinical Psychology 39, 2(1972), 333. https://doi.org/10.1037/h0033367",
      "doi": ""
    },
    {
      "text": "Guy Berger. 2016. Will This Year’s College Grads Job-Hop More Than Previous Grads?https://blog.linkedin.com/2016/04/12/will-this-year_s-college-grads-job-hop-more-than-previous-grads. Accessed: 2021-8-28.",
      "doi": ""
    },
    {
      "text": "Anna Bleakley, Daniel Rough, Justin Edwards, Philip Doyle, Odile Dumbleton, Leigh Clark, Sean Rintel, Vincent Wade, and Benjamin R Cowan. 2021. Bridging social distance during social distancing: exploring social talk and remote collegiality in video conferencing. Human–Computer Interaction(2021), 1–29.",
      "doi": ""
    },
    {
      "text": "Silvia Bonaccio, Jane O’Reilly, Sharon L O’Sullivan, and François Chiocchio. 2016. Nonverbal behavior and communication in the workplace: A review and an agenda for research. Journal of Management 42, 5 (2016), 1044–1074. https://doi.org/10.1177/0149206315621146",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Amparo Caballer, Francisco Gracia, and José-María Peiró. 2005. Affective responses to work process and outcomes in virtual teams: Effects of communication media and time pressure. Journal of Managerial Psychology(2005). https://doi.org/10.1108/02683940510589037",
      "doi": ""
    },
    {
      "text": "Abraham Carmeli, Daphna Brueller, and Jane E Dutton. 2009. Learning behaviours in the workplace: The role of high-quality interpersonal relationships and psychological safety. Systems Research and Behavioral Science: The Official Journal of the International Federation for Systems Research 26, 1 (2009), 81–98. https://doi.org/10.1002/sres.932",
      "doi": ""
    },
    {
      "text": "Wayne F Cascio. 2000. Managing a virtual workplace. Academy of Management Perspectives 14, 3 (2000), 81–90. https://doi.org/10.5465/AME.2000.4468068",
      "doi": ""
    },
    {
      "text": "CDC. 2020. CDC’s Response to COVID-19. (2020).",
      "doi": ""
    },
    {
      "text": "Shayna Chapel. 2020. New Study: Nearly one-third of workers expect to work remotely full-time after the pandemic. (2020).",
      "doi": ""
    },
    {
      "text": "Arik Cheshin, Anat Rafaeli, and Nathan Bos. 2011. Anger and happiness in virtual teams: Emotional influences of text and behavior on others’ affect in the absence of non-verbal cues. Organizational behavior and human decision processes 116, 1(2011), 2–16. https://doi.org/10.1016/j.obhdp.2011.06.002",
      "doi": ""
    },
    {
      "text": "Henriette Cramer, Paloma de Juan, and Joel Tetreault. 2016. Sender-intended functions of emojis in US messaging. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services. 504–509. https://doi.org/10.1145/2935334.2935370",
      "doi": "10.1145/2935334.2935370"
    },
    {
      "text": "Ioana C. Cristea, Paul M. Leonardi, and Emmanuelle Vaast. 2019. Social Media and Teamwork: Formation, Process, and Outcomes. Cambridge University Press, 480–508. https://doi.org/10.1017/9781108649636.019",
      "doi": ""
    },
    {
      "text": "João M Cunha, Nuno Lourenço, Pedro Martins, and Penousal Machado. 2020. Visual Blending for Concept Representation: A Case Study on Emoji Generation. New Generation Computing 38, 4 (2020), 739–771. https://doi.org/10.1007/s00354-020-00107-x",
      "doi": "10.1007/s00354-020-00107-x"
    },
    {
      "text": "João Miguel Cunha, Pedro Martins, and Penousal Machado. 2018. How Shell and Horn make a Unicorn: Experimenting with Visual Blending in Emoji.. In ICCC. 145–152.",
      "doi": ""
    },
    {
      "text": "Dill. 2020. It’s Not Just Working Remotely; Hiring and Onboarding Go Virtual, Too. Wall Street Journal (2020).",
      "doi": ""
    },
    {
      "text": "Joan DiMicco, David R Millen, Werner Geyer, Casey Dugan, Beth Brownholtz, and Michael Muller. 2008. Motivations for social networking at work. In Proceedings of the 2008 ACM conference on Computer supported cooperative work. 711–720. https://doi.org/10.1145/1460563.1460674",
      "doi": "10.1145/1460563.1460674"
    },
    {
      "text": "James E Driskell, Paul H Radtke, and Eduardo Salas. 2003. Virtual teams: Effects of technological mediation on team performance.Group Dynamics: Theory, Research, and Practice 7, 4 (2003), 297. https://doi.org/10.1037/1089-2699.7.4.297",
      "doi": ""
    },
    {
      "text": "Dain Evans. 2020. How Zoom became so popular during social distancing. https://www.cnbc.com/2020/04/03/how-zoom-rose-to-the-top-during-the-coronavirus-pandemic.html. Accessed: 2021-8-28.",
      "doi": ""
    },
    {
      "text": "Oren Ezra. [n.d.]. How fast-paced teams thrive while WFH (+templates). https://monday.com/blog/remote-work/10-templates-to-manage-covid-19-and-get-your-team-wfh-ready/. Accessed: 2021-8-28.",
      "doi": ""
    },
    {
      "text": "Yunhe Feng, Zheng Lu, Wenjun Zhou, Zhibo Wang, and Qing Cao. 2020. New emoji requests from Twitter users: when, where, why, and what we can do about them. ACM Transactions on Social Computing 3, 2 (2020), 1–25. https://doi.org/10.1080/19386389.2020.1907893",
      "doi": "10.1145/3370750"
    },
    {
      "text": "Liz Fosslien and Mollie West Duffy. 2020. How to combat zoom fatigue. Harvard Business Review 29 (2020).",
      "doi": ""
    },
    {
      "text": "Vittorio Gallese. 2003. The manifold nature of interpersonal relations: the quest for a common mechanism. Philosophical Transactions of the Royal Society of London. Series B: Biological Sciences 358, 1431 (2003), 517–528.",
      "doi": ""
    },
    {
      "text": "Jose A Gallud, Habib M Fardoun, Fernando Andres, and Nehme Safa. 2018. A study on how older people use emojis. In Proceedings of the XIX International Conference on Human Computer Interaction. 1–4. https://doi.org/10.1145/3233824.3233861",
      "doi": "10.1145/3233824.3233861"
    },
    {
      "text": "Amanda N Gesselman, Vivian P Ta, and Justin R Garcia. 2019. Worth a thousand interpersonal words: Emoji as affective signals for relationship-oriented digital communication. PloS one 14, 8 (2019), e0221297. https://doi.org/10.1371/journal.pone.0221297",
      "doi": ""
    },
    {
      "text": "Lucy L Gilson, M Travis Maynard, Nicole C Jones Young, Matti Vartiainen, and Marko Hakonen. 2015. Virtual teams research: 10 years, 10 themes, and 10 opportunities. Journal of management 41, 5 (2015), 1313–1337. https://doi.org/10.1177/0149206314559946",
      "doi": ""
    },
    {
      "text": "Cole Gleason, Amy Pavel, Xingyu Liu, Patrick Carrington, Lydia B Chilton, and Jeffrey P Bigham. 2019. Making memes accessible. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. 367–376. https://doi.org/10.1145/3308561.3353792",
      "doi": "10.1145/3308561.3353792"
    },
    {
      "text": "Steve Greenspan, David Goldberg, David Weimer, and Andrea Basso. 2000. Interpersonal trust and common ground in electronically mediated communication. In Proceedings of the 2000 ACM conference on Computer supported cooperative work. 251–260.",
      "doi": "10.1145/358916.358996"
    },
    {
      "text": "Gaël Guibon, Magalie Ochs, and Patrice Bellot. 2018. Emoji recommendation in private instant messages. In Proceedings of the 33rd annual acm symposium on applied computing. 1821–1823. https://doi.org/10.1145/3167132.3167430",
      "doi": "10.1145/3167132.3167430"
    },
    {
      "text": "Sharath Chandra Guntuku, Mingyang Li, Louis Tay, and Lyle H Ungar. 2019. Studying cultural differences in emoji usage across the east and the west. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 13. 226–235.",
      "doi": ""
    },
    {
      "text": "Helen Ai He and Elaine M Huang. 2014. A qualitative study of workplace intercultural communication tensions in dyadic face-to-face and computer-mediated interactions. In Proceedings of the 2014 conference on Designing interactive systems. 415–424. https://doi.org/10.1145/2598510.2598594",
      "doi": "10.1145/2598510.2598594"
    },
    {
      "text": "Susan C. Herring and Ashley R. Dainas. 2020. Gender and Age Influences on Interpretation of Emoji Functions. Trans. Soc. Comput. 3, 2, Article 10 (April 2020), 26 pages. https://doi.org/10.1145/3375629",
      "doi": ""
    },
    {
      "text": "Susan C Herring, Ashley R Dainas, Holly Lopez Long, and Ying Tang. 2020. “If I’m Close with Them, It Wouldn’t Be Weird”: Social Distance and Animoji Use. In International Conference on Human-Computer Interaction. Springer, 285–304. https://doi.org/10.1007/978-3-030-60152-2_23",
      "doi": ""
    },
    {
      "text": "Ilma. 2020. Is your team exhausted from video calls? 5 other ways to communicate instead. https://www.remotecompany.com/blog/remote-video-call-communication-alternatives. Accessed: 2021-8-28.",
      "doi": ""
    },
    {
      "text": "Anne Jackson, JoAnne Yates, and Wanda Orlikowski. 2007. Corporate Blogging: Building community through persistent digital talk. In 2007 40th Annual Hawaii International Conference on System Sciences (HICSS’07). IEEE, 80–80. https://doi.org/10.1109/HICSS.2007.155",
      "doi": "10.1109/HICSS.2007.155"
    },
    {
      "text": "Joris H Janssen, Wijnand A Ijsselsteijn, and Joyce HDM Westerink. 2014. How affective technologies can influence intimate interactions and improve social connectedness. International Journal of Human-Computer Studies 72, 1 (2014), 33–43. https://doi.org/10.1016/j.ijhcs.2013.09.007",
      "doi": "10.1016/j.ijhcs.2013.09.007"
    },
    {
      "text": "Moyi Jia, Jiuqing Cheng, and Claudia L Hale. 2017. Workplace emotion and communication: Supervisor nonverbal immediacy, employees’ emotion experience, and their communication motives. Management Communication Quarterly 31, 1 (2017), 69–87. https://doi.org/10.1177/0893318916650519",
      "doi": ""
    },
    {
      "text": "Stefanie K Johnson, Kenneth Bettenhausen, and Ellie Gibbons. 2009. Realities of working in virtual teams: Affective and attitudinal outcomes of using computer-mediated communication. Small Group Research 40, 6 (2009), 623–649. https://doi.org/10.1177/1046496409346448",
      "doi": ""
    },
    {
      "text": "Linda K Kaye, Helen J Wall, and Stephanie A Malone. 2016. “Turn that frown upside-down”: A contextual account of emoticon usage on different virtual platforms. Computers in Human Behavior 60 (2016), 463–467. https://doi.org/10.1016/j.chb.2016.02.088",
      "doi": "10.1016/j.chb.2016.02.088"
    },
    {
      "text": "Stephanie Kelley and Hamlet Autman. 2014. Effective computer-mediated business communication: Fostering immediacy. The Journal of Research in Business Education 56, 2 (2014), 48.",
      "doi": ""
    },
    {
      "text": "Sujay Khandekar, Joseph Higg, Yuanzhe Bian, Chae Won Ryu, Jerry O. Talton Iii, and Ranjitha Kumar. 2019. Opico: a study of emoji-first communication in a mobile social app. In Companion proceedings of the 2019 world wide web conference. 450–458. https://doi.org/10.1145/3308560.3316547",
      "doi": "10.1145/3308560.3316547"
    },
    {
      "text": "Joongyum Kim, Taesik Gong, Bogoan Kim, Jaeyeon Park, Woojeong Kim, Evey Huang, Kyungsik Han, Juho Kim, Jeonggil Ko, and Sung-Ju Lee. 2020. No More One Liners: Bringing Context into Emoji Recommendations. ACM Transactions on Social Computing 3, 2 (2020), 1–25. https://doi.org/10.1145/3373146",
      "doi": "10.1145/3373146"
    },
    {
      "text": "Philippe Kimura-Thollander and Neha Kumar. 2019. Examining the” Global” Language of Emojis: Designing for Cultural Representation. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–14. https://doi.org/10.1145/3290605.3300725",
      "doi": "10.1145/3290605.3300725"
    },
    {
      "text": "Beth Kindig. 2020. Slack Set To Accelerate From Coronavirus And Work-From-Home. https://www.forbes.com/sites/bethkindig/2020/04/26/slack-set-to-accelerate-from-coronavirus-and-work-from-home/?sh=2d6697a946ba. Accessed: 2021-8-28.",
      "doi": ""
    },
    {
      "text": "Alok Kshirsagar, Tarek Mansour, Liz McNally, and Marc Metakis. 2020. Adapting workplace learning in the time of coronavirus. https://www.mckinsey.com/business-functions/mckinsey-accelerate/our-insights/adapting-workplace-learning-in-the-time-of-coronavirus. Accessed: 2021-8-28.",
      "doi": ""
    },
    {
      "text": "Chris Lam. 2013. The efficacy of text messaging to improve social connectedness and team attitude in student technical communication projects: An experimental study. Journal of Business and Technical Communication 27, 2(2013), 180–208.",
      "doi": ""
    },
    {
      "text": "Larry. 2020. COVID-19 – Moving Classes Online, Other Updates. https://www.harvard.edu/coronavirus/covid-19-moving-classes-online-other-updates/. Accessed: 2021-8-28.",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research methods in human-computer interaction. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Joon Young Lee, Nahi Hong, Soomin Kim, Jonghwan Oh, and Joonhwan Lee. 2016. Smiley face: why we use emoticon stickers in mobile messaging. In Proceedings of the 18th international conference on human-computer interaction with mobile devices and services adjunct. 760–766. https://doi.org/10.1145/2957265.2961858",
      "doi": "10.1145/2957265.2961858"
    },
    {
      "text": "Michael P Leiter and Christina Maslach. 1988. The impact of interpersonal environment on burnout and organizational commitment. Journal of organizational behavior 9, 4 (1988), 297–308. https://doi.org/10.1002/job.4030090402",
      "doi": ""
    },
    {
      "text": "Shao-Kang Lo. 2008. The nonverbal communication functions of emoticons in computer-mediated communication. Cyberpsychology & behavior 11, 5 (2008), 595–597. https://doi.org/10.1089/cpb.2007.0132",
      "doi": ""
    },
    {
      "text": "Khyati Mahajan and Samira Shaikh. 2019. Emoji Usage Across Platforms: A Case Study for the Charlottesville Event.. In WNLP@ ACL. 160–162.",
      "doi": ""
    },
    {
      "text": "Olga Makarova. 2020. Structure Remote Working with Microsoft Teams Templates. https://www.salestim.com/structure-remote-working-with-microsoft-teams-templates/. Accessed: 2021-8-28.",
      "doi": ""
    },
    {
      "text": "Jacqueline Medland. 2021. Leveraging Email to Build Healthy Effective Work Teams. Nurse Leader 19, 1 (2021), 40–46.",
      "doi": ""
    },
    {
      "text": "Hannah Jean Miller, Jacob Thebault-Spieker, Shuo Chang, Isaac Johnson, Loren Terveen, and Brent Hecht. 2016. “Blissfully Happy” or “Ready toFight”: Varying Interpretations of Emoji. In Tenth international AAAI conference on Web and social media.",
      "doi": ""
    },
    {
      "text": "Johanna Myddleton and Chris Fullwood. 2016. Social Media Impact on Organisations. In Attrill A., Fullwood C. (eds) Applied Cyberpsychology. Palgrave Macmillan, London. https://doi.org/10.1057/9781137517036_13",
      "doi": ""
    },
    {
      "text": "Niina Nurmi. 2011. Coping with coping strategies: How distributed teams and their members deal with the stress of distance, time zones and culture. Stress and Health 27, 2 (2011), 123–143. https://doi.org/10.1002/smi.1327",
      "doi": ""
    },
    {
      "text": "Michael Quinn Patton. 2014. Qualitative evaluation and research methods: integrating theory and practice. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Deepika Phutela. 2015. The importance of non-verbal communication. IUP Journal of Soft Skills 9, 4 (2015), 43.",
      "doi": ""
    },
    {
      "text": "KR Prajwal, CV Jawahar, and Ponnurangam Kumaraguru. 2019. Towards increased accessibility of meme images with the help of rich face emotion captions. In Proceedings of the 27th ACM International Conference on Multimedia. 202–210. https://doi.org/10.1145/3343031.3350939",
      "doi": "10.1145/3343031.3350939"
    },
    {
      "text": "David Rodrigues, Marília Prada, Rui Gaspar, Margarida V Garrido, and Diniz Lopes. 2018. Lisbon Emoji and Emoticon Database (LEED): Norms for emoji and emoticons in seven evaluative dimensions. Behavior research methods 50, 1 (2018), 392–405. https://doi.org/10.3758/s13428-017-0878-6",
      "doi": ""
    },
    {
      "text": "Advait Sarkar, Sean Rintel, Damian Borowiec, Rachel Bergmann, Sharon Gillett, Danielle Bragg, Nancy Baym, and Abigail Sellen. 2021. The Promise and Peril of Parallel Chat in Video Meetings for Work. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411763.3451793",
      "doi": "10.1145/3411763.3451793"
    },
    {
      "text": "Christie N Scollon, Chu Kim-Prieto, and Ed Diener. 2003. Experience sampling: Promises and pitfalls, strengths and weaknesses. Journal of Happiness studies 4, 1 (2003), 5–34.",
      "doi": ""
    },
    {
      "text": "Amrollah Shamsi, Donna Frederick, and Reza BasirianJahromi. 2021. Emoji as an Aid for Information Retrieval: A Viewpoint regarding Metadata, Technology and Improving International Information Seeking. Journal of Library Metadata(2021), 1–6. https://doi.org/10.1080/19386389.2020.1907893",
      "doi": ""
    },
    {
      "text": "Rodney Stark and William Sims Bainbridge. 1980. Networks of faith: Interpersonal bonds and recruitment to cults and sects. Amer. J. Sociology 85, 6 (1980), 1376–1395. https://doi.org/10.1086/227169",
      "doi": ""
    },
    {
      "text": "Lilian Sung. 2021. Emoji Recommendation for Text Messaging. Master’s thesis. University of Twente.",
      "doi": ""
    },
    {
      "text": "Ying Tang and Khe Foon Hew. 2019. Emoticon, emoji, and sticker use in computer-mediated communication: A review of theories and research findings. International Journal of Communication 13 (2019), 27.",
      "doi": ""
    },
    {
      "text": "Channary Tauch and Eiman Kanjo. 2016. The roles of emojis in mobile phone notifications. In Proceedings of the 2016 acm international joint conference on pervasive and ubiquitous computing: Adjunct. 1560–1565. https://doi.org/10.1145/2968219.2968549",
      "doi": "10.1145/2968219.2968549"
    },
    {
      "text": "W Scott Terry. 1988. Everyday forgetting: Data from a diary study. Psychological reports 62, 1 (1988), 299–303.",
      "doi": ""
    },
    {
      "text": "Garreth W Tigwell and David R Flatla. 2016. Oh that’s what you meant! reducing emoji misunderstanding. In Proceedings of the 18th international conference on human-computer interaction with mobile devices and services adjunct. 859–866. https://doi.org/10.1145/2957265.2961844",
      "doi": ""
    },
    {
      "text": "Garreth W Tigwell, Benjamin M Gorman, and Rachel Menzies. 2020. Emoji Accessibility for Visually Impaired People. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14. https://doi.org/10.1145/3313831.3376267",
      "doi": "10.1145/3313831.3376267"
    },
    {
      "text": "Sarah J Tracy. 2019. Qualitative research methods: Collecting evidence, crafting analysis, communicating impact. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Valiant. [n.d.]. Using a Virtual Whiteboard in Video Conferencing. ([n. d.]).",
      "doi": ""
    },
    {
      "text": "Martin Weiß, Dariana Bille, Johannes Rodrigues, and Johannes Hewig. 2020. Age-related differences in emoji evaluation. Experimental Aging Research 46, 5 (2020), 416–432. https://doi.org/10.1080/0361073X.2020.1790087",
      "doi": ""
    },
    {
      "text": "Sanjaya Wijeratne, Lakshika Balasuriya, Amit Sheth, and Derek Doran. 2016. Emojinet: Building a machine readable sense inventory for emoji. In International conference on social informatics. Springer, 527–541. https://doi.org/10.1007/978-3-319-47880-7_33",
      "doi": ""
    },
    {
      "text": "Sarah Wiseman and Sandy J. J. Gould. 2018. Repurposing Emoji for Personalised Communication: Why pizza Means “I Love You”. Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org//10.1145/3173574.3173726",
      "doi": ""
    },
    {
      "text": "Ruobing Xie, Zhiyuan Liu, Rui Yan, and Maosong Sun. 2016. Neural emoji recommendation in dialogue systems. arXiv preprint arXiv:1612.04609(2016).",
      "doi": ""
    },
    {
      "text": "Mingrui Ray Zhang, Ruolin Wang, Xuhai Xu, Qisheng Li, Ather Sharif, and Jacob O Wobbrock. 2021. Voicemoji: Emoji Entry Using Voice for Visually Impaired People. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–18. https://doi.org/10.1145/3411764.3445338",
      "doi": "10.1145/3411764.3445338"
    },
    {
      "text": "Ilze Zigurs and Bjorn Erik Munkvold. 2006. Collaboration technologies, tasks, and contexts. Human-computer interaction and management information systems: Applications 6(2006), 143.",
      "doi": ""
    }
  ]
}