{
  "doi": "10.1145/3491102.3501875",
  "title": "Much Realistic, Such Wow! A Systematic Literature Review of Realism in Digital Games",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-21",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Researchers reference realism in digital games without sufficient specificity. Without clarity about the dimensions of realism, we cannot assess how and when to aim for a higher degree of realism, when lower realism suffices, or when purposeful unrealism is ideal for a game and can benefit player experience (PX). To address this conceptual gap, we conducted a systematic review using thematic synthesis to distinguish between types of realism currently found in the digital games literature. We contribute qualitative themes that showcase contradictory design goals of realism/unrealism. From these themes, we created a framework (i.e., a hierarchical taxonomy and mapping) of realism dimensions in digital games as a conceptual foundation. Our themes and framework enable a workable specificity for designing or analyzing types of realism, equip future work to explore effects of specific realism types on PX, and offer a starting point for similar efforts in non-game applications.",
  "authors": [
    {
      "name": "Katja Rogers",
      "institution": "HCI Games Group, Games Institute, University of Waterloo, Canada and Stratford School of Interaction Design and Business, University of Waterloo, Canada",
      "img": "/do/10.1145/contrib-83458799557/rel-imgonly/img_0821-bw.png",
      "acmid": "83458799557",
      "orcid": "missing"
    },
    {
      "name": "Sukran Karaosmanoglu",
      "institution": "Human-Computer Interaction, Universität Hamburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659466914",
      "orcid": "0000-0002-9624-4258"
    },
    {
      "name": "Maximilian Altmeyer",
      "institution": "German Research Center for Artificial Intelligence (DFKI), Saarland Informatics Campus, Germany",
      "img": "/do/10.1145/contrib-87959418257/rel-imgonly/max.jpg",
      "acmid": "87959418257",
      "orcid": "0000-0003-0279-5276"
    },
    {
      "name": "Ally Suarez",
      "institution": "School of Public Health Sciences, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659891596",
      "orcid": "missing"
    },
    {
      "name": "Lennart E. Nacke",
      "institution": "HCI Games Group, Games Institute, University of Waterloo, Canada and Stratford School of Interaction Design and Business, University of Waterloo, Canada",
      "img": "/do/10.1145/contrib-81392605076/rel-imgonly/len-acm.png",
      "acmid": "81392605076",
      "orcid": "0000-0003-4290-8829"
    }
  ],
  "references": [
    {
      "text": "Olufunmilola Abraham, Tanvee Thakur, and Randall Brown. 2020. Developing a Theory-Driven Serious Game to Promote Prescription Opioid Safety Among Adolescents: Mixed Methods Study. JMIR Serious Games 8, 3 (July 2020), e18207. https://doi.org/10.2196/18207",
      "doi": ""
    },
    {
      "text": "Ernest Adams. 2014. Fundamentals of game design. Pearson Education, London, United Kingdom.",
      "doi": "10.5555/2544002"
    },
    {
      "text": "Amy L Alexander, Tad Brunyé, Jason Sidman, and Shawn A Weil. 2005. From gaming to training: A review of studies on fidelity, immersion, presence, and buy-in and their effects on transfer in pc-based simulations and games. DARWARS Training Impact Group 5 (2005), 1–14.",
      "doi": ""
    },
    {
      "text": "Dee Howard Andrews, Lynn A Carroll, and Herbert H Bell. 1995. The future of selective fidelity in training devices. Educational Technology 35, 6 (1995), 32–36.",
      "doi": ""
    },
    {
      "text": "ArenaNet. 2005. Guild Wars. Game [Windows]. (26 April 2005). NCSOFT, Pangyo, Seongnam, South Korea.",
      "doi": ""
    },
    {
      "text": "Michael Argyle. 2017. Social interaction. Routledge, Milton Park, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Edoardo Aromataris and Zachary Munn. 2020. JBI Manual for Evidence Synthesis. JBI, 2020. Available from https://synthesismanual.jbi.global. https://doi.org/10.46658/JBIMES-20-01.",
      "doi": ""
    },
    {
      "text": "Jacqueline Bailey, Karen Blackmore, and Grant Robinson. 2018. Exploring Avatar Facial Fidelity and Emotional Expressions on Observer Perception of the Uncanny Valley. In Intersections in Simulation and Gaming. Springer International Publishing, Cham, Switzerland, 201–221. https://doi.org/10.1007/978-3-319-78795-4_15",
      "doi": ""
    },
    {
      "text": "Elaine Barnett-Page and James Thomas. 2009. Methods for the synthesis of qualitative research: a critical review. BMC medical research methodology 9, 1 (2009), 1–11. https://doi.org/10.1186/1471-2288-9-59",
      "doi": ""
    },
    {
      "text": "Julie E. Bayley and Katherine E. Brown. 2015. Translating group programmes into online formats: establishing the acceptability of a parents’ sex and relationships communication serious game. BMC Public Health 15, 1 (Dec. 2015), 1–13. https://doi.org/10.1186/s12889-015-2545-0",
      "doi": ""
    },
    {
      "text": "George Joseph Becker. 2016. Documents of Modern Literary Realism. Princeton University Press, Princeton, NJ, USA.",
      "doi": ""
    },
    {
      "text": "Steffi Beckhaus and Robert W. Lindeman. 2010. Experiential Fidelity: Leveraging the Mind to Improve the VR Experience. In Virtual Realities: Dagstuhl Seminar 2008. Springer, Vienna, Austria, 39–49. https://doi.org/10.1007/978-3-211-99178-7_3",
      "doi": ""
    },
    {
      "text": "Benjamin B Bederson and Ben Shneiderman. 2003. Theories for understanding information visualization. Morgan Kaufmann, Burlington, MA, USA, 349–351.",
      "doi": ""
    },
    {
      "text": "Stuart Marshall Bender. 2014. Blood Splats and Bodily Collapse: Reported Realism and the Perception of Violence in Combat Films and Video Games. Projections 8, 2 (Jan. 2014), 1–25. https://doi.org/10.3167/proj.2014.080202",
      "doi": ""
    },
    {
      "text": "Bradley Bereitschaft. 2015. Gods of the City? Reflecting on City Building Games as an Early Introduction to Urban Systems. Journal of Geography 115, 2 (Aug. 2015), 51–60. https://doi.org/10.1080/00221341.2015.1070366",
      "doi": ""
    },
    {
      "text": "Helena Bilandzic and Rick W. Busselle. 2011. Enjoyment of films as a function of narrative experience, perceived realism and transportability. Communications: The European Journal of Communication Research 36, 1(2011), 29–50. https://doi.org/10.1515/comm.2011.002",
      "doi": ""
    },
    {
      "text": "Steven Bird, Ewan Klein, and Edward Loper. 2009. Natural language processing with Python(1st ed ed.). O’Reilly, Sebastopol, CA, USA. http://nltk.org/book.",
      "doi": ""
    },
    {
      "text": "Alan F. Blackwell. 2006. The Reification of Metaphor as a Design Tool. ACM Trans. Comput.-Hum. Interact. 13, 4 (Dec. 2006), 490–530. https://doi.org/10.1145/1188816.1188820",
      "doi": "10.1145/1188816.1188820"
    },
    {
      "text": "Jason T. Bowey and Regan L. Mandryk. 2017. Those Are Not the Stories You Are Looking For: Using Text Prototypes to Evaluate Game Narratives Early. Association for Computing Machinery, New York, NY, USA, 265–276. https://doi.org/10.1145/3116595.3116636",
      "doi": ""
    },
    {
      "text": "Doug A Bowman and Ryan P McMahan. 2007. Virtual reality: how much immersion is enough?Computer 40, 7 (2007), 36–43. https://doi.org/10.1109/MC.2007.257",
      "doi": "10.1109/MC.2007.257"
    },
    {
      "text": "Doug A. Bowman, Ryan P. McMahan, and Eric D. Ragan. 2012. Questioning Naturalism in 3D User Interfaces. Commun. ACM 55, 9 (Sept. 2012), 78–88. https://doi.org/10.1145/2330667.2330687",
      "doi": "10.1145/2330667.2330687"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4 (2019), 589–597.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. Can I use TA? Should I use TA? Should I not use TA? Comparing reflexive thematic analysis and other pattern-based qualitative analytic approaches. Counselling and Psychotherapy Research 21, 1 (2021), 37–47.",
      "doi": "10.1002/CAPR.12360"
    },
    {
      "text": "Virginia Braun, Victoria Clarke, Nikki Hayfield, and Gareth Terry. 2018. Thematic Analysis. In Handbook of Research Methods in Health Social Sciences. Springer, Singapore, 1–18. https://doi.org/10.1007/978-981-10-2779-6_103-1",
      "doi": ""
    },
    {
      "text": "Jan Bruck. 1982. From Aristotelean mimesis to ‘bourgeois’ realism. Poetics 11, 3 (July 1982), 189–202. https://doi.org/10.1016/0304-422x(82)90007-9",
      "doi": ""
    },
    {
      "text": "Kiki R. Buijs-Spanjers, Anne Harmsen, Harianne H. Hegge, Jorinde E. Spook, Sophia E. de Rooij, and Debbie A. D. C. Jaarsma. 2020. The influence of a serious game’s narrative on students’ attitudes and learning experiences regarding delirium: an interview study. BMC Medical Education 20, 1 (Sept. 2020), 1–12. https://doi.org/10.1186/s12909-020-02210-5",
      "doi": ""
    },
    {
      "text": "W Marvin Bunker. 1978. Training effectiveness versus simulation realism. In Visual Simulation and Image Realism I, Vol. 162. International Society for Optics and Photonics, SPIE, Bellingham, WA, USA, 76–82.",
      "doi": ""
    },
    {
      "text": "Rick Busselle and Helena Bilandzic. 2008. Fictionality and perceived realism in experiencing stories: A model of narrative comprehension and engagement. Communication Theory 18, 2 (2008), 255–280.",
      "doi": ""
    },
    {
      "text": "Rick Busselle, Alina Ryabovolova, and Brian Wilson. 2004. Ruining a good story: Cultivation, perceived realism and narrative. Communications: The European Journal of Communication Research 29, 3(2004), 365–378.",
      "doi": ""
    },
    {
      "text": "Rick W Busselle and Bradley S Greenberg. 2000. The nature of television realism judgments: A reevaluation of their conceptualization and measurement. Mass Communication & Society 3, 2-3 (2000), 249–268.",
      "doi": ""
    },
    {
      "text": "Loïc Caroux, Katherine Isbister, Ludovic Le Bigot, and Nicolas Vibert. 2015. Player–video game interaction: A systematic review of current concepts. Computers in Human Behavior 48 (July 2015), 366–381. https://doi.org/10.1016/j.chb.2015.01.066",
      "doi": ""
    },
    {
      "text": "Christopher Carroll, Andrew Booth, and Katy Cooper. 2011. A worked example of” best fit” framework synthesis: a systematic review of views concerning the taking of some potential chemopreventive agents. BMC medical research methodology 11, 1 (2011), 1–9. https://doi.org/10.1186/1471-2288-11-29",
      "doi": ""
    },
    {
      "text": "Ruben Chambilla, Daniel Tomiuk, Suzanne Marcotte, Michel Plaisent, and Prosper Bernard. 2020. Factors Affecting Satisfaction with Serious Games - Direct, Mediated and Higher-Order Constructs. In 2020 11th IEEE Annual Information Technology, Electronics and Mobile Communication Conference (IEMCON). IEEE, Piscataway, NJ, USA, 0845–0853. https://doi.org/10.1109/iemcon51383.2020.9284862",
      "doi": ""
    },
    {
      "text": "Laquana Cooke and Gaines S Hubbell. 2015. Working out memory with a Medal of Honor complex. Game Studies 15, 2 (2015). http://gamestudies.org/1502/articles/cookehubbell.",
      "doi": ""
    },
    {
      "text": "Harris Cooper. 2016. Research synthesis and meta-analysis: a step-by-step approach. SAGE, Los Angeles.",
      "doi": ""
    },
    {
      "text": "Richard Coyne. 1992. The Role of Metaphor in Understanding Computers in Design. In Proceedings of the International Conference of the Association for Computer-Aided Design in Architecture (ACADIA). Association for Computer Aided Design, Fargo, ND, USA, 3–1.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi and Isabella Selega Csikszentmihalyi. 1992. Optimal experience: Psychological studies of flow in consciousness. Cambridge University Press, Cambridge, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Yngve Dahl, Ole A Alsos, and Dag Svanæs. 2010. Fidelity considerations for simulation-based usability assessments of mobile ICT for hospitals. Intl. Journal of Human–Computer Interaction 26, 5(2010), 445–476.",
      "doi": ""
    },
    {
      "text": "Rowan Daneels, Steven Malliet, Joyce Koeman, and Wannes Ribbens. 2018. The enjoyment of shooting games: Exploring the role of perceived realism. Computers in Human Behavior 86 (2018), 330–336. https://doi.org/10.1016/j.chb.2018.04.053",
      "doi": ""
    },
    {
      "text": "Cassie Bennett David J. King. 2016. An investigation of two real time machine learning techniques that could enhance the adaptability of game AI agents. In Proceedings of GAMEON’2016, the 17th International Conference on Intelligent Games and Simulation. EUROSIS, Ostend, Belgium, 41–48.",
      "doi": ""
    },
    {
      "text": "Maria De Marsico, Emanuele Panizzi, Francesca Romana Mattei, Antonio Musolino, Manuel Prandini, Marzia Riso, and Davide Sforza. 2020. Virtual Bowling: Launch as You All Were There!. In Proceedings of the International Conference on Advanced Visual Interfaces (Salerno, Italy) (AVI ’20). Association for Computing Machinery, New York, NY, USA, Article 36, 9 pages. https://doi.org/10.1145/3399715.3399848",
      "doi": "10.1145/3399715.3399848"
    },
    {
      "text": "Javier Dehesa, Andrew Vidler, Christof Lutteroth, and Julian Padget. 2020. Touché: Data-Driven Interactive Sword Fighting in Virtual Reality. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376714",
      "doi": ""
    },
    {
      "text": "Simon Demediuk, Marco Tamassia, Xiaodong Li, and William L. Raffe. 2019. Challenging AI: Evaluating the Effect of MCTS-Driven Dynamic Difficulty Adjustment on Player Enjoyment. In Proceedings of the Australasian Computer Science Week Multiconference (Sydney, NSW, Australia) (ACSW 2019). Association for Computing Machinery, New York, NY, USA, Article 43, 7 pages. https://doi.org/10.1145/3290688.3290748",
      "doi": "10.1145/3290688.3290748"
    },
    {
      "text": "Jack Denham, Steven Hirschler, and Matthew Spokes. 2019. The reification of structural violence in video games. Crime, Media, Culture: An International Journal 17, 1 (Oct. 2019), 85–103. https://doi.org/10.1177/1741659019881040",
      "doi": ""
    },
    {
      "text": "Peter Dieckmann, David Gaba, and Marcus Rall. 2007. Deepening the theoretical foundations of patient simulation as social practice. Simulation in Healthcare 2, 3 (2007), 183–193.",
      "doi": ""
    },
    {
      "text": "Mary Dixon-Woods, Shona Agarwal, David Jones, Bridget Young, and Alex Sutton. 2005. Synthesising qualitative and quantitative evidence: a review of possible methods. Journal of health services research & policy 10, 1 (2005), 45–53. https://doi.org/10.1186/1471-2288-6-35",
      "doi": ""
    },
    {
      "text": "Inger Ekman. 2008. Psychologically motivated techniques for emotional sound in computer games. Proceedings of AudioMostly(2008), 20–26.",
      "doi": ""
    },
    {
      "text": "Elsevier. 2020. Scopus Content Coverage Guide. https://www.elsevier.com/__data/assets/pdf_file/0007/69451/Scopus_ContentCoverage_Guide_WEB.pdf.",
      "doi": ""
    },
    {
      "text": "Nuša Faric, Henry W W Potts, Adrian Hon, Lee Smith, Katie Newby, Andrew Steptoe, and Abi Fisher. 2019. What Players of Virtual Reality Exercise Games Want: Thematic Analysis of Web-Based Reviews. Journal of Medical Internet Research 21, 9 (Sept. 2019), e13833. https://doi.org/10.2196/13833",
      "doi": ""
    },
    {
      "text": "Helen Farley and Caroline Steel. 2012. Multiple Sensorial Media and Presence in 3D Environments. IGI Global, Hershey, PA, USA, 39–58. https://doi.org/10.4018/978-1-60960-821-7.ch002",
      "doi": ""
    },
    {
      "text": "C Dennis Fink and Edgar L Shriver. 1978. Simulators for maintenance training: Some issues, problems and areas for future research. Technical Report ADA060088. Defense Technical Information Center, Fort Belvoir, VA, USA. 71 pages. Interim rept. Jun 77-Jan 78. https://apps.dtic.mil/sti/citations/ADA060088.",
      "doi": ""
    },
    {
      "text": "Martin Flintham, Richard Hyde, Paul Tennent, Jan-Hinrik Meyer-Sahling, and Stuart Moran. 2020. Now Wash Your Hands: Understanding Food Legislation Compliance in a Virtual Reality Restaurant Kitchen. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Virtual Event, Canada) (CHI PLAY ’20). Association for Computing Machinery, New York, NY, USA, 169–180. https://doi.org/10.1145/3410404.3414237",
      "doi": "10.1145/3410404.3414237"
    },
    {
      "text": "Emmanuel Fokides, Penelope Atsikpasi, Polyxeni Kaimara, and Ioannis Deliyannis. 2019. Factors Influencing the Subjective Learning Effectiveness of Serious Games. Journal of Information Technology Education: Research 18 (2019), 437–466. https://doi.org/10.28945/4441",
      "doi": ""
    },
    {
      "text": "Nicholas Free, Hector M. Menendez, and Luis O. Tedeschi. 2021. A paradigm shift for academia teaching in the era of virtual technology: The case study of developing an edugame in animal science. In Special Issue on: The frontiers of augmented and mixed reality in all levels of education. Springer Science and Business Media LLC, Berlin/Heidelberg, Germany, 1–18. https://doi.org/10.1007/s10639-020-10415-w",
      "doi": ""
    },
    {
      "text": "Alexander R Galloway. 2004. Social realism in gaming. Game studies 4, 1 (2004), 2004. http://www.gamestudies.org/0401/galloway/.",
      "doi": ""
    },
    {
      "text": "Subset Games. 2017. Into the Breach. Game [macOS]. (9 August 2017). Subset Games, Shanghai, China.",
      "doi": ""
    },
    {
      "text": "Audrey Girouard, Orit Shaer, Erin T. Solovey, G. Michael Poor, and Robert J. K. Jacob. 2019. The Reality of Reality-Based Interaction: Understanding the Impact of a Framework as a Research Tool. ACM Trans. Comput.-Hum. Interact. 26, 5, Article 35 (Sept. 2019), 35 pages. https://doi.org/10.1145/3319617",
      "doi": "10.1145/3319617"
    },
    {
      "text": "Alex Golub. 2010. Being in the World (of Warcraft): Raiding, realism, and knowledge production in a massively multiplayer online game. Anthropological Quarterly 83, 1 (2010), 17–45.",
      "doi": ""
    },
    {
      "text": "Antti Granqvist, Tapio Takala, Jari Takatalo, and Perttu Hämäläinen. 2018. Exaggeration of Avatar Flexibility in Virtual Reality. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (Melbourne, VIC, Australia) (CHI PLAY ’18). Association for Computing Machinery, New York, NY, USA, 201–209. https://doi.org/10.1145/3242671.3242694",
      "doi": "10.1145/3242671.3242694"
    },
    {
      "text": "Torben Grodal. 2002. The Experience of Audiovisual Realism. In Realism and ’Reality’ in Film and Media. Museum Tusculanum Press, Copenhagen, Denmark, 67–91.",
      "doi": ""
    },
    {
      "text": "Shad Gross, Jeffrey Bardzell, and Shaowen Bardzell. 2014. Skeu the Evolution: Skeuomorphs, Style, and the Material of Tangible Interactions. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (Munich, Germany) (TEI ’14). Association for Computing Machinery, New York, NY, USA, 53–60. https://doi.org/10.1145/2540930.2540969",
      "doi": "10.1145/2540930.2540969"
    },
    {
      "text": "Sebastian Günther, Dominik Schön, Florian Müller, Max Mühlhäuser, and Martin Schmitz. 2020. PneumoVolley: Pressure-Based Haptic Feedback on the Head through Pneumatic Actuation. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3334480.3382916",
      "doi": "10.1145/3334480.3382916"
    },
    {
      "text": "Wen Hai, Nisha Jain, Andrzej Wydra, Nadia Magnenat Thalmann, and Daniel Thalmann. 2018. Increasing the Feeling of Social Presence by Incorporating Realistic Interactions in Multi-Party VR. In Proceedings of the 31st International Conference on Computer Animation and Social Agents (Beijing, China) (CASA 2018). Association for Computing Machinery, New York, NY, USA, 7–10. https://doi.org/10.1145/3205326.3205345",
      "doi": "10.1145/3205326.3205345"
    },
    {
      "text": "Ilona Halim, John Casey, and Nilufar Baghaei. 2018. Designing a virtual reality flight simulator. In Proceedings of the 26th International Conference on Computers in Education. Asia-Pacific Society for Computers in Education (APSCE), Taoyuan, Taiwan, 518–520.",
      "doi": ""
    },
    {
      "text": "Alice Hall. 2003. Reading realism: Audiences’ evaluations of the reality of media texts. Journal of communication 53, 4 (2003), 624–641.",
      "doi": ""
    },
    {
      "text": "Perttu Hämäläinen, Tommi Ilmonen, Johanna Höysniemi, Mikko Lindholm, and Ari Nykänen. 2005. Martial Arts in Artificial Reality. Association for Computing Machinery, New York, NY, USA, 781–790. https://doi.org/10.1145/1054972.1055081",
      "doi": ""
    },
    {
      "text": "Perttu Hämäläinen, Joe Marshall, Raine Kajastila, Richard Byrne, and Florian ”Floyd” Mueller. 2015. Utilizing Gravity in Movement-Based Games and Play. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (London, United Kingdom) (CHI PLAY ’15). Association for Computing Machinery, New York, NY, USA, 67–77. https://doi.org/10.1145/2793107.2793110",
      "doi": "10.1145/2793107.2793110"
    },
    {
      "text": "Robert Parker Hawkins. 1977. The dimensional structure of children’s perceptions of television reality. Communication Research 4, 3 (1977), 299–320.",
      "doi": ""
    },
    {
      "text": "Susan Hayward. 2017. Cinema studies: The key concepts. Routledge, Milton Park, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Chris Heinrich, Matthew Cook, Tobias Langlotz, and Holger Regenbrecht. 2020. My hands? Importance of personalised virtual hands in a neurorehabilitation scenario. Virtual Reality 25, 2 (July 2020), 313–330. https://doi.org/10.1007/s10055-020-00456-4",
      "doi": ""
    },
    {
      "text": "Stephanie Heintz and Effie L.-C. Law. 2018. Digital Educational Games: Methodologies for Evaluating the Impact of Game Type. ACM Trans. Comput.-Hum. Interact. 25, 2, Article 8 (April 2018), 47 pages. https://doi.org/10.1145/3177881",
      "doi": "10.1145/3177881"
    },
    {
      "text": "Jeffrey C. F. Ho. 2016. Effect of Real-World Experience on Immersion in Virtual Reality Games: A Preliminary Study. In Proceedings of the Fourth International Symposium on Chinese CHI (San Jose, USA) (ChineseCHI2016). Association for Computing Machinery, New York, NY, USA, Article 6, 5 pages. https://doi.org/10.1145/2948708.2948709",
      "doi": "10.1145/2948708.2948709"
    },
    {
      "text": "Tomlinson Holman. 2012. Sound for film and television. Focal press, Waltham, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Kristina Höök and Jonas Löwgren. 2012. Strong Concepts: Intermediate-Level Knowledge in Interaction Design Research. ACM Trans. Comput.-Hum. Interact. 19, 3, Article 23 (Oct. 2012), 18 pages. https://doi.org/10.1145/2362364.2362371",
      "doi": "10.1145/2362364.2362371"
    },
    {
      "text": "Robert J.K. Jacob, Audrey Girouard, Leanne M. Hirshfield, Michael S. Horn, Orit Shaer, Erin Treacy Solovey, and Jamie Zigelbaum. 2008. Reality-Based Interaction: A Framework for Post-WIMP Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 201–210. https://doi.org/10.1145/1357054.1357089",
      "doi": "10.1145/1357054.1357089"
    },
    {
      "text": "Robert J. K. Jacob, Audrey Girouard, Leanne M. Hirshfield, Michael S. Horn, Orit Shaer, Erin Treacy Solovey, and Jamie Zigelbaum. 2007. Reality-Based Interaction: Unifying the New Generation of Interaction Styles. Association for Computing Machinery, New York, NY, USA, 2465–2470. https://doi.org/10.1145/1240866.1241025",
      "doi": ""
    },
    {
      "text": "Sue Jamison-Powell, Conor Linehan, Laura Daley, Andrew Garbett, and Shaun Lawson. 2012. ”I Can’t Get No Sleep”: Discussing #insomnia on Twitter. Association for Computing Machinery, New York, NY, USA, 1501–1510. https://doi.org/10.1145/2207676.2208612",
      "doi": ""
    },
    {
      "text": "Charlene Jennett, Anna L. Cox, Paul Cairns, Samira Dhoparee, Andrew Epps, Tim Tijs, and Alison Walton. 2008. Measuring and defining the experience of immersion in games. International Journal of Human-Computer Studies 66, 9 (Sept. 2008), 641–661. https://doi.org/10.1016/j.ijhcs.2008.04.004",
      "doi": "10.1016/j.ijhcs.2008.04.004"
    },
    {
      "text": "Hans-Christian Jetter, Harald Reiterer, and Florian Geyer. 2013. Blended Interaction: understanding natural human–computer interaction in post-WIMP interactive spaces. Personal and Ubiquitous Computing 18, 5 (Oct. 2013), 1139–1158. https://doi.org/10.1007/s00779-013-0725-4",
      "doi": ""
    },
    {
      "text": "Raine Kajastila, Leo Holsti, and Perttu Hämäläinen. 2014. Empowering the exercise: A body-controlled trampoline training game. International journal of computer science in sport 13, 1 (2014), 6–23.",
      "doi": ""
    },
    {
      "text": "Bill Kapralos, Fuad Moussa, and Adam Dubrowski. 2014. An Overview of Virtual Simulation and Serious Gaming for Surgical Education and Training. In Studies in Computational Intelligence. Springer, Berlin/Heidelberg, Germany, 289–306. https://doi.org/10.1007/978-3-642-45432-5_14",
      "doi": ""
    },
    {
      "text": "Bill Feenstra Kevin O’Neill. 2016. “Honestly, I Would Stick with the Books”: Young Adults’ Ideas About a Videogame as a Source of Historical Knowledge. Game Studies 16, 2 (2016). http://gamestudies.org/1602/articles/oneilfeenstra.",
      "doi": ""
    },
    {
      "text": "Erin Kim and Oliver Schneider. 2020. Defining Haptic Experience: Foundations for Understanding, Communicating, and Evaluating HX. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376280",
      "doi": "10.1145/3313831.3376280"
    },
    {
      "text": "Scott A. King. 2008. Animating Speech in Games. In Motion in Games. Springer, Berlin/Heidelberg, Germany, 234–245. https://doi.org/10.1007/978-3-540-89220-5_23",
      "doi": ""
    },
    {
      "text": "Peter Korfiatis, Robert Cloutier, and Teresa Zigh. 2015. Model-Based Concept of Operations Development Using Gaming Simulation. Simulation & Gaming 46, 5 (March 2015), 471–488. https://doi.org/10.1177/1046878115571290",
      "doi": "10.1177/1046878115571290"
    },
    {
      "text": "Andrey Krekhov, Katharina Emmerich, Philipp Bergmann, Sebastian Cmentowski, and Jens Krüger. 2017. Self-Transforming Controllers for Virtual Reality First Person Shooters. Association for Computing Machinery, New York, NY, USA, 517–529. https://doi.org/10.1145/3116595.3116615",
      "doi": ""
    },
    {
      "text": "Przemyslaw Krompiec and Kyoungju Park. 2019. Enhanced Player Interaction Using Motion Controllers for First-Person Shooting Games in Virtual Reality. IEEE Access 7(2019), 124548–124557. https://doi.org/10.1109/access.2019.2937937",
      "doi": ""
    },
    {
      "text": "A. Kulik. 2009. Building on Realism and Magic for Designing 3D Interaction Techniques. IEEE Computer Graphics and Applications 29, 6 (Nov. 2009), 22–33. https://doi.org/10.1109/mcg.2009.115",
      "doi": ""
    },
    {
      "text": "Chongsan Kwon. 2020. The Effect of the Degree of Anxiety of Learners during the Use of VR on the Flow and Learning Effect. Applied Sciences 10, 14 (July 2020), 4932. https://doi.org/10.3390/app10144932",
      "doi": ""
    },
    {
      "text": "Birger Langkjær. 2009. Making fictions sound real-On film sound, perceptual realism and genre. MedieKultur: Journal of media and communication research 26, 48(2009), 13–p.",
      "doi": ""
    },
    {
      "text": "Lauri Lehtonen, Maximus D. Kaos, Raine Kajastila, Leo Holsti, Janne Karsisto, Sami Pekkola, Joni Vähämäki, Lassi Vapaakallio, and Perttu Hämäläinen. 2019. Movement Empowerment in a Multiplayer Mixed-Reality Trampoline Game. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Barcelona, Spain) (CHI PLAY ’19). Association for Computing Machinery, New York, NY, USA, 19–29. https://doi.org/10.1145/3311350.3347181",
      "doi": "10.1145/3311350.3347181"
    },
    {
      "text": "Jih-Hsuan Lin and Wei Peng. 2015. The contributions of perceived graphic and enactive realism to enjoyment and engagement in active video games. International Journal of Technology and Human Interaction (IJTHI) 11, 3(2015), 1–16.",
      "doi": "10.5555/2795091.2795092"
    },
    {
      "text": "Julia Littell. 2008. Systematic reviews and meta-analysis. Oxford University Press, Oxford New York.",
      "doi": ""
    },
    {
      "text": "Dahai Liu, Nikolas Macchiarella, and Dennis Vincenzi. 2008. Simulation Fidelity. Routledge, Milton Park, United Kingdom, 61–73. https://doi.org/10.1201/9781420072846.ch4",
      "doi": ""
    },
    {
      "text": "Mitchell G. H. Loewen, Christopher T. Burris, and Lennart E. Nacke. 2021. Me, Myself, and Not-I: Self-Discrepancy Type Predicts Avatar Creation Style. Frontiers in Psychology 11 (Jan. 2021), 1902. https://doi.org/10.3389/fpsyg.2020.01902",
      "doi": ""
    },
    {
      "text": "Matthew Lombard and Theresa Ditton. 1997. At the heart of it all: The concept of presence. Journal of computer-mediated communication 3, 2 (1997), JCMC321. https://doi.org/10.1111/j.1083-6101.1997.tb00072.x",
      "doi": ""
    },
    {
      "text": "[97] Optimal Workshop Ltd.2021. https://www.optimalworkshop.com/. Last accessed: December 23, 2021.",
      "doi": ""
    },
    {
      "text": "Heide Lukosch, Stephan Lukosch, Simon Hoermann, and Robert W. Lindeman. 2019. Conceptualizing Fidelity for HCI in Applied Gaming. In Lecture Notes in Computer Science. Springer International Publishing, Cham, Switzerland, 165–179. https://doi.org/10.1007/978-3-030-22602-2_14",
      "doi": ""
    },
    {
      "text": "Cayley MacArthur, Arielle Grinberg, Daniel Harley, and Mark Hancock. 2021. You’re Making Me Sick: A Systematic Review of How Virtual Reality Research Considers Gender & Cybersickness. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 401, 15 pages. https://doi.org/10.1145/3411764.3445701",
      "doi": "10.1145/3411764.3445701"
    },
    {
      "text": "Michal Malewicz. 2019. Neumorphism in user interfaces: How UI trends reach for inspiration into the real world and what problems do we have to solve to make those trends work.Blog post at UX Collection (uxdesign.cc). Available at https://uxdesign.cc/neumorphism-in-user-interfaces-b47cef3bf3a6, last accessed 9 September, 2021.",
      "doi": ""
    },
    {
      "text": "Steven Malliet. 2006. An exploration of adolescents’ perceptions of videogame realism. Learning, media and technology 31, 4 (2006), 377–394.",
      "doi": ""
    },
    {
      "text": "Alice Malpass, Alison Shaw, Debbie Sharp, Fiona Walter, Gene Feder, Matthew Ridd, and David Kessler. 2009. “Medication career” or “Moral career”? The two sides of managing antidepressants: A meta-ethnography of patients' experience of antidepressants. Social Science & Medicine 68, 1 (Jan. 2009), 154–168. https://doi.org/10.1016/j.socscimed.2008.09.068",
      "doi": ""
    },
    {
      "text": "Molly Manning, Anne MacFarlane, Anne Hickey, and Sue Franklin. 2019. Perspectives of people with aphasia post-stroke towards personal recovery and living successfully: A systematic review and thematic synthesis. PLOS ONE 14, 3 (March 2019), e0214200. https://doi.org/10.1371/journal.pone.0214200",
      "doi": ""
    },
    {
      "text": "Tim May and Beth Perry. 2014. Reflexivity and the practice of qualitative research. Vol. 109. Sage, Los Angeles, USA, Chapter 8, 109–122.",
      "doi": ""
    },
    {
      "text": "Rory McGloin, Kirstie M. Farrar, and Joshua Fishlock. 2015. Triple Whammy! Violent Games and Violent Controllers: Investigating the Use of Realistic Gun Controllers on Perceptions of Realism, Immersion, and Outcome Aggression. Journal of Communication 65, 2 (Feb. 2015), 280–299. https://doi.org/10.1111/jcom.12148",
      "doi": ""
    },
    {
      "text": "Rory McGloin, Kirstie M. Farrar, Marina Krcmar, Suji Park, and Joshua Fishlock. 2016. Modeling outcomes of violent video game play: Applying mental models and model matching to explain the relationship between user differences, game characteristics, enjoyment, and aggressive intentions. Computers in Human Behavior 62 (Sept. 2016), 442–451. https://doi.org/10.1016/j.chb.2016.04.018",
      "doi": ""
    },
    {
      "text": "Ryan P McMahan, Doug A Bowman, David J Zielinski, and Rachael B Brady. 2012. Evaluating display fidelity and interaction fidelity in a virtual reality game. IEEE transactions on visualization and computer graphics 18, 4(2012), 626–633. https://doi.org/10.1109/TVCG.2012.43",
      "doi": "10.1109/TVCG.2012.43"
    },
    {
      "text": "Paul Milgram and Fumio Kishino. 1994. A Taxonomy of Mixed Reality Visual Displays. IEICE Trans. Information Systems vol. E77-D, no. 12 (12 1994), 1321–1329.",
      "doi": ""
    },
    {
      "text": "Alexander Miller. 2019. Political Realism in International Relations. The Stanford Encyclopedia of Philosophy (Summer 2018 Edition). https://plato.stanford.edu/archives/win2019/entries/realism/.",
      "doi": ""
    },
    {
      "text": "Alexander Miller. 2019. Realism. The Stanford Encyclopedia of Philosophy (Winter 2019 Edition). https://plato.stanford.edu/archives/win2019/entries/realism/.",
      "doi": ""
    },
    {
      "text": "[111] Miro.2021. https://miro.com/. Last accessed: December 23, 2021.",
      "doi": ""
    },
    {
      "text": "Scott Mitchell and Sheryl N Hamilton. 2017. Playing at apocalypse: Reading Plague Inc. in pandemic culture. Convergence: The International Journal of Research into New Media Technologies 24, 6 (Jan. 2017), 587–606. https://doi.org/10.1177/1354856516687235",
      "doi": ""
    },
    {
      "text": "Ryo Mizobata, Chaklam Silpasuwanchai, and Xiangshi Ren. 2014. Only for Casual Players? Investigating Player Differences in Full-Body Game Interaction. In Proceedings of the Second International Symposium of Chinese CHI (Toronto, Ontario, Canada) (Chinese CHI ’14). Association for Computing Machinery, New York, NY, USA, 57–65. https://doi.org/10.1145/2592235.2592244",
      "doi": "10.1145/2592235.2592244"
    },
    {
      "text": "Mojang. 2011. Minecraft. Game [Microsoft Windows]. (18 November 2011) Mojang, Stockholm, Sweden. Microsoft Studios, Redmond, Washington, United States. Sony Computer Entertainment, San Mateo, California, United States.",
      "doi": ""
    },
    {
      "text": "Pam Morris. 2004. Realism. Routledge, Milton Park, United Kingdom. https://doi.org/10.4324/9780203634073",
      "doi": ""
    },
    {
      "text": "Muriel Ney, Celso Goncalves, and Nicolas Balacheff. 2014. Design Heuristics for Authentic Simulation-Based Learning Games. IEEE Transactions on Learning Technologies 7, 2 (April 2014), 132–141. https://doi.org/10.1109/tlt.2014.2316161",
      "doi": ""
    },
    {
      "text": "Linda Nochlin. 1991. Realism: (Style and Civilization).",
      "doi": ""
    },
    {
      "text": "Don Norman. 2013. The design of everyday things: Revised and expanded edition. Basic Books, New York, USA.",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Aline Normoyle and Sophie Jörg. 2014. Trade-Offs between Responsiveness and Naturalness for Player Characters. In Proceedings of the Seventh International Conference on Motion in Games (Playa Vista, California) (MIG ’14). Association for Computing Machinery, New York, NY, USA, 61–70. https://doi.org/10.1145/2668064.2668087",
      "doi": "10.1145/2668064.2668087"
    },
    {
      "text": "Aline Normoyle and Sophie Jörg. 2016. The effect of animation controller and avatar on player perceptions. Computer Animation and Virtual Worlds 29, 6 (Nov. 2016), 1–16. https://doi.org/10.1002/cav.1731",
      "doi": ""
    },
    {
      "text": "Anne E. Norris, Harry Weger, Cory Bullinger, and Alyssa Bowers. 2014. Quantifying engagement: Measuring player involvement in human–avatar interactions. Computers in Human Behavior 34 (May 2014), 1–11. https://doi.org/10.1016/j.chb.2014.01.044",
      "doi": ""
    },
    {
      "text": "Ottawa Hospital Research Institute (OHRI): PRISMA Group. 2020. PRISMA 2020 flowchart. http://prisma-statement.org/prismastatement/flowdiagram.aspx. Last accessed: December 23, 2021.",
      "doi": ""
    },
    {
      "text": "Matthew J Page, Joanne E McKenzie, Patrick M Bossuyt, Isabelle Boutron, Tammy C Hoffmann, Cynthia D Mulrow, Larissa Shamseer, Jennifer M Tetzlaff, Elie A Akl, Sue E Brennan, Roger Chou, Julie Glanville, Jeremy M Grimshaw, Asbjørn Hróbjartsson, Manoj M Lalu, Tianjing Li, Elizabeth W Loder, Evan Mayo-Wilson, Steve McDonald, Luke A McGuinness, Lesley A Stewart, James Thomas, Andrea C Tricco, Vivian A Welch, Penny Whiting, and David Moher. 2021. The PRISMA 2020 statement: an updated guideline for reporting systematic reviews. BMJ 372 (March 2021), n71. https://doi.org/10.1136/bmj.n71",
      "doi": ""
    },
    {
      "text": "Jane B Paige and Karen H Morin. 2013. Simulation fidelity and cueing: A systematic review of the literature. Clinical Simulation in Nursing 9, 11 (2013), e481–e489.",
      "doi": ""
    },
    {
      "text": "Loral Patchen, Lindsey Ellis, Tony Xuyen Ma, Corilyn Ott, Katie HK Chang, Brook Araya, Sravanthi Atreyapurapu, Amal Alyusuf, and Robin Gaines Lanzi. 2020. Engaging African American Youth in the Development of a Serious Mobile Game for Sexual Health Education: Mixed Methods Study. JMIR Serious Games 8, 1 (Jan. 2020), e16254. https://doi.org/10.2196/16254",
      "doi": ""
    },
    {
      "text": "Sandra Poeschl and Nicola Doering. 2013. The German VR Simulation Realism Scale-Psychometric Construction for Virtual Reality Applications with Virtual Humans.Annual Review of Cybertherapy and Telemedicine 11 (2013), 33–37.",
      "doi": ""
    },
    {
      "text": "Lyudmila Popova. 2010. Perceived reality of media messages: Concept explication and testing. Ph.D. Dissertation. University of California, Santa Barbara.",
      "doi": ""
    },
    {
      "text": "Michael I Posner, Mary J Nissen, and Raymond M Klein. 1976. Visual dominance: an information-processing account of its origins and significance.Psychological review 83, 2 (1976), 157. https://doi.org/10.1037/0033-295X.83.2.157",
      "doi": ""
    },
    {
      "text": "W James Potter. 1988. Perceived reality in television effects research. Journal of Broadcasting & Electronic Media 32, 1 (1988), 23–41.",
      "doi": ""
    },
    {
      "text": "Oxford University Press. 2021. Definition of fidelity [online]. Available at: https://www.lexico.com/definition/fidelity. (Accessed: 6 July 2021).",
      "doi": ""
    },
    {
      "text": "Oxford University Press. 2021. Definition of realism [online]. Available at: https://www.lexico.com/definition/realism. (Accessed: 6 July 2021).",
      "doi": ""
    },
    {
      "text": "NLTK Project. 2009. NLTK 3.6.2 documentation. https://www.nltk.org/api/nltk.html. Last accessed: July 16, 2021.",
      "doi": ""
    },
    {
      "text": "Eric D Ragan, Doug A Bowman, Regis Kopper, Cheryl Stinson, Siroberto Scerbo, and Ryan P McMahan. 2015. Effects of field of view and visual complexity on virtual reality training effectiveness for a visual scanning task. IEEE transactions on visualization and computer graphics 21, 7(2015), 794–807.",
      "doi": "10.1109/TVCG.2015.2403312"
    },
    {
      "text": "Albert J Rehmann, Robert D Mitman, and Michael C Reynolds. 1995. A Handbook of Flight Simulation Fidelity Requirements for Human Factors Research.Technical Report. Crew System Ergonomics Information Analysis Center Wright-Patterson AFB OH.",
      "doi": ""
    },
    {
      "text": "Wannes Ribbens. 2013. Perceived game realism: a test of three alternative models. Cyberpsychology, Behavior, and Social Networking 16, 1(2013), 31–36.",
      "doi": ""
    },
    {
      "text": "Wannes Ribbens and Steven Malliet. 2010. Perceived digital game realism: A quantitative exploration of its structure. Presence 19, 6 (2010), 585–600.",
      "doi": "10.1162/pres_a_00024"
    },
    {
      "text": "Wannes Ribbens, Steven Malliet, Richard Van Eck, and Damien Larkin. 2016. Perceived realism in shooting games: Towards scale validation. Computers in Human Behavior 64 (2016), 308–318.",
      "doi": "10.1016/j.chb.2016.06.055"
    },
    {
      "text": "Rockstar Studios. 2018. Red Dead Redemption 2. Game [PlayStation 4]. (26 October 2018). Rockstar Games, New York City, NY, United States.",
      "doi": ""
    },
    {
      "text": "Katja Rogers, Jana Funke, Julian Frommel, Sven Stamm, and Michael Weber. 2019. Exploring Interaction Fidelity in Virtual Reality: Object Manipulation and Whole-Body Movements. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300644",
      "doi": "10.1145/3290605.3300644"
    },
    {
      "text": "Katja Rogers, Sukran Karaosmanoglu, Dennis Wolf, Frank Steinicke, and Lennart E. Nacke. 2021. A Best-Fit Framework and Systematic Review of Asymmetric Gameplay in Multiplayer Virtual Reality Games. Frontiers in Virtual Reality 2 (July 2021), 85. https://doi.org/10.3389/frvir.2021.694660",
      "doi": ""
    },
    {
      "text": "Katja Rogers, Giovanni Ribeiro, Rina R. Wehbe, Michael Weber, and Lennart E. Nacke. 2018. Vanishing Importance: Studying Immersive Effects of Game Audio Perception on Player Experiences in Virtual Reality. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173902",
      "doi": "10.1145/3173574.3173902"
    },
    {
      "text": "Yvonne Rogers. 2012. HCI theory: classical, modern, and contemporary. Synthesis lectures on human-centered informatics 5, 2(2012), 1–129.",
      "doi": ""
    },
    {
      "text": "Brendan Rooney, Ciarán Benson, and Eilis Hennessy. 2012. The apparent reality of movies and emotional arousal: A study using physiological and self-report measures. Poetics 40, 5 (2012), 405–422.",
      "doi": ""
    },
    {
      "text": "Brendan Rooney and Eilis Hennessy. 2013. Actually in the cinema: A field study comparing real 3D and 2D movie patrons’ attention, emotion, and film satisfaction. Media Psychology 16, 4 (2013), 441–460.",
      "doi": ""
    },
    {
      "text": "S. Ros, S. Gonzalez, A. Robles, LL. Tobarra, A. Caminero, and Jesus Cano. 2020. Analyzing Students’ Self-Perception of Success and Learning Effectiveness Using Gamification in an Online Cybersecurity Course. IEEE Access 8(2020), 97718–97728. https://doi.org/10.1109/access.2020.2996361",
      "doi": ""
    },
    {
      "text": "Jim Rudd, Ken Stern, and Scott Isensee. 1996. Low vs. High-Fidelity Prototyping Debate. Interactions 3, 1 (Jan. 1996), 76–85. https://doi.org/10.1145/223500.223514",
      "doi": "10.1145/223500.223514"
    },
    {
      "text": "Johnny Saldaña. 2013. The Coding Manual for Qualitative Researchers. Sage Publications, Thousand Oaks, California, United States. 2nd Edition.",
      "doi": ""
    },
    {
      "text": "V. Schwind, K. Leicht, S. Jäger, K. Wolf, and N. Henze. 2018. Is there an uncanny valley of virtual animals? A quantitative and qualitative investigation. International Journal of Human-Computer Studies 111 (March 2018), 49–61. https://doi.org/10.1016/j.ijhcs.2017.11.003",
      "doi": ""
    },
    {
      "text": "Daniel M. Shafer, Corey P. Carbonara, and Michael F. Korpi. 2019. Factors Affecting Enjoyment of Virtual Reality Games: A Comparison Involving Consumer-Grade Virtual Reality Technology. Games for Health Journal 8, 1 (Feb. 2019), 15–23. https://doi.org/10.1089/g4h.2017.0190",
      "doi": ""
    },
    {
      "text": "Daniel M. Shafer, Corey P. Carbonara, and Lucy Popova. 2014. Controller Required? The Impact of Natural Mapping on Interactivity, Realism, Presence, and Enjoyment in Motion-Based Video Games. Presence: Teleoperators and Virtual Environments 23, 3 (Oct. 2014), 267–286. https://doi.org/10.1162/pres_a_00193",
      "doi": ""
    },
    {
      "text": "Michael A. Shapiro, Jorge Peña-Herborn, and Jeffrey T. Hancock. 2006. Realism, Imagination, and Narrative Video Games.In Playing Video Games: Motives, Responses, Consequences, Peter Vorderer and Jennings Bryant (Eds.). Lawrence Erlbaum Associates Publishers, Mahwah, New Jersey, Chapter 19, 275–289.",
      "doi": ""
    },
    {
      "text": "Eugénie Shinkle. 2020. Of Particle Systems and Picturesque Ontologies: Landscape, Nature, and Realism in Video Games. Art Journal 79, 2 (April 2020), 59–67. https://doi.org/10.1080/00043249.2020.1765556",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2003. Why not make interfaces better than 3D reality?IEEE Computer Graphics and Applications 23, 6 (2003), 12–15. https://doi.org/10.1109/MCG.2003.1242376",
      "doi": ""
    },
    {
      "text": "Andy P. Siddaway, Alex M. Wood, and Larry V. Hedges. 2019. How to Do a Systematic Review: A Best Practice Guide for Conducting and Reporting Narrative Reviews, Meta-Analyses, and Meta-Syntheses. Annual Review of Psychology 70, 1 (Jan. 2019), 747–770. https://doi.org/10.1146/annurev-psych-010418-102803",
      "doi": ""
    },
    {
      "text": "Mel Slater, Cristina Gonzalez-Liencres, Patrick Haggard, Charlotte Vinkers, Rebecca Gregory-Clarke, Steve Jelley, Zillah Watson, Graham Breen, Raz Schwarz, William Steptoe, 2020. The ethics of realism in virtual and augmented reality. Frontiers in Virtual Reality 1 (2020), 1.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Anthony Steed, and Yiorgos Chrysanthou. 2002. Computer graphics and virtual environments: from realism to real-time. Addison-Wesley, Boston, MA, USA.",
      "doi": ""
    },
    {
      "text": "Omar Sosa-Tzec. 2019. Design Tensions: Interaction Criticism on Instagram’s Mobile Interface. In Proceedings of the 37th ACM International Conference on the Design of Communication(Portland, Oregon) (SIGDOC ’19). Association for Computing Machinery, New York, NY, USA, Article 10, 10 pages. https://doi.org/10.1145/3328020.3353944",
      "doi": "10.1145/3328020.3353944"
    },
    {
      "text": "Bethesda Game Studios. 2011. The Elder Scrolls V: Skyrim. Game [Windows]. (11 November 2011) Bethesda Softworks, Rockville, Maryland, United States.",
      "doi": ""
    },
    {
      "text": "Bethesda Game Studios. 2015. Fallout 4. Game [Microsoft Windows]. (10 November 2015) Bethesda Softworks, Rockville, Maryland, United States.",
      "doi": ""
    },
    {
      "text": "Paige L. Sweet. 2020. Who Knows? Reflexivity in Feminist Standpoint Theory and Bourdieu. Gender & Society 34, 6 (Nov. 2020), 922–950. https://doi.org/10.1177/0891243220966600",
      "doi": ""
    },
    {
      "text": "Grant Tavinor. 2019. Towards an analysis of virtual realism.DiGRA ’19 - Proceedings of the 2019. DiGRA International Conference: Game, Play and the Emerging Ludo-Mix.",
      "doi": ""
    },
    {
      "text": "Team Cherry. 2017. Hollow Knight. Game [Windows]. (24 February 2017) Team Cherry, Adelaide, Australia.",
      "doi": ""
    },
    {
      "text": "Team17, Ghost Town Games. 2018. Overcooked 2. Game [macOS]. (7 August 2018) Team17, Wakefield, England.",
      "doi": ""
    },
    {
      "text": "James Thomas and Angela Harden. 2008. Methods for the thematic synthesis of qualitative research in systematic reviews. BMC medical research methodology 8, 1 (2008), 45. https://doi.org/10.1186/1471-2288-8-45",
      "doi": ""
    },
    {
      "text": "Inês Cunha Vaz Pereira Urbano, João Pedro Vieira Guerreiro, and Hugo Miguel Aleixo Albuquerque Nicolau. 2020. From skeuomorphism to flat design: age-related differences in performance and aesthetic perceptions. Behaviour & Information Technology 0, 0 (Sept. 2020), 1–16. https://doi.org/10.1080/0144929x.2020.1814867",
      "doi": ""
    },
    {
      "text": "Marnix van Gisbergen, Michelle Kovacs, Fabio Campos, Malou van der Heeft, and Valerie Vugts. 2019. What we don’t know. the effect of realism in virtual reality on experience and behaviour. In Augmented Reality and Virtual Reality. Springer, Cham, Switzerland, 45–57.",
      "doi": ""
    },
    {
      "text": "Elizabeth S. Veinott, Brandon Perleman, Emily Polander, James Leonard, Gloria Berry, Richard Catrambone, Elizabeth Whitaker, Brianne Eby, Sharon Mayell, Kinneret Teodorescu, Taleri Hammack, and Lucas Lemaster. 2014. Is more information better? Examining the effects of visual and cognitive fidelity on learning in a serious video game. In 2014 IEEE Games Media Entertainment. IEEE, Piscataway, NJ, USA, 1–6. https://doi.org/10.1109/gem.2014.7048105",
      "doi": ""
    },
    {
      "text": "Rodrigo Vicencio-Moreira, Regan L. Mandryk, and Carl Gutwin. 2015. Now You Can Compete With Anyone: Balancing Players of Different Skill Levels in a First-Person Shooter Game. Association for Computing Machinery, New York, NY, USA, 2255–2264. https://doi.org/10.1145/2702123.2702242",
      "doi": ""
    },
    {
      "text": "Vinoba Vinayagamoorthy, Andrea Brogni, Marco Gillies, Mel Slater, and Anthony Steed. 2004. An investigation of presence response across variations in visual realism. In The 7th Annual International Presence Workshop. Technical University of Valencia, Valencia, Spain, 148–155. https://manpages.ubuntu.com/manpages/xenial/man1/pdf2htmlEX.1.html.",
      "doi": ""
    },
    {
      "text": "Jan-Niklas Voigt-Antons, Tanja Kojic, Danish Ali, and Sebastian Möller. 2020. Influence of hand tracking as a way of interaction in virtual reality on user experience. In 2020 Twelfth International Conference on Quality of Multimedia Experience (QoMEX). IEEE, Piscataway, NJ, USA, 1–4.",
      "doi": ""
    },
    {
      "text": "Lu Wang. 2020. Man page for pdf2htmlEX. https://manpages.ubuntu.com/manpages/xenial/man1/pdf2htmlEX.1.html. Last accessed: December 23, 2021.",
      "doi": ""
    },
    {
      "text": "Shaojung Sharon Wang and Chih-Ting Hsieh. 2018. Ubiquitous Pokémon Go: Human–Environment Relationships and the Location-Based Augmented Reality Game. Environment and Behavior 52, 7 (Dec. 2018), 695–725. https://doi.org/10.1177/0013916518817878",
      "doi": ""
    },
    {
      "text": "Roy Want. 2009. Through Tinted Eyeglasses. IEEE Pervasive Computing 8, 3 (July 2009), 2–4. https://doi.org/10.1109/mprv.2009.58",
      "doi": ""
    },
    {
      "text": "Jane Webster, Linda Klebe Trevino, and Lisa Ryan. 1993. The dimensionality and correlates of flow in human-computer interactions. Computers in human behavior 9, 4 (1993), 411–426.",
      "doi": ""
    },
    {
      "text": "Katherine A. Whalen, Cecilia Berlin, Johanna Ekberg, Ilaria Barletta, and Peter Hammersberg. 2018. ‘All they do is win’: Lessons learned from use of a serious game for Circular Economy education. Resources, Conservation and Recycling 135 (Aug. 2018), 335–345. https://doi.org/10.1016/j.resconrec.2017.06.021",
      "doi": ""
    },
    {
      "text": "Mikael Wiberg. 2014. Methodology for Materiality: Interaction Design Research through a Material Lens. Personal Ubiquitous Comput. 18, 3 (March 2014), 625–636. https://doi.org/10.1007/s00779-013-0686-7",
      "doi": "10.1007/s00779-013-0686-7"
    },
    {
      "text": "Bob G Witmer and Michael J Singer. 1998. Measuring presence in virtual environments: A presence questionnaire. Presence 7, 3 (1998), 225–240.",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "Dennis Wolf, Katja Rogers, Christoph Kunder, and Enrico Rukzio. 2020. JumpVR: Jump-Based Locomotion Augmentation for Virtual Reality. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376243",
      "doi": "10.1145/3313831.3376243"
    },
    {
      "text": "Jiahua Yang. 2019. A comparison of cognitive impacts of narrative and human-computer interaction as two sources of perceived realism in video games. Master of Arts. The University of Texas at Austin, Perry-Castañeda Library, 101 East 21st Street, Austin, Texas 78712. Master’s thesis.",
      "doi": ""
    },
    {
      "text": "David Zendle, Daniel Kudenko, and Paul Cairns. 2018. Behavioural realism and the activation of aggressive concepts in violent video games. Entertainment Computing 24 (Jan. 2018), 21–29. https://doi.org/10.1016/j.entcom.2017.10.003",
      "doi": ""
    },
    {
      "text": "Xuesong Zhai, Fahad Asmi, Rongting Zhou, Intikhab Ahmad, Muhammad Azfar Anwar, Saba Saneinia, and Man Li. 2020. Investigating the Mediation and Moderation Effect of Students’ Addiction to Virtual Reality Games: A Perspective of Structural Equation Modeling. Discrete Dynamics in Nature and Society 2020 (Sept. 2020), 1–13. https://doi.org/10.1155/2020/5714546",
      "doi": ""
    },
    {
      "text": "Katja Zibrek, Elena Kokkinara, and Rachel McDonnell. 2017. Don’t Stand so Close to Me: Investigating the Effect of Control on the Appeal of Virtual Humans Using Immersion and a Proximity-Based Behavioral Task. In Proceedings of the ACM Symposium on Applied Perception (Cottbus, Germany) (SAP ’17). Association for Computing Machinery, New York, NY, USA, Article 3, 11 pages. https://doi.org/10.1145/3119881.3119887",
      "doi": "10.1145/3119881.3119887"
    },
    {
      "text": "Joerg Zumbach, Caroline Seitz, and Matthias Bluemke. 2015. Impact of violent video game realism on the self-concept of aggressiveness assessed with explicit and implicit measures. Computers in Human Behavior 53 (Dec. 2015), 278–288. https://doi.org/10.1016/j.chb.2015.07.018",
      "doi": ""
    }
  ]
}