{
  "doi": "10.1145/3491102.3501976",
  "title": "“I Wanted to See How Bad it Was”: Online Self-screening as a Critical Transition Point Among Young Adults with Common Mental Health Conditions",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Young adults have high rates of mental health conditions, yet they are the age group least likely to seek traditional treatment. They do, however, seek information about their mental health online, including by filling out online mental health screeners. To better understand online self-screening, and its role in help-seeking, we conducted focus groups with 50 young adults who voluntarily completed a mental health screener hosted on an advocacy website. We explored (1) catalysts for taking the screener, (2) anticipated outcomes, (3) reactions to the results, and (4) desired next steps. For many participants, the screener results validated their lived experiences of symptoms, but they were nevertheless unsure how to use the information to improve their mental health moving forward. Our findings suggest that online screeners can serve as a transition point in young people’s mental health journeys. We discuss design implications for online screeners, post-screener feedback, and digital interventions broadly.",
  "tags": [
    "online screening",
    "digital intervention",
    "mental health",
    "depression",
    "anxiety",
    "help-seeking"
  ],
  "authors": [
    {
      "name": "Kaylee Payne Kruzan",
      "institution": "Center for Behavioral Intervention Technologies, Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528961",
      "orcid": "0000-0003-1489-487X"
    },
    {
      "name": "Jonah Meyerhoff",
      "institution": "Center for Behavioral Intervention Technologies, Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660082186",
      "orcid": "0000-0001-5149-7959"
    },
    {
      "name": "Theresa Nguyen",
      "institution": "Mental Health America, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235803",
      "orcid": "missing"
    },
    {
      "name": "Madhu Reddy",
      "institution": "Department of Informatics, University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81340492349",
      "orcid": "0000-0002-6330-3637"
    },
    {
      "name": "David C. Mohr",
      "institution": "Center for Behavioral Intervention Technologies, Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490646436",
      "orcid": "0000-0002-5443-7596"
    },
    {
      "name": "Rachel Kornfield",
      "institution": "Center for Behavioral Intervention Technologies, Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658701819",
      "orcid": "0000-0001-8542-6913"
    }
  ],
  "references": [
    {
      "text": "[n. d.]. National Survey on Drug Use and Health 2019 (NSDUH-2019). https://www.samhsa.gov/data/report/2019-nsduh-detailed-tables",
      "doi": ""
    },
    {
      "text": "Alaa A Abd-Alrazaq, Mohannad Alajlani, Ali Abdallah Alalwan, Bridgette M Bewick, Peter Gardner, and Mowafa Househ. 2019. An overview of the features of chatbots in mental health: A scoping review. International Journal of Medical Informatics 132 (2019), 103978.",
      "doi": ""
    },
    {
      "text": "Philip J Batterham, Alison L Calear, Matthew Sunderland, Natacha Carragher, and Jacqueline L Brewer. 2016. Online screening and feedback to increase help-seeking for mental health problems: population-based randomised controlled trial. BJPsych Open 2, 1 (2016), 67–73.",
      "doi": ""
    },
    {
      "text": "Eric PS Baumer, Vera Khovanskaya, Mark Matthews, Lindsay Reynolds, Victoria Schwanda Sosik, and Geri Gay. 2014. Reviewing reflection: on the use of reflection in interactive system design. In Proceedings of the 2014 conference on Designing interactive systems. 93–102.",
      "doi": "10.1145/2598510.2598598"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "David A Brent, Steven M Brunwasser, Steven D Hollon, V Robin Weersing, Gregory N Clarke, John F Dickerson, William R Beardslee, Tracy RG Gladstone, Giovanna Porta, Frances L Lynch, 2015. Effect of a cognitive-behavioral prevention program on depression 6 years after implementation among at-risk adolescents: a randomized clinical trial. JAMA psychiatry 72, 11 (2015), 1110–1118.",
      "doi": ""
    },
    {
      "text": "Brant R Burleson. 2009. Understanding the outcomes of supportive communication: A dual-process approach. Journal of Social and Personal Relationships 26, 1(2009), 21–38.",
      "doi": ""
    },
    {
      "text": "Jane M Burns, Lauren A Durkin, and Jonathan Nicholas. 2009. Mental health of young people in the United States: what role can the internet play in reducing stigma and promoting help seeking?Journal of Adolescent Health 45, 1 (2009), 95–97.",
      "doi": ""
    },
    {
      "text": "Isabella Choi, David N Milne, Mark Deady, Rafael A Calvo, Samuel B Harvey, and Nick Glozier. 2018. Impact of mental health screening on promoting immediate online help-seeking: Randomized trial comparing normative versus humor-driven feedback. JMIR mental health 5, 2 (2018), e26.",
      "doi": ""
    },
    {
      "text": "Patrick W Corrigan, Jonathon E Larson, and Nicolas Ruesch. 2009. Self-stigma and the “why try” effect: impact on life goals and evidence-based practices. World psychiatry 8, 2 (2009), 75.",
      "doi": ""
    },
    {
      "text": "Ewa K Czyz, Adam G Horwitz, Daniel Eisenberg, Anne Kramer, and Cheryl A King. 2013. Self-reported barriers to professional help seeking among college students at elevated risk for suicide. Journal of American college health 61, 7 (2013), 398–406.",
      "doi": ""
    },
    {
      "text": "Kevin Doherty, José Marcano-Belisario, Martin Cohn, Nikolaos Mastellos, Cecily Morrison, Josip Car, and Gavin Doherty. 2019. Engagement with mental health screening on mobile devices: Results from an antenatal feasibility study. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3290605.3300416"
    },
    {
      "text": "Kathleen Kara Fitzpatrick, Alison Darcy, and Molly Vierhile. 2017. Delivering cognitive behavior therapy to young adults with symptoms of depression and anxiety using a fully automated conversational agent (Woebot): a randomized controlled trial. JMIR mental health 4, 2 (2017), e7785.",
      "doi": ""
    },
    {
      "text": "Ellen E Fitzsimmons-Craft, Katherine N Balantekin, Andrea K Graham, Bianca DePietro, Olivia Laing, Marie-Laure Firebaugh, Lauren Smolar, Dan Park, Claire Mysko, Burkhardt Funk, 2020. Preliminary data on help-seeking intentions and behaviors of individuals completing a widely available online screen for eating disorders in the United States. International Journal of Eating Disorders 53, 9 (2020), 1556–1562.",
      "doi": ""
    },
    {
      "text": "Ellen E Fitzsimmons-Craft, Katherine N Balantekin, Andrea K Graham, Lauren Smolar, Dan Park, Claire Mysko, Burkhardt Funk, C Barr Taylor, and Denise E Wilfley. 2019. Results of disseminating an online screen for eating disorders across the US: Reach, respondent characteristics, and unmet treatment need. International Journal of Eating Disorders 52, 6 (2019), 721–729.",
      "doi": ""
    },
    {
      "text": "Jennis Freyer, J Scott Tonigan, Stefan Keller, Ulrich John, Hans-Jürgen Rumpf, and Ulfert Hapke. 2004. Readiness to change versus readiness to seek help for alcohol problems: the development of the Treatment Readiness Tool (TReaT).Journal of studies on alcohol 65, 6 (2004), 801–809.",
      "doi": ""
    },
    {
      "text": "Jennis Freyer, J Scott Tonigan, Stefan Keller, Hans-Jürgen Rumpf, Ulrich John, and Ulfert Hapke. 2005. Readiness for change and readiness for help-seeking: A composite assessment of client motivation. Alcohol and Alcoholism 40, 6 (2005), 540–544.",
      "doi": ""
    },
    {
      "text": "Mareka Frost and Leanne Casey. 2016. Who seeks help online for self-injury?Archives of suicide research 20, 1 (2016), 69–79.",
      "doi": ""
    },
    {
      "text": "Hannah Gaffney, Warren Mansell, and Sara Tai. 2019. Conversational agents in the treatment of mental health problems: mixed-method systematic review. JMIR mental health 6, 10 (2019), e14166.",
      "doi": ""
    },
    {
      "text": "Madelyn S Gould, Jimmie Lou Harris Munfakh, Keri Lubell, Marjorie Kleinman, and Sarah Parker. 2002. Seeking help from the internet during adolescence. Journal of the American Academy of Child & Adolescent Psychiatry 41, 10(2002), 1182–1189.",
      "doi": ""
    },
    {
      "text": "Amelia Gulliver, Kathleen M Griffiths, and Helen Christensen. 2010. Perceived barriers and facilitators to mental health help-seeking in young people: a systematic review. BMC psychiatry 10, 1 (2010), 1–9.",
      "doi": ""
    },
    {
      "text": "Morten Hesse. 2006. The Readiness Ruler as a measure of readiness to change poly-drug use in drug abusers. Harm reduction journal 3, 1 (2006), 1–5.",
      "doi": ""
    },
    {
      "text": "Steven D Hollon, Robert J DeRubeis, Richard C Shelton, Jay D Amsterdam, Ronald M Salomon, John P O’Reardon, Margaret L Lovett, Paula R Young, Kirsten L Haman, Brent B Freeman, 2005. Prevention of relapse following cognitive therapy vs medications in moderate to severe depression. Archives of general psychiatry 62, 4 (2005), 417–422.",
      "doi": ""
    },
    {
      "text": "Aine Horgan and John Sweeney. 2010. Young students’ use of the Internet for mental health information and support. Journal of psychiatric and mental health nursing 17, 2 (2010), 117–123.",
      "doi": ""
    },
    {
      "text": "Jittrapol Intarasirisawat, Chee Siang Ang, Christos Efstratiou, Luke Dickens, Naranchaya Sriburapar, Dinkar Sharma, and Burachai Asawathaweeboon. 2020. An Automated Mobile Game-based Screening Tool for Patients with Alcohol Dependence. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 3 (2020), 1–23.",
      "doi": "10.1145/3411837"
    },
    {
      "text": "Nicholas C Jacobson, Elad Yom-Tov, Damien Lekkas, Michael Heinz, Lili Liu, and Paul J Barr. 2020. Impact of online mental health screening tools on help-seeking, care receipt, and suicidal ideation and suicidal intent: Evidence from internet search behavior in a large US cohort. Journal of psychiatric research(2020).",
      "doi": ""
    },
    {
      "text": "Haley MacLeod Ben Jelen, Prabhakar Annu, Oehlberg Lora, Siek Katie, and Connelly Kay. 2016. Asynchronous remote communities (arc) for researching distributed populations. In 10th EAI International Conference on Pervasive Computing Technologies for Healthcare.[Google Scholar].",
      "doi": ""
    },
    {
      "text": "Sooyeon Jeong and Cynthia Lynn Breazeal. 2016. Improving smartphone users’ affect and wellbeing with personalized positive psychology interventions. In Proceedings of the Fourth International Conference on Human Agent Interaction. 131–137.",
      "doi": "10.1145/2974804.2974831"
    },
    {
      "text": "Yukun Kang, Huiyao Wang, Xiaojing Li, Yujie Tao, Xia Yang, Wei Deng, Jianying Yu, Qian Zhou, Tao Li, and Wanjun Guo. 2021. A brief web-based screening plus emotional-disorder health education was associated with improvement of mental health awareness and service-seeking attitudes among patients seeking nonpsychiatric clinical services in China. Depression and Anxiety 38, 5 (2021), 571–587.",
      "doi": ""
    },
    {
      "text": "Sylvia D Kauer, Kerrie Buhagiar, Victoria Blake, Sue Cotton, and Lena Sanci. 2017. Facilitating mental health help-seeking by young adults with a dedicated online program: a feasibility study of Link. BMJ open 7, 7 (2017), e015303.",
      "doi": ""
    },
    {
      "text": "Sylvia Deidre Kauer, Cheryl Mangan, and Lena Sanci. 2014. Do online mental health services improve help-seeking for young people? A systematic review. Journal of medical Internet research 16, 3 (2014), e66.",
      "doi": ""
    },
    {
      "text": "Christina Kelley, Bongshin Lee, and Lauren Wilcox. 2017. Self-tracking for mental wellness: understanding expert perspectives and student experiences. In Proceedings of the 2017 CHI conference on human factors in computing systems. 629–641.",
      "doi": "10.1145/3025453.3025750"
    },
    {
      "text": "Lars Vedel Kessing, Hanne Vibe Hansen, Anne Hvenegaard, Ellen Margrethe Christensen, Henrik Dam, Christian Gluud, Jørn Wetterslev, Early Intervention Affective Disorders (EIA) Trial Group, 2013. Treatment in a specialised out-patient mood disorder clinic v. standard out-patient treatment in the early course of bipolar disorder: randomised clinical trial. The British journal of psychiatry 202, 3 (2013), 212–219.",
      "doi": ""
    },
    {
      "text": "Eung-Hun Kim, Anil Coumar, William B Lober, and Yongmin Kim. 2011. Addressing mental health epidemic among university students via web-based, self-screening, and referral system: a preliminary study. IEEE Transactions on Information Technology in Biomedicine 15, 2(2011), 301–307.",
      "doi": "10.1109/TITB.2011.2107561"
    },
    {
      "text": "Rafal Kocielnik, Lillian Xiao, Daniel Avrahami, and Gary Hsieh. 2018. Reflection Companion: a conversational system for engaging users in reflection on physical activity. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 2 (2018), 1–26.",
      "doi": "10.1145/3214273"
    },
    {
      "text": "Kristy R Kowatch and David C Hodgins. 2015. Predictors of help-seeking for gambling disorder from the transtheoretical model perspective. International Gambling Studies 15, 3 (2015), 450–469.",
      "doi": ""
    },
    {
      "text": "Victoria E Kress and Rachel M Hoffman. 2008. Non-suicidal self-injury and motivational interviewing: Enhancing readiness for change.Journal of Mental Health Counseling 30, 4 (2008).",
      "doi": ""
    },
    {
      "text": "Kurt Kroenke, Robert L Spitzer, and Janet BW Williams. 2001. The PHQ-9: validity of a brief depression severity measure. Journal of general internal medicine 16, 9 (2001), 606–613.",
      "doi": ""
    },
    {
      "text": "Kaylee Payne Kruzan and Janis Whitlock. 2019. Processes of change and nonsuicidal self-injury: A qualitative interview study with individuals at various stages of change. Global qualitative nursing research 6 (2019), 2333393619852935.",
      "doi": ""
    },
    {
      "text": "Florian Künzler, Varun Mishra, Jan-Niklas Kramer, David Kotz, Elgar Fleisch, and Tobias Kowatsch. 2019. Exploring the state-of-receptivity for mhealth interventions. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 4 (2019), 1–27.",
      "doi": "10.1145/3369805"
    },
    {
      "text": "Emily G Lattie, Rachel Kornfield, Kathryn E Ringland, Renwen Zhang, Nathan Winquist, and Madhu Reddy. 2020. Designing mental health technologies that support the social ecosystem of college students. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376362"
    },
    {
      "text": "Stephen P Lewis and Yukari Seko. 2016. A double-edged sword: A review of benefits and risks of online nonsuicidal self-injury activities. Journal of clinical psychology 72, 3 (2016), 249–262.",
      "doi": ""
    },
    {
      "text": "Catherine Y Lim, Andrew BL Berry, Andrea L Hartzler, Tad Hirsch, David S Carrell, Zoë A Bermet, and James D Ralston. 2019. Facilitating self-reflection about values and self-care among individuals with chronic conditions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300885"
    },
    {
      "text": "Juan F Maestre, Haley MacLeod, Ciabhan L Connelly, Julia C Dunbar, Jordan Beck, Katie A Siek, and Patrick C Shih. 2018. Defining through expansion: conducting asynchronous remote communities (arc) research with stigmatized groups. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3174131"
    },
    {
      "text": "Juan Martínez-Miranda, Fernando López-Flores, Antonio Palacios-Isaac, Liliana Jiménez, Luis García Medina, Rosa M Moreno-Robles, and Giovanni Rosales. 2020. Implementation of a Health Information System to Support the Screening and Surveillance of Suicidal Behaviours. In Proceedings of the 4th International Conference on Medical and Health Informatics. 136–144.",
      "doi": "10.1145/3418094.3418108"
    },
    {
      "text": "Mark Matthews, Elizabeth Murnane, and Jaime Snyder. 2017. Quantifying the Changeable Self: The role of self-tracking in coming to terms with and managing bipolar disorder. Human–Computer Interaction 32, 5-6 (2017), 413–446.",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and inter-rater reliability in qualitative research: Norms and guidelines for CSCW and HCI practice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Ramin Mojtabai, Mark Olfson, Nancy A Sampson, Robert Jin, Benjamin Druss, Philip S Wang, Kenneth B Wells, Harold A Pincus, and Ronald C Kessler. 2011. Barriers to mental health treatment: results from the National Comorbidity Survey Replication. Psychological medicine 41, 8 (2011), 1751–1761.",
      "doi": ""
    },
    {
      "text": "Megan A Moreno, Lauren A Jelenchick, Katie G Egan, Elizabeth Cox, Henry Young, Kerry E Gannon, and Tara Becker. 2011. Feeling bad on Facebook: Depression disclosures by college students on a social networking site. Depression and anxiety 28, 6 (2011), 447–455.",
      "doi": ""
    },
    {
      "text": "J Michael Murphy, Theresa Nguyen, Cara Lucke, Cindy Chiang, Natalie Plasencia, and Michael Jellinek. 2018. Adolescent self-screening for mental health problems; demonstration of an internet-based approach. Academic pediatrics 18, 1 (2018), 59–65.",
      "doi": ""
    },
    {
      "text": "Michal Muszynski, Jamie Zelazny, Jeffrey M Girard, and Louis-Philippe Morency. 2020. Depression Severity Assessment for Adolescents at High Risk of Mental Disorders. In Proceedings of the 2020 International Conference on Multimodal Interaction. 70–78.",
      "doi": "10.1145/3382507.3418859"
    },
    {
      "text": "Brea L Perry and Bernice A Pescosolido. 2015. Social network activation: the role of health discussion partners in recovery from mental illness. Social science & medicine 125 (2015), 116–128.",
      "doi": ""
    },
    {
      "text": "Bernice A Pescosolido, Jack K Martin, J Scott Long, Tait R Medina, Jo C Phelan, and Bruce G Link. 2010. “A disease like any other”? A decade of change in public reactions to schizophrenia, depression, and alcohol dependence. American Journal of Psychiatry 167, 11 (2010), 1321–1330.",
      "doi": ""
    },
    {
      "text": "Annu Sible Prabhakar, Lucia Guerra-Reyes, Vanessa M Kleinschmidt, Ben Jelen, Haley MacLeod, Kay Connelly, and Katie A Siek. 2017. Investigating the suitability of the asynchronous, remote, community-based method for pregnant and new mothers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 4924–4934.",
      "doi": "10.1145/3025453.3025546"
    },
    {
      "text": "Claudette Pretorius, Derek Chambers, and David Coyle. 2019. Young people’s online help-seeking and mental health difficulties: Systematic narrative review. Journal of medical Internet research 21, 11 (2019), e13873.",
      "doi": ""
    },
    {
      "text": "Claudette Pretorius, David Coyle, and Derek Chambers. 2018. Intelligent techniques to support online mental health communities: resource recommendations for 4 levels of stepped care. In Proceedings of the Second African Conference for Human Computer Interaction: Thriving Communities. 1–4.",
      "doi": "10.1145/3283458.3283509"
    },
    {
      "text": "Claudette Pretorius, Darragh McCashin, Naoise Kavanagh, and David Coyle. 2020. Searching for mental health: a mixed-methods study of young people’s online help-seeking. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376328"
    },
    {
      "text": "James O Prochaska, Colleen A Redding, Kerry E Evers, 2015. The transtheoretical model and stages of change. Health behavior: Theory, research, and practice 97 (2015).",
      "doi": ""
    },
    {
      "text": "Simon Provoost, Ho Ming Lau, Jeroen Ruwaard, and Heleen Riper. 2017. Embodied conversational agents in clinical psychology: a scoping review. Journal of medical Internet research 19, 5 (2017), e151.",
      "doi": ""
    },
    {
      "text": "Betty Purwandari, Wayan Surya Wibawa, Nilam Fitriah, Mellia Christia, and Dini Rahma Bintari. 2020. Internet addiction and mental health prediction using ensemble learning based on web browsing history. In Proceedings of the 3rd International Conference on Software Engineering and Information Management. 155–159.",
      "doi": "10.1145/3378936.3378947"
    },
    {
      "text": "M Reinert and T Nguyen. 2021. Suicide and Covid-19: Communities in need across the U.S.Technical Report. Mental Health America, Alexandria, VA. https://mhanational.org/research-reports/suicide-and-covid-19-communities-need-across-us",
      "doi": ""
    },
    {
      "text": "Derek Richards. 2011. Prevalence and clinical course of depression: a review. Clinical psychology review 31, 7 (2011), 1117–1125.",
      "doi": ""
    },
    {
      "text": "Debra Rickwood, Frank P Deane, Coralie J Wilson, and Joseph Ciarrochi. 2005. Young people’s help-seeking for mental health problems. Australian e-journal for the Advancement of Mental health 4, 3(2005), 218–251.",
      "doi": ""
    },
    {
      "text": "Debra Rickwood and Kerry Thomas. 2012. Conceptual measurement framework for help-seeking for mental health problems. Psychology research and behavior management 5 (2012), 173.",
      "doi": ""
    },
    {
      "text": "Kathryn E Ringland, Jennifer Nicholas, Rachel Kornfield, Emily G Lattie, David C Mohr, and Madhu Reddy. 2019. Understanding mental ill-health as psychosocial disability: Implications for assistive technology. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. 156–170.",
      "doi": "10.1145/3308561.3353785"
    },
    {
      "text": "Stephen Rollnick and William R Miller. 1995. What is motivational interviewing?Behavioural and cognitive Psychotherapy 23, 4 (1995), 325–334.",
      "doi": ""
    },
    {
      "text": "Sarah L Rowe, Krisna Patel, Rebecca S French, Claire Henderson, Dennis Ougrin, Mike Slade, and Paul Moran. 2018. Web-based decision aid to assist help-seeking choices for young people who self-harm: outcomes from a randomized controlled feasibility trial. JMIR mental health 5, 1 (2018), e8098.",
      "doi": ""
    },
    {
      "text": "Keziban Salaheddin and Barbara Mason. 2016. Identifying barriers to mental health help-seeking among young adults in the UK: a cross-sectional survey. British Journal of General Practice 66, 651 (2016), e686–e692.",
      "doi": ""
    },
    {
      "text": "Gabrielle H Saunders, Melissa T Frederick, ShienPei C Silverman, Claus Nielsen, and Ariane Laplante-Lévesque. 2016. Description of adults seeking hearing help for the first time according to two health behavior change approaches: Transtheoretical model (stages of change) and health belief model. Ear and hearing 37, 3 (2016), 324–333.",
      "doi": ""
    },
    {
      "text": "Jason Schnittker. 2013. Public beliefs about mental illness. Handbook of the sociology of mental health(2013), 75–93.",
      "doi": ""
    },
    {
      "text": "Ruba Skaik and Diana Inkpen. 2020. Using Social Media for Mental Health Surveillance: A Review. ACM Computing Surveys (CSUR) 53, 6 (2020), 1–31.",
      "doi": ""
    },
    {
      "text": "Robert L Spitzer, Kurt Kroenke, Janet BW Williams, and Bernd Löwe. 2006. A brief measure for assessing generalized anxiety disorder: the GAD-7. Archives of internal medicine 166, 10 (2006), 1092–1097.",
      "doi": ""
    },
    {
      "text": "Anja Thieme, Danielle Belgrave, and Gavin Doherty. 2020. Machine learning in mental health: A systematic review of the HCI literature to support the development of effective and implementable ML systems. ACM Transactions on Computer-Human Interaction (TOCHI) 27, 5(2020), 1–53.",
      "doi": "10.1145/3398069"
    },
    {
      "text": "Alice Thudt, Uta Hinrichs, Samuel Huron, and Sheelagh Carpendale. 2018. Self-reflection and personal physicalization construction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173728"
    },
    {
      "text": "Aditya Nrusimha Vaidyam, Hannah Wisniewski, John David Halamka, Matcheri S Kashavan, and John Blake Torous. 2019. Chatbots and conversational agents in mental health: a review of the psychiatric landscape. The Canadian Journal of Psychiatry 64, 7 (2019), 456–464.",
      "doi": ""
    },
    {
      "text": "Marianne Webb, Lena Sanci, Sylvia Kauer, and Greg Wadley. 2015. Designing a health screening tool to help young people communicate with their general practitioner. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction. 124–133.",
      "doi": "10.1145/2838739.2838756"
    },
    {
      "text": "Felicia M Wetterlin, Marissa Y Mar, Erika K Neilson, Gregory R Werker, and Michael Krausz. 2014. eMental health experiences and expectations: a survey of youths’ Web-based resource preferences in Canada. Journal of medical Internet research 16, 12 (2014), e293.",
      "doi": ""
    },
    {
      "text": "Coralie J Wilson, Debra J Rickwood, John A Bushnell, Peter Caputi, and Susan J Thomas. 2011. The effects of need for autonomy and preference for seeking help from informal sources on emerging adults’ intentions to access mental health services for common mental disorders and suicidal thoughts. Advances in Mental Health 10, 1 (2011), 29–38.",
      "doi": ""
    },
    {
      "text": "Amir Hossein Yazdavar, Hussein S Al-Olimat, Monireh Ebrahimi, Goonmeet Bajaj, Tanvi Banerjee, Krishnaprasad Thirunarayan, Jyotishman Pathak, and Amit Sheth. 2017. Semi-supervised approach to monitoring clinical depressive symptoms in social media. In Proceedings of the 2017 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining 2017. 1191–1198.",
      "doi": "10.1145/3110025.3123028"
    },
    {
      "text": "Michele L Ybarra and William W Eaton. 2005. Internet-based mental health interventions. Mental health services research 7, 2 (2005), 75–87.",
      "doi": ""
    },
    {
      "text": "Dong Whi Yoo and Munmun De Choudhury. 2019. Designing dashboard for campus stakeholders to support college student mental health. In Proceedings of the 13th EAI International Conference on Pervasive Computing Technologies for Healthcare. 61–70.",
      "doi": "10.1145/3329189.3329200"
    }
  ]
}