{
  "doi": "10.1145/3491102.3501922",
  "title": "Keep the VRhythm going: A musician-centred study investigating how Virtual Reality can support creative musical practice",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2022,
  "badges": [],
  "abstract": "The acoustic and visual experiences of musicians in the spaces they perform in are complex and organic in nature, entailing a continuous interaction with the environment. With this project, we leverage the power of Virtual Reality (VR) to support musicians in their creative practice by transporting them to novel sonic and visual worlds. For this, we developed a musician-centred VR system, featuring various acoustic and visual virtual environments, VR Rehearse & Perform, based on design requirements gathered with musicians and performance experts. To investigate how VR can be designed to support music-makers in their creative musical practice, we performed iterative tests with 19 musicians followed by semi-structured interviews. Our findings suggest that VR has the potential to support different aspects of the creative musical practice, such as rehearsing, performing and improvising. Our research provides insights and inspirations toward designing musician-centred VR experiences for various musical activities.",
  "tags": [
    "Creativity",
    "Virtual Reality",
    "Performing",
    "Musical practice",
    "Music",
    "Improvisation",
    "Rehearsing"
  ],
  "authors": [
    {
      "name": "Sophia Ppali",
      "institution": "Creative Computing Institute, University of the Arts London, United Kingdom and School of Engineering, University of Kent, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659917271",
      "orcid": "0000-0001-5630-1679"
    },
    {
      "name": "Vali Lalioti",
      "institution": "Creative Computing Institute, University of the Arts London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100420693",
      "orcid": "missing"
    },
    {
      "name": "Boyd Branch",
      "institution": "School of Media and Performing Arts, Coventry University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702152",
      "orcid": "missing"
    },
    {
      "name": "Chee Siang Ang",
      "institution": "School of Computing, University of Kent, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319487778",
      "orcid": "0000-0002-1109-9689"
    },
    {
      "name": "Andrew J. Thomas",
      "institution": "Royal College of Music, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659917984",
      "orcid": "missing"
    },
    {
      "name": "Bea S. Wohl",
      "institution": "Creative Computing Insitute, University of the Arts London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658759957",
      "orcid": "missing"
    },
    {
      "name": "Alexandra Covaci",
      "institution": "School of Engineering, University of Kent, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658655770",
      "orcid": "0000-0002-3205-2273"
    }
  ],
  "references": [
    {
      "text": "Tue Haste Andersen. 2005. Interaction with Sound and Pre-recorded Music: Novel Interfaces and Use Patterns. Ph.D. Dissertation. Citeseer.",
      "doi": ""
    },
    {
      "text": "Jack Atherton and Ge Wang. 2020. Doing vs. Being: A philosophy of design for artful VR. Journal of New Music Research 49, 1 (Jan. 2020), 35–59. https://doi.org/10.1080/09298215.2019.1705862 Publisher: Routledge _eprint: https://doi.org/10.1080/09298215.2019.1705862.",
      "doi": ""
    },
    {
      "text": "Lisa Aufegger, Rosie Perkins, David Wasley, and Aaron Williamon. 2017. Musicians’ perceptions and experiences of using simulation training to develop performance skills. Psychology of Music 45, 3 (2017), 417–431.",
      "doi": ""
    },
    {
      "text": "Lisa Aufegger and David Wasley. 2020. Virtual reality feedback influences musicians’ physical responses and mental attitude towards performing. Music and Medicine 12, 3 (2020), 157–166.",
      "doi": ""
    },
    {
      "text": "Siamak Baharloo, Paul A. Johnston, Susan K. Service, Jane Gitschier, and Nelson B. Freimer. 1998. Absolute Pitch: An Approach for Identification of Genetic and Nongenetic Components. The American Journal of Human Genetics 62, 2 (Feb. 1998), 224–231. https://doi.org/10.1086/301704",
      "doi": ""
    },
    {
      "text": "Will Bailey and Bruno Fazenda. 2018. The effect of visual cues and binaural rendering method on plausibility in virtual environments. In Audio Engineering Society Convention 144. Audio Engineering Society.",
      "doi": ""
    },
    {
      "text": "Louise J. Banton. 1995. The Role of Visual and Auditory Feedback during the Sight-Reading of Music. Psychology of Music 23, 1 (April 1995), 3–16. https://doi.org/10.1177/0305735695231001 Publisher: SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Alvaro Barbosa and João Cordeiro. 2011. The influence of perceptual attack times in networked music performance. In Audio Engineering Society Conference: 44th International Conference: Audio Networking. Audio Engineering Society.",
      "doi": ""
    },
    {
      "text": "Anders Riddersholm Bargum, Devansh Kandpal, Oddur Ingi Kristjansson, Simon Rostami Mosen, Jesper Andersen, and Stefania Serafin. 2021. Virtual Reconstruction of a the Ambisonic Concert Hall of the Royal Danish Academy of Music. In 2021 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, 99–102.",
      "doi": ""
    },
    {
      "text": "Christopher Bartlette, Dave Headlam, Mark Bocko, and Gordana Velikic. 2006. Effect of network latency on interactive musical performance. Music Perception 24, 1 (2006), 49–62.",
      "doi": ""
    },
    {
      "text": "Valentin Bauer and Tifanie Bouchara. 2021. First Steps Towards Augmented Reality Interactive Electronic Music Production. In 2021 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, 90–93.",
      "doi": ""
    },
    {
      "text": "Leo Beranek. 2012. Concert halls and opera houses: music, acoustics, and architecture. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Josiane Bissonnette, Francis Dubé, Martin D Provencher, and Maria T Moreno Sala. 2015. Virtual reality exposure training for musicians: Its effect on performance anxiety and quality. Medical problems of performing artists 30, 3 (2015), 169–177.",
      "doi": ""
    },
    {
      "text": "Josiane Bissonnette, Francis Dubé, Martin D Provencher, and Maria T Moreno Sala. 2016. Evolution of music performance anxiety and quality of performance during virtual reality exposure training. Virtual Reality 20, 1 (2016), 71–81.",
      "doi": "10.1007/s10055-016-0283-y"
    },
    {
      "text": "Judith Brereton, Damian Murphy, and David M Howard. 2011. Evaluating the Auralization of Performance Spaces and its Effect on Singing Performance. In Audio Engineering Society Convention 130. Audio Engineering Society.",
      "doi": ""
    },
    {
      "text": "Pamela Briggs, Patrick Olivier, and Jim Kitson. 2009. Film as invisible design: the example of the biometric daemon. In CHI’09 Extended Abstracts on Human Factors in Computing Systems. 3511–3512.",
      "doi": ""
    },
    {
      "text": "James Broderick, Jim Duggan, and Sam Redfern. 2018. The Importance of Spatial Audio in Modern Games and Virtual Environments. In 2018 IEEE Games, Entertainment, Media Conference (GEM). 1–9. https://doi.org/10.1109/GEM.2018.8516445",
      "doi": ""
    },
    {
      "text": "A. Bryman. 2005. Social research methods. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Zach Buckley and Kristin Carlson. 2019. Towards a framework for composition design for music-led virtual reality experiences. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 1497–1499.",
      "doi": ""
    },
    {
      "text": "Carrie J Cai, Michelle Carney, Nida Zada, and Michael Terry. 2021. Breakdowns and Breakthroughs: Observing Musicians’ Responses to the COVID-19 Pandemic. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": ""
    },
    {
      "text": "Jean-Philippe Charron. 2017. Music Audiences 3.0: Concert-Goers’ Psychological Motivations at the Dawn of Virtual Reality. Frontiers in Psychology 8 (2017), 800. https://doi.org/10.3389/fpsyg.2017.00800",
      "doi": ""
    },
    {
      "text": "Li-Xian Chen and Chuen-Tsai Sun. 2016. Self-regulation influence on game play flow state. Computers in Human Behavior 54 (2016), 341–350.",
      "doi": "10.1016/j.chb.2015.08.020"
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1990. Flow: The psychology of optimal experience. Vol. 1990. Harper & Row New York.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi and Judith LeFevre. 1989. Optimal experience in work and leisure.Journal of personality and social psychology 56, 5(1989), 815.",
      "doi": ""
    },
    {
      "text": "María Cuevas-Rodríguez, Lorenzo Picinali, Daniel González-Toledo, Carlos Garre, Ernesto de la Rubia-Cuestas, Luis Molina-Tanco, and Arcadio Reyes-Lecuona. 2019. 3D tune-in toolkit: An open-source library for real-time binaural spatialisation. PLoS ONE 14, 3 (mar 2019), e0211899. https://doi.org/10.1371/journal.pone.0211899",
      "doi": ""
    },
    {
      "text": "Richard E Cytowic and David Eagleman. 2011. Wednesday is indigo blue: Discovering the brain of synesthesia. Mit Press.",
      "doi": ""
    },
    {
      "text": "Tatsuya Daikoku. 2018. Musical creativity and depth of implicit knowledge: spectral and temporal individualities in improvisation. Frontiers in computational neuroscience 12 (2018), 89.",
      "doi": ""
    },
    {
      "text": "Irène Deliège and Geraint A Wiggins. 2006. Musical creativity: Multidisciplinary research in theory and practice. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Jochen Delrue, Athanasios Mouratidis, Leen Haerens, Gert-Jan De Muynck, Nathalie Aelterman, and Maarten Vansteenkiste. 2016. Intrapersonal achievement goals and underlying reasons among long distance runners: Their relation with race experience, self-talk, and running time. Psychologica Belgica 56, 3 (2016), 288.",
      "doi": ""
    },
    {
      "text": "Digital Catapult and UK Reseach and Innovation. [n.d.]. An overview of audience insights and perspectives on immersive art, culture, and entertainment. Technical Report. https://www.digicatapult.org.uk/news-and-insights/publication/the-audience-of-the-future-immersive-audience-journey-report",
      "doi": ""
    },
    {
      "text": "Hubert L Dreyfus and Stuart E Dreyfus. 2004. The ethical implications of the five-stage skill-acquisition model. Bulletin of Science, Technology & Society 24, 3 (2004), 251–264.",
      "doi": ""
    },
    {
      "text": "Stefan Engeser and Falko Rheinberg. 2008. Flow, performance and moderators of challenge-skill balance. Motivation and Emotion 32, 3 (2008), 158–172.",
      "doi": ""
    },
    {
      "text": "K. Anders Ericsson, Ralf T. Krampe, and Clemens Tesch-Römer. 1993. The role of deliberate practice in the acquisition of expert performance. Psychological Review 100, 3 (1993), 363–406. https://doi.org/10.1037/0033-295X.100.3.363 Place: US Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Anders C Gade. 1989. Investigations of musicians’ room acoustic conditions in concert halls. Part I: methods and laboratory experiments. Acta Acustica united with Acustica 69, 5 (1989), 193–203.",
      "doi": ""
    },
    {
      "text": "Jérémie Garcia, Thibaut Carpentier, and Jean Bresson. 2017. Interactive-compositional authoring of sound spatialization. Journal of New Music Research 46, 1 (2017), 74–86.",
      "doi": ""
    },
    {
      "text": "Waldo Greeff. 2016. The influence of perception latency on the quality of musical performance during a simulated delay scenario. Ph.D. Dissertation. University of Pretoria.",
      "doi": ""
    },
    {
      "text": "Maria Anna Harley. 2016. Space and spatialization in contemporary music: History and analysis, ideas and implementations. Lulu. com.",
      "doi": ""
    },
    {
      "text": "David J Harris, Kate L Allen, Samuel J Vine, and Mark R Wilson. 2021. A systematic review and meta-analysis of the relationship between flow states and performance. International Review of Sport and Exercise Psychology (2021), 1–29.",
      "doi": ""
    },
    {
      "text": "Ni Kang, Willem-Paul Brinkman, M Birna van Riemsdijk, and Mark Neerincx. 2016. The design of virtual audiences: noticeable and recognizable behavioral styles. Computers in Human Behavior 55 (2016), 680–694.",
      "doi": "10.1016/j.chb.2015.10.008"
    },
    {
      "text": "Chaitali Kapadia. 2016. Doing more in less time: How multitasking increases creativity. In Academy of Management Proceedings, Vol. 2016. Academy of Management Briarcliff Manor, NY 10510, 17543.",
      "doi": ""
    },
    {
      "text": "Chaitali Kapadia and Shimul Melwani. 2021. More tasks, more ideas: The positive spillover effects of multitasking on subsequent creativity.Journal of Applied Psychology 106, 4 (2021), 542.",
      "doi": ""
    },
    {
      "text": "Brian F Katz, Barteld N Postma, David Poirier-Quinot, and Julie Meyer. 2017. Experience with a virtual reality auralization of Notre-Dame Cathedral. The Journal of the Acoustical Society of America 141, 5 (2017), 3454–3454.",
      "doi": ""
    },
    {
      "text": "Malte Kob, Sebastià V. Amengual Garí, and Zora Schärer Kalkandjiev. 2020. Room Effect on Musicians’ Performance. Springer International Publishing, Cham, 223–249. https://doi.org/10.1007/978-3-030-00386-9_9",
      "doi": ""
    },
    {
      "text": "Vali Lalioti, Sophia Ppali, Andrew J. Thomas, Ragnar Hrafnkelsson, Mick Grierson, Chee Siang Ang, B. S. Wohl, and Alexandra Covaci. 2021. VR Rehearse & Perform - A platform for rehearsing in Virtual Reality. In Proceedings of the 27th ACM Symposium on Virtual Reality Software and Technology(VRST ’21). Association for Computing Machinery, New York, NY, USA, 1–3. https://doi.org/10.1145/3489849.3489896",
      "doi": "10.1145/3489849.3489896"
    },
    {
      "text": "Rasmus B. Lind, Victor Milesen, Dina M. Smed, Simone P. Vinkel, Francesco Grani, Niels C. Nilsson, Lars Reng, Rolf Nordahl, and Stefania Serafin. 2017. Sound design in virtual reality concert experiences using a wave field synthesis approach. In 2017 IEEE Virtual Reality (VR). 363–364. https://doi.org/10.1109/VR.2017.7892327 ISSN: 2375-5334.",
      "doi": ""
    },
    {
      "text": "Kep Kee Loh and Stephen Wee Hun Lim. 2020. Positive associations between media multitasking and creativity. Computers in Human Behavior Reports 1 (2020), 100015.",
      "doi": ""
    },
    {
      "text": "Charles H Low. 2016. Assessing the Future IP Landscape of Music’s Cash Cow: What Happens When the Live Concert Goes Virtual. New York University Law Review 91 (2016), 33.",
      "doi": ""
    },
    {
      "text": "G. Luck and Petri Toiviainen. 2007. Ideal singing posture: evidence from behavioural studies and computational motion analysis. (Sept. 2007), 15–19.",
      "doi": ""
    },
    {
      "text": "Frederico Macedo. 2015. Investigating Sound in Space: Five meanings of space in music and sound art. Organised Sound 20, 2 (2015), 241–248.",
      "doi": ""
    },
    {
      "text": "Bhupinder S Mongia and Vijay K Madisetti. [n.d.]. Reliable Real-Time Applications on Android OS. ([n. d.]). http://omappedia.org/wiki/Android_Getting_Started",
      "doi": ""
    },
    {
      "text": "Jussi Palomäki, Tuisku Tammi, Noora Lehtonen, Niina Seittenranta, Michael Laakasuo, Sami Abuhamdeh, Otto Lappi, and Benjamin Ultan Cowley. 2021. The link between flow and performance is moderated by task experience. Computers in Human Behavior 124 (2021), 106891. https://doi.org/10.1016/j.chb.2021.106891",
      "doi": "10.1016/j.chb.2021.106891"
    },
    {
      "text": "Lilyan Frances Panton. 2017. Investigating auditorium acoustics from the perspective of musicians. Ph.D. Dissertation. University of Tasmania.",
      "doi": ""
    },
    {
      "text": "Luc Perneel, Hasan Fayyad-Kazan, and Martin Timmerman. 2012. Can Android be used for real-time purposes?2012 International Conference on Computer Systems and Industrial Informatics, ICCSII 2012 (2012). https://doi.org/10.1109/ICCSII.2012.6454350",
      "doi": ""
    },
    {
      "text": "Roberto Pompoli, Nicola Prodi, and Andrea Farnetani. 2012. A note on the acoustics of orchestra rehearsal rooms. Building Acoustics 19, 1 (2012), 1–11.",
      "doi": ""
    },
    {
      "text": "Luca Remaggi, Hansung Kim, Philip JB Jackson, and Adrian Hilton. 2019. Reproducing real world acoustics in virtual reality using spherical cameras. In Audio Engineering Society Conference: 2019 AES International Conference on Immersive and Interactive Audio. Audio Engineering Society.",
      "doi": ""
    },
    {
      "text": "Mark M Reybrouck. 2006. Musical creativity between symbolic modelling and perceptual constraints: The role of adaptive behaviour and epistemic autonomy. In Musical Creativity. Psychology Press, 58–76.",
      "doi": ""
    },
    {
      "text": "Zora Schärer and Stefan Weinzierl. 2015. The influence of room acoustics on solo music performance: An experimental study.Psychomusicology: Music, Mind, and Brain 25, 3 (2015), 195.",
      "doi": ""
    },
    {
      "text": "Eliane Schreuder, Jan van Erp, Alexander Toet, and Victor L Kallen. 2016. Emotional responses to multisensory environmental stimuli: A conceptual framework and literature review. Sage Open 6, 1 (2016), 2158244016630591.",
      "doi": ""
    },
    {
      "text": "Stefania Serafin, Cumhur Erkut, Juraj Kojs, Niels C Nilsson, and Rolf Nordahl. 2016. Virtual reality musical instruments: State of the art, design principles, and future directions. Computer Music Journal 40, 3 (2016), 22–40.",
      "doi": "10.1162/COMJ_a_00372"
    },
    {
      "text": "Stefania Serafin, Michele Geronazzo, Cumhur Erkut, Niels C Nilsson, and Rolf Nordahl. 2018. Sonic interactions in virtual reality: state of the art, current challenges, and future directions. IEEE computer graphics and applications 38, 2 (2018), 31–43.",
      "doi": ""
    },
    {
      "text": "Mincheol Shin, Stephen W Song, Se Jung Kim, and Frank Biocca. 2019. The effects of 3D sound in a 360-degree live concert video on social presence, parasocial interaction, enjoyment, and intent of financial supportive action. International Journal of Human-Computer Studies 126 (2019), 81–93.",
      "doi": "10.1016/j.ijhcs.2019.02.001"
    },
    {
      "text": "Mincheol Shin, Stephen W. Song, Se Jung Kim, and Frank Biocca. 2019. The effects of 3D sound in a 360-degree live concert video on social presence, parasocial interaction, enjoyment, and intent of financial supportive action. International Journal of Human Computer Studies 126 (jun 2019), 81–93. https://doi.org/10.1016/j.ijhcs.2019.02.001",
      "doi": "10.1016/j.ijhcs.2019.02.001"
    },
    {
      "text": "Veerle L. Simoens and Mari Tervaniemi. 2013. Musician–instrument relationship as a candidate index for professional well-being in musicians.Psychology of Aesthetics, Creativity, and the Arts 7, 2 (2013), 171. https://doi.org/10.1037/a0030164 Publisher: US: Educational Publishing Foundation.",
      "doi": ""
    },
    {
      "text": "Nikhil Singh, Jeff Mentch, Jerry Ng, Matthew Beveridge, and Iddo Drori. 2021. Image2Reverb: Cross-Modal Reverb Impulse Response Synthesis. arXiv:2103.14201 [cs, eess] (Aug. 2021). http://arxiv.org/abs/2103.14201 arXiv:2103.14201.",
      "doi": ""
    },
    {
      "text": "Mel Slater. 2009. Place illusion and plausibility can lead to realistic behaviour in immersive virtual environments. Philosophical Transactions of the Royal Society B: Biological Sciences 364, 1535 (Dec. 2009), 3549–3557. https://doi.org/10.1098/rstb.2009.0138",
      "doi": ""
    },
    {
      "text": "Mel Slater, Solène Neyret, Tania Johnston, Guillermo Iruretagoyena, Mercè Álvarez de la Campa Crespo, Miquel Alabèrnia-Segura, Bernhard Spanlang, and Guillem Feixas. 2019. An experimental study of a virtual reality counselling paradigm using embodied self-dialogue. Scientific Reports 9, 1 (July 2019), 10903. https://doi.org/10.1038/s41598-019-46877-3 Bandiera_abtest: a Cc_license_type: cc_by Cg_type: Nature Research Journals Number: 1 Primary_atype: Research Publisher: Nature Publishing Group Subject_term: Human behaviour;Quality of life Subject_term_id: human-behaviour;quality-of-life.",
      "doi": ""
    },
    {
      "text": "Mel Slater and Maria V Sanchez-Vives. 2016. Enhancing our lives with immersive virtual reality. Frontiers in Robotics and AI 3 (2016), 74.",
      "doi": ""
    },
    {
      "text": "Mel Slater and Sylvia Wilbur. 1997. A framework for immersive virtual environments (FIVE): Speculations on the role of presence in virtual environments. Presence: Teleoperators & Virtual Environments 6, 6(1997), 603–616.",
      "doi": "10.1162/pres.1997.6.6.603"
    },
    {
      "text": "Neta Spiro, Rosie Perkins, Sasha Kaye, Urszula Tymoszuk, Adele Mason-Bertrand, Isabelle Cossette, Solange Glasser, and Aaron Williamon. 2021. The Effects of COVID-19 Lockdown 1.0 on Working Patterns, Income, and Wellbeing among 1 Performing Arts Professionals in the United Kingdom (April–June 2020). Frontiers in Psychology(2021), 1–30. https://doi.org/10.3389/fpsyg.2020.594086",
      "doi": ""
    },
    {
      "text": "Maria Spychiger. 2019. The Sacred Sphere. Its Equipment, Beauty, Functions, and Transformations under Secular Conditions. Music, Education, and Religion: Intersections and Entanglements (2019), 142.",
      "doi": ""
    },
    {
      "text": "Isabel C Sumaya and Emily Darling. 2018. Procrastination, flow, and academic performance in real time using the experience sampling method. The Journal of Genetic Psychology 179, 3 (2018), 123–131.",
      "doi": ""
    },
    {
      "text": "David R. Thomas. 2006. A General Inductive Approach for Analyzing Qualitative Evaluation Data. American Journal of Evaluation 27, 2 (June 2006), 237–246. https://doi.org/10.1177/1098214005283748 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "James Traer and Josh H. McDermott. 2016. Statistics of natural reverberation enable perceptual separation of sound and space. Proceedings of the National Academy of Sciences 113, 48 (Nov. 2016), E7856–E7865. https://doi.org/10.1073/pnas.1612524113 Publisher: National Academy of Sciences Section: PNAS Plus.",
      "doi": ""
    },
    {
      "text": "Konstantinos Tsioutas, George Xylomenos, and Ioannis Doumanis. 2021. An empirical evaluation of QoME for NMP. In 2021 11th IFIP International Conference on New Technologies, Mobility and Security (NTMS). IEEE, 1–5.",
      "doi": ""
    },
    {
      "text": "Kanako Ueno, Kosuke Kato, and Keiji Kawai. 2010. Effect of room acoustics on musicians’ performance. Part I: Experimental investigation with a conceptual model. Acta Acustica united with Acustica 96, 3 (2010), 505–515.",
      "doi": ""
    },
    {
      "text": "Kanako Ueno and Hideki Tachibana. 2005. Cognitive modeling of musician’s perception in concert halls. Acoustical science and technology 26, 2 (2005), 156–161.",
      "doi": ""
    },
    {
      "text": "Kanako Ueno and Hideki Tachibana. 2011. A consideration on acoustic properties on concert-hall stages. Building Acoustics 18, 3-4 (2011), 221–235.",
      "doi": ""
    },
    {
      "text": "Dimitri van der Linden, Mattie Tops, and Arnold B Bakker. 2021. Go with the flow: A neuroscientific view on being fully engaged. European Journal of Neuroscience 53, 4 (2021), 947–963.",
      "doi": ""
    },
    {
      "text": "Tara Venkatesan, Qian Janice Wang, Charles Spence, T Venkatesan, QJ Wang, and C Spence. 2020. Psychology of Aesthetics, Creativity, and the Arts. (2020).",
      "doi": ""
    },
    {
      "text": "Arnold POS Vermeeren, Effie Lai-Chong Law, Virpi Roto, Marianna Obrist, Jettie Hoonhout, and Kaisa Väänänen-Vainio-Mattila. 2010. User experience evaluation methods: current state and development needs. In Proceedings of the 6th Nordic conference on human-computer interaction: Extending boundaries. 521–530.",
      "doi": "10.1145/1868914.1868973"
    },
    {
      "text": "John Vervaeke, Leo Ferraro, and Arianne Herrera-Bennett. 2018. 24 Flow as Spontaneous Thought: Insight and Implicit Learning. The Oxford Handbook of Spontaneous Thought: Mind-Wandering, Creativity, and Dreaming (2018), 309.",
      "doi": ""
    },
    {
      "text": "Indiana Wollman, Claudia Fritz, Jacques Poitevineau, and Stephen McAdams. 2014. Investigating the Role of Auditory and Tactile Modalities in Violin Quality Evaluation. PLOS ONE 9, 12 (Dec. 2014), e112552. https://doi.org/10.1371/journal.pone.0112552 Publisher: Public Library of Science.",
      "doi": ""
    },
    {
      "text": "NL Yeo, MP White, I Alcock, R Garside, SG Dean, AJ Smalley, and B Gatersleben. 2020. What is the best way of delivering virtual nature for improving mood? An experimental comparison of high definition TV, 360 video, and computer generated virtual reality. Journal of environmental psychology 72 (2020), 101500.",
      "doi": ""
    }
  ]
}