{
  "doi": "10.1145/3491102.3501821",
  "title": "VRception: Rapid Prototyping of Cross-Reality Systems in Virtual Reality",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Cross-reality systems empower users to transition along the reality-virtuality continuum or collaborate with others experiencing different manifestations of it. However, prototyping these systems is challenging, as it requires sophisticated technical skills, time, and often expensive hardware. We present VRception, a concept and toolkit for quick and easy prototyping of cross-reality systems. By simulating all levels of the reality-virtuality continuum entirely in Virtual Reality, our concept overcomes the asynchronicity of realities, eliminating technical obstacles. Our VRception Toolkit leverages this concept to allow rapid prototyping of cross-reality systems and easy remixing of elements from all continuum levels. We replicated six cross-reality papers using our toolkit and presented them to their authors. Interviews with them revealed that our toolkit sufficiently replicates their core functionalities and allows quick iterations. Additionally, remote participants used our toolkit in pairs to collaboratively implement prototypes in about eight minutes that they would have otherwise expected to take days.",
  "authors": [
    {
      "name": "Uwe Gruenefeld",
      "institution": "HCI Group, University of Duisburg-Essen, Germany",
      "img": "/do/10.1145/contrib-99658650069/rel-imgonly/99658650069.jpg",
      "acmid": "99658650069",
      "orcid": "0000-0002-5671-1640"
    },
    {
      "name": "Jonas Auda",
      "institution": "HCI Group, University of Duisburg-Essen, Germany",
      "img": "/do/10.1145/contrib-87259206957/rel-imgonly/87259206957.jpg",
      "acmid": "87259206957",
      "orcid": "missing"
    },
    {
      "name": "Florian Mathis",
      "institution": "University of Glasgow, United Kingdom and University of Edinburgh, United Kingdom",
      "img": "/do/10.1145/contrib-99659234110/rel-imgonly/aaaaa.jpg",
      "acmid": "99659234110",
      "orcid": "0000-0002-1690-3410"
    },
    {
      "name": "Stefan Schneegass",
      "institution": "HCI Group, University of Duisburg-Essen, Germany",
      "img": "/do/10.1145/contrib-81503680798/rel-imgonly/stefan_wide.png",
      "acmid": "81503680798",
      "orcid": "0000-0002-0132-4934"
    },
    {
      "name": "Mohamed Khamis",
      "institution": "University of Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-99659272366/rel-imgonly/22_-_287_computing_science_staff_mohamad_khamis_0058.jpg",
      "acmid": "99659272366",
      "orcid": "0000-0001-7051-5200"
    },
    {
      "name": "Jan Gugenheimer",
      "institution": "Institut Polytechnique de Paris, France and Télécom Paris, LTCI, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458801557",
      "orcid": "0000-0002-6466-3845"
    },
    {
      "name": "Sven Mayer",
      "institution": "LMU Munich, Germany",
      "img": "/do/10.1145/contrib-99658696530/rel-imgonly/p_mayersven.jpg",
      "acmid": "99658696530",
      "orcid": "0000-0001-5462-8782"
    }
  ],
  "references": [
    {
      "text": "Shivam Agarwal, Jonas Auda, Stefan Schneegaß, and Fabian Beck. 2020. A Design and Application Space for Visualizing User Sessions of Virtual and Mixed Reality Environments. In Vision, Modeling, and Visualization, Jens Krüger, Matthias Niessner, and Jörg Stückler (Eds.). The Eurographics Association, Norrköping, Sweden, 10 pages. https://doi.org/10.2312/vmv.20201194",
      "doi": ""
    },
    {
      "text": "Ghassem Alaee, Amit P Deasi, Lourdes Pena-Castillo, Edward Brown, and Oscar Meruvia-Pastor. 2018. A User Study on Augmented Virtuality Using Depth Sensing Cameras for Near-Range Awareness in Immersive VR. In IEEE VR’s 4th Workshop on Everyday Virtual Reality(WEVR ’18, Vol. 10). wevr.adalsimeone.me, Reutlingen, Germany, 1–6.",
      "doi": ""
    },
    {
      "text": "Tatsuya Amano, Shugo Kajita, Hirozumi Yamaguchi, Teruo Higashino, and Mineo Takai. 2018. Smartphone Applications Testbed Using Virtual Reality. In Proceedings of the 15th EAI International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services (New York, NY, USA) (MobiQuitous ’18). Association for Computing Machinery, New York, NY, USA, 422–431. https://doi.org/10.1145/3286978.3287028",
      "doi": "10.1145/3286978.3287028"
    },
    {
      "text": "Deepali Aneja, Daniel McDuff, and Shital Shah. 2019. A High-Fidelity Open Embodied Avatar with Lip Syncing and Expression Capabilities. In 2019 International Conference on Multimodal Interaction (Suzhou, China) (ICMI ’19). Association for Computing Machinery, New York, NY, USA, 69–73. https://doi.org/10.1145/3340555.3353744",
      "doi": "10.1145/3340555.3353744"
    },
    {
      "text": "Csaba Antonya and Doru Talaba. 2007. Design Evaluation and Modification of Mechanical Systems in Virtual Environments. Virtual Reality 11, 4 (Oct. 2007), 275–285. https://doi.org/10.1007/s10055-007-0074-6",
      "doi": ""
    },
    {
      "text": "Andreas Aristidou and Joan Lasenby. 2011. FABRIK: A fast, iterative solver for the Inverse Kinematics problem. Graphical Models 73, 5 (2011), 243–260. https://doi.org/10.1016/j.gmod.2011.05.003",
      "doi": "10.1016/j.gmod.2011.05.003"
    },
    {
      "text": "Narges Ashtari, Andrea Bunt, Joanna McGrenere, Michael Nebeling, and Parmit K. Chilana. 2020. Creating Augmented and Virtual Reality Applications: Current Practices, Challenges, and Opportunities. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376722",
      "doi": "10.1145/3313831.3376722"
    },
    {
      "text": "Jonas Auda, Uwe Gruenefeld, and Sven Mayer. 2020. It Takes Two To Tango: Conflicts Between Users on the Reality-Virtuality Continuum and Their Bystanders. In In the Proceedings of the International Workshop on Cross-Reality (XR) Interaction (2020-11-08) (XR ’20). CEUR-WS, Lisbon, Portugal, 1–5. http://ceur-ws.org/Vol-2779/paper3.pdf",
      "doi": ""
    },
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining What Individual SUS Scores Mean: Adding an Adjective Rating Scale. J. Usability Studies 4, 3 (May 2009), 114–123.",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "Mark Billinghurst and Michael Nebeling. 2021. Rapid Prototyping of XR Experiences. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 132, 3 pages. https://doi.org/10.1145/3411763.3445002",
      "doi": ""
    },
    {
      "text": "John Brooke. 1996. SUS: a ”quick and dirty” usability. Usability evaluation in industry 189 (1996), 6 pages.",
      "doi": ""
    },
    {
      "text": "Liwei Chan and Kouta Minamizawa. 2017. FrontFace: Facilitating Communication between HMD Users and Outsiders Using Front-Facing-Screen HMDs. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (Vienna, Austria) (MobileHCI ’17). Association for Computing Machinery, New York, NY, USA, Article 22, 5 pages. https://doi.org/10.1145/3098279.3098548",
      "doi": "10.1145/3098279.3098548"
    },
    {
      "text": "Lung-Pan Cheng, Eyal Ofek, Christian Holz, and Andrew D. Wilson. 2019. VRoamer: Generating On-The-Fly VR Experiences While Walking inside Large, Unknown Real-World Building Environments. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces. IEEE, Piscataway, New Jersey, United States, 359–366. https://doi.org/10.1109/VR.2019.8798074",
      "doi": ""
    },
    {
      "text": "Shuchisnigdha Deb, Daniel W. Carruth, Richard Sween, Lesley Strawderman, and Teena M. Garrison. 2017. Efficacy of virtual reality in pedestrian safety research. Applied Ergonomics 65(2017), 449 – 460. https://doi.org/10.1016/j.apergo.2017.03.007",
      "doi": ""
    },
    {
      "text": "Kevin Doherty and Gavin Doherty. 2018. Engagement in HCI: Conception, Theory and Measurement. ACM Comput. Surv. 51, 5, Article 99 (Nov. 2018), 39 pages. https://doi.org/10.1145/3234149",
      "doi": "10.1145/3234149"
    },
    {
      "text": "Kevin Fan, Liwei Chan, Daiya Kato, Kouta Minamizawa, and Masahiko Inami. 2016. VR Planet: Interface for Meta-View and Feet Interaction of VR Contents. In ACM SIGGRAPH 2016 VR Village (Anaheim, California) (SIGGRAPH ’16). ACM, New York, NY, USA, Article 24, 2 pages. https://doi.org/10.1145/2929490.2931001",
      "doi": "10.1145/2929490.2931001"
    },
    {
      "text": "Gabriel Freitas, Marcio Sarroglia Pinho, Milene Selbach Silveira, and Frank Maurer. 2020. A Systematic Review of Rapid Prototyping Tools for Augmented Reality. In 2020 22nd Symposium on Virtual and Augmented Reality(SVR ’20). IEEE, Piscataway, New Jersey, United States, 199–209. https://doi.org/10.1109/SVR51698.2020.00041",
      "doi": ""
    },
    {
      "text": "Ceenu George, Philipp Janssen, David Heuss, and Florian Alt. 2019. Should I Interrupt or Not? Understanding Interruptions in Head-Mounted Display Settings. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 497–510. https://doi.org/10.1145/3322276.3322363",
      "doi": "10.1145/3322276.3322363"
    },
    {
      "text": "Andrzej Grabowski and Jarosław Jankowski. 2015. Virtual Reality-based pilot training for underground coal miners. Safety Science 72(2015), 310–314. https://doi.org/10.1016/j.ssci.2014.09.017",
      "doi": ""
    },
    {
      "text": "Uwe Gruenefeld, Abdallah El Ali, Susanne Boll, and Wilko Heuten. 2018. Beyond Halo and Wedge: Visualizing out-of-View Objects on Head-Mounted Virtual and Augmented Reality Devices. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (Barcelona, Spain) (MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, Article 40, 11 pages. https://doi.org/10.1145/3229434.3229438",
      "doi": "10.1145/3229434.3229438"
    },
    {
      "text": "Jan Gugenheimer, Evgeny Stemasov, Julian Frommel, and Enrico Rukzio. 2017. ShareVR: Enabling Co-Located Experiences for Virtual Reality between HMD and Non-HMD Users. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 4021–4033. https://doi.org/10.1145/3025453.3025683",
      "doi": "10.1145/3025453.3025683"
    },
    {
      "text": "Jan Gugenheimer, Evgeny Stemasov, Harpreet Sareen, and Enrico Rukzio. 2018. FaceDisplay: Towards Asymmetric Multi-User Interaction for Nomadic Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173628",
      "doi": "10.1145/3173574.3173628"
    },
    {
      "text": "Gunnar Harboe and Elaine M. Huang. 2015. Real-World Affinity Diagramming Practices: Bridging the Paper-Digital Gap. In Proc. 33rd Annual ACM Conf. Human Factors in Computing Systems. ACM, New York, NY, USA, 95–104. https://doi.org/10.1145/2702123.2702561",
      "doi": "10.1145/2702123.2702561"
    },
    {
      "text": "Sandra G. Hart. 2006. NASA-task load index (NASA-TLX); 20 years later. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 50. Sage publications Sage CA: Los Angeles, CA, Los Angeles, California, United States, 904–908. https://doi.org/10.1177/154193120605000909",
      "doi": "10.1177/154193120605000909"
    },
    {
      "text": "Jeremy Hartmann, Christian Holz, Eyal Ofek, and Andrew D. Wilson. 2019. RealityCheck: Blending Virtual Environments with Situated Physical Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300577",
      "doi": "10.1145/3290605.3300577"
    },
    {
      "text": "Jeremy Hartmann, Yen-Ting Yeh, and Daniel Vogel. 2020. AAR: Augmenting a Wearable Augmented Reality Display with an Actuated Head-Mounted Projector. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 445–458. https://doi.org/10.1145/3379337.3415849",
      "doi": "10.1145/3379337.3415849"
    },
    {
      "text": "Philipp Hock, Sebastian Benedikter, Jan Gugenheimer, and Enrico Rukzio. 2017. CarVR: Enabling In-Car Virtual Reality Entertainment. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 4034–4044. https://doi.org/10.1145/3025453.3025665",
      "doi": "10.1145/3025453.3025665"
    },
    {
      "text": "Arief Ernst Hühn, Vassilis-Javed Khan, Andrés Lucero, and Paul Ketelaar. 2012. On the Use of Virtual Environments for the Evaluation of Location-Based Applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 2569–2578. https://doi.org/10.1145/2207676.2208646",
      "doi": "10.1145/2207676.2208646"
    },
    {
      "text": "Akira Ishii, Masaya Tsuruta, Ippei Suzuki, Shuta Nakamae, Tatsuya Minagawa, Junichi Suzuki, and Yoichi Ochiai. 2017. ReverseCAVE: Providing Reverse Perspectives for Sharing VR Experience. In ACM SIGGRAPH 2017 Posters (Los Angeles, California) (SIGGRAPH ’17). Association for Computing Machinery, New York, NY, USA, Article 28, 2 pages. https://doi.org/10.1145/3102163.3102208",
      "doi": "10.1145/3102163.3102208"
    },
    {
      "text": "Akira Ishii, Masaya Tsuruta, Ippei Suzuki, Shuta Nakamae, Junichi Suzuki, and Yoichi Ochiai. 2019. Let Your World Open: CAVE-Based Visualization Methods of Public Virtual Reality towards a Shareable VR Experience. In Proceedings of the 10th Augmented Human International Conference 2019 (Reims, France) (AH ’19). ACM, New York, NY, USA, Article 33, 8 pages. https://doi.org/10.1145/3311823.3311860",
      "doi": "10.1145/3311823.3311860"
    },
    {
      "text": "Pascal Jansen, Fabian Fischbach, Jan Gugenheimer, Evgeny Stemasov, Julian Frommel, and Enrico Rukzio. 2020. ShARe: Enabling Co-Located Asymmetric Multi-User Interaction for Augmented Reality Head-Mounted Displays. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 459–471. https://doi.org/10.1145/3379337.3415843",
      "doi": "10.1145/3379337.3415843"
    },
    {
      "text": "Ben Kenwright. 2012. Inverse Kinematics – Cyclic Coordinate Descent (CCD). Journal of Graphics Tools 16, 4 (2012), 177–217. https://doi.org/10.1080/2165347X.2013.823362",
      "doi": ""
    },
    {
      "text": "Jarrod Knibbe, Jonas Schjerlund, Mathias Petraeus, and Kasper Hornbæk. 2018. The Dream is Collapsing: The Experience of Exiting VR. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174057",
      "doi": "10.1145/3173574.3174057"
    },
    {
      "text": "Pascal Knierim, Valentin Schwind, Anna Maria Feit, Florian Nieuwenhuizen, and Niels Henze. 2018. Physical Keyboards in Virtual Reality: Analysis of Typing Performance and Effects of Avatar Hands. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3173574.3173919",
      "doi": "10.1145/3173574.3173919"
    },
    {
      "text": "Zhengqing Li, Liwei Chan, Theophilus Teo, and Hideki Koike. 2020. OmniGlobeVR: A Collaborative 360° Communication System for VR. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3382869",
      "doi": "10.1145/3334480.3382869"
    },
    {
      "text": "Christian Mai, Lukas Rambold, and Mohamed Khamis. 2017. TransparentHMD: Revealing the HMD User’s Face to Bystanders. In Proceedings of the 16th International Conference on Mobile and Ubiquitous Multimedia (Stuttgart, Germany) (MUM ’17). Association for Computing Machinery, New York, NY, USA, 515–520. https://doi.org/10.1145/3152832.3157813",
      "doi": "10.1145/3152832.3157813"
    },
    {
      "text": "Christian Mai, Tim Wiltzius, Florian Alt, and Heinrich Hußmann. 2018. Feeling Alone in Public: Investigating the Influence of Spatial Layout on Users’ VR Experience. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (Oslo, Norway) (NordiCHI ’18). Association for Computing Machinery, New York, NY, USA, 286–298. https://doi.org/10.1145/3240167.3240200",
      "doi": "10.1145/3240167.3240200"
    },
    {
      "text": "Ville Mäkelä, Rivu Radiah, Saleh Alsherif, Mohamed Khamis, Chong Xiao, Lisa Borchert, Albrecht Schmidt, and Florian Alt. 2020. Virtual Field Studies: Conducting Studies on Public Displays in Virtual Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376796",
      "doi": "10.1145/3313831.3376796"
    },
    {
      "text": "Florian Mathis, Kami Vaniea, and Mohamed Khamis. 2021. RepliCueAuth: Validating the Use of a lab-based Virtual Reality Setup for Evaluating Authentication Systems. In Proceedings of the 39th Annual ACM Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). ACM, New York, NY, USA, 21 pages. https://doi.org/10.1145/3411764.3445478",
      "doi": "10.1145/3411764.3445478"
    },
    {
      "text": "Mark McGill, Daniel Boland, Roderick Murray-Smith, and Stephen Brewster. 2015. A Dose of Reality: Overcoming Usability Challenges in VR Head-Mounted Displays. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2143–2152. https://doi.org/10.1145/2702123.2702382",
      "doi": ""
    },
    {
      "text": "Paul Milgram and Fumio Kishino. 1994. A taxonomy of mixed reality visual displays. IEICE TRANSACTIONS on Information and Systems 77, 12 (1994), 1321–1329.",
      "doi": ""
    },
    {
      "text": "Mark P. Mobach. 2008. Do Virtual Worlds Create Better Real Worlds?Virtual Reality 12, 3 (Sept. 2008), 163–179. https://doi.org/10.1007/s10055-008-0081-2",
      "doi": ""
    },
    {
      "text": "Michael Nebeling, Katy Lewis, Yu-Cheng Chang, Lihan Zhu, Michelle Chung, Piaoyang Wang, and Janet Nebeling. 2020. XRDirector: A Role-Based Collaborative Immersive Authoring System. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376637",
      "doi": "10.1145/3313831.3376637"
    },
    {
      "text": "Michael Nebeling, Katy Lewis, Yu-Cheng Chang, Lihan Zhu, Michelle Chung, Piaoyang Wang, and Janet Nebeling. 2020. XRDirector: A Role-Based Collaborative Immersive Authoring System. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376637",
      "doi": "10.1145/3313831.3376637"
    },
    {
      "text": "Michael Nebeling and Katy Madier. 2019. 360proto: Making Interactive Virtual Reality & Augmented Reality Prototypes from Paper. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300826",
      "doi": "10.1145/3290605.3300826"
    },
    {
      "text": "Michael Nebeling, Janet Nebeling, Ao Yu, and Rob Rumble. 2018. ProtoAR: Rapid Physical-Digital Prototyping of Mobile Augmented Reality Applications. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173927",
      "doi": "10.1145/3173574.3173927"
    },
    {
      "text": "Michael Nebeling and Maximilian Speicher. 2018. The Trouble with Augmented Reality/Virtual Reality Authoring Tools. In 2018 IEEE International Symposium on Mixed and Augmented Reality Adjunct(ISMAR-Adjunct ’18). IEEE, Piscataway, New Jersey, United States, 333–337. https://doi.org/10.1109/ISMAR-Adjunct.2018.00098",
      "doi": ""
    },
    {
      "text": "Benjamin Nuernberger, Eyal Ofek, Hrvoje Benko, and Andrew D. Wilson. 2016. SnapToReality: Aligning Augmented Reality to the Real World. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1233–1244. https://doi.org/10.1145/2858036.2858250",
      "doi": "10.1145/2858036.2858250"
    },
    {
      "text": "Thammathip Piumsomboon, Gun A. Lee, Andrew Irlitti, Barrett Ens, Bruce H. Thomas, and Mark Billinghurst. 2019. On the Shoulder of the Giant: A Multi-Scale Mixed Reality Collaboration with 360 Video Sharing and Tangible Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–17. https://doi.org/10.1145/3290605.3300458",
      "doi": "10.1145/3290605.3300458"
    },
    {
      "text": "Charles Pontonnier, Georges Dumont, Asfhin Samani, Pascal Madeleine, and Marwan Badawi. 2014. Designing and evaluating a workstation in real and virtual environment: toward virtual reality based ergonomic design sessions. Journal on Multimodal User Interfaces 8, 2 (2014), 199–208. https://doi.org/10.1007/s12193-013-0138-8",
      "doi": ""
    },
    {
      "text": "Rivu Radiah, Ville Mäkelä, Sarah Prange, Sarah Delgado Rodriguez, Robin Piening, Yumeng Zhou, Kay Köhle, Ken Pfeuffer, Yomna Abdelrahman, Matthias Hoppe, Albrecht Schmidt, and Florian Alt. 2021. Remote VR Studies: A Framework for Running Virtual Reality Studies Remotely Via Participant-Owned HMDs. ACM Trans. Comput.-Hum. Interact. 28, 6, Article 46 (nov 2021), 36 pages. https://doi.org/10.1145/3472617",
      "doi": "10.1145/3472617"
    },
    {
      "text": "Jack Ratcliffe, Francesco Soave, Nick Bryan-Kinns, Laurissa Tokarchuk, and Ildar Farkhatdinov. 2021. Extended Reality (XR) Remote Research: a Survey of Drawbacks and Opportunities. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (2021-05-08) (CHI ’21). Association for Computing Machinery, New York, New York, USA, 1–13. https://doi.org/10.1145/3411764.3445170 arxiv:2101.08046 [cs.HC]",
      "doi": "10.1145/3411764.3445170"
    },
    {
      "text": "Francisco Rebelo, Paulo Noriega, Emília Duarte, and Marcelo Soares. 2012. Using Virtual Reality to Assess User Experience. Human Factors 54, 6 (2012), 964–982. https://doi.org/10.1177/0018720812465006",
      "doi": ""
    },
    {
      "text": "David Saffo, Sara Di Bartolomeo, Caglar Yildirim, and Cody Dunne. 2021. Remote and Collaborative Virtual Reality Experiments via Social VR Platforms. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (2021-05-08) (CHI ’21). Association for Computing Machinery, New York, New York, USA, 1–15. https://doi.org/10.1145/3411764.3445426",
      "doi": "10.1145/3411764.3445426"
    },
    {
      "text": "Valentin Schwind, Pascal Knierim, Lewis Chuang, and Niels Henze. 2017. ”Where’s Pinky?”: The Effects of a Reduced Number of Fingers in Virtual Reality. In Proceedings Annual Symposium on Computer-Human Interaction in Play (Amsterdam, The Netherlands) (CHIPlay ’17). ACM, New York, NY, USA, 507–515. https://doi.org/10.1145/3116595.3116596",
      "doi": "10.1145/3116595.3116596"
    },
    {
      "text": "Valentin Schwind, Jens Reinhardt, Rufat Rzayev, Niels Henze, and Katrin Wolf. 2018. Virtual Reality on the Go? A Study on Social Acceptance of VR Glasses. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (Barcelona, Spain) (MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, 111–118. https://doi.org/10.1145/3236112.3236127",
      "doi": "10.1145/3236112.3236127"
    },
    {
      "text": "Ben Shneiderman, Catherine Plaisant, Maxine S Cohen, Steven Jacobs, Niklas Elmqvist, and Nicholas Diakopoulos. 2016. Designing the user interface: strategies for effective human-computer interaction. Pearson, London, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Adalberto L. Simeone, Mohamed Khamis, Augusto Esteves, Florian Daiber, Matjaž Kljun, Klen Čopič Pucihar, Poika Isokoski, and Jan Gugenheimer. 2020. International Workshop on Cross-Reality (XR) Interaction. In Companion Proceedings of the 2020 Conference on Interactive Surfaces and Spaces (Virtual Event, Portugal) (ISS ’20). Association for Computing Machinery, New York, NY, USA, 111–114. https://doi.org/10.1145/3380867.3424551",
      "doi": "10.1145/3380867.3424551"
    },
    {
      "text": "Richard Skarbez, Missie Smith, and Mary C. Whitton. 2021. Revisiting Milgram and Kishino’s Reality-Virtuality Continuum. Frontiers in Virtual Reality 2 (2021), 27. https://doi.org/10.3389/frvir.2021.647997",
      "doi": ""
    },
    {
      "text": "Mel Slater, Martin Usoh, and Anthony Steed. 1994. Depth of Presence in Virtual Environments. Presence: Teleoperators and Virtual Environments 3, 2 (05 1994), 130–144. https://doi.org/10.1162/pres.1994.3.2.130",
      "doi": ""
    },
    {
      "text": "Maximilian Speicher, Brian D. Hall, and Michael Nebeling. 2019. What is Mixed Reality?. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300767",
      "doi": "10.1145/3290605.3300767"
    },
    {
      "text": "Maximilian Speicher, Brian D. Hall, Ao Yu, Bowen Zhang, Haihua Zhang, Janet Nebeling, and Michael Nebeling. 2018. XD-AR: Challenges and Opportunities in Cross-Device Augmented Reality Application Development. Proc. ACM Hum.-Comput. Interact. 2, EICS, Article 7 (June 2018), 24 pages. https://doi.org/10.1145/3229089",
      "doi": "10.1145/3229089"
    },
    {
      "text": "Frank Steinicke, Gerd Bruder, Klaus Hinrichs, Anthony Steed, and Alexander L. Gerlach. 2009. Does a Gradual Transition to the Virtual World increase Presence?. In 2009 IEEE Virtual Reality Conference. IEEE, Piscataway, New Jersey, United States, 203–210. https://doi.org/10.1109/VR.2009.4811024",
      "doi": "10.1109/VR.2009.4811024"
    },
    {
      "text": "Balasaravanan Thoravi Kumaravel, Cuong Nguyen, Stephen DiVerdi, and Bjoern Hartmann. 2020. TransceiVR: Bridging Asymmetrical Communication Between VR Users and External Collaborators. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 182–195. https://doi.org/10.1145/3379337.3415827",
      "doi": "10.1145/3379337.3415827"
    },
    {
      "text": "Dimitar Valkov and Steffen Flagge. 2017. Smooth Immersion: The Benefits of Making the Transition to Virtual Environments a Continuous Process. In Proceedings of the 5th Symposium on Spatial User Interaction (Brighton, United Kingdom) (SUI ’17). Association for Computing Machinery, New York, NY, USA, 12–19. https://doi.org/10.1145/3131277.3132183",
      "doi": "10.1145/3131277.3132183"
    },
    {
      "text": "Alexandra Voit, Sven Mayer, Valentin Schwind, and Niels Henze. 2019. Online, VR, AR, Lab, and In-Situ: Comparison of Research Methods to Evaluate Smart Artifacts. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300737",
      "doi": "10.1145/3290605.3300737"
    },
    {
      "text": "Chiu-Hsuan Wang, Chia-En Tsai, Seraphina Yong, and Liwei Chan. 2020. Slice of Light: Transparent and Integrative Transition Among Realities in a Multi-HMD-User Environment. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 805–817. https://doi.org/10.1145/3379337.3415868",
      "doi": "10.1145/3379337.3415868"
    },
    {
      "text": "Chiu-Hsuan Wang, Seraphina Yong, Hsin-Yu Chen, Yuan-Syun Ye, and Liwei Chan. 2020. HMD Light: Sharing In-VR Experience via Head-Mounted Projector for Asymmetric Interaction. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 472–486. https://doi.org/10.1145/3379337.3415847",
      "doi": "10.1145/3379337.3415847"
    },
    {
      "text": "Maximilian Weiß, Katrin Angerbauer, Alexandra Voit, Magdalena Schwarzl, Michael Sedlmair, and Sven Mayer. 2021. Revisited: Comparison of Empirical Methods to Evaluate Visualizations Supporting Crafting and Assembly Purposes. IEEE Transactions on Visualization and Computer Graphics 27, 2(2021), 1204–1213. https://doi.org/10.1109/TVCG.2020.3030400",
      "doi": ""
    },
    {
      "text": "Julie R. Williamson, Mark McGill, and Khari Outram. 2019. PlaneVR: Social Acceptability of Virtual Reality for Aeroplane Passengers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300310",
      "doi": "10.1145/3290605.3300310"
    },
    {
      "text": "Keng-Ta Yang, Chiu-Hsuan Wang, and Liwei Chan. 2018. ShareSpace: Facilitating Shared Use of the Physical Space by Both VR Head-Mounted Display and External Users. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 499–509. https://doi.org/10.1145/3242587.3242630",
      "doi": "10.1145/3242587.3242630"
    }
  ]
}