{
  "doi": "10.1145/3491102.3517438",
  "title": "Avatar Identities and Climate Change Action in Video Games: Analysis of Mitigation and Adaptation Practices",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "Games are considered promising for engaging people with climate change. In virtual worlds, players can adopt empowering roles to mitigate greenhouse gas emissions and/or adapt to climate impacts. However, the lack of a comprehensive exploration of existing climate-related identities and actions prevents understanding their potential. Here, we analyze 80 video games and classify avatar identities, or expected player roles, into six types. Climate selves encourage direct life changes; climate citizens are easy to identify with and imitate; climate heroes are inspirational figures upholding environmental values; empowered individuals deliberate to avoid a tragedy of the commons; authorities should consider stakeholders and the environment; and faction leaders engage in bi- or multilateral relations. Adaptation is often for decision-making profiles, while empowered individuals, authorities, and faction leaders usually face conflicting objectives. We discuss our results in relation to avatar research and provide suggestions for researchers, designers, and educators.",
  "authors": [
    {
      "name": "Daniel Fernández Galeote",
      "institution": "Gamification Group, Faculty of Information Technology and Communication Sciences, Tampere University, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659892582",
      "orcid": "0000-0002-5197-146X"
    },
    {
      "name": "Nikoletta-Zampeta Legaki",
      "institution": "Gamification Group, Faculty of Information Technology and Communication Sciences, Tampere University, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233965",
      "orcid": "missing"
    },
    {
      "name": "Juho Hamari",
      "institution": "Gamification Group, Faculty of Information Technology and Communication Sciences, Tampere University, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548585656",
      "orcid": "0000-0002-6573-588X"
    }
  ],
  "references": [
    {
      "text": "Espen Aarseth. 2007. I fought the law: Transgressive play and the implied player. In Proceedings of DiGRA 2007 Conference. Digital Games Research Association (DiGRA), Finland, 130–133.",
      "doi": ""
    },
    {
      "text": "WeDontHaveTime AB. 2019. We Don’t Have Time. Social network [Android, iOS]. WeDontHaveTime AB, Stockholm, Sweden..",
      "doi": ""
    },
    {
      "text": "Benjamin Abraham and Darshana Jayemanne. 2017. Where are all the climate change games? Locating digital games’ response to climate change. Transformations 30(2017), 74–94.",
      "doi": ""
    },
    {
      "text": "Activision. 2000. Call to Power II. Game [PC]. Activision, Santa Monica, California..",
      "doi": ""
    },
    {
      "text": "Adobe. 2021. Adobe Flash Player End of Life. Adobe. https://www.adobe.com/products/flashplayer/end-of-life.html",
      "doi": ""
    },
    {
      "text": "Sun Joo Ahn, Joshua Bostick, Elise Ogle, Kristine L Nowak, Kara T McGillicuddy, and Jeremy N Bailenson. 2016. Experiencing nature: Embodying animals in immersive virtual environments increases inclusion of nature in self and involvement with nature. Journal of Computer-Mediated Communication 21, 6 (2016), 399–419.",
      "doi": "10.1111/jcc4.12173"
    },
    {
      "text": "Playing For The Planet Alliance. 2019. Members - Playing4theplanet. Playing For The Planet Alliance. https://playing4theplanet.org/members/",
      "doi": ""
    },
    {
      "text": "Lawrence C An, Michele RS Demers, Matthias A Kirch, Shannon Considine-Dunn, Vijay Nair, Kohinoor Dasgupta, Naveen Narisetty, Ken Resnicow, and Jasjit Ahluwalia. 2013. A randomized trial of an avatar-hosted multiple behavior change intervention for young adult smokers. Journal of the National Cancer Institute Monographs 2013, 47(2013), 209–215.",
      "doi": ""
    },
    {
      "text": "Thomas Apperley and Darshana Jayemane. 2012. Game studies’ material turn. Westminster Papers in Communication and Culture 9, 1 (2012), 5–25.",
      "doi": ""
    },
    {
      "text": "Thomas H Apperley and Justin Clemens. 2017. Flipping out: Avatars and identity. In Boundaries of Self and Reality Online. Elsevier, Amsterdam, The Netherlands, 41–56.",
      "doi": ""
    },
    {
      "text": "Therese Asplund. 2020. Credibility aspects of research-based gaming in science communication.: The case of The Maladaptation Game. JCOM-Journal of Science Communication 19, 1 (2020), A01.",
      "doi": ""
    },
    {
      "text": "Isabella Aura, Lobna Hassan, and Juho Hamari. 2021. Teaching within a Story: Understanding storification of pedagogy. International Journal of Educational Research 106 (2021), 101728.",
      "doi": ""
    },
    {
      "text": "Christine M Bachen, Pedro F Hernández-Ramos, and Chad Raphael. 2012. Simulating REAL LIVES: Promoting global empathy and interest in learning through simulation games. Simulation & Gaming 43, 4 (2012), 437–460.",
      "doi": "10.1177/1046878111432108"
    },
    {
      "text": "Jaime Banks. 2015. Object, me, symbiote, other: A social typology of player-avatar relationships. First Monday 20, 2 (2015).",
      "doi": ""
    },
    {
      "text": "Jorge Barcena-Vazquez and Karina Caro. 2019. Designing a video game to support climate change awareness in a museum exhibition context. In Proceedings of the IX Latin American Conference on Human Computer Interaction. Association for Computing Machinery, New York, NY, 1–4.",
      "doi": "10.1145/3358961.3358972"
    },
    {
      "text": "Dalibor Bartoš. 2019. Trash Time. Game [PC]. Dalibor Bartoš and TEDI Games, Slovakia..",
      "doi": ""
    },
    {
      "text": "Jonathan Belman and Mary Flanagan. 2010. Designing games to foster empathy. International Journal of Cognitive Technology 15, 1(2010), 11.",
      "doi": ""
    },
    {
      "text": "Max V Birk, Cheralyn Atkins, Jason T Bowey, and Regan L Mandryk. 2016. Fostering intrinsic motivation through avatar identification in digital games. In Proceedings of the 2016 CHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, 2982–2995.",
      "doi": "10.1145/2858036.2858062"
    },
    {
      "text": "Ian Bogost. 2007. Persuasive games. Vol. 5. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Maxime Boudreault, Bruno Bouchard, Kévin Bouchard, and Sébastien Gaboury. 2018. Maximizing Player Engagement in a Global Warming Sensitization Video Game Through Reinforcement Learning. In Proceedings of the 4th EAI International Conference on Smart Objects and Technologies for Social Good. Association for Computing Machinery, New York, NY, 196–201.",
      "doi": "10.1145/3284869.3284920"
    },
    {
      "text": "Sarah Lynne Bowman. 2010. The functions of role-playing games: How participants create community, solve problems and explore identity. McFarland, Jefferson, NC.",
      "doi": ""
    },
    {
      "text": "Mila Bujić, Mikko Salminen, Joseph Macey, and Juho Hamari. 2020. “Empathy machine”: how virtual reality affects human rights attitudes. Internet Research 30, 5 (2020), 1407–1425.",
      "doi": ""
    },
    {
      "text": "Jacqueline Burgess and Christian Jones. 2020. “I Harbour Strong Feelings for Tali Despite Her Being a Fictional Character”: Investigating Videogame Players’ Emotional Attachments to Non-Player Characters. Game Studies 20, 1 (2020).",
      "doi": ""
    },
    {
      "text": "Peter L Callero. 1985. Role-identity salience. Social Psychology Quarterly 48, 3 (1985), 203–215.",
      "doi": ""
    },
    {
      "text": "CO2 Cards. 2019. CO2 Cards - Play & reduce real-life CO2 emissions!Game [Android]. CO2 Cards, Sofia, Bulgaria..",
      "doi": ""
    },
    {
      "text": "Carl von Ossietzky Universität Oldenburgand Bornholdt Lee GmbH. 2016. Keep Cool Mobile. Game [browser]. Carl von Ossietzky Universität Oldenburg, Oldenburg, Germany..",
      "doi": ""
    },
    {
      "text": "Michael J Carter and Hannah Mangum. 2020. Role identities: Measurement and outcomes of conventional vs. idiosyncratic balance. Current Psychology 2020(2020), 1–12.",
      "doi": ""
    },
    {
      "text": "Tina Chan and Adam Leung. 2020. Illuminate: A Simulation Game to Instill Grounded Hope in Youth for Climate Action. In Extended Abstracts of the 2020 Annual Symposium on Computer-Human Interaction in Play. Association for Computing Machinery, New York, NY, 47–49.",
      "doi": "10.1145/3383668.3419920"
    },
    {
      "text": "Alenda Y Chang. 2019. Playing nature: Ecology in video games. Vol. 58. U of Minnesota Press, Minneapolis, MN.",
      "doi": ""
    },
    {
      "text": "Susan Clayton. 2020. Climate anxiety: Psychological responses to climate change. Journal of Anxiety Disorders 74 (2020), 102263.",
      "doi": ""
    },
    {
      "text": "The Capture Club. 2020. Capture (Carbon footprint & CO2 tracker). Game [PC]. The Capture Club, Raffles Place, Singapore..",
      "doi": ""
    },
    {
      "text": "Emmanuelle Cohen-Shacham, Gretchen Walters, Christine Janzen, and Stewart Maginnis. 2016. Nature-based solutions to address global societal challenges. Vol. 97. IUCN, Gland, Switzerland.",
      "doi": ""
    },
    {
      "text": "David A Collings. 2014. Stolen future, broken present: the human significance of climate change. Open Humanities Press, London, England.",
      "doi": ""
    },
    {
      "text": "Anna N Cooke, Kelly S Fielding, and Winnifred R Louis. 2016. Environmentally active people: The role of autonomy, relatedness, competence and self-determined motivation. Environmental Education Research 22, 5 (2016), 631–657.",
      "doi": ""
    },
    {
      "text": "Rajendra KP Core Writing Team. 2014. Climate change 2014: Synthesis Report. Contribution of working groups I, II and III to the fifth assessment report of the intergovernmental panel on climate change 27 (2014), 408.",
      "doi": ""
    },
    {
      "text": "John W Creswell and J David Creswell. 2013. Research design: Qualitative, quantitative, and mixed methods approaches. SAGE Publications, London, England.",
      "doi": ""
    },
    {
      "text": "Philipp Überbacher Daniela Bruns and denovaire. 2019. Something Something Climate Change. Game [browser].",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness: defining” gamification”. In Proceedings of the 15th international academic MindTrek conference: Envisioning future media environments. Association for Computing Machinery, New York, NY, 9–15.",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Hans Dieleman and Don Huisingh. 2006. Games by which to learn and teach about sustainable development: exploring the relevance of games and experiential learning for sustainability. Journal of Cleaner Production 14, 9-11 (2006), 837–847.",
      "doi": ""
    },
    {
      "text": "ZU Digital. 2017. World Rescue. Game [Android]. ZU Digital, Budapest, Hungary..",
      "doi": ""
    },
    {
      "text": "Edward Downs, Nicholas D Bowman, and Jaime Banks. 2019. A polythetic model of player-avatar identification: Synthesizing multiple mechanisms.Psychology of Popular Media Culture 8, 3 (2019), 269.",
      "doi": ""
    },
    {
      "text": "Anthony Dudo, Vincent Cicchirillo, Lucy Atkinson, and Samantha Marx. 2014. Portrayals of technoscience in video games: A potential avenue for informal science learning. Science Communication 36, 2 (2014), 219–247.",
      "doi": ""
    },
    {
      "text": "EarthGames. 2019. Deal: A Green New Election. Game [Android, browser].",
      "doi": ""
    },
    {
      "text": "EDF. 2015. Cleanopolis VR. Game [iOS]. EDF, London, UK..",
      "doi": ""
    },
    {
      "text": "Klaus Eisenack. 2013. A climate change board game for interdisciplinary communication and education. Simulation & Gaming 44, 2-3 (2013), 328–348.",
      "doi": ""
    },
    {
      "text": "Ulrike Erb. 2015. Possibilities and limitations of transferring an educational simulation game to a digital platform. Simulation & Gaming 46, 6 (2015), 817–837.",
      "doi": "10.1177/1046878115621980"
    },
    {
      "text": "Eversim. 2019. Power & Revolution 2019 Edition. Game [PC]. Eversim, Lognes, France..",
      "doi": ""
    },
    {
      "text": "Garry Falloon. 2010. Using avatars and virtual environments in learning: What do they have to offer?British Journal of Educational Technology 41, 1 (2010), 108–122.",
      "doi": ""
    },
    {
      "text": "Timea Farkas, Sarah Wiseman, Paul Cairns, and Rebecca Fiebrink. 2020. A Grounded Analysis of Player-Described Board Game Immersion. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. Association for Computing Machinery, New York, NY, 427–437.",
      "doi": "10.1145/3410404.3414224"
    },
    {
      "text": "Daniel Fernández Galeote and Juho Hamari. 2021. Game-based Climate Change Engagement: Analyzing the Potential of Entertainment and Serious Games. Proceedings of the ACM on Human-Computer Interaction 5, CHI PLAY(2021), 1–21.",
      "doi": "10.1145/3474653"
    },
    {
      "text": "Daniel Fernández Galeote, Mikko Rajanen, Dorina Rajanen, Nikoletta Z. Legaki, David J. Langley, and Juho Hamari. 2021. Gamification for climate change engagement: review of corpus and future agenda. Environmental Research Letters 16, 6 (2021), 1–50. http://iopscience.iop.org/article/10.1088/1748-9326/abec05",
      "doi": ""
    },
    {
      "text": "Kristoffer S Fjællingsdal and Christian A Klöckner. 2019. Gaming Green: The Educational Potential of Eco–A Digital Simulated Ecosystem. Frontiers in psychology 10 (2019), 2846.",
      "doi": ""
    },
    {
      "text": "Stephen Flood, Nicholas A Cradock-Henry, Paula Blackett, and Peter Edwards. 2018. Adaptive and interactive climate futures: systematic review of ‘serious games’ for engagement and decision-making. Environmental Research Letters 13, 6 (2018), 063005.",
      "doi": ""
    },
    {
      "text": "Centre for System Solutions. 2018. New Shores. Game [browser]. Centre for System Solutions, Wrocław, Poland..",
      "doi": ""
    },
    {
      "text": "Elfriede Fursich. 2009. In defense of textual analysis. Journalism studies 10, 2 (2009), 238–252.",
      "doi": ""
    },
    {
      "text": "Alastor Games. 2019. Mad Parallax: Jumpy Road. Game [browser]. Alastor Games, France..",
      "doi": ""
    },
    {
      "text": "Africa Cross Games. 2019. Global Warming Strategy Game. Game [browser]. Africa Cross Games, New Jersey..",
      "doi": ""
    },
    {
      "text": "Africa Cross Games. 2019. The Carbon Neutral Republic of Novaya Zemlya (Inc.). Game [browser]. Africa Cross Games, New Jersey..",
      "doi": ""
    },
    {
      "text": "Deep State Games. 2019. The Climate Trail. Game [PC, Android, iOS].",
      "doi": ""
    },
    {
      "text": "Firaxis Games. 1999. Sid Meier’s Alpha Centauri. Game [PC]. Electronic Arts, Redwood City, California..",
      "doi": ""
    },
    {
      "text": "Firaxis Games. 2001. Sid Meier’s Civilization III. Game [PC]. Infogrames, Paris, France..",
      "doi": ""
    },
    {
      "text": "Firaxis Games. 2019. Sid Meier’s Civilization VI: Gathering Storm. Game [PC]. 2K Games, Novato, California..",
      "doi": ""
    },
    {
      "text": "Positech Games. 2013. Democracy 3. Game [PC]. Positech Games, UK..",
      "doi": ""
    },
    {
      "text": "Pixel Quality Games. 2018. Project AURA. Game [PC].",
      "doi": ""
    },
    {
      "text": "Strange Loop Games. 2018. Eco. Game [PC]. Strange Loop Games, Seattle, Washington..",
      "doi": ""
    },
    {
      "text": "James Paul Gee. 2008. Learning and Games. In The ecology of games: Connecting youth, games, and learning, Katie Salen Tekinbaş (Ed.). MIT Press, Cambridge, MA, 21–40. https://mitpress.mit.edu/books/ecology-games",
      "doi": ""
    },
    {
      "text": "James Paul Gee. 2014. Unified discourse analysis: Language, reality, virtual worlds and video games. Routledge, Abingdon, England.",
      "doi": ""
    },
    {
      "text": "Alex Gekker. 2021. Against game studies. Media and Communication 9, 1 (2021), 73–83.",
      "doi": ""
    },
    {
      "text": "Andreas Gerber, Markus Ulrich, Flurin X Wäger, Marta Roca-Puigròs, João SV Gonçalves, and Patrick Wäger. 2021. Games on Climate Change: Identifying Development Potentials through Advanced Classification and Game Characteristics Mapping. Sustainability 13, 4 (2021), 1997.",
      "doi": ""
    },
    {
      "text": "Robert Gifford. 2011. The dragons of inaction: psychological barriers that limit climate change mitigation and adaptation.American psychologist 66, 4 (2011), 290.",
      "doi": ""
    },
    {
      "text": "Michael Goerger. 2017. Value, violence, and the ethics of gaming. Ethics and Information Technology 19, 2 (2017), 95–105.",
      "doi": "10.1007/s10676-017-9417-5"
    },
    {
      "text": "Tobias Greitemeyer and Silvia Osswald. 2010. Effects of prosocial video games on prosocial behavior.Journal of personality and social psychology 98, 2(2010), 211.",
      "doi": ""
    },
    {
      "text": "Georgina Guillen M, Juho Hamari, and Jaco Quist. 2021. Gamification of Sustainable Consumption: a systematic literature review. In Proceedings of the 54th Hawaii International Conference on System Sciences. HICSS, Hawaii, 1345.",
      "doi": ""
    },
    {
      "text": "Juho Hamari. 2019. Gamification. In The Blackwell Encyclopedia of Sociology. John Wiley & Sons, Hoboken, NJ, 1–3.",
      "doi": ""
    },
    {
      "text": "Juho Hamari, David J Shernoff, Elizabeth Rowe, Brianno Coller, Jodi Asbell-Clarke, and Teon Edwards. 2016. Challenging games help students learn: An empirical study on engagement, flow and immersion in game-based learning. Computers in human behavior 54 (2016), 170–179.",
      "doi": ""
    },
    {
      "text": "Sherry Hamby. 2017. On defining violence, and why it matters [Editorial]. Psychology of Violence 7, 2 (2017), 167–180. https://doi.org/10.1037/vio0000117",
      "doi": ""
    },
    {
      "text": "Garrett Hardin. 1968. The tragedy of the commons. Science 162, 3859 (1968), 1243–1248.",
      "doi": ""
    },
    {
      "text": "Earth Hero. 2020. Earth Hero: Climate Change. Game [Android, iOS].",
      "doi": ""
    },
    {
      "text": "Lorenz Hilty, Wolfgang Lohmann, and Elaine M Huang. 2011. Sustainability and ICT-an overview of the field. Notizie di POLITEIA 27, 104 (2011), 13–28.",
      "doi": ""
    },
    {
      "text": "Nina Huntemann and Ben Aslinger. 2013. Gaming globally: Production, play, and place. Springer, New York, NY.",
      "doi": ""
    },
    {
      "text": "Frank P Incropera. 2016. Climate change: a wicked problem: complexity and uncertainty at the intersection of science, economics, politics, and human behavior. Cambridge University Press, Cambridge, England.",
      "doi": ""
    },
    {
      "text": "Charlene Jennett, Ioanna Iacovides, Anna L Cox, Anastasia Vikhanova, Emily Weigold, Layla Mostaghimi, Geraint Jones, James Jenkins, Sarah Gallacher, and Yvonne Rogers. 2016. Squeezy Green Balls: Promoting Environmental Awareness through Playful Interactions. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play. Association for Computing Machinery, New York, NY, 389–400.",
      "doi": "10.1145/2967934.2968102"
    },
    {
      "text": "Jesper Juul and Rune Klevjer. 2016. Avatar. In The International Encyclopedia of Communication Theory and Philosophy. John Wiley & Sons, Hoboken, NJ, 1–5.",
      "doi": ""
    },
    {
      "text": "Leonie Kallabis. 2020. Overcome Your Weaker Self. Game [browser]. Leonie Kallabis, Cologne, Germany..",
      "doi": ""
    },
    {
      "text": "Dominic Kao and D Fox Harrell. 2015. Exploring the impact of role model avatars on game experience in educational games. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play. Association for Computing Machinery, New York, NY, 571–576.",
      "doi": "10.1145/2793107.2810291"
    },
    {
      "text": "Avi Kaplan and Joanna K Garner. 2017. A complex dynamic systems perspective on identity and its development: The dynamic systems model of role identity.Developmental psychology 53, 11 (2017), 2036.",
      "doi": ""
    },
    {
      "text": "Korina Katsaliaki and Navonil Mustafee. 2015. Edutainment for sustainable development: A survey of games in the field. Simulation & Gaming 46, 6 (2015), 647–672.",
      "doi": "10.1177/1046878114552166"
    },
    {
      "text": "Keunyeong Kim, Michael G Schmierbach, Mun-Young Chung, Julia Daisy Fraustino, Frank Dardis, Lee Ahern, 2015. Is it a sense of autonomy, control, or attachment? Exploring the effects of in-game customization on game enjoyment. Computers in Human Behavior 48 (2015), 695–705.",
      "doi": "10.1016/j.chb.2015.02.011"
    },
    {
      "text": "Elaine L Kinsella, Timothy D Ritchie, and Eric R Igou. 2015. Lay perspectives on the social and psychological functions of heroes. Frontiers in psychology 6 (2015), 130.",
      "doi": ""
    },
    {
      "text": "Philipp ‘Phil’ Klaus and Stan Maklan. 2013. Towards a better measure of customer experience. International Journal of Market Research 55, 2 (2013), 227–246.",
      "doi": ""
    },
    {
      "text": "Christoph Klimmt, Dorothée Hefner, and Peter Vorderer. 2009. The video game experience as “true” identification: A theory of enjoyable alterations of players’ self-perception. Communication theory 19, 4 (2009), 351–373.",
      "doi": ""
    },
    {
      "text": "Christoph Klimmt, Dorothée Hefner, Peter Vorderer, Christian Roth, and Christopher Blake. 2010. Identification with video game characters as automatic shift of self-perceptions. Media Psychology 13, 4 (2010), 323–338.",
      "doi": ""
    },
    {
      "text": "Udo Kuckartz. 2013. Qualitative text analysis: A guide to methods, practice and using software. SAGE Publications, London, England.",
      "doi": ""
    },
    {
      "text": "Udo Kuckartz. 2014. Three basic methods of qualitative text analysis. In Qualitative text analysis: A guide to methods, practice and using software. SAGE Publications, London, England, 65–120.",
      "doi": ""
    },
    {
      "text": "Petri Lankoski and Staffan Björk. 2015. Formal analysis of gameplay. In Game Research Methods. ETC Press, Pittsburgh, PA, 23–35.",
      "doi": ""
    },
    {
      "text": "Lanthanum. 2020. Oil Eco Factory Tycoon. Game [PC]. Lanthanum, Corrèze, France..",
      "doi": ""
    },
    {
      "text": "Georgia Liarakou, Eleni Sakka, Costas Gavrilakis, and Costas Tsolakidis. 2012. Evaluation of serious games, as a tool for education for sustainable development. European Journal of Open, Distance and E-learning 15, 2(2012), 96–110.",
      "doi": ""
    },
    {
      "text": "Christine Lisetti, Reza Amini, Ugan Yasavur, and Naphtali Rishe. 2013. I can help you change! an empathic virtual agent delivers behavior change health interventions. ACM Transactions on Management Information Systems (TMIS) 4, 4(2013), 1–28.",
      "doi": "10.1145/2544103"
    },
    {
      "text": "Michael Loadenthal. 2017. “Eco-Terrorism”: An Incident-Driven History of Attack (1973–2010). Journal for the Study of Radicalism 11, 2 (2017), 1–34.",
      "doi": ""
    },
    {
      "text": "Irene Lorenzoni, Sophie Nicholson-Cole, and Lorraine Whitmarsh. 2007. Barriers perceived to engaging with climate change among the UK public and their policy implications. Global environmental change 17, 3-4 (2007), 445–459.",
      "doi": ""
    },
    {
      "text": "Valérie Masson-Delmotte, Panmao Zhai, Hans-Otto Pörtner, Debra Roberts, Jim Skea, Priyadarshi R Shukla, Anna Pirani, W Moufouma-Okia, C Péan, R Pidcock, 2018. Global warming of 1.5 C. An IPCC Special Report on the impacts of global warming of 1 (2018), 1–9.",
      "doi": ""
    },
    {
      "text": "Jasper N Meya and Klaus Eisenack. 2018. Effectiveness of gaming for communicating and teaching climate change. Climatic change 149, 3 (2018), 319–333.",
      "doi": ""
    },
    {
      "text": "Evan Mills, Norman Bourassa, Leo Rainer, Jimmy Mai, Arman Shehabi, and Nathaniel Mills. 2019. Toward greener gaming: Estimating national energy use and energy efficiency potential. The Computer Games Journal 8, 3 (2019), 157–178.",
      "doi": ""
    },
    {
      "text": "Joel Millward-Hopkins, Julia K Steinberger, Narasimha D Rao, and Yannick Oswald. 2020. Providing decent living with minimum energy: A global scenario. Global Environmental Change 65 (2020), 102168.",
      "doi": ""
    },
    {
      "text": "Martha C Monroe, Richard R Plate, Annie Oxarart, Alison Bowers, and Willandia A Chaves. 2019. Identifying effective climate change education strategies: a systematic review of the research. Environmental Education Research 25, 6 (2019), 791–812.",
      "doi": ""
    },
    {
      "text": "Vicki Moulder, Lorna R Boschman, Ron Wakkary, Carman Neustaedter, and Hiroki Hill Kobayashi. 2018. HCI interventions for science communication. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, 1–9.",
      "doi": "10.1145/3170427.3174357"
    },
    {
      "text": "Tina-Simone Neset, Sirkku Juhola, Lotten Wiréhn, Janina Käyhkö, Carlo Navarra, Therese Asplund, Erik Glaas, Victoria Wibeck, and Björn-Ola Linnér. 2020. Supporting dialogue and analysis on trade-offs in climate adaptation research with the Maladaptation Game. Simulation & Gaming 51, 3 (2020), 378–399.",
      "doi": "10.1177/1046878120904393"
    },
    {
      "text": "Isabel Newsome. 2020. An Educational Game Bringing Awareness to Declining Insect Populations. In Extended Abstracts of the 2020 Annual Symposium on Computer-Human Interaction in Play. Association for Computing Machinery, New York, NY, 326–329.",
      "doi": "10.1145/3383668.3419912"
    },
    {
      "text": "NIWA Taihoro Nukurangi and Manaaki Whenua Landcare Research. 2019. Adaptive Futures. Game [browser]. NIWA Taihoro Nukurangi and Manaaki Whenua Landcare Research, Auckland and Lincoln, New Zealand..",
      "doi": ""
    },
    {
      "text": "Kari Marie Norgaard. 2011. Living in denial: Climate change, emotions, and everyday life. mit Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Maria Ojala. 2012. How do children cope with global climate change? Coping strategies, engagement, and well-being. Journal of Environmental Psychology 32, 3 (2012), 225–233.",
      "doi": ""
    },
    {
      "text": "Maria Ojala. 2015. Hope in the face of climate change: Associations with environmental engagement and student perceptions of teachers’ emotion communication style and future orientation. The Journal of Environmental Education 46, 3 (2015), 133–148.",
      "doi": ""
    },
    {
      "text": "Tania Ouariachi, José Gutiérrez-Pérez, and María-Dolores Olvera-Lobo. 2018. Can serious games help to mitigate climate change? Exploring their influence on Spanish and American teenagers’ attitudes/?‘ Pueden los serious games ayudar a mitigar el cambio climático? Una exploración de su influencia sobre las actitudes de los adolescentes españoles y estadounidenses. Psyecology 9, 3 (2018), 365–395.",
      "doi": ""
    },
    {
      "text": "Tania Ouariachi, María Dolores Olvera-Lobo, and José Gutiérrez-Pérez. 2017. Analyzing climate change communication through online games: Development and application of validated criteria. Science Communication 39, 1 (2017), 10–44.",
      "doi": ""
    },
    {
      "text": "Tania Ouariachi, María Dolores Olvera-Lobo, José Gutiérrez-Pérez, and Edward Maibach. 2019. A framework for climate change engagement through video games. Environmental Education Research 25, 5 (2019), 701–716.",
      "doi": ""
    },
    {
      "text": "Leslie Paas. 2016. Action for Climate Empowerment: Guidelines for accelerating solutions through education, training and public awareness. UNESCO Publishing, Paris, France.",
      "doi": ""
    },
    {
      "text": "Hunter Parcells. 2018. World Saver. Game [browser].",
      "doi": ""
    },
    {
      "text": "Paris Reinforce. 2021. I2AMPARIS - Dynamic Documentation. http://paris-reinforce.epu.ntua.gr/dynamic_doc/ [Online; accessed 15-February-2021].",
      "doi": ""
    },
    {
      "text": "Luc G Pelletier, Stephanie Dion, Kim Tuson, and Isabelle Green-Demers. 1999. Why do people fail to adopt environmental protective behaviors? Toward a taxonomy of environmental amotivation 1. Journal of applied social psychology 29, 12 (1999), 2481–2504.",
      "doi": ""
    },
    {
      "text": "Jorge Peña and Meng Chen. 2017. With great power comes great responsibility: Superhero primes and expansive poses influence prosocial behavior after a motion-controlled game task. Computers in Human Behavior 76 (2017), 378–385.",
      "doi": "10.1016/j.chb.2017.07.039"
    },
    {
      "text": "Wei Peng, Jih-Hsuan Lin, Karin A Pfeiffer, and Brian Winn. 2012. Need satisfaction supportive game features as motivational determinants: An experimental study of a self-determination theory guided exergame. Media Psychology 15, 2 (2012), 175–196.",
      "doi": ""
    },
    {
      "text": "Devin N Perkins, Marie-Noel Brune Drisse, Tapiwa Nxele, and Peter D Sly. 2014. E-waste: a global hazard. Annals of global health 80, 4 (2014), 286–295.",
      "doi": ""
    },
    {
      "text": "Jan L Plass, Bruce D Homer, and Charles K Kinzer. 2015. Foundations of game-based learning. Educational Psychologist 50, 4 (2015), 258–283.",
      "doi": ""
    },
    {
      "text": "PlayMob. 2019. Mission 1.5. Game [browser]. United Nations Development Programme, New York, New York..",
      "doi": ""
    },
    {
      "text": "Poolo and Sarry. 2019. Climate, Please!Game [PC].",
      "doi": ""
    },
    {
      "text": "Nick Porillo. 2018. Minecraft GlobalWarming. Game [PC]. Nick Porillo, Rochester, New York..",
      "doi": ""
    },
    {
      "text": "Rabindra Ratan, David Beyea, Benjamin J Li, and Luis Graciano. 2020. Avatar characteristics induce users’ behavioral conformity with small-to-medium effect sizes: A meta-analysis of the proteus effect. Media Psychology 23, 5 (2020), 651–675.",
      "doi": ""
    },
    {
      "text": "Rabindra Ratan, RV Rikard, Celina Wanek, Madison McKinley, Lee Johnson, and Young June Sah. 2016. Introducing Avatarification: An experimental examination of how avatars influence student motivation. In 49th Hawaii International Conference on System Sciences (HICSS). IEEE Computer Society, Washington, D.C., US, 51–59.",
      "doi": "10.1109/HICSS.2016.15"
    },
    {
      "text": "Diana Reckien and Klaus Eisenack. 2013. Climate change gaming on board and screen: A review. Simulation & Gaming 44, 2-3 (2013), 253–271.",
      "doi": ""
    },
    {
      "text": "Red Redemption. 2006. Climate Challenge. Game [browser]. Red Redemption, Oxford, UK..",
      "doi": ""
    },
    {
      "text": "Red Redemption. 2011. Fate of the World: Tipping Point. Game [PC]. Red Redemption, Oxford, UK..",
      "doi": ""
    },
    {
      "text": "Related Designs and Bluebyte. 2011. Anno 2070. Game [PC]. Ubisoft, Paris, France..",
      "doi": ""
    },
    {
      "text": "Robin S Rosenberg, Shawnee L Baughman, and Jeremy N Bailenson. 2013. Virtual superheroes: Using superpowers in virtual reality to encourage prosocial behavior. PloS one 8, 1 (2013), e55003.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan, C Scott Rigby, and Andrew Przybylski. 2006. The motivational pull of video games: A self-determination theory approach. Motivation and emotion 30, 4 (2006), 344–360.",
      "doi": ""
    },
    {
      "text": "Anandita Sabherwal, Matthew T Ballew, Sander van Der Linden, Abel Gustafson, Matthew H Goldberg, Edward W Maibach, John E Kotcher, Janet K Swim, Seth A Rosenthal, and Anthony Leiserowitz. 2021. The Greta Thunberg Effect: Familiarity with Greta Thunberg predicts intentions to engage in climate activism in the United States. Journal of Applied Social Psychology 51, 4 (2021), 321–333.",
      "doi": ""
    },
    {
      "text": "Owen Schaffer and Xiaowen Fang. 2020. The Impact of Fulfilling a Desire for Idealism on Task Engagement and Enjoyment in Digital Games. In International Conference on Human-Computer Interaction. Springer, New York, NY, 162–178.",
      "doi": "10.1007/978-3-030-50164-8_11"
    },
    {
      "text": "David W Shaffer. 2006. Epistemic frames for epistemic games. Computers & education 46, 3 (2006), 223–234.",
      "doi": "10.5555/1139227.1651376"
    },
    {
      "text": "John Sharp. 2014. Perspective. In The Routledge Companion to Video Game Studies, M.J.P. Wolf and B. Perron (Eds.). Routledge, Abingdon, England, 107–116.",
      "doi": ""
    },
    {
      "text": "Stephen RJ Sheppard. 2012. Visualizing climate change: a guide to visual communication of climate change and developing local solutions. Routledge, Abingdon, England.",
      "doi": ""
    },
    {
      "text": "Miguel Sicart. 2013. Beyond choices: The design of ethical gameplay. MIT Press, Cambridge, MA.",
      "doi": "10.5555/2500952"
    },
    {
      "text": "Marios Stanitsas, Konstantinos Kirytopoulos, and Elise Vareilles. 2019. Facilitating sustainability transition through serious games: A systematic literature review. Journal of cleaner production 208 (2019), 924–936.",
      "doi": ""
    },
    {
      "text": "Paul C Stern. 2000. New environmental theories: toward a coherent theory of environmentally significant behavior. Journal of social issues 56, 3 (2000), 407–424.",
      "doi": ""
    },
    {
      "text": "TapTapTales. 2018. Animal Club: Play to save the Polar Bear. Game [Android]. TapTapTales, Barcelona, Spain.",
      "doi": ""
    },
    {
      "text": "The Global Calculator. 2020. The Global Calculator. http://tool.globalcalculator.org/ [Online; accessed 15-February-2021].",
      "doi": ""
    },
    {
      "text": "Debbe Thompson. 2012. Designing serious video games for health behavior change: current status and future directions. Journal of diabetes science and technology 6, 4 (2012), 807–811.",
      "doi": ""
    },
    {
      "text": "Sabine Trepte and Leonard Reinecke. 2010. Avatar creation and video game enjoyment. Journal of Media Psychology 22 (2010), 171–184.",
      "doi": ""
    },
    {
      "text": "Giovanni Maria Troiano, Dylan Schouten, Michael Cassidy, Eli Tucker-Raymond, Gillian Puttick, and Casper Harteveld. 2020. Ice Paddles, CO2 Invaders, and Exploding Planets: How Young Students Transform Climate Science Into Serious Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. Association for Computing Machinery, New York, NY, 534–548.",
      "doi": "10.1145/3410404.3414256"
    },
    {
      "text": "April Tyack and Peta Wyeth. 2017. Exploring relatedness in single-player video game play. In Proceedings of the 29th Australian Conference on Computer-Human Interaction. Association for Computing Machinery, New York, NY, 422–427.",
      "doi": "10.1145/3152771.3156149"
    },
    {
      "text": "United Nations Environment Programme (UNEP). 2021. Making Peace with Nature: A scientific blueprint to tackle the climate, biodiversity and pollution emergencies. UNEP. https://www.unep.org/resources/making-peace-nature",
      "doi": ""
    },
    {
      "text": "United Nations Development Programme, GRID-Arendal. 2019. Video Games Industry Levels Up in Fight Against Climate Change. https://www.unep.org/news-and-stories/press-release/video-games-industry-levels-fight-against-climate-change [Online; accessed 15-February-2021].",
      "doi": ""
    },
    {
      "text": "Robert J Vallerand. 1997. Toward a hierarchical model of intrinsic and extrinsic motivation. Advances in experimental social psychology 29 (1997), 271–360.",
      "doi": ""
    },
    {
      "text": "Austin van Loon, Jeremy Bailenson, Jamil Zaki, Joshua Bostick, and Robb Willer. 2018. Virtual reality perspective-taking increases cognitive empathy for specific others. PloS one 13, 8 (2018), e0202442.",
      "doi": ""
    },
    {
      "text": "Daniel Vella. 2016. ” Who Am’I’in the Game?”: A Typology of the Modes of Ludic Subjectivity.. In Proceedings of 1st International Joint Conference of DiGRA and FDG. DiGRA and FDG, Finland, 1–16.",
      "doi": ""
    },
    {
      "text": "Daniel Vella and Magdalena Cielecka. 2021. “You Won’t Even Know Who You Are Anymore”: Bakthinian Polyphony and the Challenge to the Ludic Subject in Disco Elysium. Baltic Screen Media Review 9, 1 (2021), 90–104.",
      "doi": ""
    },
    {
      "text": "T Franklin Waddell, S Shyam Sundar, and Joshua Auriemma. 2015. Can customizing an avatar motivate exercise intentions and health behaviors among those with low health ideals?Cyberpsychology, Behavior, and Social Networking 18, 11(2015), 687–690.",
      "doi": ""
    },
    {
      "text": "David I Waddington and Thomas Fennewald. 2018. Grim FATE: Learning about systems thinking in an in-depth climate change simulation. Simulation & gaming 49, 2 (2018), 168–194.",
      "doi": ""
    },
    {
      "text": "Alexander Walmsley. 2019. Zero Carbon, Zero Tolerance. Game [PC]. Alexander Walmsley, Berlin, Germany..",
      "doi": ""
    },
    {
      "text": "Peter Weinreich and Wendy Saunderson. 2005. Analysing identity: Cross-cultural, societal and clinical contexts. Routledge, Abingdon, England.",
      "doi": ""
    },
    {
      "text": "Lorraine Whitmarsh, Irene Lorenzoni, and Saffron O’Neill. 2012. Engaging the public with climate change: Behaviour change and communication. Routledge, Abingdon, England.",
      "doi": ""
    },
    {
      "text": "Victoria Wibeck. 2014. Enhancing learning, communication and public engagement about climate change–some lessons from recent literature. Environmental Education Research 20, 3 (2014), 387–411.",
      "doi": ""
    },
    {
      "text": "Pieter Wouters, Christof Van Nimwegen, Herre Van Oostendorp, and Erik D Van Der Spek. 2013. A meta-analysis of the cognitive and motivational effects of serious games.Journal of educational psychology 105, 2 (2013), 249.",
      "doi": ""
    },
    {
      "text": "Nannan Xi and Juho Hamari. 2019. Does gamification satisfy needs? A study on the relationship between gamification features and intrinsic need satisfaction. International Journal of Information Management 46 (2019), 210–221.",
      "doi": "10.1016/j.ijinfomgt.2018.12.002"
    },
    {
      "text": "Nick Yee and Jeremy Bailenson. 2007. The Proteus effect: The effect of transformed self-representation on behavior. Human communication research 33, 3 (2007), 271–290.",
      "doi": ""
    },
    {
      "text": "Nick Yee, Jeremy N Bailenson, and Nicolas Ducheneaut. 2009. The Proteus effect: Implications of transformed digital self-representation on online and offline behavior. Communication Research 36, 2 (2009), 285–312.",
      "doi": ""
    },
    {
      "text": "José P Zagal, Michael S Debus, and Rogelio E Cardona-Rivera. 2019. On the ultimate goals of games: Winning, finishing, and prolonging. In Proceedings of the 13th International Philosophy of Computer Games Conference, Vol. 11. Game Philosophy Network and Centre for Media Philosophy and Laboratory for Computer Games Research, St. Petersburg, Russia, 1–11.",
      "doi": ""
    },
    {
      "text": "Dan Zahavi. 2008. Subjectivity and selfhood: Investigating the first-person perspective. MIT Press, Cambridge, MA.",
      "doi": ""
    }
  ]
}