{
  "doi": "10.1145/3491102.3502126",
  "title": "“Hartal (Strike) Happens Here Everyday”: Understanding Impact of Disruption on Education in Kashmir",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "Sustainable Development Goal 4 promotes inclusive and equitable quality education and lifelong learning opportunities for all. However, regions with ongoing socio-political conflict suffer disruption to education and learning. We situate our work in Kashmir, India, affected by socio-political conflict for more than three decades. We did multiple field visits and conducted 21 semi-structured interviews with parents, teachers, students, and members of a non-government organization that runs Community Learning Centers in Kashmir. Our findings present the barriers in education caused by disruption and the role of community learning centers in overcoming the barriers within these contextual constraints. Further, we discuss engaging researchers and policymakers to leverage human infrastructure, embedding uncertainty into the design, infrastructuring trust, and content usability to develop solutions to make education more accessible. Despite significant research in HCI and Education, research in this particular context is under-explored, and our work contributes to filling this gap.",
  "tags": [
    "India.",
    "Education",
    "Trust and Uncertainty",
    "Disruption",
    "Culture",
    "Conflict",
    "Technology",
    "Kashmir",
    "Internet shutdown"
  ],
  "authors": [
    {
      "name": "Asra Sakeen Wani",
      "institution": "IIIT-Delhi, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659480831",
      "orcid": "missing"
    },
    {
      "name": "Divyanshu Kumar Singh",
      "institution": "IIIT-Delhi, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235441",
      "orcid": "missing"
    },
    {
      "name": "Pushpendra Singh",
      "institution": "IIIT-Delhi, India",
      "img": "/do/10.1145/contrib-81309502140/rel-imgonly/psingh.jpg",
      "acmid": "81309502140",
      "orcid": "0000-0003-2152-1027"
    }
  ],
  "references": [
    {
      "text": "Saleema Amershi, Meredith Ringel Morris, Neema Moraveji, Ravin Balakrishnan, and Kentaro Toyama. 2010. Multiple Mouse Text Entry for Single-Display Groupware. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (Savannah, Georgia, USA) (CSCW ’10). Association for Computing Machinery, New York, NY, USA, 169–178. https://doi.org/10.1145/1718918.1718950",
      "doi": "10.1145/1718918.1718950"
    },
    {
      "text": "Richard Anderson, Chad Robertson, Esha Nabi, Urvashi Sahni, and Tanuja Setia. 2012. Facilitated Video Instruction in Low Resource Schools. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development(Atlanta, Georgia, USA) (ICTD ’12). Association for Computing Machinery, New York, NY, USA, 2–12. https://doi.org/10.1145/2160673.2160675",
      "doi": "10.1145/2160673.2160675"
    },
    {
      "text": "American Library Association. 2009. Empowering learners guidelines for school library programs.",
      "doi": ""
    },
    {
      "text": "Priyanka Bakaya and Sumeet Bhatti. 2005. Kashmir Conflict: A Study of What Led to the Insurgency in Kashmir Valley & Proposes Future Solutions. Swords and Ploughshares 16 (2005), 1–4.",
      "doi": ""
    },
    {
      "text": "Olina Banerji, Arundhati Ramanathan, and Rohin Dharmakumar. 2019. The making of a loan crisis at Byju’s. (Accessed on 05/09/21). https://the-ken.com/story/the-loan-crisis-at-byjus/",
      "doi": ""
    },
    {
      "text": "World Bank. 2021. How countries are using edtech (including online learning, radio, television, texting) to support access to remote learning during the COVID-19 pandemic. World Bank. (Accessed on 05/09/2021). https://www.worldbank.org/en/topic/edutech/brief/how-countries-are-using-edtech-to-support-remote-learning-during-the-covid-19-pandemic",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1301–1310. https://doi.org/10.1145/1753326.1753521",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "BBC. 2019. Pulwama attack: INDIA mourns Kashmir dead. (Accessed on 05/09/2021). https://www.bbc.com/news/world-asia-india-47266001",
      "doi": ""
    },
    {
      "text": "Tony Belpaeme, James Kennedy, Aditi Ramachandran, Brian Scassellati, and Fumihide Tanaka. 2018. Social robots for education: A review. Science Robotics 3, 21 (2018), eaat5954. https://doi.org/10.1126/scirobotics.aat5954",
      "doi": ""
    },
    {
      "text": "Bisma Bhat. 2019. Academic calendar: 150 days of Classwork lost. (Accessed on 05/09/21). https://www.thekashmirmonitor.net/academic-calendar-150-days-of-classwork-lost/",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "A. J. Bernheim Brush and Kori M. Inkpen. 2007. Yours, Mine and Ours? Sharing and Use of Technology in Domestic Environments. In UbiComp 2007: Ubiquitous Computing, John Krumm, Gregory D. Abowd, Aruna Seneviratne, and Thomas Strang (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 109–126.",
      "doi": ""
    },
    {
      "text": "Byju. 2020. Explore all education boards in India only at Byju’s. (Accessed on 05/09/2021). https://byjus.com/education-boards-in-india/",
      "doi": ""
    },
    {
      "text": "Alexander Cho, Roxana G. Herrera, Luis Chaidez, and Adilene Uriostegui. 2019. The ”Comadre” Project: An Asset-Based Design Approach to Connecting Low-Income Latinx Families to Out-of-School Learning Opportunities. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300837",
      "doi": ""
    },
    {
      "text": "Louis Cohen, Lawrence Manion, and Keith Morrison. 2002. Research methods in education. routledge, UK.",
      "doi": ""
    },
    {
      "text": "Lizzie Coles-Kemp, Rikke Bjerg Jensen, and Reem Talhouk. 2018. In a New Land: Mobile Phones, Amplified Pressures and Reduced Capabilities. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174158",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Andrés Monroy-Hernández, and Gloria Mark. 2014. ”Narco” Emotions: Affect and Desensitization in Social Media during the Mexican Drug War. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 3563–3572. https://doi.org/10.1145/2556288.2557197",
      "doi": "10.1145/2556288.2557197"
    },
    {
      "text": "Sebastian Denef, Petra S. Bayerl, and Nico A. Kaptein. 2013. Social Media and the Police: Tweeting Practices of British Police Forces during the August 2011 Riots. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 3471–3480. https://doi.org/10.1145/2470654.2466477",
      "doi": "10.1145/2470654.2466477"
    },
    {
      "text": "Betsy DiSalvo, Jason Yip, Elizabeth Bonsignore, and DiSalvo Carl. 2017. Participatory design for learning. Routledge, UK.",
      "doi": ""
    },
    {
      "text": "Sophie Domingues-Montanari. 2017. Clinical and psychological effects of excessive screen time on children. Journal of paediatrics and child health 53, 4 (2017), 333–338.",
      "doi": ""
    },
    {
      "text": "Michaelanne Dye, David Nemer, Josiah Mangiameli, Amy Bruckman, and Neha Kumar. 2018. The Human Infrastructure of El Paquete, Cuba’s Offline Internet. Interactions 26, 1 (dec 2018), 58–62. https://doi.org/10.1145/3289487",
      "doi": ""
    },
    {
      "text": "Michaelanne Dye, David Nemer, Josiah Mangiameli, Amy S. Bruckman, and Neha Kumar. 2018. El Paquete Semanal: The Week’s Internet in Havana. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174213",
      "doi": "10.1145/3173574.3174213"
    },
    {
      "text": "Daily Excelsior. 2021. Youth shot dead, militant killed in Kashmir. (Accessed on 05/09/21). https://www.dailyexcelsior.com/youth-shot-dead-militant-killed-in-kashmir/",
      "doi": ""
    },
    {
      "text": "Brittany Fiore-Silfvast, Carl Hartung, Kirti Iyengar, Sharad Iyengar, Kiersten Israel-Ballard, Noah Perin, and Richard Anderson. 2013. Mobile Video for Patient Education: The Midwives’ Perspective. In Proceedings of the 3rd ACM Symposium on Computing for Development (Bangalore, India) (ACM DEV ’13). Association for Computing Machinery, New York, NY, USA, Article 2, 10 pages. https://doi.org/10.1145/2442882.2442885",
      "doi": "10.1145/2442882.2442885"
    },
    {
      "text": "Elizabeth Foss, Mona Leigh Guha, Panagis Papadatos, Tamara Clegg, Jason Yip, and Greg Walsh. 2013. Cooperative Inquiry Extended: Creating Technology with Middle School Students with Learning Differences. Journal of Special Education Technology 28, 3 (2013), 33–46. https://doi.org/10.1177/016264341302800303 arXiv:https://doi.org/10.1177/016264341302800303",
      "doi": ""
    },
    {
      "text": "UN Foundation. 2019. Sustainable development goals. (Accessed on 05/09/21). https://unfoundation.org/what-we-do/issues/sustainable-development-goals/?gclid=Cj0KCQjw-NaJBhDsARIsAAja6dNdgx-ffnWd23V21oNvCqLoG0HwjNjKZDSgznwHJ4CpwodknSByDKAaAqLTEALw_wcB",
      "doi": ""
    },
    {
      "text": "Paulo Freire. 2018. Pedagogy of the oppressed. Bloomsbury publishing USA, USA.",
      "doi": ""
    },
    {
      "text": "Sabrina Gabel, Lilian Reichert, and Christian Reuter. 0. Discussing conflict in social media: The use of Twitter in the Jammu and Kashmir conflict. Media, War & Conflict 0, 0 (0), 1750635220970997. https://doi.org/10.1177/1750635220970997 arXiv:https://doi.org/10.1177/1750635220970997",
      "doi": ""
    },
    {
      "text": "R Govinda and Madhumita Bandyopadhyay. 2008. Access to Elementary Education in India. Country Analytical Review.ERIC, India.",
      "doi": ""
    },
    {
      "text": "Miriam Greis, Jessica Hullman, Michael Correll, Matthew Kay, and Orit Shaer. 2017. Designing for Uncertainty in HCI: When Does Uncertainty Help?. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(Denver, Colorado, USA) (CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 593–600. https://doi.org/10.1145/3027063.3027091",
      "doi": "10.1145/3027063.3027091"
    },
    {
      "text": "Miriam Greis, Aditi Joshi, Ken Singer, Albrecht Schmidt, and Tonja Machulla. 2018. Uncertainty Visualization Influences How Humans Aggregate Discrepant Information. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174079",
      "doi": ""
    },
    {
      "text": "Xinning Gui, Yubo Kou, Kathleen H. Pine, and Yunan Chen. 2017. Managing Uncertainty: Using Social Media for Risk Assessment during a Public Health Crisis. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4520–4533. https://doi.org/10.1145/3025453.3025891",
      "doi": "10.1145/3025453.3025891"
    },
    {
      "text": "Tambri Housen, Shabnum Ara, Akmal Shah, Showkat Shah, Annick Lenglet, and Giovanni Pintaldi. 2019. Dua Ti Dawa Ti: understanding psychological distress in the ten districts of the Kashmir Valley and community mental health service needs. Conflict and health 13, 1 (2019), 1–11.",
      "doi": ""
    },
    {
      "text": "David Hume. 2006. A Treatise of Human Nature: Volume 1: Texts. Oxford University Press UK, UK.",
      "doi": ""
    },
    {
      "text": "Faheem Hussain, Abdullah Hasan Safir, Dina Sabie, Zulkarin Jahangir, and Syed Ishtiaque Ahmed. 2020. Infrastructuring Hope: Solidarity, Leadership, Negotiation, and ICT among the Rohingya Refugees in Bangladesh. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development (Guayaquil, Ecuador) (ICTD2020). Association for Computing Machinery, New York, NY, USA, Article 12, 12 pages. https://doi.org/10.1145/3392561.3394640",
      "doi": "10.1145/3392561.3394640"
    },
    {
      "text": "Samia Ibtasam. 2021. For God’s sake! Considering Religious Beliefs in HCI Research: A Case of Islamic HCI. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–8.",
      "doi": ""
    },
    {
      "text": "Muhammad Imran, Carlos Castillo, Fernando Diaz, and Sarah Vieweg. 2015. Processing Social Media Messages in Mass Emergency: A Survey. ACM Comput. Surv. 47, 4, Article 67 (jun 2015), 38 pages. https://doi.org/10.1145/2771588",
      "doi": ""
    },
    {
      "text": "Javed Iqbal. 2018. Alama Anwar Shah MEMORIAL district library KUPWARA in a shambles. (Accessed on 05/09/2021). https://www.greaterkashmir.com/kashmir/alama-anwar-shah-memorial-district-library-kupwara-in-a-shambles",
      "doi": ""
    },
    {
      "text": "Ajaz Islam. 2014. Impact of Armed Conflict on Economy and Tourism: A Study Of State of Jammu and Kashmir.Islam, Ajaz Ul,(2014), Impact of Armed Conflict on Economy and Tourism: A Study of State of Jammu and Kashmir. IOSR Journal of Economics and Finance (IOSR-JEF) 4, 6 (2014), 55–60.",
      "doi": ""
    },
    {
      "text": "Shruti Jain. 2019. Kashmiri student beaten, forced to wear women’s clothes in Rajasthan. (Accessed on 05/09/21). https://thewire.in/rights/kashmiri-student-beaten-forced-to-wear-womens-clothes-in-rajasthan",
      "doi": ""
    },
    {
      "text": "Govt.of J&K. 2020. DIRECTORY OF PUBLIC LIBRARIES,KASHMIR. (Accessed on 05/09/2021). http://www.jkpubliclibraries.nic.in/read-more-directory-kashmir.htm",
      "doi": ""
    },
    {
      "text": "Matthew Kam. 2010. Language and Literacy Learning in Developing Communities via Cellphones. In Proceedings of the 9th International Conference of the Learning Sciences - Volume 2 (Chicago, Illinois) (ICLS ’10). International Society of the Learning Sciences, USA, 106–108.",
      "doi": ""
    },
    {
      "text": "Matthew Kam, Aishvarya Agarwal, Anuj Kumar, Siddhartha Lal, Akhil Mathur, Anuj Tewari, and John Canny. 2008. Designing E-Learning Games for Rural Children in India: A Format for Balancing Learning with Fun. In Proceedings of the 7th ACM Conference on Designing Interactive Systems (Cape Town, South Africa) (DIS ’08). Association for Computing Machinery, New York, NY, USA, 58–67. https://doi.org/10.1145/1394445.1394452",
      "doi": "10.1145/1394445.1394452"
    },
    {
      "text": "Matthew Kam, Anuj Kumar, Shirley Jain, Akhil Mathur, and John Canny. 2009. Improving Literacy in Rural India: Cellphone Games in an after-School Program. In Proceedings of the 3rd International Conference on Information and Communication Technologies and Development(ICTD’09). IEEE Press, Doha, Qatar, 139–149.",
      "doi": ""
    },
    {
      "text": "Matthew Kam, Akhil Mathur, Anuj Kumar, and John Canny. 2009. Designing Digital Games for Rural Children: A Study of Traditional Village Games in India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 31–40. https://doi.org/10.1145/1518701.1518707",
      "doi": "10.1145/1518701.1518707"
    },
    {
      "text": "Matthew Kam, Divya Ramachandran, Anand Raghavan, Jane Chiu, Urvashi Sahni, and John Canny. 2006. Practical Considerations for Participatory Design with Rural School Children in Underdeveloped Regions: Early Reflections from the Field. In Proceedings of the 2006 Conference on Interaction Design and Children (Tampere, Finland) (IDC ’06). Association for Computing Machinery, New York, NY, USA, 25–32. https://doi.org/10.1145/1139073.1139085",
      "doi": "10.1145/1139073.1139085"
    },
    {
      "text": "Amy K. Karlson, A.J. Bernheim Brush, and Stuart Schechter. 2009. Can i Borrow Your Phone? Understanding Concerns When Sharing Mobile Phones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 1647–1650. https://doi.org/10.1145/1518701.1518953",
      "doi": "10.1145/1518701.1518953"
    },
    {
      "text": "Naveena Karusala, Aditya Vishwanath, Arkadeep Kumar, Aman Mangal, and Neha Kumar. 2017. Care as a Resource in Underserved Learning Environments. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 104 (dec 2017), 22 pages. https://doi.org/10.1145/3134739",
      "doi": "10.1145/3134739"
    },
    {
      "text": "Kashish Khandelwal. 2021. Covid-19 and the year-long internet restrictions in Jammu & Kashmir.",
      "doi": ""
    },
    {
      "text": "Anuj Kumar, Anuj Tewari, Geeta Shroff, Deepti Chittamuru, Matthew Kam, and John Canny. 2010. An Exploratory Study of Unsupervised Mobile Learning in Rural India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 743–752. https://doi.org/10.1145/1753326.1753435",
      "doi": "10.1145/1753326.1753435"
    },
    {
      "text": "Neha Kumar and Richard J. Anderson. 2015. Mobile Phones for Maternal Health in Rural India. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 427–436. https://doi.org/10.1145/2702123.2702258",
      "doi": "10.1145/2702123.2702258"
    },
    {
      "text": "Priya C. Kumar, Marshini Chetty, Tamara L. Clegg, and Jessica Vitak. 2019. Privacy and Security Considerations For Digital Technology Use in Elementary Schools. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300537",
      "doi": ""
    },
    {
      "text": "Divyanshu Kumar Singh, Sumita Sharma, Jainendra Shukla, and Grace Eden. 2020. Toy, Tutor, Peer, or Pet? Preliminary Findings from Child-Robot Interactions in a Community School. In Companion of the 2020 ACM/IEEE International Conference on Human-Robot Interaction (Cambridge, United Kingdom) (HRI ’20). Association for Computing Machinery, New York, NY, USA, 325–327. https://doi.org/10.1145/3371382.3378315",
      "doi": "10.1145/3371382.3378315"
    },
    {
      "text": "Samvet Kuril, Vishal Gupta, and Vijaya Chand. 2021. Relationship between negative teacher behaviors and student engagement: Evidence from India. International Journal of Educational Research 109 (01 2021), 101858. https://doi.org/10.1016/j.ijer.2021.101858",
      "doi": ""
    },
    {
      "text": "Sameer Lalwani and Gillian Gayner. 2020. India’s Kashmir Conundrum: Before and After the Abrogation of Article 370.",
      "doi": ""
    },
    {
      "text": "Edith Law, Krzysztof Z. Gajos, Andrea Wiggins, Mary L. Gray, and Alex Williams. 2017. Crowdsourcing as a Tool for Research: Implications of Uncertainty. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1544–1561. https://doi.org/10.1145/2998181.2998197",
      "doi": "10.1145/2998181.2998197"
    },
    {
      "text": "Michael A. Madaio, Vikram Kamath, Evelyn Yarzebinski, Shelby Zasacky, Fabrice Tanoh, Joelle Hannon-Cropp, Justine Cassell, Kaja Jasinska, and Amy Ogan. 2019. ”You Give a Little of Yourself”: Family Support for Children’s Use of an IVR Literacy System. In Proceedings of the 2nd ACM SIGCAS Conference on Computing and Sustainable Societies (Accra, Ghana) (COMPASS ’19). Association for Computing Machinery, New York, NY, USA, 86–98. https://doi.org/10.1145/3314344.3332504",
      "doi": "10.1145/3314344.3332504"
    },
    {
      "text": "Michael A. Madaio, Fabrice Tanoh, Axel Blahoua Seri, Kaja Jasinska, and Amy Ogan. 2019. ”Everyone Brings Their Grain of Salt”: Designing for Low-Literate Parental Engagement with a Mobile Literacy Technology in CôTe d’Ivoire. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300695",
      "doi": ""
    },
    {
      "text": "Anub Mannaan. 2019. Education paralysis in Kashmir: Need to protect the future. (Accessed on 05/09/21). https://www.orfonline.org/expert-speak/education-paralysis-in-kashmir-need-to-protect-the-future-55680/#:~:text=a%20long%20break.-,Breaks%20in%20education%20faced%20by%20the%20children%20of%20Kashmir%20are,themselves%20in%20regular%20school%20routine",
      "doi": ""
    },
    {
      "text": "Gloria Mark and Bryan Semaan. 2008. Resilience in Collaboration: Technology as a Resource for New Patterns of Action. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (San Diego, CA, USA) (CSCW ’08). Association for Computing Machinery, New York, NY, USA, 137–146. https://doi.org/10.1145/1460563.1460585",
      "doi": "10.1145/1460563.1460585"
    },
    {
      "text": "Gloria J. Mark, Ban Al-Ani, and Bryan Semaan. 2009. Resilience through Technology Adoption: Merging the Old and the New in Iraq. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 689–698. https://doi.org/10.1145/1518701.1518808",
      "doi": "10.1145/1518701.1518808"
    },
    {
      "text": "Kelly Mills, Elizabeth Bonsignore, Tamara Clegg, June Ahn, Jason Yip, Daniel Pauw, Lautaro Cabrera, Kenna Hernly, and Caroline Pitt. 2019. Connecting children’s scientific funds of knowledge shared on social media to science concepts. International Journal of Child-Computer Interaction 21 (2019), 54–64. https://doi.org/10.1016/j.ijcci.2019.04.003",
      "doi": "10.1016/j.ijcci.2019.04.003"
    },
    {
      "text": "Aparna Moitra, Vishnupriya Das, Gram Vaani, Archna Kumar, and Aaditeshwar Seth. 2016. Design Lessons from Creating a Mobile-Based Community Media Platform in Rural India. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development (Ann Arbor, MI, USA) (ICTD ’16). Association for Computing Machinery, New York, NY, USA, Article 14, 11 pages. https://doi.org/10.1145/2909609.2909670",
      "doi": "10.1145/2909609.2909670"
    },
    {
      "text": "Andrés Monroy-Hernández, danah boyd, Emre Kiciman, Munmun De Choudhury, and Scott Counts. 2013. The New War Correspondents: The Rise of Civic Media Curation in Urban Warfare. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (San Antonio, Texas, USA) (CSCW ’13). Association for Computing Machinery, New York, NY, USA, 1443–1452. https://doi.org/10.1145/2441776.2441938",
      "doi": "10.1145/2441776.2441938"
    },
    {
      "text": "J. Nyoni. 2013. The Viral Nature of Massive Open Online Courses (MOOCs) in Open and Distance Learning: Discourses of Quality, Mediation and Control. Mediterranean Journal of Social Sciences 4, 3 (2013), 665–665. https://www.mcser.org/journal/index.php/mjss/article/view/523",
      "doi": ""
    },
    {
      "text": "Govt. of India. 2019. ”The Unlawful Activities (Prevention) Amendment Act, 2019. (Accessed on 05/09/2021). https://egazette.nic.in/WriteReadData/2019/210355.pdf",
      "doi": ""
    },
    {
      "text": "Press Trust of India. 2018. Kashmiri student beaten up during fight at Greater Noida College. (Accessed on 05/09/21). https://www.indiatoday.in/india/story/kashmiri-student-beaten-up-during-fight-at-greater-noida-college-1356134-2018-10-05",
      "doi": ""
    },
    {
      "text": "Leysia Palen, Kenneth M. Anderson, Gloria Mark, James Martin, Douglas Sicker, Martha Palmer, and Dirk Grunwald. 2010. A Vision for Technology-Mediated Support for Public Participation & Assistance in Mass Emergencies & Disasters. In Proceedings of the 2010 ACM-BCS Visions of Computer Science Conference (Edinburgh, United Kingdom) (ACM-BCS ’10). BCS Learning & Development Ltd., Swindon, GBR, Article 8, 12 pages.",
      "doi": ""
    },
    {
      "text": "Anthony Poon, Sarah Giroux, Parfait Eloundou-Enyegue, François Guimbretiere, and Nicola Dell. 2019. Engaging High School Students in Cameroon with Exam Practice Quizzes via SMS and WhatsApp. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300712",
      "doi": ""
    },
    {
      "text": "Christopher Power, Alena Denisova, Themis Papaioannou, and Paul Cairns. 2017. Measuring Uncertainty in Games: Design and Preliminary Validation. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(Denver, Colorado, USA) (CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 2839–2845. https://doi.org/10.1145/3027063.3053215",
      "doi": "10.1145/3027063.3053215"
    },
    {
      "text": "Borgen Project. 2020. The long-lasting effects of education in conflict zones. https://borgenproject.org/the-benefits-of-education-in-conflict-zones/",
      "doi": ""
    },
    {
      "text": "Arpan Rai. 2021. 2 security Personnel, 2 civilians killed in terrorist attack in Kashmir’s Sopore. (Accessed on 05/09/2021). https://www.hindustantimes.com/india-news/terrorist-attack-in-kashmir-s-sopore-kills-2-civilians-2-armed-forces-personnel-101623483124617.html",
      "doi": ""
    },
    {
      "text": "Murtaza Rashid. 2020. Health-care crisis in Kashmir. The Lancet 396, 10255 (2020), e42.",
      "doi": ""
    },
    {
      "text": "Prerna Ravi, Azra Ismail, and Neha Kumar. 2021. The Pandemic Shift to Remote Learning under Resource Constraints. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 314 (oct 2021), 28 pages. https://doi.org/10.1145/3476055",
      "doi": "10.1145/3476055"
    },
    {
      "text": "Nithya Sambasivan, Garen Checkley, Amna Batool, Nova Ahmed, David Nemer, Laura Sanely Gaytán-Lugo, Tara Matthews, Sunny Consolvo, and Elizabeth Churchil. 2018. ”Privacy is Not for Me, It’s for Those Rich Women”: Performative Privacy Practices on Mobile Phones by Women in South Asia. In Proceedings of the Fourteenth USENIX Conference on Usable Privacy and Security (Baltimore, MD, USA) (SOUPS ’18). USENIX Association, USA, 127–142.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Ed Cutrell, Kentaro Toyama, and Bonnie Nardi. 2010. Intermediated Technology Use in Developing Communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 2583–2592. https://doi.org/10.1145/1753326.1753718",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "Nithya Sambasivan and Thomas Smyth. 2010. The Human Infrastructure of ICTD. In Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development(London, United Kingdom) (ICTD ’10). Association for Computing Machinery, New York, NY, USA, Article 40, 9 pages. https://doi.org/10.1145/2369220.2369258",
      "doi": "10.1145/2369220.2369258"
    },
    {
      "text": "Nishtha Satyam. 2021. Indian Education’s new digital wave after Covid left behind women. (Accessed on 06/09/21). https://theprint.in/opinion/indian-educations-new-digital-wave-after-covid-left-behind-women/593491/",
      "doi": ""
    },
    {
      "text": "Amit Saxena, Urvashi Sahni, Rahul Gupta, Anjana Arora, Richard Anderson, and Natalie Linnell. 2010. Evaluating Facilitated Video Instruction for Primary Schools in Rural India. In Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development (London, United Kingdom) (ICTD ’10). Association for Computing Machinery, New York, NY, USA, Article 41, 10 pages. https://doi.org/10.1145/2369220.2369259",
      "doi": "10.1145/2369220.2369259"
    },
    {
      "text": "Bryan Semaan and Gloria Mark. 2012. ’facebooking’ towards Crisis Recovery and beyond: Disruption as an Opportunity. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (Seattle, Washington, USA) (CSCW ’12). Association for Computing Machinery, New York, NY, USA, 27–36. https://doi.org/10.1145/2145204.2145214",
      "doi": "10.1145/2145204.2145214"
    },
    {
      "text": "Statesman News Service. 2019. Kashmiri students beaten up in UP Institute, Return Home. (Accessed on 05/09/21). https://www.thestatesman.com/india/kashmiri-students-beaten-institute-return-home-1502756211.html",
      "doi": ""
    },
    {
      "text": "Kritika Sharma, Peter Casey, Shekhar Gupta, and Chitleen K Sethi. 2020. Govt turns to ’TV classrooms’ as online lessons prove to be a challenge during lockdown. (Accessed on 05/09/21). https://theprint.in/india/education/govt-turns-to-tv-classrooms-as-online-lessons-prove-to-be-a-challenge-during-lockdown/415683/",
      "doi": ""
    },
    {
      "text": "Sumita Sharma. 2018. Collaborative Educational Applications for Underserved Children : Experiences from India. Number 1912 in Acta Electronica Universitatis Tamperensis. Tampere University, Tampere.",
      "doi": ""
    },
    {
      "text": "Frances Shaw, Jean Burgess, Kate Crawford, and Axel Bruns. 2013. Sharing news, making sense, saying thanks: Patterns of talk on Twitter during the Queensland floods. Australian Journal of Communication 40, 1 (2013), 23–39.",
      "doi": ""
    },
    {
      "text": "Akanksha Singh. 2021. Hard sells and ’toxic’ targets: How indian edtech giant byju’s fuels its meteoric rise. (Accessed on 05/09/21). https://restofworld.org/2021/inside-india-edtech-byjus/",
      "doi": ""
    },
    {
      "text": "Robert Soden. 2019. Modes of Uncertainty: RETHINKING flood risk in Colorado. https://items.ssrc.org/chancing-the-storm/modes-of-uncertainty-rethinking-flood-risk-in-colorado/",
      "doi": ""
    },
    {
      "text": "Robert Soden, Laura Devendorf, Richmond Y. Wong, Lydia B. Chilton, Ann Light, and Yoko Akama. 2020. Embracing Uncertainty in HCI. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3375177",
      "doi": "10.1145/3334480.3375177"
    },
    {
      "text": "Robert Soden and Leysia Palen. 2016. Infrastructure in the Wild: What Mapping in Post-Earthquake Nepal Reveals about Infrastructural Emergence. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 2796–2807. https://doi.org/10.1145/2858036.2858545",
      "doi": "10.1145/2858036.2858545"
    },
    {
      "text": "Robert Soden and Leysia Palen. 2018. Informating Crisis: Expanding Critical Perspectives in Crisis Informatics. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 162 (nov 2018), 22 pages. https://doi.org/10.1145/3274431",
      "doi": "10.1145/3274431"
    },
    {
      "text": "Molly Steenson and Jonathan Donner. 2009. Beyond the Personal and Private: Modes of Mobile Phone Sharing in Urban India. The Reconstruction of Space and Time: Mobile Communication Practices 1 (01 2009), 231–250.",
      "doi": ""
    },
    {
      "text": "Sharifa Sultana, François Guimbretière, Phoebe Sengers, and Nicola Dell. 2018. Design Within a Patriarchal Society: Opportunities and Challenges in Designing for Rural Women in Bangladesh. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174110",
      "doi": "10.1145/3173574.3174110"
    },
    {
      "text": "Reem Talhouk, Sandra Mesmar, Anja Thieme, Madeline Balaam, Patrick Olivier, Chaza Akik, and Hala Ghattas. 2016. Syrian Refugees and Digital Health in Lebanon: Opportunities for Improving Antenatal Health. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 331–342. https://doi.org/10.1145/2858036.2858331",
      "doi": "10.1145/2858036.2858331"
    },
    {
      "text": "Feng Tian, Fei Lv, Jingtao Wang, Hongan Wang, Wencan Luo, Matthew Kam, Vidya Setlur, Guozhong Dai, and John Canny. 2010. Let’s Play Chinese Characters: Mobile Learning Approaches via Culturally Inspired Group Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1603–1612. https://doi.org/10.1145/1753326.1753565",
      "doi": "10.1145/1753326.1753565"
    },
    {
      "text": "Toppr. 2021. Toppr.com (Kerala State Board). (Accessed on 05/09/2021). https://www.toppr.com/boards/kerala/",
      "doi": ""
    },
    {
      "text": "Michael Trucano. 2014. Promising uses of technology in education in poor, rural and isolated communities around the world. (Accessed on 05/09/2021). https://blogs.worldbank.org/edutech/education-technology-poor-rural",
      "doi": ""
    },
    {
      "text": "Anupriya Tuli, Shaan Chopra, Neha Kumar, and Pushpendra Singh. 2018. Learning from and with Menstrupedia: Towards Menstrual Health Education in India. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 174 (nov 2018), 20 pages. https://doi.org/10.1145/3274443",
      "doi": "10.1145/3274443"
    },
    {
      "text": "Judith Uchidiuno, Evelyn Yarzebinski, Emily Keebler, Kenneth Koedinger, and Amy Ogan. 2019. Learning from African Classroom Pedagogy to Increase Student Engagement in Education Technologies. In Proceedings of the 2nd ACM SIGCAS Conference on Computing and Sustainable Societies (Accra, Ghana) (COMPASS ’19). Association for Computing Machinery, New York, NY, USA, 99–110. https://doi.org/10.1145/3314344.3332501",
      "doi": "10.1145/3314344.3332501"
    },
    {
      "text": "UNICEF. 2021. 25 million children out of school in Conflict Zones. (Accessed on 05/09/21). https://www.unicef.org/press-releases/25-million-children-out-school-conflict-zones",
      "doi": ""
    },
    {
      "text": "Rama Adithya Varanasi, Aditya Vashistha, Tapan Parikh, and Nicola Dell. 2020. Challenges and Issues Integrating Smartphones into Teacher Support Programs in India. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development (Guayaquil, Ecuador) (ICTD2020). Association for Computing Machinery, New York, NY, USA, Article 10, 11 pages. https://doi.org/10.1145/3392561.3394638",
      "doi": "10.1145/3392561.3394638"
    },
    {
      "text": "Vedantu. 2019. Online study materials, courses for state boards students. (Accessed on 05/09/2021). https://www.vedantu.com/state-boards",
      "doi": ""
    },
    {
      "text": "Sarah Vieweg, Amanda L. Hughes, Kate Starbird, and Leysia Palen. 2010. Microblogging during Two Natural Hazards Events: What Twitter May Contribute to Situational Awareness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1079–1088. https://doi.org/10.1145/1753326.1753486",
      "doi": "10.1145/1753326.1753486"
    },
    {
      "text": "Aditya Vishwanath, Matthew Kam, and Neha Kumar. 2017. Examining Low-Cost Virtual Reality for Learning in Low-Resource Environments. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 1277–1281. https://doi.org/10.1145/3064663.3064696",
      "doi": "10.1145/3064663.3064696"
    },
    {
      "text": "Wikipedia. 2021. Cache (computing). https://en.wikipedia.org/wiki/Cache_(computing)",
      "doi": ""
    },
    {
      "text": "Deepika Yadav, Prerna Malik, Kirti Dabas, and Pushpendra Singh. 2019. Feedpal: Understanding Opportunities for Chatbots in Breastfeeding Education of Women in India. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 170 (nov 2019), 30 pages. https://doi.org/10.1145/3359272",
      "doi": "10.1145/3359272"
    },
    {
      "text": "Jason Yip, June Ahn, Tamara Clegg, Elizabeth Bonsignore, Daniel Pauw, and Michael Gubbels. 2014. ”It Helped Me Do My Science.”: A Case of Designing Social Media Technologies for Children in Science Learning. In Proceedings of the 2014 Conference on Interaction Design and Children (Aarhus, Denmark) (IDC ’14). Association for Computing Machinery, New York, NY, USA, 155–164. https://doi.org/10.1145/2593968.2593969",
      "doi": "10.1145/2593968.2593969"
    },
    {
      "text": "Jason C. Yip, Kiley Sobel, Caroline Pitt, Kung Jin Lee, Sijin Chen, Kari Nasu, and Laura R. Pina. 2017. Examining Adult-Child Interactions in Intergenerational Participatory Design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 5742–5754. https://doi.org/10.1145/3025453.3025787",
      "doi": "10.1145/3025453.3025787"
    },
    {
      "text": "Safwat Zargar. 2020. In Kashmir, school children have barely gone to classes for nine months. (Accessed on 05/09/2021). https://scroll.in/article/962295/in-kashmir-school-children-have-barely-gone-to-classes-for-nine-months",
      "doi": ""
    },
    {
      "text": "Safwat Zargar. 2021. ’For anything AND everything’: UAPA cases are rising in Kashmir. (Accessed on 05/09/2021). https://scroll.in/article/991077/for-anything-and-everything-uapa-cases-are-rising-in-kashmir",
      "doi": ""
    }
  ]
}