{
  "doi": "10.1145/3491102.3501824",
  "title": "Investigating Culturally Responsive Design for Menstrual Tracking and Sharing Practices Among Individuals with Minimal Sexual Education",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "Human-Computer Interaction (HCI) research on menstrual tracking has emphasized the need for more inclusive design of mechanisms for tracking and sharing information on menstruation. We investigate menstrual tracking and data-sharing attitudes and practices in educated, young (20-30 years old) menstruating individuals based in the United States, with self-identified minimal menstrual education backgrounds. Using interviews (N=18), a survey (N=62), and participatory design (N=7), we find that existing mechanisms for tracking and sharing data on menstruation are not adequately responsive to the needs of those who seek relevant menstrual education, are not in the sexual majority, and/or wish to customize what menstrual data they share and with whom. Our analysis highlights a design gap for participants with minimal sexual education backgrounds who wish to better understand their cycles. We also contribute a deepened understanding of structural health inequities that impact menstrual tracking and sharing practices, making recommendations for technology-mediated menstrual care.",
  "authors": [
    {
      "name": "Georgianna E Lin",
      "institution": "College of Computing, Georgia Institute of Technology, United States and Department of Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659576613",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth D Mynatt",
      "institution": "Institute for People and Teechnology, Georgia Institute of Technology, United States and Institute for People and Teechnology, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100331104",
      "orcid": "missing"
    },
    {
      "name": "Neha Kumar",
      "institution": "Georgia Institute of Technology, United States and Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646715",
      "orcid": "0000-0002-7014-5585"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. LOONLAB. http://www.loonlab.com/. (Accessed on 05/02/2020).",
      "doi": ""
    },
    {
      "text": "[n.d.]. my.Flow - my.Flow. http://www.trackmyflow.com/myflow.html. (Accessed on 05/02/2020).",
      "doi": ""
    },
    {
      "text": "Teresa Almeida, Madeline Balaam, Shaowen Bardzell, and Lone Koefoed Hansen. 2020. Introduction to the Special Issue on HCI and the Body: Reimagining Women’s Health. ACM Trans. Comput.-Hum. Interact. 27, 4, Article 20 (Aug. 2020), 32 pages. https://doi.org/10.1145/3406091",
      "doi": "10.1145/3406091"
    },
    {
      "text": "Teresa Almeida, Rob Comber, and Madeline Balaam. 2016. HCI and Intimate Care as an Agenda for Change in Women’s Health. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 2599–2611.",
      "doi": "10.1145/2858036.2858187"
    },
    {
      "text": "Teresa Almeida, Rob Comber, Gavin Wood, Dean Saraf, and Madeline Balaam. 2016. On looking at the vagina through Labella. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 1810–1821.",
      "doi": "10.1145/2858036.2858119"
    },
    {
      "text": "Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andrew Garbett. 2015. FeedFinder: a location-mapping mobile application for breastfeeding women. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1709–1718.",
      "doi": "10.1145/2702123.2702328"
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, Amanda Lazar, and Norman Makoto Su. 2019. (Re-) Framing Menopause Experiences for HCI and Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300345"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI conference on human factors in computing systems. 1301–1310.",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a Feminist HCI Methodology: Social Science, Feminism, and HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 675–684. https://doi.org/10.1145/1978942.1979041",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Oliver J Bott, E Ammenwerth, B Brigl, P Knaup, E Lang, R Pilgram, B Pfeifer, F Ruderich, AC Wolff, R Haux, 2005. The challenge of ubiquitous computing in health care: technology, concepts and solutions. Methods of Information in Medicine 44, 03 (2005), 473–479.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Haywood L Brown, Maria J Small, Camille A Clare, and Washington Hill. 2020. Black women health inequity the origin of perinatal health disparity. Journal of the National Medical Association(2020).",
      "doi": ""
    },
    {
      "text": "Emeline Brulé and Katta Spiel. 2019. Negotiating gender and disability identities in participatory design. In Proceedings of the 9th International Conference on Communities & Technologies-Transforming Communities. 218–227.",
      "doi": "10.1145/3328320.3328369"
    },
    {
      "text": "Thanh Cong Bui, Christine M Markham, Michael W Ross, Mark L Williams, R Palmer Beasley, Ly TH Tran, Huong TH Nguyen, and Thach Ngoc Le. 2012. Dimensions of gender relations and reproductive health inequity perceived by female undergraduate students in the Mekong Delta of Vietnam: a qualitative exploration. International Journal for Equity in Health 11, 1 (2012), 1–11.",
      "doi": ""
    },
    {
      "text": "Vicky Bungay. 2013. Health care among street-involved women: The perpetuation of health inequity. Qualitative Health Research 23, 8 (2013), 1016–1026.",
      "doi": ""
    },
    {
      "text": "Timothy A Carey, Sara J Tai, and Robert Griffiths. 2021. Deconstructing Health Inequity: A Perceptual Control Theory Perspective. Springer Nature.",
      "doi": ""
    },
    {
      "text": "Rasheeta Chandler, Dominique Guillaume, Andrea Parker, Jessica Wells, and Natalie D Hernandez. 2021. Developing Culturally Tailored mHealth Tools to Address Sexual and Reproductive Health Outcomes Among Black and Latina Women: A Systematic Review. Health Promotion Practice(2021), 15248399211002831.",
      "doi": ""
    },
    {
      "text": "Rasheeta Chandler, Dominique Guillaume, Andrea G Parker, Sierra Carter, and Natalie D Hernandez. 2020. Promoting Optimal Sexual and Reproductive Health with Mobile Health Tools for Black Women: Combining Technology, Culture and Context. Perspectives on Sexual and Reproductive Health 52, 4 (2020), 205–209.",
      "doi": ""
    },
    {
      "text": "Mayara Costa Figueiredo, Clara Caldeira, Tera L. Reynolds, Sean Victory, Kai Zheng, and Yunan Chen. 2017. Self-Tracking for Fertility Care: Collaborative Support for a Highly Personalized Problem. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 36 (Dec. 2017), 21 pages. https://doi.org/10.1145/3134671",
      "doi": "10.1145/3134671"
    },
    {
      "text": "Catherine D’Ignazio, Alexis Hope, Becky Michelson, Robyn Churchill, and Ethan Zuckerman. 2016. A Feminist HCI Approach to Designing Postpartum Technologies: ” When I first saw a breast pump I was wondering if it was a joke”. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 2612–2622.",
      "doi": "10.1145/2858036.2858460"
    },
    {
      "text": "Kevin Doherty, José Marcano-Belisario, Martin Cohn, Nikolaos Mastellos, Cecily Morrison, Josip Car, and Gavin Doherty. 2019. Engagement with Mental Health Screening on Mobile Devices: Results from an Antenatal Feasibility Study. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3290605.3300416"
    },
    {
      "text": "Ian Douglas and Zhengjie Liu. 2011. Global usability. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Anna Eaglin and Shaowen Bardzell. 2011. Sex toys and designing for sexual wellness. In CHI’11 Extended Abstracts on Human Factors in Computing Systems. 1837–1842.",
      "doi": ""
    },
    {
      "text": "Catherine E Elmore, Jessica Keim-Malpass, and Emma McKim Mitchell. 2021. Health Inequity in Cervical Cancer Control Among Refugee Women in the United States by Country of Origin. Health Equity 5, 1 (2021), 119–123.",
      "doi": ""
    },
    {
      "text": "Daniel A Epstein, Nicole B Lee, Jennifer H Kang, Elena Agapie, Jessica Schroeder, Laura R Pina, James Fogarty, Julie A Kientz, and Sean Munson. 2017. Examining menstrual tracking to inform the design of personal informatics tools. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 6876–6888.",
      "doi": "10.1145/3025453.3025635"
    },
    {
      "text": "Joanna N Erdman, Kinga Jelinska, and Susan Yanow. 2018. Understandings of self-managed abortion as health inequity, harm reduction and social change. Reproductive health matters 26, 54 (2018), 13–19.",
      "doi": ""
    },
    {
      "text": "Jordan Eschler, Amanda Menking, Sarah Fox, and Uba Backonja. 2019. Defining Menstrual Literacy With the Aim of Evaluating Mobile Menstrual Tracking Applications. CIN: Computers, Informatics, Nursing 37, 12 (2019), 638–646.",
      "doi": ""
    },
    {
      "text": "Margaret Flemings, Shanzay Kazmi, Rachel Pak, and Orit Shaer. 2018. Crimson Wave: Shedding Light on Menstrual Health. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (Stockholm, Sweden) (TEI ’18). Association for Computing Machinery, New York, NY, USA, 343–348. https://doi.org/10.1145/3173225.3173292",
      "doi": "10.1145/3173225.3173292"
    },
    {
      "text": "Sarah Fox and Daniel A Epstein. 2020. Monitoring Menses: Design-Based Investigations of Menstrual Tracking Applications. In The Palgrave Handbook of Critical Menstruation Studies. Palgrave Macmillan, Singapore, 733–750.",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Noura Howell, Richmond Wong, and Franchesca Spektor. 2019. Vivewell: Speculating Near-Future Menstrual Tracking through Current Data Practices. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 541–552. https://doi.org/10.1145/3322276.3323695",
      "doi": "10.1145/3322276.3323695"
    },
    {
      "text": "Sarah E. Fox, Amanda Menking, Jordan Eschler, and Uba Backonja. 2020. Multiples Over Models: Interrogating the Past and Collectively Reimagining the Future of Menstrual Sensemaking. ACM Trans. Comput.-Hum. Interact. 27, 4, Article 22 (Sept. 2020), 24 pages. https://doi.org/10.1145/3397178",
      "doi": "10.1145/3397178"
    },
    {
      "text": "Leo A Goodman. 1961. Snowball sampling. The annals of mathematical statistics(1961), 148–170.",
      "doi": ""
    },
    {
      "text": "Edward Twitchell Hall. 1989. Beyond culture. Anchor.",
      "doi": ""
    },
    {
      "text": "Sarah Homewood. 2018. Designing for the Changing Body: A Feminist Exploration of Self-Tracking Technologies. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, Article DC11, 4 pages. https://doi.org/10.1145/3170427.3173031",
      "doi": "10.1145/3170427.3173031"
    },
    {
      "text": "Sarah Homewood. 2019. Inaction as a design decision: Reflections on not designing self-tracking tools for menopause. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290607.3310430"
    },
    {
      "text": "Rita Ismail, Lauri A Linder, Catherine Fiona MacPherson, and Nancy Fugate Woods. 2016. Feasibility of an iPad application for studying menopause-related symptom clusters and women’s heuristics. Informatics for Health and Social Care 41, 3 (2016), 247–266.",
      "doi": ""
    },
    {
      "text": "Minal Jain and Pradeep Yammiyavar. 2015. Game based learning tool seeking peer support for empowering adolescent girls in rural Assam. In Proceedings of the 14th International Conference on Interaction Design and Children. 275–278.",
      "doi": "10.1145/2771839.2771895"
    },
    {
      "text": "Matthew R Jamnik and David J Lane. 2017. The use of Reddit as an inexpensive source for high-quality data. Practical Assessment, Research, and Evaluation 22, 1(2017), 5.",
      "doi": ""
    },
    {
      "text": "Reihaneh Jarrahi, Nahid Golmakani, and Seyyed Reza Mazlom. 2020. Comparison of the effect of menstrual health education with peer-based and small-group approaches on adolescent girls’ health behaviors, a clinical trial. Evidence Based Care (2020).",
      "doi": ""
    },
    {
      "text": "Allen C Johnston, James L Worrell, Paul M Di Gangi, and Molly Wasko. 2013. Online health communities: An assessment of the influence of participation on patient empowerment outcomes. Information Technology & People(2013).",
      "doi": ""
    },
    {
      "text": "Gopinaath Kannabiran, Alex A Ahmed, Matthew Wood, Madeline Balaam, Joshua G Tanenbaum, Shaowen Bardzell, and Jeffrey Bardzell. 2018. Design for sexual wellbeing in HCI. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. 1–7.",
      "doi": "10.1145/3170427.3170639"
    },
    {
      "text": "Joan Kaufman. 2005. China: the intersections between poverty, health inequity, reproductive health and HIV/AIDS. Development 48, 4 (2005), 113–119.",
      "doi": ""
    },
    {
      "text": "Jiro Kawakita. 1991. The original KJ method. Tokyo: Kawakita Research Institute 5 (1991).",
      "doi": ""
    },
    {
      "text": "Os Keyes, Burren Peil, Rua M Williams, and Katta Spiel. 2020. Reimagining (women’s) health: HCI, gender and essentialised embodiment. ACM Transactions on Computer-Human Interaction (TOCHI) 27, 4(2020), 1–42.",
      "doi": "10.1145/3404218"
    },
    {
      "text": "Julie A Kientz, Rosa I Arriaga, and Gregory D Abowd. 2009. Baby steps: evaluation of a system to support record-keeping for parents of young children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1713–1722.",
      "doi": "10.1145/1518701.1518965"
    },
    {
      "text": "Anant Kumar. 2007. Health inequity and women’s self-help groups in India: The role of caste and class. Health Sociology Review 16, 2 (2007), 160–168.",
      "doi": ""
    },
    {
      "text": "Neha Kumar, Naveena Karusala, Azra Ismail, and Anupriya Tuli. 2020. Taking the Long, Holistic, and Intersectional View to Women’s Wellbeing. ACM Transactions on Computer-Human Interaction (TOCHI) 27, 4(2020), 1–32.",
      "doi": "10.1145/3397159"
    },
    {
      "text": "Yeunhee Kwak, Yoonjung Kim, and Kyoung Ah Baek. 2019. Prevalence of irregular menstruation according to socioeconomic status: A population-based nationwide cross-sectional study. PloS one 14, 3 (2019), e0214071.",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Norman Makoto Su, Jeffrey Bardzell, and Shaowen Bardzell. 2019. Parting the red sea: Sociotechnical systems and lived experiences of menopause. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3290605.3300710"
    },
    {
      "text": "Inseong Lee, Gi Woong Choi, Jinwoo Kim, Solyung Kim, Kiho Lee, Daniel Kim, Myunghee Han, Seung Yong Park, and Yongil An. 2008. Cultural dimensions for user experience: Cross-country and cross-product analysis of users’ cultural characteristics. People and Computers XXII Culture, Creativity, Interaction 22 (2008), 3–12.",
      "doi": ""
    },
    {
      "text": "MS Lee. 2005. Health inequalities among Korean adults: socioeconomic status and residential area differences. Korean J Sociol 39, 6 (2005), 183–209.",
      "doi": ""
    },
    {
      "text": "Mirim Lee, Bon-chang Koo, Hee-seok Jeong, Joongsing Park, Juhee Cho, and Jundong Cho. 2015. Designing mHealth intervention for women in menopausal period. In 2015 9th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth). IEEE, 257–260.",
      "doi": ""
    },
    {
      "text": "Mirim Lee, Bon-chang Koo, Hee-seok Jeong, Joongsin Park, Juhee Cho, and Jun-dong Cho. 2015. Understanding Women’s Needs in Menopause for Development of mHealth. In Proceedings of the 2015 Workshop on Pervasive Wireless Healthcare. 51–56.",
      "doi": "10.1145/2757290.2757295"
    },
    {
      "text": "Raymond Luong and Anna M Lomanowska. 2021. Evaluating Reddit as a Crowdsourcing Platform for Psychology Research Projects. Teaching of Psychology(2021), 00986283211020739.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2013. Understanding the human machine [Commentary]. IEEE Technology and Society Magazine 32, 4 (2013), 25–30.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2014. Quantified Sex: A Critical Analysis of Sexual and Reproductive Self-Tracking Using Apps. Culture, health & sexuality 17 (06 2014), 1–14. https://doi.org/10.1080/13691058.2014.920528",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2014. Self-tracking modes: Reflexive self-monitoring and data practices. Available at SSRN 2483549(2014).",
      "doi": ""
    },
    {
      "text": "JoAnn E Manson, Jeffrey M Ames, Marla Shapiro, Margery LS Gass, Jan L Shifren, Cynthia A Stuenkel, JoAnn V Pinkerton, Andrew M Kaunitz, Diane T Pace, Risa Kagan, 2015. Algorithm and mobile app for menopausal symptom management and hormonal/non-hormonal therapy decision making: a clinical decision-support tool from The North American Menopause Society. Menopause 22, 3 (2015), 247–253.",
      "doi": ""
    },
    {
      "text": "Sonali R. Mishra, Predrag Klasnja, John MacDuffie Woodburn, Eric B. Hekler, Larsson Omberg, Michael Kellen, and Lara Mangravite. 2019. Supporting Coping with Parkinson’s Disease Through Self Tracking. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3290605.3300337",
      "doi": "10.1145/3290605.3300337"
    },
    {
      "text": "Michelle Moglia, Henry Nguyen, Kathy Chyjek, Katherine Chen, and Paula Castaño. 2016. Evaluation of Smartphone Menstrual Cycle Tracking Applications Using an Adapted APPLICATIONS Scoring System. Obstetrics and gynecology 127 (05 2016). https://doi.org/10.1097/AOG.0000000000001444",
      "doi": ""
    },
    {
      "text": "Michelle L Moglia, Henry V Nguyen, Kathy Chyjek, Katherine T Chen, and Paula M Castaño. 2016. Evaluation of smartphone menstrual cycle tracking applications using an adapted APPLICATIONS scoring system. Obstetrics & Gynecology 127, 6 (2016), 1153–1160.",
      "doi": ""
    },
    {
      "text": "Priya Nambisan. 2011. Information seeking and social support in online health communities: impact on patients’ perceived empathy. Journal of the American Medical Informatics Association 18, 3(2011), 298–304.",
      "doi": ""
    },
    {
      "text": "Lisa Neal, Kate Oakley, Gitte Lindgaard, David Kaufman, Jan Marco Leimeister, and Ted Selker. 2007. Online health communities. In CHI’07 Extended Abstracts on Human Factors in Computing Systems. 2129–2132.",
      "doi": ""
    },
    {
      "text": "Don Operario, Kristi E Gamarel, Benjamin M Grin, Ji Hyun Lee, Christopher W Kahler, Brandon DL Marshall, Jacob J van den Berg, and Nickolas D Zaller. 2015. Sexual minority health disparities in adult men and women in the United States: National Health and Nutrition Examination Survey, 2001–2010. American journal of public health 105, 10 (2015), e27–e34.",
      "doi": ""
    },
    {
      "text": "Tamara Peyton, Erika Poole, Madhu Reddy, Jennifer Kraschnewski, and Cynthia Chuang. 2014. ” Every pregnancy is different” designing mHealth for the pregnancy ecology. In Proceedings of the 2014 conference on Designing interactive systems. 577–586.",
      "doi": "10.1145/2598510.2598572"
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the SIGCHI conference on human factors in computing systems. 1163–1172.",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Minna Ruckenstein. 2014. Visualized and interacted life: Personal analytics and engagements with data doubles. Societies 4, 1 (2014), 68–84.",
      "doi": ""
    },
    {
      "text": "Luciana Salgado, Roberto Pereira, and Isabela Gasparini. 2015. Cultural issues in HCI: challenges and opportunities. In International Conference on Human-Computer Interaction. Springer, 60–70.",
      "doi": ""
    },
    {
      "text": "Udani Samarasekera and Richard Horton. 2017. Women’s cancers: shining a light on a neglected health inequity. The Lancet 389, 10071 (2017), 771–773.",
      "doi": ""
    },
    {
      "text": "Uchechukwu KA Sampson, Robert M Kaplan, Richard S Cooper, Ana V Diez Roux, James S Marks, Michael M Engelgau, Emmanuel Peprah, Helena Mishoe, L Ebony Boulware, Kaytura L Felix, 2016. Reducing health inequities in the US: recommendations from the NHLBI’s Health Inequities Think Tank Meeting. Journal of the American College of Cardiology 68, 5(2016), 517–524.",
      "doi": ""
    },
    {
      "text": "Marilyn M Schapira, Mary Ann Gilligan, Timothy McAuliffe, Gwenn Garmon, Molly Carnes, and Ann B Nattinger. 2007. Decision-making at menopause: a randomized controlled trial of a computer-based hormone therapy decision-aid. Patient education and counseling 67, 1-2 (2007), 100–107.",
      "doi": ""
    },
    {
      "text": "Jessica Schroeder, Chia-Fang Chung, Daniel A. Epstein, Ravi Karkar, Adele Parsons, Natalia Murinova, James Fogarty, and Sean A. Munson. 2018. Examining Self-Tracking by People with Migraine: Goals, Needs, and Opportunities in a Chronic Health Condition. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 135–148. https://doi.org/10.1145/3196709.3196738",
      "doi": "10.1145/3196709.3196738"
    },
    {
      "text": "Jessica Schroeder, Ravi Karkar, Natalia Murinova, James Fogarty, and Sean A. Munson. 2019. Examining Opportunities for Goal-Directed Self-Tracking to Support Chronic Condition Management. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 4, Article 151 (Dec. 2019), 26 pages. https://doi.org/10.1145/3369809",
      "doi": "10.1145/3369809"
    },
    {
      "text": "Gita Sen and Piroska Östlin. 2008. Gender inequity in health: why it exists and how we can change it.",
      "doi": ""
    },
    {
      "text": "Annie D Smith, Alfred Muli, Kellogg J Schwab, and Julie Hennegan. 2020. National Monitoring for Menstrual Health and Hygiene: Is the Type of Menstrual Material Used Indicative of Needs Across 10 Countries?International Journal of Environmental Research and Public Health 17, 8(2020), 2633.",
      "doi": ""
    },
    {
      "text": "Marni Sommer, Jennifer S Hirsch, Constance Nathanson, and Richard G Parker. 2015. Comfortably, safely, and without shame: defining menstrual hygiene management as a public health issue. American Journal of Public Health 105, 7 (2015), 1302–1311.",
      "doi": ""
    },
    {
      "text": "S Sood, S Stevens, M Okumura, A Ramaiya, and M Hauer. 2020. Everywhere is Nowhere: A Systematic Review of Menstrual Health and Hygiene Management (MHHM) as a Human Right. (2020).",
      "doi": ""
    },
    {
      "text": "Katta Spiel. 2019. Body-positive computing as a means to counteract normative biases in fitness trackers. XRDS: Crossroads, The ACM Magazine for Students 25, 4 (2019), 34–37.",
      "doi": "10.1145/3331065"
    },
    {
      "text": "Katta Spiel, Oliver L Haimson, and Danielle Lottridge. 2019. How to do better with gender on surveys: a guide for HCI researchers. interactions 26, 4 (2019), 62–65.",
      "doi": "10.1145/3338283"
    },
    {
      "text": "Clay Spinuzzi. 2005. The methodology of participatory design. Technical communication 52, 2 (2005), 163–174.",
      "doi": ""
    },
    {
      "text": "Katarzyna Stawarz, Anna L Cox, and Ann Blandford. 2015. Beyond self-tracking and reminders: designing smartphone apps that support habit formation. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 2653–2662.",
      "doi": "10.1145/2702123.2702230"
    },
    {
      "text": "Elizabeth Stowell, Mercedes C Lyson, Herman Saksono, Reneé C Wurth, Holly Jimison, Misha Pavel, and Andrea G Parker. 2018. Designing and evaluating mHealth interventions for vulnerable populations: A systematic review. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3173574.3173589"
    },
    {
      "text": "Hyewon Suh, John R Porter, Alexis Hiniker, and Julie A Kientz. 2014. @ BabySteps: design and evaluation of a system for using twitter for tracking children’s developmental milestones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2279–2288.",
      "doi": "10.1145/2556288.2557386"
    },
    {
      "text": "Melanie Swan. 2009. Emerging patient-driven health care models: an examination of health social networks, consumer personalized medicine and quantified self-tracking. International journal of environmental research and public health 6, 2(2009), 492–525.",
      "doi": ""
    },
    {
      "text": "Mary Gayle Sweet, Tarin A Schmidt-Dalton, Patrice M Weiss, and Keith P Madsen. 2012. Evaluation and management of abnormal uterine bleeding in premenopausal women. American Family Physician 85, 1 (2012), 35–43.",
      "doi": ""
    },
    {
      "text": "Elena Toffol, Päivikki Koponen, Riitta Luoto, and Timo Partonen. 2014. Pubertal timing, menstrual irregularity, and mental health: results of a population-based study. Archives of Women’s mental Health 17, 2 (2014), 127–135.",
      "doi": ""
    },
    {
      "text": "Giulia Tomasello and Teresa Almeida. 2020. Empowerment and Self-Care: Designing for the Female Body. Crafting Anatomies: The Body as Site in Fashion and Textile Research Practice (2020).",
      "doi": ""
    },
    {
      "text": "Bonnie Tran and Lee Na Choi. 2018. Menstrual maze: A toy exploring public engagement in menstrual health education. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3170427.3180649"
    },
    {
      "text": "Amaury Trujillo and Maria Claudia Buzzi. 2016. Participatory User Requirements Elicitation for Personal Menopause App. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (Gothenburg, Sweden) (NordiCHI ’16). Association for Computing Machinery, New York, NY, USA, Article 102, 6 pages. https://doi.org/10.1145/2971485.2996737",
      "doi": "10.1145/2971485.2996737"
    },
    {
      "text": "Anupriya Tuli, Shaan Chopra, Neha Kumar, and Pushpendra Singh. 2018. Learning from and with Menstrupedia: Towards menstrual health education in India. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–20.",
      "doi": "10.1145/3274443"
    },
    {
      "text": "Anupriya Tuli, Shaan Chopra, Pushpendra Singh, and Neha Kumar. 2020. Menstrual (Im) Mobilities and Safe Spaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376653"
    },
    {
      "text": "Anupriya Tuli, Shruti Dalvi, Neha Kumar, and Pushpendra Singh. 2019. “It’sa girl thing” Examining Challenges and Opportunities around Menstrual Health Education in India. ACM Transactions on Computer-Human Interaction (TOCHI) 26, 5(2019), 1–24.",
      "doi": "10.1145/3325282"
    },
    {
      "text": "Agatha Tutia, Kelda Baljon, Lan Vu, and Daniela K Rosner. 2019. HCI and Menopause: Designing with and around the Aging Body. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3290607.3299066"
    },
    {
      "text": "Martijn Van der Eijk, Marjan J Faber, Johanna WM Aarts, Jan AM Kremer, Marten Munneke, and Bastiaan R Bloem. 2013. Using online health communities to deliver patient-centered care to people with chronic conditions. Journal of medical Internet research 15, 6 (2013), e115.",
      "doi": ""
    },
    {
      "text": "Joyce Varughese and Susan Richman. 2010. Cancer care inequity for women in resource-poor countries. Reviews in Obstetrics and Gynecology 3, 3 (2010), 122.",
      "doi": ""
    },
    {
      "text": "Tiffany C Veinot, Jessica S Ancker, Heather Cole-Lewis, Elizabeth D Mynatt, Andrea G Parker, Katie A Siek, and Lena Mamykina. 2019. Leveling up: on the potential of upstream health informatics interventions to enhance health equity. Medical care 57(2019), S108–S114.",
      "doi": ""
    },
    {
      "text": "Tiffany C Veinot, Hannah Mitchell, and Jessica S Ancker. 2018. Good intentions are not enough: how informatics interventions can worsen inequality. Journal of the American Medical Informatics Association 25, 8(2018), 1080–1088.",
      "doi": ""
    },
    {
      "text": "Alicia Williamson, Andrea Barbarin, Bettina Campbell, Terrance Campbell, Susan Franzen, Thomas M Reischl, Marc Zimmerman, Tiffany Christine Veinot, 2021. Uptake of and Engagement With an Online Sexual Health Intervention (HOPE eIntervention) Among African American Young Adults: Mixed Methods Study. Journal of medical Internet research 23, 7 (2021), e22203.",
      "doi": ""
    },
    {
      "text": "Zhijun Yan, Tianmei Wang, Yi Chen, and Han Zhang. 2016. Knowledge sharing in online health communities: A social exchange theory perspective. Information & management 53, 5 (2016), 643–653.",
      "doi": ""
    },
    {
      "text": "Alyson L Young and Andrew D Miller. 2019. ” This Girl is on Fire” Sensemaking in an Online Health Community for Vulvodynia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300359"
    },
    {
      "text": "Rhonda Zwingerman, Michael Chaikof, and Claire Jones. 2020. A Critical Appraisal of Fertility and Menstrual Tracking Apps for the iPhone. Journal of Obstetrics and Gynaecology Canada 42, 5 (2020), 583–590.",
      "doi": ""
    }
  ]
}