{
  "doi": "10.1145/3491102.3502106",
  "title": "Who am I, and who are you, and who are we? A Scientometric Analysis of Gender and Geography in HCI",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2022,
  "badges": [],
  "abstract": "Conference authorship, attendance and presentation is a key measure of quality in the HCI academic, yet we know conferences are not equally accessible for reasons that have nothing to do with quality. In this paper we examine two axes of diversity: gender, and geographic location (of both authors and conferences) and examine how they affect participation at major HCI conferences. Diversity in a group is associated with better outcomes from its work, and HCI has made numerous contributions to increasing representation in other communities. Reflecting on our own situation can produce recommendations for the planning of future HCI conferences, and identify challenges of representation that the HCI community should endeavor to address.",
  "tags": [
    "geography",
    "gender",
    "diversity",
    "Equity",
    "authorship in HCI"
  ],
  "authors": [
    {
      "name": "Dana McKay",
      "institution": "School of Computing Technologies, RMIT University, Australia",
      "img": "/do/10.1145/contrib-81361598975/rel-imgonly/dmckaycropped.jpg",
      "acmid": "81361598975",
      "orcid": "missing"
    },
    {
      "name": "Huiwen Zhang",
      "institution": "iSchool, University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659676750",
      "orcid": "missing"
    },
    {
      "name": "George Buchanan",
      "institution": "iSchool, University of Melbourne, Australia",
      "img": "/do/10.1145/contrib-81100456135/rel-imgonly/g5edit.jpg",
      "acmid": "81100456135",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amnesty International, 2018. Toxic Twitter. https://www.amnesty.org/en/latest/research/2018/03/online-violence-against-women-chapter-1/.",
      "doi": ""
    },
    {
      "text": "Andersen, J.P., Nielsen, M.W., Simone, N.L., Lewiss, R.E., and Jagsi, R., 2020. COVID-19 medical papers have fewer women first authors than expected. eLife 9(2020/06/15), e58807. DOI= http://dx.doi.org/10.7554/eLife.58807.",
      "doi": ""
    },
    {
      "text": "Bares, W., Manaris, B., and McCauley, R., 2018. Gender equity in computer science through computing in the arts – a six-year longitudinal study. Comp Sci Ed 28, 3 (2018/07/03), 191-210. DOI= http://dx.doi.org/10.1080/08993408.2018.1519322.",
      "doi": ""
    },
    {
      "text": "Bartneck, C. and Hu, J., 2010. The fruits of collaboration in a multidisciplinary field. Scientometrics 85, 1 (2010/10/01), 41-52. DOI= http://dx.doi.org/10.1007/s11192-010-0242-4.",
      "doi": ""
    },
    {
      "text": "Becker-Blease, J.R. and Sohl, J.E., 2007. Do women-owned businesses have equal access to angel capital? J Bus Venturing 22, 4 (2007/07/01/), 503-521. DOI= http://dx.doi.org/https://doi.org/10.1016/j.jbusvent.2006.06.003.",
      "doi": ""
    },
    {
      "text": "Bidwell, N.J., 2019. Women and the Spatial Politics of Community Networks: Invisible in the sociotechnical imaginary of wireless connectivity. In Proc. OzCHI 2020 (Fremantle, WA, Australia), Association for Computing Machinery, 197–208. DOI= http://dx.doi.org/10.1145/3369457.3369474.",
      "doi": "10.1145/3369457.3369474"
    },
    {
      "text": "Blum, L., Frieze, C., Hazzan, O., and Dias, M.B., 2007. A cultural perspective on gender diversity in computing. In Reconfiguring The Firewall, C.J. BURGER, E.G. CREAMER and P.S. MESZAROS Eds. CRC Press, Boca Raton, FL, 109-129.",
      "doi": ""
    },
    {
      "text": "Bogers, T. and Greifeneder, E., 2016. The iSchool community: A case study of iConference Reviews. In Proc. iConference 16 (Pittsburgh, PA), iSchools, Urbana-Champaign, IL. DOI= http://dx.doi.org/10.9776/16247.",
      "doi": ""
    },
    {
      "text": "Borghans, L., Heckman, J.J., Golsteyn, B.H.H., and Meijers, H., 2009. Gender Differences in Risk Aversion and Ambiguity Aversion. J Europ. Econ. Assn 7, 2-3, 649-658. DOI= http://dx.doi.org/10.1162/JEEA.2009.7.2-3.649 %J Journal of the European Economic Association.",
      "doi": ""
    },
    {
      "text": "Breslin, S. and Wadhwa, B., 2018. Gender and Human‐Computer Interaction. In The Wiley Handbook of Human Computer Interaction, K. NORMAN and J. KIRAKOWSKI Eds. Wiley, 71-87.",
      "doi": ""
    },
    {
      "text": "Brown, B., 2020. Notes on running an online academic conference or how we got zoombombed and lived to tell the tale. interactions 27, 16–21. DOI= http://dx.doi.org/10.1145/3406108.",
      "doi": ""
    },
    {
      "text": "Buchanan, G., Jones, M., and Marsden, G., 2002. Exploring Small Screen Digital Library Access with the Greenstone Digital Library Springer Berlin Heidelberg, Berlin, Heidelberg, 583-596.",
      "doi": ""
    },
    {
      "text": "Charlton, J.L., 1998. Nothing About Us Without Us: Disability Oppression and Empowerment. California University Press, Los Angeles, CA.",
      "doi": ""
    },
    {
      "text": "Cheong, M., Leins, K., and Coghlan, S., 2021. Computer Science Communities: Who is Speaking, and Who is Listening to the Women? Using an Ethics of Care to Promote Diverse Voices. In Proc. FAccT 21 (Virtual Event, Canada), Association for Computing Machinery, 106–115. DOI= http://dx.doi.org/10.1145/3442188.3445874.",
      "doi": ""
    },
    {
      "text": "Cohoon, J.M., Nigai, S., and Kaye, J., 2011. Gender and computing conference papers. Gender and computing conference papers 54, 8, 72-80.",
      "doi": ""
    },
    {
      "text": "Cook, T.E., Dimant, O.E., Novick, R., Adegbola, A., Blackstock, U., Drake, C.B., Patenaude, M.E., Ravenell, J.E., Radix, A., and Greene, R.E., 2020. Gendered Expectations: Strategies for Navigating Structural Challenges in Support of Transgender and Nonbinary Trainees in Academic Medicine. Acad. Med. 95, 5.",
      "doi": ""
    },
    {
      "text": "Correia, A., Paredes, H., and Fonseca, B., 2018. Scientometric analysis of scientific publications in CSCW. Scientometrics 114, 1 (2018/01/01), 31-89. DOI= http://dx.doi.org/10.1007/s11192-017-2562-0.",
      "doi": ""
    },
    {
      "text": "Cronin, B., 1998. Metatheorizing citation. Metatheorizing citation 43, 1, 45-55.",
      "doi": ""
    },
    {
      "text": "Dell, N. and Kumar, N., 2016. The Ins and Outs of HCI for Development. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems Association for Computing Machinery, San Hose, TX, 2220–2232. DOI= http://dx.doi.org/10.1145/2858036.2858081.",
      "doi": ""
    },
    {
      "text": "Dray, K.K., Smith, V.R.E., Kostecki, T.P., Sabat, I.E., and Thomson, C.R., 2020. Moving beyond the gender binary: Examining workplace perceptions of nonbinary and transgender employees. Gender Work and Organization 27, 6, 1181-1191. DOI= http://dx.doi.org/https://doi.org/10.1111/gwao.12455.",
      "doi": ""
    },
    {
      "text": "Dray, S.M., Peters, A.N., Brock, A.M., Peer, A., Druin, A., Gitau, S., Kumar, J., and Murray, D., 2013. Leveraging the progress of women in the HCI field to address the diversity chasm. In (Paris, France), Association for Computing Machinery, 2399–2406. DOI= http://dx.doi.org/10.1145/2468356.2468785.",
      "doi": ""
    },
    {
      "text": "Early, K., Hammer, J., Hofmann, M.K., Rode, J.A., Wong, A., and Mankoff, J., 2018. Understanding Gender Equity in Author Order Assignment. In (New York, NY), Article 46. DOI= http://dx.doi.org/10.1145/3274315.",
      "doi": ""
    },
    {
      "text": "Ferber, M.A. and Brün, M., 2011. The Gender Gap in Citations: Does It Persist? Feminist Economics 17, 1 (2011/01/01), 151-158. DOI= http://dx.doi.org/10.1080/13545701.2010.541857.",
      "doi": ""
    },
    {
      "text": "Fisher, C.B. and Anushko, A.E., 2008. Research ethics in social science. Research ethics in social science, 95-109.",
      "doi": ""
    },
    {
      "text": "Freed, D., Palmer, J., Minchala, D., Levy, K., Ristenpart, T., and Dell, N., 2018. \"A Stalker's Paradise\": How Intimate Partner Abusers Exploit Technology. In Proc. CHI 18 (Montreal QC, Canada), ACM, New York, NY, 1-13. DOI= http://dx.doi.org/10.1145/3173574.3174241.",
      "doi": ""
    },
    {
      "text": "Frenken, K., Hardeman, S., and Hoekman, J., 2009. Spatial scientometrics: Towards a cumulative research program. J Infometrics 3, 3 (2009/07/01/), 222-232. DOI= http://dx.doi.org/https://doi.org/10.1016/j.joi.2009.03.005.",
      "doi": ""
    },
    {
      "text": "Graham, M., Hale, S., and Stephens, M., 2012. Featured graphic: Digital divide: the geography of Internet access. Env & Plan A 44, 5, 1009-1010. DOI= http://dx.doi.org/10.1068/a44497.",
      "doi": ""
    },
    {
      "text": "Guarino, C.M. and Borden, V.M., 2017. Faculty service loads and gender: Are women taking care of the academic family? Res Higher Ed 58, 6, 672-694.",
      "doi": ""
    },
    {
      "text": "Haines, C.D., Rose, E.M., Odom, K.J., and Omland, K.E., 2020. The role of diversity in science: a case study of women advancing female birdsong research. Animal Behaviour 168(2020/10/01/), 19-24. DOI= http://dx.doi.org/https://doi.org/10.1016/j.anbehav.2020.07.021.",
      "doi": ""
    },
    {
      "text": "Harrison, R., 2010. Unique benefits of conference attendance as a method of professional development for LIS professionals. Unique benefits of conference attendance as a method of professional development for LIS professionals 59, 3-4, 263-270.",
      "doi": ""
    },
    {
      "text": "Hezelgrave, N.L., Whitty, C.J.M., Shennan, A.H., and Chappell, L.C., 2011. Advising on travel during pregnancy. BMJ 342, d2506. DOI= http://dx.doi.org/10.1136/bmj.d2506 %J BMJ.",
      "doi": ""
    },
    {
      "text": "Himmelsbach, J., Schwarz, S., Gerdenitsch, C., Wais-Zechmann, B., Bobeth, J., and Tscheligi, M., 2019. Do We Care About Diversity in Human Computer Interaction: A Comprehensive Content Analysis on Diversity Dimensions in Research. In (Glasgow, Scotland Uk), Association for Computing Machinery, Paper 490. DOI= http://dx.doi.org/10.1145/3290605.3300720.",
      "doi": ""
    },
    {
      "text": "Holman, L., Stuart-Fox, D., and Hauser, C.E., 2018. The gender gap in science: How long until women are equally represented? PLoS Biology 16, 4, e2004956. DOI= http://dx.doi.org/10.1371/journal.pbio.2004956.",
      "doi": ""
    },
    {
      "text": "Honing, S., 2012. Does diversity in executive boards make a difference? . Does diversity in executive boards make a difference? .",
      "doi": ""
    },
    {
      "text": "Jain, D., Desjardins, A., Findlater, L., and Froehlich, J.E., 2019. Autoethnography of a Hard of Hearing Traveler. In Proc. SIGACCESS 19 (Pittsburgh, PA, USA), Association for Computing Machinery, 236–248. DOI= http://dx.doi.org/10.1145/3308561.3353800.",
      "doi": ""
    },
    {
      "text": "Johnson, D.G. and Miller, K.W., 2002. Is diversity in computing a moral matter? SIGSCE Bull. 34, 9–10. DOI= http://dx.doi.org/10.1145/543812.543814.",
      "doi": "10.1145/543812.543814"
    },
    {
      "text": "Kaatz, A., Gutierrez, B., and Carnes, M., 2014. Threats to objectivity in peer review: the case of gender. Trends Pharmacol Sci 35, 8, 371-373. DOI= http://dx.doi.org/10.1016/j.tips.2014.06.005.",
      "doi": ""
    },
    {
      "text": "Kalia, V., Srinivasan, A., Wilkins, L., and Luker, G.D., 2020. Adapting Scientific Conferences to the Realities Imposed by COVID-19. Radiol Imaging Cancer 2, 4. DOI= http://dx.doi.org/10.1148/rycan.2020204020.",
      "doi": ""
    },
    {
      "text": "Kiiski, S. and Pohjola, M., 2002. Cross-country diffusion of the Internet. Info Econ Pol 14, 2 (2002/06/01/), 297-310. DOI= http://dx.doi.org/https://doi.org/10.1016/S0167-6245(01)00071-3.",
      "doi": ""
    },
    {
      "text": "King, M.M., Bergstrom, C.T., Correll, S.J., Jacquet, J., and West, J.D., 2017. Men Set Their Own Cites High: Gender and Self-citation across Fields and over Time. Socius 3(2017/01/01), 2378023117738903. DOI= http://dx.doi.org/10.1177/2378023117738903.",
      "doi": ""
    },
    {
      "text": "Klawe, M., 2013. Increasing Female Participation in Computing: The Harvey Mudd College Story. IEEE Computer 46, 3, 56-58. DOI= http://dx.doi.org/10.1109/MC.2013.4.",
      "doi": "10.1109/MC.2013.4"
    },
    {
      "text": "Knobloch-Westerwick, S., Glynn, C.J., and Huge, M., 2013. The Matilda Effect in Science Communication:An Experiment on Gender Bias in Publication Quality Perceptions and Collaboration Interest. Sci Comm 35, 5, 603-625. DOI= http://dx.doi.org/10.1177/1075547012472684.",
      "doi": ""
    },
    {
      "text": "Larson, S., 2016. Research shows gender bias in Google's voice recognition, The Daily Dot. Complex Media Inc., San Francisco, CA, https://www.dailydot.com/debug/google-voice-recognition-gender-bias/.",
      "doi": ""
    },
    {
      "text": "Leitão, R., 2019. Anticipating Smart Home Security and Privacy Threats with Survivors of Intimate Partner Abuse. In Proc. DIS 19 (San Diego, CA, USA), Association for Computing Machinery, 527–539. DOI= http://dx.doi.org/10.1145/3322276.3322366.",
      "doi": "10.1145/3322276.3322366"
    },
    {
      "text": "Levy, K. and Schneier, B., 2020. Privacy threats in intimate relationships. J Cybersec 6, 1. DOI= http://dx.doi.org/10.1093/cybsec/tyaa006.",
      "doi": ""
    },
    {
      "text": "Ley, T.J. and Hamilton, B.H., 2008. The Gender Gap in NIH Grant Applications. Science 322, 5907, 1472-1474. DOI= http://dx.doi.org/10.1126/science.1165878.",
      "doi": ""
    },
    {
      "text": "Madera, J.M., Hebl, M.R., and Martin, R.C., 2009. Gender and letters of recommendation for academia: Agentic and communal differences American Psychological Association, 1591-1599. DOI= http://dx.doi.org/10.1037/a0016539.",
      "doi": ""
    },
    {
      "text": "Margolis, J. and Fisher, A., 2003. Unlocking the clubhouse: Women in computing. MIT press.",
      "doi": ""
    },
    {
      "text": "Maritsch, M., Föll, S., Lehmann, V., Bérubé, C., Kraus, M., Feuerriegel, S., Kowatsch, T., Züger, T., Stettler, C., Fleisch, E., and Wortmann, F., 2020. Towards Wearable-based Hypoglycemia Detection and Warning in Diabetes. In Proc. CHI 2020 (Honolulu, HI, USA), Association for Computing Machinery, 1–8. DOI= http://dx.doi.org/10.1145/3334480.3382808.",
      "doi": ""
    },
    {
      "text": "Marsden, G., llda Ladeira, l.L., Reitmaier, T., Bidwell, N.J., and Blake, E., 2010. Digital Storytelling in Africa. Int J Comput(2010-12-20), 9.",
      "doi": ""
    },
    {
      "text": "Matthews, T., O'Leary, K., Turner, A., Sleeper, M., Woelfer, J.P., Shelton, M., Manthorne, C., Churchill, E.F., and Consolvo, S., 2017. Stories from Survivors: Privacy & Security Practices when Coping with Intimate Partner Abuse. In Proc. CHI 17 (Denver, Colorado, USA), ACM, New York NY, 2189-2201. DOI= http://dx.doi.org/10.1145/3025453.3025875.",
      "doi": ""
    },
    {
      "text": "McKay, D. and Buchanan, G., 2019. Shaking the Tree: Understanding Historic and Future Representation of Women at OzCHI. In (Fremantle, WA, Australia), Association for Computing Machinery, 412–417. DOI= http://dx.doi.org/10.1145/3369457.3369504.",
      "doi": ""
    },
    {
      "text": "McKay, D. and Miller, C., 2021. Standing in the Way of Control: A Call to Action to Prevent Abuse through Better Design of Smart Technologies. In Proc. CHI 21, Association for Computing Machinery, Article 332. DOI= http://dx.doi.org/10.1145/3411764.3445114.",
      "doi": ""
    },
    {
      "text": "McLeod, P.L., Lobel, S.A., and Cox Jr, T.H., 1996. Ethnic diversity and creativity in small groups. Small Group Reseach 27, 2, 248-264.",
      "doi": ""
    },
    {
      "text": "Mengel, F., Sauermann, J., and Zölitz, U., 2018. Gender bias in teaching evaluations. J Europ Econ Assn 17, 2, 535-566.",
      "doi": ""
    },
    {
      "text": "Misa, C., Guse, D., Hohlfeld, O., Durairajan, R., Sperotto, A., Dainotti, A., and Rejaie, R., 2020. Lessons learned organizing the PAM 2020 virtual conference. SIGCOMM Comput. Commun. Rev. 50, SIGCOMM Comput. Commun. Rev., 46–54. DOI= http://dx.doi.org/10.1145/3411740.3411747.",
      "doi": "10.1145/3411740.3411747"
    },
    {
      "text": "Munafo, J., Diedrick, M., and Stoffregen, T.A., 2017. The virtual reality head-mounted display Oculus Rift induces motion sickness and is sexist in its effects. Experimental Brain Research 235, 3, 889-901.",
      "doi": ""
    },
    {
      "text": "Myers, K.R., Tham, W.Y., Yin, Y., Cohodes, N., Thursby, J.G., Thursby, M.C., Schiffer, P., Walsh, J.T., Lakhani, K.R., and Wang, D., 2020. Unequal effects of the COVID-19 pandemic on scientists. Nat Hum Behav 4, 9 (2020/09/01), 880-883. DOI= http://dx.doi.org/10.1038/s41562-020-0921-y.",
      "doi": ""
    },
    {
      "text": "Nichols, D.M. and Cunningham, S.J., 2015. A scientometric analysis of 15 years of CHINZ conferences. In Proc. CHINZ 15 (Hamilton, New Zealand), ACM, New York, NY, 73-80. DOI= http://dx.doi.org/10.1145/2808047.2808060.",
      "doi": ""
    },
    {
      "text": "Nikou, S., 2019. Factors driving the adoption of smart home technology: An empirical assessment. Telematics and Informatics 45(2019/12/01/), 101283. DOI= http://dx.doi.org/https://doi.org/10.1016/j.tele.2019.101283.",
      "doi": ""
    },
    {
      "text": "Niner, H.J., Johri, S., Meyer, J., and Wassermann, S.N., 2020. The pandemic push: can COVID-19 reinvent conferences to models rooted in sustainability, equitability and inclusion? Socio-Ecological Prac Res 2, 3 (2020/09/01), 253-256. DOI= http://dx.doi.org/10.1007/s42532-020-00059-y.",
      "doi": ""
    },
    {
      "text": "Offenwanger, A., Milligan, A.J., Chang, M., Bullard, J., and Yoon, D., 2021. Diagnosing Bias in the Gender Representation of HCI Research Participants: How it Happens and Where We Are. In Proc. CHI 21 (Yokohama, Japan), ACM, New York, Article 399. DOI= http://dx.doi.org/10.1145/3411764.3445383.",
      "doi": ""
    },
    {
      "text": "Ogbonnaya-Ogburu, I.F., Smith, A.D.R., To, A., and Toyama, K., 2020. Critical Race Theory for HCI. In Proc. CHI 20, Association for Computing Machinery, 1–16. DOI= http://dx.doi.org/10.1145/3313831.3376392.",
      "doi": ""
    },
    {
      "text": "Oliu-Barton, M., Pradelski, B.S.R., Aghion, P., Artus, P., Kickbusch, I., Lazarus, J.V., Sridhar, D., and Vanderslott, S., 2021. SARS-CoV-2 elimination, not mitigation, creates best outcomes for health, the economy, and civil liberties. The Lancet 397, 10291, 2234-2236. DOI= http://dx.doi.org/10.1016/S0140-6736(21)00978-8.",
      "doi": ""
    },
    {
      "text": "Ortu, M., Destefanis, G., Counsell, S., Swift, S., Tonelli, R., and Marchesi, M., 2017. How diverse is your team? Investigating gender and nationality diversity in GitHub teams. J Software Eng Res Dev 5, 1 (2017/12/20), 9. DOI= http://dx.doi.org/10.1186/s40411-017-0044-y.",
      "doi": ""
    },
    {
      "text": "Pande, R. and Ford, D., 2012. Gender Quotas and Female Leadership. World Bank",
      "doi": ""
    },
    {
      "text": "Peng, Y.-H., Yu, C., Liu, S.-H., Wang, C.-W., Taele, P., Yu, N.-H., and Chen, M.Y., 2020. WalkingVibe: Reducing Virtual Reality Sickness and Improving Realism while Walking in VR using Unobtrusive Head-mounted Vibrotactile Feedback. In (Honolulu, HI, USA), Association for Computing Machinery, 1–12. DOI= http://dx.doi.org/10.1145/3313831.3376847.",
      "doi": ""
    },
    {
      "text": "Perez, C.C., 2019. Invisible women: Exposing data bias in a world designed for men. Random House.",
      "doi": ""
    },
    {
      "text": "Pinho-Gomes, A.-C., Peters, S., Thompson, K., Hockham, C., Ripullone, K., Woodward, M., and Carcel, C., 2020. Where are the women? Gender inequalities in COVID-19 research authorship. BMJ Global Health 5, 7, e002922. DOI= http://dx.doi.org/10.1136/bmjgh-2020-002922.",
      "doi": ""
    },
    {
      "text": "Power, K., 2020. The COVID-19 pandemic has increased the care burden of women and families. Sustainability: Science, Practice and Policy 16, 1 (2020/12/10), 67-73. DOI= http://dx.doi.org/10.1080/15487733.2020.1776561.",
      "doi": ""
    },
    {
      "text": "Radford, J. and Holdstock, L., 1995. Gender Differences in Higher Education Aims between Computing and Psychology Students. Res Sci Tech Ed 13, 2 (1995/11/01), 163-176. DOI= http://dx.doi.org/10.1080/0263514950130206.",
      "doi": ""
    },
    {
      "text": "Rankin, Y.A. and Thomas, J.O., 2019. Straighten up and fly right: rethinking intersectionality in HCI research. interactions 26, 6, 64–68. DOI= http://dx.doi.org/10.1145/3363033.",
      "doi": ""
    },
    {
      "text": "Rankin, Y.A. and Thomas, J.O., 2020. The Intersectional Experiences of Black Women in Computing. In Proc. SIGCSE 20 (Portland, OR, USA), Association for Computing Machinery, 199–205. DOI= http://dx.doi.org/10.1145/3328778.3366873.",
      "doi": ""
    },
    {
      "text": "Rapp, A., Cena, F., Mattutino, C., Boella, G., Schifanella, C., Keller, R., and Brighenti, S., 2019. Designing an Urban Support for Autism. In Proc. MobileHCI (Taipei, Taiwan), Association for Computing Machinery, Article 43. DOI= http://dx.doi.org/10.1145/3338286.3344390.",
      "doi": ""
    },
    {
      "text": "Rello, L. and Baeza-Yates, R., 2013. Good fonts for dyslexia. In Proc. SIGACCESS (Bellevue, Washington), Association for Computing Machinery, Article 14. DOI= http://dx.doi.org/10.1145/2513383.2513447.",
      "doi": ""
    },
    {
      "text": "Robertson, M., Newell, S., Swan, J., Mathiassen, L., and Bjerknes, G., 2001. The issue of gender within computing: reflections from the UK and Scandinavia. Info Sys J 11, 2 (2001/04/01), 111-126. DOI= http://dx.doi.org/10.1046/j.1365-2575.2001.00098.x.",
      "doi": ""
    },
    {
      "text": "Rode, J.A., 2011. A theoretical agenda for feminist HCI. Interacting With Computers 23, 5, 393-400.",
      "doi": "10.1016/j.intcom.2011.04.005"
    },
    {
      "text": "Rodger, J.A. and Pendharkar, P.C., 2004. A field study of the impact of gender and user's technical experience on the performance of voice-activated medical tracking application. Int J Hum Comp Studies 60, 5-6, 529-544.",
      "doi": ""
    },
    {
      "text": "Roser, M. and Ortiz-Ospina, E., 2013. Tertiary Education. Our World In Data.",
      "doi": ""
    },
    {
      "text": "Rowe, N., 2018. 'When You Get What You Want, but Not What You Need': The Motivations, Affordances and Shortcomings of Attending Academic/Scientific Conferences. Int J Res Educ Sci 4, 2, 714-729.",
      "doi": ""
    },
    {
      "text": "Sambasivan, N., Batool, A., Ahmed, N., Matthews, T., Thomas, K., Gaytán-Lugo, L.S., Nemer, D., Bursztein, E., Churchill, E., and Consolvo, S., 2019. \"They Don't Leave Us Alone Anywhere We Go\": Gender and Digital Abuse in South Asia. In Proc. CHI 19 (Glasgow, Scotland Uk), Association for Computing Machinery, Paper 2. DOI= http://dx.doi.org/10.1145/3290605.3300232.",
      "doi": ""
    },
    {
      "text": "Sax, L.J., Lehman, K.J., Jacobs, J.A., Kanny, M.A., Lim, G., Monje-Paulson, L., and Zimmerman, H.B., 2017. Anatomy of an Enduring Gender Gap: The Evolution of Women's Participation in Computer Science. J Higher Ed 88, 2 (2017/03/04), 258-293. DOI= http://dx.doi.org/10.1080/00221546.2016.1257306.",
      "doi": ""
    },
    {
      "text": "Shin, S.J., Kim, T.-Y., Lee, J.-Y., and Bian, L., 2012. Cognitive team diversity and individual team member creativity: A cross-level interaction. Academy Manag J 55, 1, 197-212.",
      "doi": ""
    },
    {
      "text": "Siegel, D.P., 2019. Transgender experiences and transphobia in higher education. Sociology Compass 13, 10 (2019/10/01), e12734. DOI= http://dx.doi.org/https://doi.org/10.1111/soc4.12734.",
      "doi": ""
    },
    {
      "text": "Slupska, J., 2019. Safe at home: Towards a feminist critique of cybersecurity. St Anthony's International Review 15, 1, 83-100.",
      "doi": ""
    },
    {
      "text": "Spiel, K., Haimson, O.L., and Lottridge, D., 2019. How to do better with gender on surveys: a guide for HCI researchers. interactions 26, 4, 62–65. DOI= http://dx.doi.org/10.1145/3338283.",
      "doi": ""
    },
    {
      "text": "Tamblyn, R., Girard, N., Qian, C.J., and Hanley, J., 2018. Assessment of potential bias in research grant peer review in Canada. CMAJ 190, 16, E489-E499. DOI= http://dx.doi.org/10.1503/cmaj.170901.",
      "doi": ""
    },
    {
      "text": "Timperley, C., Sutherland, K.A., Wilson, M., and Hall, M., 2020. He moana pukepuke: navigating gender and ethnic inequality in early career academics’ conference attendance. Gender and Education 32, 1 (2020/01/02), 11-26. DOI= http://dx.doi.org/10.1080/09540253.2019.1633464.",
      "doi": ""
    },
    {
      "text": "Tomkins, A., Zhang, M., and Heavlin, W.D., 2017. Reviewer bias in single- versus double-blind peer review. PNAS 114, 48, 12708-12713. DOI= http://dx.doi.org/10.1073/pnas.1707323114.",
      "doi": ""
    },
    {
      "text": "Tregenza, T., 2002. Gender bias in the refereeing process? Trends in Ecology and Evolution 17, 8, 349-350.",
      "doi": ""
    },
    {
      "text": "Vandenberghe, B. and Slegers, K., 2016. Designing for Others, and the Trap of HCI Methods & Practices. In Proc. CHI 2016 (San Jose, California, USA), Association for Computing Machinery, 512–524. DOI= http://dx.doi.org/10.1145/2851581.2892584.",
      "doi": ""
    },
    {
      "text": "Wang, W., Bai, X., Xia, F., Bekele, T.M., Su, X., and Tolba, A., 2017. From triadic closure to conference closure: the role of academic conferences in promoting scientific collaborations. Scientometrics 113, 1 (2017/10/01), 177-193. DOI= http://dx.doi.org/10.1007/s11192-017-2468-x.",
      "doi": ""
    },
    {
      "text": "Weissmann, J., 2013. The brogrammer effect: women are a small (and shrinking) share of computer workers. In The Atlantic Emerson Collective, Boston, MA.",
      "doi": ""
    },
    {
      "text": "West, J.D., Jacquet, J., King, M.M., Correll, S.J., and Bergstrom, C.T., 2013. The Role of Gender in Scholarly Authorship. PloS ONE 8, 7, e66212. DOI= http://dx.doi.org/10.1371/journal.pone.0066212.",
      "doi": ""
    },
    {
      "text": "Wilson, C., McNaney, R., Roper, A., Capel, T., Scheepmaker, L., Brereton, M., Wilson, S., Green, D.P., and Wallace, J., 2020. Rethinking Notions of 'Giving Voice' in Design. In Proc. CHI EA 2020 (Honolulu, HI, USA), Association for Computing Machinery, 1–8. DOI= http://dx.doi.org/10.1145/3334480.3375171.",
      "doi": ""
    },
    {
      "text": "Zhang, S.-j., Lyu, P.-h., and Yan, Y., 2015. Global geographical and scientometric analysis of tourism-themed research. Scientometrics 105, 1 (2015/10/01), 385-401. DOI= http://dx.doi.org/10.1007/s11192-015-1678-3.",
      "doi": ""
    }
  ]
}