{
  "doi": "10.1145/3491102.3517595",
  "title": "Does Mode of Digital Contact Tracing Affect User Willingness to Share Information? A Quantitative Study",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "Digital contact tracing can limit the spread of infectious diseases. Nevertheless, barriers remain to attain sufficient adoption. In this study, we investigate how willingness to participate in contact tracing is affected by two critical factors: the modes of data collection and the type of data collected. We conducted a scenario-based survey study among 220 respondents in the United States (U.S.) to understand their perceptions about contact tracing associated with automated and manual contact tracing methods. The findings indicate a promising use of smartphones and a combination of public health officials and medical health records as information sources. Through a quantitative analysis, we describe how different modalities and individual demographic factors may affect user compliance when participants are asked to provide four key information pieces for contact tracing.",
  "tags": [
    "contact tracing",
    "trust",
    "public health",
    "willingness",
    "pandemic"
  ],
  "authors": [
    {
      "name": "Camellia Zakaria",
      "institution": "College of Information & Computer Sciences, University of Massachusetts Amherst, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659051183",
      "orcid": "missing"
    },
    {
      "name": "Pin Sym Foong",
      "institution": "Saw Swee Hock School of Public Health, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414606008",
      "orcid": "missing"
    },
    {
      "name": "Chang Siang Lim",
      "institution": "Future Health Technologies, Singapore ETH Center, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234908",
      "orcid": "missing"
    },
    {
      "name": "Pavithren V. S. Pakianathan",
      "institution": "Singapore University of Technology and Design, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659661905",
      "orcid": "missing"
    },
    {
      "name": "Gerald Huat Choon Koh",
      "institution": "Saw Swee Hock School of Public Health, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529047",
      "orcid": "missing"
    },
    {
      "name": "Simon Tangi Perrault",
      "institution": "Singapore University of Technology and Design, Singapore",
      "img": "/do/10.1145/contrib-81484656821/rel-imgonly/simon_perrault.jpg",
      "acmid": "81484656821",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "[1] Altmann, S., Milsom, L., Zillessen, H., Blasone, R., Gerdon, F., Bach, R., Kreuter, F., Nosenzo, D., Toussaert, S., and Abeler, J. Acceptability of app-based contact tracing for covid-19: Cross-country survey study. JMIR mHealth and uHealth, 8(8):e19857, 2020.",
      "doi": ""
    },
    {
      "text": "[2] American Academy of Family Physicians. Covid-19 vaccine.",
      "doi": ""
    },
    {
      "text": "[3] Association of Public Health Laboratories. Exposure notifications, 2020.",
      "doi": ""
    },
    {
      "text": "[4] Bausell, R. B. and Li, Y.-F. Power analysis for experimental research: a practical guide for the biological, medical and social sciences. Cambridge University Press, 2002.",
      "doi": ""
    },
    {
      "text": "[5] Bentley, F. R., Peesapati, S. T., and Church, K. ” i thought she would like to read it” exploring sharing behaviors in the context of declining mobile web use. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, pages 1893–1903, 2016.",
      "doi": ""
    },
    {
      "text": "[6] Braithwaite, I., Callender, T., Bullock, M., and Aldridge, R. W. Automated and partly automated contact tracing: a systematic review to inform the control of covid-19. The Lancet Digital Health, 2020.",
      "doi": ""
    },
    {
      "text": "[7] Braun, V. and Clarke, V. Using thematic analysis in psychology. Qualitative research in psychology, 3(2):77–101, 2006.",
      "doi": ""
    },
    {
      "text": "[8] Centers for Disease Control and Prevention. 2020 case counts in the us.",
      "doi": ""
    },
    {
      "text": "[9] Centers for Disease Control and Prevention. Case investigation and contact tracing: Part of a multipronged approach to fight the covid-19 pandemic, 2020.",
      "doi": ""
    },
    {
      "text": "[10] Centers for Disease Control and Prevention. Digital contact tracing tools, 2020.",
      "doi": ""
    },
    {
      "text": "[11] Centers for Disease Control and Prevention. Preliminary criteria for the evaluation of digital contact tracing tools for covid-19, 2020.",
      "doi": ""
    },
    {
      "text": "[12] Centers for Disease Control and Prevention. Training case investigators and contact tracers, 2021.",
      "doi": ""
    },
    {
      "text": "[13] Davis, S. Contact tracing apps: Extra risks for women and marginalized groups. Health and Human Rights Journal, 2020.",
      "doi": ""
    },
    {
      "text": "[14] Ferretti, L., Wymant, C., Kendall, M., Zhao, L., Nurtay, A., Abeler-Dörner, L., Parker, M., Bonsall, D., and Fraser, C. Quantifying sars-cov-2 transmission suggests epidemic control with digital contact tracing. Science, 368(6491), 2020.",
      "doi": ""
    },
    {
      "text": "[15] Gillmor, D. K. Principles for technology-assisted contact-tracing. ACLU white paper, 2020.",
      "doi": ""
    },
    {
      "text": "[16] Google. Exposure notifications: Using technology to help public health authorities fight covid‑19.",
      "doi": ""
    },
    {
      "text": "[17] Government of Singapore. Tracetogether, safer together, 2020.",
      "doi": ""
    },
    {
      "text": "[18] Hassandoust, F., Akhlaghpour, S., and Johnston, A. C. Individuals’ privacy concerns and adoption of contact tracing mobile applications in a pandemic: A situational privacy calculus perspective. Journal of the American Medical Informatics Association, 28(3):463–471, 2021.",
      "doi": ""
    },
    {
      "text": "[19] James, G., Witten, D., Hastie, T., and Tibshirani, R. An introduction to statistical learning, volume 112. Springer, 2013.",
      "doi": ""
    },
    {
      "text": "[20] Jonker, M., de Bekker-Grob, E., Veldwijk, J., Goossens, L., Bour, S., and Rutten-Van Mölken, M. Covid-19 contact tracing apps: Predicted uptake in the netherlands based on a discrete choice experiment. JMIR mHealth and uHealth, 8(10):e20741, 2020.",
      "doi": ""
    },
    {
      "text": "[21] Kahn, J. P. et al. Digital contact tracing for pandemic response: Ethics and governance guidance. Johns Hopkins University Press, 2020.",
      "doi": ""
    },
    {
      "text": "[22] Kaptchuk, G., Goldstein, D. G., Hargittai, E., Hofman, J., and Redmiles, E. M. How good is good enough for covid19 apps. The influence of benefits, accuracy, and privacy on willingness to adopt, 2020.",
      "doi": ""
    },
    {
      "text": "[23] Keeling, M. J., Hollingsworth, T. D., and Read, J. M. Efficacy of contact tracing for the containment of the 2019 novel coronavirus (covid-19). J Epidemiol Community Health, 74(10):861–866, 2020.",
      "doi": ""
    },
    {
      "text": "[24] Kretzschmar, M. E., Rozhnova, G., Bootsma, M. C., van Boven, M., van de Wijgert, J. H., and Bonten, M. J. Impact of delays on effectiveness of contact tracing strategies for covid-19: a modelling study. The Lancet Public Health, 5(8):e452–e459, 2020.",
      "doi": ""
    },
    {
      "text": "[25] Larus, J. et al. Joint statement on contact tracing: Date 19th april 2020, 2020.",
      "doi": ""
    },
    {
      "text": "[26] Lee, B. and Raszka, W. V. Covid-19 transmission and children: the child is not to blame. Pediatrics, 146(2), 2020.",
      "doi": ""
    },
    {
      "text": "[27] Lewis, N. M., Chu, V. T., Ye, D., Conners, E. E., Gharpure, R., Laws, R. L., Reses, H. E., Freeman, B. D., Fajans, M., Rabold, E. M., et al. Household transmission of sars-cov-2 in the united states. Clinical infectious diseases: an official publication of the Infectious Diseases Society of America, 2020.",
      "doi": ""
    },
    {
      "text": "[28] Li, C., Chen, L. J., Chen, X., Zhang, M., Pang, C. P., and Chen, H. Retrospective analysis of the possibility of predicting the covid-19 outbreak from internet searches and social media data, china, 2020. Eurosurveillance, 25(10):2000199, 2020.",
      "doi": ""
    },
    {
      "text": "[29] Lockey, S., Edwards, M. R., Hornsey, M. J., Gillespie, N., Akhlaghpour, S., and Colville, S. Profiling adopters (and non-adopters) of a contact tracing mobile application: insights from australia. International Journal of Medical Informatics, 149:104414, 2021.",
      "doi": ""
    },
    {
      "text": "[30] Lu, T. and Reis, B. Y. Internet search patterns reveal clinical course of covid-19 disease progression and pandemic spread across 32 countries. NPJ digital medicine, 4(1):1–9, 2021.",
      "doi": ""
    },
    {
      "text": "[31] Mayer, R. C., Davis, J. H., and Schoorman, F. D. An integrative model of organizational trust. Academy of management review, 20(3):709–734, 1995.",
      "doi": ""
    },
    {
      "text": "[32] McClain, C. and Rainie, L. The challenges of contact tracing as us battles covid-19. Pew research center, 2020.",
      "doi": ""
    },
    {
      "text": "[33] McKnight, D. H., Choudhury, V., and Kacmar, C. Developing and validating trust measures for e-commerce: An integrative typology. Information systems research, 13(3):334–359, 2002.",
      "doi": ""
    },
    {
      "text": "[34] Megnin-Viggars, O., Carter, P., Melendez-Torres, G., Weston, D., and Rubin, G. J. Facilitators and barriers to engagement with contact tracing during infectious disease outbreaks: A rapid review of the evidence. PloS one, 15(10):e0241473, 2020.",
      "doi": ""
    },
    {
      "text": "[35] Metlay, J. P., Haas, J. S., Soltoff, A. E., and Armstrong, K. A. Household transmission of sars-cov-2. JAMA Network Open, 4(2):e210304–e210304, 2021.",
      "doi": ""
    },
    {
      "text": "[36] Michael, M., Amanda, M.-F., Sara, C., Erin E, D., and Pounders, K. Health literacy and health information technology adoption: The potential for a new digital divide. Journal of Medical Internet Research, (10):e264, 2016.",
      "doi": ""
    },
    {
      "text": "[37] Michaud, C. Global burden of infectious diseases. Encyclopedia of Microbiology, page 444, 2009.",
      "doi": ""
    },
    {
      "text": "[38] National Academy for State Health Policy. State approaches to contact tracing during the covid-19 pandemic.",
      "doi": ""
    },
    {
      "text": "[39] Njozing, B. N., Edin, K. E., San Sebastián, M., and Hurtig, A.-K. ” if the patients decide not to tell what can we do?”-tb/hiv counsellors’ dilemma on partner notification for hiv. BMC international health and human rights, 11(1):1–11, 2011.",
      "doi": ""
    },
    {
      "text": "[40] NOVID. New feature: 100% anonymous contact tracing, 2020.",
      "doi": ""
    },
    {
      "text": "[41] Nurgalieva, L., Ryan, S., and Doherty, G. Attitudes towards covid-19 contact tracing apps: a cross-national survey. IEEE Access, 2021.",
      "doi": ""
    },
    {
      "text": "[42] Perez-Fuentes, M. D. C., Molero Jurado, M. d. M., Oropesa Ruiz, N. F., Martos Martinez, A., Simon Marquez, M. d. M., Herrera-Peco, I., and Gazquez Linares, J. J. Questionnaire on perception of threat from covid-19. Journal of Clinical Medicine, 9(4):1196, 2020.",
      "doi": ""
    },
    {
      "text": "[43] Peterman, T. A., Toomey, K. E., Dicker, L. W., Zaidi, A. A., Wroten, J. E., and Carolina, J. Partner notification for syphilis: a randomized, controlled trial of three approaches. Sexually transmitted diseases, 24(9):511–518, 1997.",
      "doi": ""
    },
    {
      "text": "[44] Peterson, R. Constructing Effective Questionnaires. SAGE Publications, Inc., 2455 Teller Road, Thousand Oaks California 91320 United States, 2000.",
      "doi": ""
    },
    {
      "text": "[45] Pew Research Center. Key findings about americans’ views on covid-19 contact tracing.",
      "doi": ""
    },
    {
      "text": "[46] Pew Research Center. Mobile fact sheet.",
      "doi": ""
    },
    {
      "text": "[47] Phelan, C., Lampe, C., and Resnick, P. It’s creepy, but it doesn’t bother me. Proceedings of the 2016 CHI conference on human factors in computing systems, pages 5240–5251, 2016.",
      "doi": ""
    },
    {
      "text": "[48] Qualtrics. Qualtrics. Available at: https://www.qualtrics.com.",
      "doi": ""
    },
    {
      "text": "[49] Rajae, T., Emilien, S., Seth M, H., Stéphanie, V., Pierre, A., Francis, G., Dominuque, R., Alexandra, R., Anne-Déborah, B., and Julien, M. Early acceptability of a mobile app for contact tracing during the covid-19 pandemic in france: National web-based survey. JMIR mHealth and uHealth, (7):e27768, 2021.",
      "doi": ""
    },
    {
      "text": "[50] Redmiles, E. M. User concerns & tradeoffs in technology-facilitated contact tracing. arXiv preprint arXiv:2004.13219, 2020.",
      "doi": ""
    },
    {
      "text": "[51] Rikard, R., Thompson, M. S., McKinney, J., and Beauchamp, A. Examining health literacy disparities in the united states: a third look at the national assessment of adult literacy (naal). BMC Public Health, 16(1):1–11, 2016.",
      "doi": ""
    },
    {
      "text": "[52] Sadique, M. Z., Edmunds, W. J., Smith, R. D., Meerding, W. J., De Zwart, O., Brug, J., and Beutels, P. Precautionary behavior in response to perceived threat of pandemic influenza. Emerging infectious diseases, 13(9):1307, 2007.",
      "doi": ""
    },
    {
      "text": "[53] SaferMe. A new approach to pandemics, 2021.",
      "doi": ""
    },
    {
      "text": "[54] Sanches, P., Tsaknaki, V., Rostami, A., and Brown, B. Under surveillance: Technology practices of those monitored by the state. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, pages 1–13, 2020.",
      "doi": ""
    },
    {
      "text": "[55] Sannon, S. and Cosley, D. Privacy, power, and invisible labor on amazon mechanical turk. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, pages 1–12, 2019.",
      "doi": ""
    },
    {
      "text": "[56] Shin, S.-Y., Seo, D.-W., An, J., Kwak, H., Kim, S.-H., Gwack, J., and Jo, M.-W. High correlation of middle east respiratory syndrome spread with google search and twitter trends in korea. Scientific reports, 6(1):1–7, 2016.",
      "doi": ""
    },
    {
      "text": "[57] Sinha, P. and Paterson, A. E. Contact tracing: Can big tech come to the rescue, and if so, at what cost? EClinicalMedicine, 24, 2020.",
      "doi": ""
    },
    {
      "text": "[58] Swanson, K. C., Altare, C., Wesseh, C. S., Nyenswah, T., Ahmed, T., Eyal, N., Hamblion, E. L., Lessler, J., Peters, D. H., and Altmann, M. Contact tracing performance during the ebola epidemic in liberia, 2014-2015. PLoS neglected tropical diseases, 12(9):e0006762, 2018.",
      "doi": ""
    },
    {
      "text": "[59] The Associated Press. Anonymous contact tracing without the tracking, 2020.",
      "doi": ""
    },
    {
      "text": "[60] The New York Times. Coronavirus in the u.s.: Latest map and case count.",
      "doi": ""
    },
    {
      "text": "[61] Thorneloe, R., Epton, T., Fynn, W., Daly, M., Stanulewicz, N., Kassianos, A., Shorter, G. W., Moll, S.-J., Campbell, M., Sodergren, S., et al. Scoping review of mobile phone app uptake and engagement to inform digital contact tracing tools for covid-19. 2020.",
      "doi": ""
    },
    {
      "text": "[62] TIME. Contact tracing apps were big tech’s best idea for fighting covid-19. why haven’t they helped?",
      "doi": ""
    },
    {
      "text": "[63] Trivedi, A., Zakaria, C., Balan, R., Becker, A., Corey, G., and Shenoy, P. Wifitrace: Network-based contact tracing for infectious diseases using passive wifi sensing. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, 5(1):1–26, 2021.",
      "doi": ""
    },
    {
      "text": "[64] Uzor, S., Jacques, J. T., Dudley, J. J., and Kristensson, P. O. Investigating the accessibility of crowdwork tasks on mechanical turk. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, pages 1–14, 2021.",
      "doi": ""
    },
    {
      "text": "[65] Wang, D., Hu, B., Hu, C., Zhu, F., Liu, X., Zhang, J., Wang, B., Xiang, H., Cheng, Z., Xiong, Y., et al. Clinical characteristics of 138 hospitalized patients with 2019 novel coronavirus–infected pneumonia in wuhan, china. Jama, 323(11):1061–1069, 2020.",
      "doi": ""
    },
    {
      "text": "[66] Wirth, F. N., Johns, M., Meurers, T., and Prasser, F. Citizen-centered mobile health apps collecting individual-level spatial data for infectious disease management: Scoping review. JMIR mHealth and uHealth, 8(11):e22594, 2020.",
      "doi": ""
    },
    {
      "text": "[67] World Health Organization. Ethical considerations to guide the use of digital proximity tracking technologies for covid-19 contact tracing: interim guidance, 28 may 2020. Technical report, World Health Organization, 2020.",
      "doi": ""
    },
    {
      "text": "[68] World Health Organization. Statement on the second meeting of the international health regulations (2005) emergency committee regarding the outbreak of novel coronavirus (2019-ncov), 2020.",
      "doi": ""
    },
    {
      "text": "[69] Yuen, S. Parliament: $13.8 million spent on SafeEntry, TraceTogether digital contact tracing tools. The Straits Times, Nov. 2020.",
      "doi": ""
    },
    {
      "text": "[70] Zakaria, C., Trivedi, A., Cecchet, E., Chee, M., Shenoy, P., and Balan, R. Analyzing the impact of covid-19 control policies on campus occupancy and mobility via passive wifi sensing. ACM Transactions on Spatial Algorithms and Systems, 1(1), 2022.",
      "doi": ""
    },
    {
      "text": "[71] Zhang, B., Kreps, S., McMurry, N., and McCain, R. M. Americans’ perceptions of privacy and surveillance in the covid-19 pandemic. Plos one, 15(12):e0242652, 2020.",
      "doi": ""
    }
  ]
}