{
  "doi": "10.1145/3491102.3517487",
  "title": "Beyond Virtual Bazaar: How Social Commerce Promotes Inclusivity for the Traditionally Underserved Community in Chinese Developing Regions",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "The disadvantaged population is often underserved and marginalized in technology engagement: prior works show they are generally more reluctant and experience more barriers in adopting and engaging with mainstream technology. Here, we contribute to the HCI4D and ICTD literature through a novel “counter” case study on Chinese social commerce (e.g., Pinduoduo), which 1) first prospers among the traditionally underserved community from developing regions ahead of the more technologically advantaged communities, and 2) has been heavily engaged by this community. Through 12 in-depth interviews with social commerce users from the traditionally underserved community in Chinese developing regions, we demonstrate how social commerce, acting as a “virtual bazaar”, brings online the traditional offline socioeconomic lives the community has lived for ages, fits into the community’s social, cultural, and economic context, and thus effectively promotes technology inclusivity. Our work provides novel insights and implications for building inclusive technology for the “next billion” population.",
  "tags": [
    "social commerce",
    "bazaar",
    "underserved",
    "HCI4D",
    "inclusive"
  ],
  "authors": [
    {
      "name": "Zhilong Chen",
      "institution": "Department of Electronic Engineering, Tsinghua University, China and Department of Electronic Engineering, Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659321038",
      "orcid": "missing"
    },
    {
      "name": "Hancheng Cao",
      "institution": "Department of Computer Science, Stanford University, United States and Department of Computer Science, Stanford University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659254782",
      "orcid": "0000-0001-7231-1076"
    },
    {
      "name": "Xiaochong Lan",
      "institution": "Department of Electronic Engineering, Tsinghua University, China and Department of Electronic Engineering, Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237014",
      "orcid": "missing"
    },
    {
      "name": "Zhicong Lu",
      "institution": "Department of Computer Science, City University of Hong Kong, China and Department of Computer Science, City University of Hong Kong, China",
      "img": "/do/10.1145/contrib-99659162049/rel-imgonly/photo.jpg",
      "acmid": "99659162049",
      "orcid": "0000-0002-7761-6351"
    },
    {
      "name": "Yong Li",
      "institution": "E.E., Tsinghua University, China and E.E., Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453640533",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Xinhua News Agency. 2019. Distribution of small cities and rural residents in China in 2019, by highest academic level. https://www.statista.com/statistics/1248135/china-distribution-of-lower-tier-market-users-by-education-level/",
      "doi": ""
    },
    {
      "text": "Syed Ishtiaque Ahmed, Nicola J Bidwell, Himanshu Zade, Srihari H Muralidhar, Anupama Dhareshwar, Baneen Karachiwala, Cedrick N Tandong, and Jacki O’Neill. 2016. Peer-to-peer in the Workplace: A View from the Road. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 5063–5075.",
      "doi": "10.1145/2858036.2858393"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Jay Chen, and Nicola Dell. 2017. Digital privacy challenges with shared mobile phone use in Bangladesh. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–20.",
      "doi": "10.1145/3134652"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Shion Guha, Md Rashidujjaman Rifat, and Nicola Dell. 2017. Privacy, security, and surveillance in the Global South: A study of biometric mobile SIM registration in Bangladesh. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 906–918.",
      "doi": "10.1145/3025453.3025961"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Irtaza Haider, Jay Chen, and Nicola Dell. 2019. “Everyone Has Some Personal Stuff” Designing to Support Digital Privacy with Shared Mobile Phone Use in Bangladesh. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": ""
    },
    {
      "text": "Yan Bai, Zhong Yao, and Yi-Fan Dou. 2015. Effect of social commerce factors on user purchase behavior: An empirical investigation from renren. com. International Journal of Information Management 35, 5(2015), 538–550.",
      "doi": "10.1016/j.ijinfomgt.2015.04.011"
    },
    {
      "text": "Patrick Biernacki and Dan Waldorf. 1981. Snowball Sampling: Problems and Techniques of Chain Referral Sampling. Sociological methods & research 10, 2 (1981), 141–163.",
      "doi": ""
    },
    {
      "text": "Eric Brewer, Michael Demmer, Bowei Du, Melissa Ho, Matthew Kam, Sergiu Nedevschi, Joyojeet Pal, Rabin Patra, Sonesh Surana, and Kevin Fall. 2005. The case for technology in developing regions. Computer 38, 6 (2005), 25–38.",
      "doi": "10.1109/MC.2005.204"
    },
    {
      "text": "Peter J Buckley, Jeremy Clegg, and Hui Tan. 2010. Cultural Awareness in Knowledge Transfer to China — The Role of Guanxi and Mianzi. In Foreign direct investment, China and the world economy. Springer, 165–191.",
      "doi": ""
    },
    {
      "text": "Abdelsalam H Busalim 2016. Understanding social commerce: A systematic literature review and directions for further research. International Journal of Information Management 36, 6(2016), 1075–1088.",
      "doi": "10.1016/j.ijinfomgt.2016.06.005"
    },
    {
      "text": "Hancheng Cao, Zhilong Chen, Mengjie Cheng, Shuling Zhao, Tao Wang, and Yong Li. 2021. You Recommend, I Buy: How and Why People Engage in Instant Messaging Based Social Commerce. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–25.",
      "doi": "10.1145/3449141"
    },
    {
      "text": "Hancheng Cao, Zhilong Chen, Fengli Xu, Tao Wang, Yujian Xu, Lianglun Zhang, and Yong Li. 2020. When Your Friends Become Sellers: An Empirical Study of Social Commerce Site Beidian. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 14. 83–94.",
      "doi": ""
    },
    {
      "text": "China Internet Network Information Center. 2021. The 47th China Statistical Report on Internet Development. http://www.cnnic.cn/hlwfzyj/hlwxzbg/hlwtjbg/202102/P020210203334633480104.pdf",
      "doi": ""
    },
    {
      "text": "Priyank Chandra, Syed Ishtiaque Ahmed, and Joyojeet Pal. 2017. Market Practices and the Bazaar: Technology Consumption in ICT Markets in the Global South. In Proceedings of the 2017 CHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 4741–4752.",
      "doi": "10.1145/3025453.3025970"
    },
    {
      "text": "Priyank Chandra and Jay Chen. 2019. Taming the Amazon: The Domestication of Online Shopping in Bangalore, India. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development. Association for Computing Machinery, New York, NY, USA, 1–11.",
      "doi": "10.1145/3287098.3287105"
    },
    {
      "text": "Mable-Ann Chang. 2019. The Rise of China’s Smaller Cities. https://english.ckgsb.edu.cn/knowledges/china-lower-tier-cities/",
      "doi": ""
    },
    {
      "text": "Zhilong Chen, Hancheng Cao, Fengli Xu, Mengjie Cheng, Tao Wang, and Yong Li. 2020. Understanding the Role of Intermediaries in Online Social E-commerce: An Exploratory Study of Beidian. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–24.",
      "doi": "10.1145/3415185"
    },
    {
      "text": "Deborah R Compeau and Christopher A Higgins. 1995. Computer self-efficacy: Development of a measure and initial test. MIS quarterly (1995), 189–211.",
      "doi": ""
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2014. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Sage publications.",
      "doi": ""
    },
    {
      "text": "Mary J Culnan, Patrick J McHugh, and Jesus I Zubillaga. 2010. How large US companies can use Twitter and other social media to gain business value.MIS Quarterly Executive 9, 4 (2010).",
      "doi": ""
    },
    {
      "text": "Renata Gonçalves Curty and Ping Zhang. 2011. Social commerce: Looking back and forward. Proceedings of the American Society for Information Science and Technology 48, 1 (2011), 1–10.",
      "doi": ""
    },
    {
      "text": "Steven Davidson, Wei Ding, and Anthony Marshall. 2017. Growing China: Regional Contributions to Economic Success. https://www.ibm.com/downloads/cas/RDP8XP5V",
      "doi": ""
    },
    {
      "text": "Nicola Dell and Neha Kumar. 2016. The ins and outs of HCI for development. In Proceedings of the 2016 CHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 2220–2232.",
      "doi": "10.1145/2858036.2858081"
    },
    {
      "text": "Tawanna R Dillahunt and Joey Chiao-Yin Hsiao. 2020. Positive Feedback and Self-Reflection: Features to Support Self-Efficacy among Underrepresented Job Seekers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3313831.3376717"
    },
    {
      "text": "Tawanna R Dillahunt, Jason Lam, Alex Lu, and Earnest Wheeler. 2018. Designing future employment applications for underserved job seekers: a speed dating study. In Proceedings of the 2018 Designing Interactive Systems Conference. Association for Computing Machinery, New York, NY, USA, 33–44.",
      "doi": "10.1145/3196709.3196770"
    },
    {
      "text": "Tawanna R Dillahunt and Amelia R Malone. 2015. The promise of the sharing economy among disadvantaged communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2285–2294.",
      "doi": "10.1145/2702123.2702189"
    },
    {
      "text": "Alan Dix, Janet Finlay, Gregory D Abowd, and Russell Beale. 2003. Human-computer interaction. Pearson Education.",
      "doi": ""
    },
    {
      "text": "Patricia M Doney, Joseph P Cannon, and Michael R Mullen. 1998. Understanding the influence of national culture on the development of trust. Academy of management review 23, 3 (1998), 601–620.",
      "doi": ""
    },
    {
      "text": "Michaelanne Dye, Annie Antón, and Amy S Bruckman. 2016. Early adopters of the Internet and social media in Cuba. In Proceedings of the 19th ACM conference on computer-supported cooperative work & social computing. Association for Computing Machinery, New York, NY, USA, 1295–1309.",
      "doi": "10.1145/2818048.2819947"
    },
    {
      "text": "Michaelanne Dye, David Nemer, Neha Kumar, and Amy S Bruckman. 2019. If it Rains, Ask Grandma to Disconnect the Nano: Maintenance & Care in Havana’s StreetNet. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–27.",
      "doi": "10.1145/3359289"
    },
    {
      "text": "Michaelanne Dye, David Nemer, Josiah Mangiameli, Amy S Bruckman, and Neha Kumar. 2018. El Paquete Semanal: The Week’s Internet in Havana. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": "10.1145/3173574.3174213"
    },
    {
      "text": "Michaelanne Dye, David Nemer, Laura R Pina, Nithya Sambasivan, Amy S Bruckman, and Neha Kumar. 2017. Locating the Internet in the Parks of Havana. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 3867–3878.",
      "doi": "10.1145/3025453.3025728"
    },
    {
      "text": "Jiayang Fan. 2018. How E-commerce Is Transforming Rural China. https://www.newyorker.com/magazine/2018/07/23/how-e-commerce-is-transforming-rural-china",
      "doi": ""
    },
    {
      "text": "Frank S Fanselow. 1990. The bazaar economy or how bizarre is the bazaar really?Man (1990), 250–265.",
      "doi": ""
    },
    {
      "text": "Xiaotong Fei. 2008. From the Soil: The Foundations of Chinese Society. People’s Publishing House.",
      "doi": ""
    },
    {
      "text": "Clifford Geertz. 1963. Peddlers and princes: Social development and economic change in two Indonesian towns. Vol. 318. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Clifford Geertz. 1978. The Bazaar Economy: Information and Search in Peasant Marketing. The American Economic Review 68, 2 (1978), 28–32.",
      "doi": ""
    },
    {
      "text": "Eric Gilbert, Karrie Karahalios, and Christian Sandvig. 2008. The Network in the Garden: An Empirical Analysis of Social Media in Rural Life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1603–1612.",
      "doi": "10.1145/1357054.1357304"
    },
    {
      "text": "Ricardo Gomez, Luis F Baron, and Brittany Fiore-Silfvast. 2012. The changing field of ICTD: content analysis of research published in selected journals and conferences, 2000–2010. In Proceedings of the fifth international conference on information and communication technologies and development. Association for Computing Machinery, New York, NY, USA, 65–74.",
      "doi": "10.1145/2160673.2160682"
    },
    {
      "text": "Mark Granovetter. 1985. Economic action and social structure: The problem of embeddedness. American journal of sociology 91, 3 (1985), 481–510.",
      "doi": ""
    },
    {
      "text": "JoAnn T Hackos and Janice Redish. 1998. User and task analysis for interface design. Vol. 1. Wiley New York.",
      "doi": ""
    },
    {
      "text": "Nick Hajli. 2015. Social commerce constructs and consumer’s intention to buy. International journal of information management 35, 2(2015), 183–191.",
      "doi": ""
    },
    {
      "text": "Jean Hardy, Dharma Dailey, Susan Wyche, and Norman Makoto Su. 2018. Rural computing: Beyond access and infrastructure. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. Association for Computing Machinery, New York, NY, USA, 463–470.",
      "doi": "10.1145/3272973.3273008"
    },
    {
      "text": "Jean Hardy, Susan Wyche, and Tiffany Veinot. 2019. Rural HCI Research: Definitions, Distinctions, Methods, and Opportunities. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–33.",
      "doi": "10.1145/3359298"
    },
    {
      "text": "Brent Hecht and Monica Stephens. 2014. A tale of cities: Urban biases in volunteered geographic information. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 8.",
      "doi": ""
    },
    {
      "text": "Pingqing Huan. 2005. Transformation of Rural Markets and Social Structure in North China. Ph.D. Dissertation. Renmin University of China.",
      "doi": ""
    },
    {
      "text": "Suzaan Hughes and Chantal Beukes. 2012. Growth and implications of social e-commerce and group buying daily deal sites: The case of Groupon and LivingSocial. International Business & Economics Research Journal (IBER) 11, 8(2012), 921–934.",
      "doi": ""
    },
    {
      "text": "Magid Igbaria and Juhani Iivari. 1995. The effects of self-efficacy on computer usage. Omega 23, 6 (1995), 587–605.",
      "doi": ""
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E Grinter. 2010. Postcolonial computing: a lens on design and development. In Proceedings of the SIGCHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 1311–1320.",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Margaret Jack, Jay Chen, and Steven J Jackson. 2017. Infrastructure As Creative Action: Online Buying, Selling, and Delivery in Phnom Penh. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 6511–6522.",
      "doi": "10.1145/3025453.3025889"
    },
    {
      "text": "Margaret C Jack, Sopheak Chann, Steven J Jackson, and Nicola Dell. 2021. Networked Authoritarianism at the Edge: The Digital and Political Transitions of Cambodian Village Officials. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–25.",
      "doi": "10.1145/3449124"
    },
    {
      "text": "Margaret C Jack, Pang Sovannaroth, and Nicola Dell. 2019. ” Privacy is not a concept, but a way of dealing with life” Localization of Transnational Technology Platforms and Liminal Privacy Practices in Cambodia. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–19.",
      "doi": ""
    },
    {
      "text": "Maia Jacobs, James Clawson, and Elizabeth D Mynatt. 2014. Cancer navigation: opportunities and challenges for facilitating the breast cancer journey. In Proceedings of the 17th ACM conference on computer supported cooperative work & social computing. Association for Computing Machinery, New York, NY, USA, 1467–1478.",
      "doi": "10.1145/2531602.2531645"
    },
    {
      "text": "Isaac L Johnson, Yilun Lin, Toby Jia-Jun Li, Andrew Hall, Aaron Halfaker, Johannes Schöning, and Brent Hecht. 2016. Not at home on the range: Peer production and the urban/rural divide. In Proceedings of the 2016 CHI conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 13–25.",
      "doi": "10.1145/2858036.2858123"
    },
    {
      "text": "Vera Khovanskaya, Phoebe Sengers, Melissa Mazmanian, and Charles Darrah. 2017. Reworking the gaps between design and ethnography. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 5373–5385.",
      "doi": "10.1145/3025453.3026051"
    },
    {
      "text": "Hsiu-Chia Ko. 2018. Social desire or commercial desire? The factors driving social sharing and shopping intentions on social commerce platforms. Electronic Commerce Research and Applications 28 (2018), 1–15.",
      "doi": "10.1016/j.elerap.2017.12.011"
    },
    {
      "text": "Gilly Leshed, Maria Håkansson, and Joseph’Jofish’ Kaye. 2014. “Our life is the farm and farming is our life” home-work coordination in organic farm families. In Proceedings of the 17th ACM conference on computer supported cooperative work & social computing. Association for Computing Machinery, New York, NY, USA, 487–498.",
      "doi": ""
    },
    {
      "text": "Ting-Peng Liang and Efraim Turban. 2011. Introduction to the special issue social commerce: a research framework for social commerce. International Journal of electronic commerce 16, 2 (2011), 5–14.",
      "doi": "10.2753/JEC1086-4415160201"
    },
    {
      "text": "Baozhou Lu, Weiguo Fan, and Mi Zhou. 2016. Social presence, trust, and social commerce purchase intention: An empirical research. Computers in Human Behavior 56 (2016), 225–237.",
      "doi": "10.1016/j.chb.2015.11.057"
    },
    {
      "text": "Baozhou Lu, Qingfeng Zeng, and Weiguo Fan. 2016. Examining macro-sources of institution-based trust in social commerce marketplaces: An empirical study. Electronic Commerce Research and Applications 20 (2016), 116–131.",
      "doi": "10.1016/j.elerap.2016.10.004"
    },
    {
      "text": "Zhicong Lu, Michelle Annett, and Daniel Wigdor. 2019. Vicariously experiencing it all without going outside: A study of outdoor livestreaming in China. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–28.",
      "doi": "10.1145/3359127"
    },
    {
      "text": "Tom McDonald. 2016. Social media in rural China. UCL Press.",
      "doi": ""
    },
    {
      "text": "Roberta M Melvin, Andrea Bunt, Erick Oduor, and Carman Neustaedter. 2015. The effect of signal expense and dependability on family communication in rural and northern Canada. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 717–726.",
      "doi": "10.1145/2702123.2702301"
    },
    {
      "text": "Nusrat Jahan Mim. 2021. Gospels of Modernity: Digital Cattle Markets, Urban Religiosity, and Secular Computing in the Global South. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–17.",
      "doi": "10.1145/3411764.3445259"
    },
    {
      "text": "Nusrat Jahan Mim and Syed Ishtiaque Ahmed. 2020. Others’ Images: Online Social Media, Architectural Improvisations, and Spatial Marginalization in Bangladesh. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376572"
    },
    {
      "text": "Elad Natanson. 2019. The Miraculous Rise Of Pinduoduo and Its Lessons. https://www.forbes.com/sites/eladnatanson/2019/12/04/the-miraculous-rise-of-pinduoduo-and-its-lessons/?sh=4c6386951f13",
      "doi": ""
    },
    {
      "text": "China Economic Net. 2020. “Dual circulation strategy shows strong domestic demand”: New CEO Chen Lei leads Pinduoduo to its first profitable quarter. http://www.ce.cn/xwzx/gnsz/gdxw/202011/12/t20201112_36003632.shtml",
      "doi": ""
    },
    {
      "text": "China Business News. 2021. The Announcement of the Latest First to Fifth Tier City Rankings. https://www.yicai.com/news/101063860.html",
      "doi": ""
    },
    {
      "text": "China Academy of Information and Communications Technology. 2021. China Mobile Phone Market Report, Jun. 2021. http://www.caict.ac.cn/kxyj/qwfb/qwsj/202107/P020210713522029022939.pdf",
      "doi": ""
    },
    {
      "text": "National Bureau of Statistics of China. 2020. China Statistical Yearbook. http://www.stats.gov.cn/tjsj/ndsj/2020/indexeh.htm",
      "doi": ""
    },
    {
      "text": "State Post Bureau of the People’s Republic of China. 2021. 2020 China Express Development Index Report. http://www.spb.gov.cn/xw/dtxx_15079/202105/t20210508_3898077.html",
      "doi": ""
    },
    {
      "text": "Jinghua Piao, Guozhen Zhang, Fengli Xu, Zhilong Chen, and Yong Li. 2021. Predicting customer value with social relationships via motif-based graph attention networks. In Proceedings of the Web Conference 2021. Association for Computing Machinery, New York, NY, USA, 3146–3157.",
      "doi": "10.1145/3442381.3449849"
    },
    {
      "text": "Jinghua Piao, Guozhen Zhang, Fengli Xu, Zhilong Chen, Yu Zheng, Chen Gao, and Yong Li. 2021. Bringing Friends into the Loop of Recommender Systems: An Exploratory Study. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–26.",
      "doi": "10.1145/3479583"
    },
    {
      "text": "Pinduoduo. 2020. Pinduoduo user distribution in China as of June 2020, by city tier. https://www.statista.com/statistics/1007111/china-pinduoduo-user-breakdown-by-city-tier/",
      "doi": ""
    },
    {
      "text": "Pinduoduo. 2021. Number of monthly active users of Pinduoduo Inc. from 1st quarter 2018 to 1st quarter 2021. https://www.statista.com/statistics/1006368/china-pinduoduo-monthly-active-users/",
      "doi": ""
    },
    {
      "text": "Jean-Christophe Plantin and Gabriele De Seta. 2019. WeChat as infrastructure: The techno-nationalist shaping of Chinese digital platforms. Chinese Journal of Communication 12, 3 (2019), 257–273.",
      "doi": ""
    },
    {
      "text": "Xiaoying Qi. 2011. Face: A Chinese concept in a global sociology. Journal of Sociology 47, 3 (2011), 279–295.",
      "doi": ""
    },
    {
      "text": "Xiaoying Qi. 2013. Guanxi, social capital theory and beyond: Toward a globalized social science. The British journal of sociology 64, 2 (2013), 308–324.",
      "doi": ""
    },
    {
      "text": "Kate Rooney. 2019. Mobile Payments Have Barely Caught on in the US, Despite the Rise of Smartphones. https://www.cnbc.com/2019/08/29/why-mobile-payments-have-barely-caught-on-in-the-us.html",
      "doi": ""
    },
    {
      "text": "Georgia Robins Sadler, Hau-Chen Lee, Rod Seung-Hwan Lim, and Judith Fullerton. 2010. Recruitment of hard-to-reach population subgroups via adaptations of the snowball sampling strategy. Nursing & health sciences 12, 3 (2010), 369–374.",
      "doi": ""
    },
    {
      "text": "Hong Shen, Cori Faklaris, Haojian Jin, Laura Dabbish, and Jason I Hong. 2020. ‘I Can’t Even Buy Apples If I Don’t Use Mobile Pay?’ When Mobile Payments Become Infrastructural in China. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–26.",
      "doi": ""
    },
    {
      "text": "Rosemary Steup, Lynn Dombrowski, and Norman Makoto Su. 2019. Feeding the world with data: visions of data-driven farming. In Proceedings of the 2019 on Designing Interactive Systems Conference. Association for Computing Machinery, New York, NY, USA, 1503–1515.",
      "doi": "10.1145/3322276.3322382"
    },
    {
      "text": "Rosemary Steup, Arvind Santhanam, Marisa Logan, Lynn Dombrowski, and Norman Makoto Su. 2018. Growing tiny publics: small farmers’ social movement strategies. Proceedings of the ACM on human-computer interaction 2, CSCW(2018), 1–24.",
      "doi": "10.1145/3274434"
    },
    {
      "text": "Anselm Strauss and Juliet M Corbin. 1997. Grounded Theory in Practice. Sage.",
      "doi": ""
    },
    {
      "text": "Sharifa Sultana and Syed Ishtiaque Ahmed. 2019. Witchcraft and hci: Morality, modernity, and postcolonial computing in rural bangladesh. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–15.",
      "doi": "10.1145/3290605.3300586"
    },
    {
      "text": "Sharifa Sultana, Syed Ishtiaque Ahmed, and Jeffrey M Rzeszotarski. 2021. Seeing in Context: Traditional Visual Communication Practices in Rural Bangladesh. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–31.",
      "doi": "10.1145/3432913"
    },
    {
      "text": "Sharifa Sultana, François Guimbretière, Phoebe Sengers, and Nicola Dell. 2018. Design within a patriarchal society: Opportunities and challenges in designing for rural women in bangladesh. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3173574.3174110"
    },
    {
      "text": "Yi Sun, Kwok Kee Wei, Chaobin Fan, Yaobin Lu, and Sumeet Gupta. 2016. Does social climate matter? On friendship groups in social commerce. Electronic Commerce Research and Applications 18 (2016), 37–47.",
      "doi": "10.1016/j.elerap.2016.06.002"
    },
    {
      "text": "Statista Global Consumer Survey. 2021. ECommerce: jd.com in China 2021 Brand Report. https://www.statista.com/study/68526/ecommerce-jdcom-in-china-brand-report/",
      "doi": ""
    },
    {
      "text": "Mingfeng Wang. 2005. Internet Use and Urbanization in China – The Spatial Dimension of the “Digital Divide”. Sociological Studies 06(2005), 112–135.",
      "doi": ""
    },
    {
      "text": "Yi Wang. 2021. Living in a City, Living a Rural Life: Understanding Second Generation Mingongs’ Experiences with Technologies in China. ACM Transactions on Computer-Human Interaction (TOCHI) 28, 3(2021), 1–29.",
      "doi": "10.1145/3448979"
    },
    {
      "text": "Gerard Weisbuch, Alan Kirman, and Dorothea Herreiner. 2000. Market organisation and trading relationships. The economic journal 110, 463 (2000), 411–436.",
      "doi": ""
    },
    {
      "text": "Fengli Xu, Zhenyu Han, Jinghua Piao, and Yong Li. 2019. ” I Think You’ll Like It” Modelling the Online Purchase Behavior in Social E-commerce. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": ""
    },
    {
      "text": "Fengli Xu, Guozhen Zhang, Yuan Yuan, Hongjia Huang, Diyi Yang, Depeng Jin, and Yong Li. 2021. Understanding the Invitation Acceptance in Agent-initiated Social E-commerce. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 15. 820–829.",
      "doi": ""
    },
    {
      "text": "Dong-Ling Xu-Priour, Yann Truong, and Richard R Klink. 2014. The effects of collectivism and polychronic time orientation on online social interaction and shopping behavior: A comparative study between China and France. Technological Forecasting and Social Change 88 (2014), 265–275.",
      "doi": ""
    },
    {
      "text": "Song Oh Yoon, Kwanho Suk, Seon Min Lee, and Eun Young Park. 2011. To seek variety or uniformity: The role of culture in consumers’ choice in a group setting. Marketing Letters 22, 1 (2011), 49–64.",
      "doi": ""
    },
    {
      "text": "Guozhen Zhang, Yong Li, Yuan Yuan, Fengli Xu, Hancheng Cao, Yujian Xu, and Depeng Jin. 2021. Community Value Prediction in Social E-commerce. In Proceedings of the Web Conference 2021. Association for Computing Machinery, New York, NY, USA, 2958–2967.",
      "doi": "10.1145/3442381.3449793"
    },
    {
      "text": "Mengmeng Zhang. 2019. The Rise of Pinduoduo: The New E-Commerce Challenger in China. https://www.counterpointresearch.com/rise-pinduoduo-new-e-commerce-challenger-china/",
      "doi": ""
    },
    {
      "text": "Lina Zhou, Ping Zhang, and Hans-Dieter Zimmermann. 2013. Social commerce research: An integrated view. Electronic commerce research and applications 12, 2(2013), 61–68.",
      "doi": ""
    },
    {
      "text": "Wei Zhou and Mingfeng Wang. 2018. Internet Use and Urbanization in China – The Spatial Dimension of the “Digital Divide”. Urban Development Studies 25, 9 (2018), 9–15.",
      "doi": ""
    },
    {
      "text": "Xinkai Zhu. 2003. Studies on Rural Households’ Consumption Functions in China. Ph.D. Dissertation. Huazhong Agricultural University.",
      "doi": ""
    }
  ]
}