{
  "doi": "10.1145/3491102.3517455",
  "title": "Cicero: A Declarative Grammar for Responsive Visualization",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "Designing responsive visualizations can be cast as applying transformations to a source view to render it suitable for a different screen size. However, designing responsive visualizations is often tedious as authors must manually apply and reason about candidate transformations. We present Cicero, a declarative grammar for concisely specifying responsive visualization transformations which paves the way for more intelligent responsive visualization authoring tools. Cicero’s flexible specifier syntax allows authors to select visualization elements to transform, independent of the source view’s structure. Cicero encodes a concise set of actions to encode a diverse set of transformations in both desktop-first and mobile-first design processes. Authors can ultimately reuse design-agnostic transformations across different visualizations. To demonstrate the utility of Cicero, we develop a compiler to an extended version of Vega-Lite, and provide principles for our compiler. We further discuss the incorporation of Cicero into responsive visualization authoring tools, such as a design recommender.",
  "tags": [
    "responsive visualization",
    "grammar",
    "Visualization"
  ],
  "authors": [
    {
      "name": "Hyeok Kim",
      "institution": "Computer Science, Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234405",
      "orcid": "missing"
    },
    {
      "name": "Ryan Rossi",
      "institution": "Adobe Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484653761",
      "orcid": "0000-0001-9758-0635"
    },
    {
      "name": "Fan Du",
      "institution": "Adobe Research, United States",
      "img": "/do/10.1145/contrib-87658692957/rel-imgonly/img_2623.jpg",
      "acmid": "87658692957",
      "orcid": "0000-0002-4383-8888"
    },
    {
      "name": "Eunyee Koh",
      "institution": "Adobe Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81310489834",
      "orcid": "0000-0003-2091-5972"
    },
    {
      "name": "Shunan Guo",
      "institution": "Adobe Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261837",
      "orcid": "0000-0001-5355-8399"
    },
    {
      "name": "Jessica Hullman",
      "institution": "Computer Science, Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657387",
      "orcid": "0000-0001-6826-3550"
    },
    {
      "name": "Jane Hoffswell",
      "institution": "Adobe Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131610",
      "orcid": "0000-0002-9871-4575"
    }
  ],
  "references": [
    {
      "text": "2012. DataWrapper. https://www.datawrapper.de/ Last accessed: Jun. 2, 2021.",
      "doi": ""
    },
    {
      "text": "Keith Andrews. 2018. Responsive Visualisation. In MobileVis ‘18 Workshop at CHI 2018. ACM.",
      "doi": ""
    },
    {
      "text": "Richard A. Becker, William S. Cleveland, and Ming-Jen Shyu. 1996. The Visual Design and Control of Trellis Display. Journal of Computational and Graphical Statistics 5, 2 (1996), 123–155. https://doi.org/10.1080/10618600.1996.10474701",
      "doi": ""
    },
    {
      "text": "Elliot Bentley. 2021. The Web as medium for data visualization. In The Data Journalism Handbook: Towards a Critical Data Practice, Liliana Bounegru and Jonathan Gray (Eds.). Amsterdam University Press, 182–192. https://doi.org/10.5117/9789462989511",
      "doi": ""
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12(2011), 2301–2309. https://doi.org/10.1109/TVCG.2011.185",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Gerhard Brewka, Thomas Eiter, and Mirosław Truszczyński. 2011. Answer Set Programming at a Glance. Commun. ACM (2011). https://doi.org/10.1145/2043174.2043195",
      "doi": ""
    },
    {
      "text": "Jay Bryant and Mike Jones. 2012. Responsive Web Design. Apress, Berkeley, CA, 37–49. https://doi.org/10.1007/978-1-4302-4525-4_4",
      "doi": ""
    },
    {
      "text": "E. Di Giacomo, W. Didimo, G. Liotta, and F. Montecchiani. 2015. Network visualization retargeting. In 2015 6th International Conference on Information, Intelligence, Systems and Applications (IISA). 1–6. https://doi.org/10.1109/IISA.2015.7388095",
      "doi": ""
    },
    {
      "text": "Roy Gal. 2017. Responsive visualizations coming to Power BI. https://powerbi.microsoft.com/en-us/blog/responsive-visualizations-coming-to-power-bi/Last accessed: Jun. 2, 2021.",
      "doi": ""
    },
    {
      "text": "Martin Gebser, Roland Kaminski, Benjamin Kaufmann, and Torsten Schaub. 2014. Clingo = ASP + Control: Preliminary Report. (2014). arxiv:1405.3694https://arxiv.org/abs/1405.3694.",
      "doi": ""
    },
    {
      "text": "Google. 2019. Using Google Charts. https://developers-dot-devsite-v2-prod.appspot.com/chart/interactive/docsLast accessed: Sept. 11, 2020.",
      "doi": ""
    },
    {
      "text": "Jane Hoffswell, Alan Borning, and Jeffrey Heer. 2018. SetCoLa: High-Level Constraints for Graph Layout. In Computer Graphics Forum (Proc. EuroVis). https://doi.org/10.1111/cgf.13440",
      "doi": ""
    },
    {
      "text": "Jane Hoffswell, Wilmot Li, and Zhicheng Liu. 2020. Techniques for Flexible Responsive Visualization Design. In ACM Human Factors in Computing Systems (CHI). https://doi.org/10.1145/3313831.3376777",
      "doi": ""
    },
    {
      "text": "IDL. 2017. Documentation–Vega. https://vega.github.io/vega/docs/ Last accessed: Sept. 9, 2021.",
      "doi": ""
    },
    {
      "text": "M. R. Jakobsen and K. Hornbæk. 2013. Interactive Visualizations on Large and Small Displays: The Interrelation of Display Size, Information Space, and Scale. IEEE Transactions on Visualization and Computer Graphics 19, 12(2013), 2336–2345. https://doi.org/10.1109/TVCG.2013.170",
      "doi": "10.1109/TVCG.2013.170"
    },
    {
      "text": "Hyeok Kim, Dominik Mortiz, and Jessica Hullman. 2021. Design Patterns and Trade-Offs in Authoring Communication-Oriented Responsive Visualization. Computer Graphics Forum (Proc. EuroVis) 40 (2021), 00–00. Issue 3. https://doi.org/10.1111/cgf.14321",
      "doi": ""
    },
    {
      "text": "Hyeok Kim, Ryan Rossi, Abhraneel Sarma, Dominik Mortiz, and Jessica Hullman. 2021. An Automated Approach to Reasoning About Task-Oriented Insights in Responsive Visualization. To Appear IEEE Trans. Visualization & Comp. Graphics (Proc. InfoVis) (2021). https://arxiv.org/abs/2107.08141.",
      "doi": ""
    },
    {
      "text": "Younghoon Kim and Jeffrey Heer. 2021. Gemini: A Grammar and Recommender System for Animated Transitions in Statistical Graphics. IEEE Trans. Visualization & Comp. Graphics (Proc. InfoVis) (2021). https://doi.org/10.1109/TVCG.2020.3030360",
      "doi": ""
    },
    {
      "text": "Juliana Leclaire and Aurélien Tabard. 2015. R3S.js–Towards Responsive Visualizations. In Workshop on Data Exploration for Interactive Surfaces DEXIS 2015. 16–19.",
      "doi": ""
    },
    {
      "text": "Halden Lin, Dominik Moritz, and Jeffrey Heer. 2020. Dziban: Balancing Agency & Automation in Visualization Design via Anchored Recommendations. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). 12. https://doi.org/10.1145/3313831.3376880",
      "doi": "10.1145/3313831.3376880"
    },
    {
      "text": "Ruixian Ma, Honghui Mei, Huihua Guan, Wei Huang, Fan Zhang, Chengye Xin, Wenzhuo Dai, Xiao Wen, and Wei Chen. 2021. LADV: Deep Learning Assisted Authoring of Dashboard Visualizations From Images and Sketches. IEEE Transactions on Visualization and Computer Graphics 27, 9(2021), 3717–3732. https://doi.org/10.1109/TVCG.2020.2980227",
      "doi": "10.1109/TVCG.2020.2980227"
    },
    {
      "text": "MDN. n.d.. Cascade and inheritance. https://developer.mozilla.org/en-US/docs/Learn/CSS/Building_blocks/Cascade_and_inheritance Last accessed Aug 13, 2021.",
      "doi": ""
    },
    {
      "text": "MDN. n.d.. Specificity. https://developer.mozilla.org/en-US/docs/Web/CSS/Specificity Last accessed Dec 15, 2021.",
      "doi": ""
    },
    {
      "text": "MDN. n.d.. Using media queries. https://developer.mozilla.org/en-US/docs/Web/CSS/Media_Queries/Using_media_queries Last accessed Sept 4, 2021.",
      "doi": ""
    },
    {
      "text": "Gonzalo Gabriel Méndez, Uta Hinrichs, and Miguel A. Nacenta. 2017. Bottom-up vs. Top-down: Trade-Offs in Efficiency, Understanding, Freedom and Creativity with InfoVis Tools. Association for Computing Machinery, New York, NY, USA, 841–852. https://doi.org/10.1145/3025453.3025942",
      "doi": ""
    },
    {
      "text": "Microsoft. 2011. Power BI. https://powerplatform.microsoft.com/en-us/.",
      "doi": ""
    },
    {
      "text": "S. Mohorovičić. 2013. Implementing responsive web design for enhanced web presence. In 2013 36th International Convention on Information and Communication Technology, Electronics and Microelectronics (MIPRO). 1206–1210.",
      "doi": ""
    },
    {
      "text": "Dominik Moritz, Chenglong Wang, Gregory Nelson, Halden Lin, Adam M. Smith, Bill Howe, and Jeffrey Heer. 2019. Formalizing Visualization Design Knowledge as Constraints: Actionable and Extensible Models in Draco. IEEE Trans. Visualization & Comp. Graphics (Proc. InfoVis) (2019). https://doi.org/10.1109/TVCG.2018.2865240",
      "doi": ""
    },
    {
      "text": "Lisa C. Rost. 2020. Create better, more responsive text annotations (yes, also on maps). https://blog.datawrapper.de/better-more-responsive-annotations-in-datawrapper-data-visualizations/Last accessed: Jun. 2, 2021.",
      "doi": ""
    },
    {
      "text": "Lisa C. Rost and Gregor Aisch. 2020. Our new Tables: responsive, with sparklines, bar charts and sticky rows. https://blog.datawrapper.de/new-table-tool-barcharts-fixed-rows-responsive-2/Last accessed: Jun. 2, 2021.",
      "doi": ""
    },
    {
      "text": "Cedric Sam. 2018. Ai2html and Its Impact on the News Graphics Industry. In MobileVis ‘18 Workshop at CHI 2018. https://mobilevis.github.io/assets/mobilevis2018_paper_20.pdf.",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan and Jeffrey Heer. 2014. Lyra: An Interactive Visualization Design Environment. Computer Graphics Forum 33, 3 (2014), 351–360. https://doi.org/10.1111/cgf.12391",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2017. Vega-Lite: A Grammar of Interactive Graphics. IEEE Trans. Visualization & Comp. Graphics (Proc. InfoVis) (2017). https://doi.org/10.1109/TVCG.2016.2599030",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Ryan Russell, Jane Hoffswell, and Jeffrey Heer. 2016. Reactive Vega: A Streaming Dataflow Architecture for Declarative Interactive Visualization. In IEEE Trans. Visualization & Comp. Graphics (Proc. InfoVis ’15). https://doi.org/10.1109/TVCG.2015.2467091",
      "doi": ""
    },
    {
      "text": "Archie Tse. 2011. ai2html. http://ai2html.org/.",
      "doi": ""
    },
    {
      "text": "Jacob VanderPlas, Brian Granger, Jeffrey Heer, Dominik Moritz, Kanit Wongsuphasawat, Arvind Satyanarayan, Eitan Lees, Ilia Timofeev, Ben Welsh, and Scott Sievert. 2018. Altair: Interactive Statistical Visualizations for Python. Journal of Open Source Software 3, 32 (2018), 1057. https://doi.org/10.21105/joss.01057",
      "doi": ""
    },
    {
      "text": "Hadley Wickham. 2010. A Layered Grammar of Graphics. Journal of Computational and Graphical Statistics 19, 1(2010), 3–28. https://doi.org/10.1198/jcgs.2009.07098",
      "doi": ""
    },
    {
      "text": "Kanit Wongsuphasawat, Dominik Moritz, Anushka Anand, Jock Mackinlay, Bill Howe, and Jeffrey Heer. 2016. Voyager: Exploratory Analysis via Faceted Browsing of Visualization Recommendations. IEEE Transactions on Visualization and Computer Graphics 22, 1(2016), 649–658.",
      "doi": "10.1109/TVCG.2015.2467191"
    },
    {
      "text": "Kanit Wongsuphasawat, Zening Qu, Dominik Moritz, Riley Chang, Felix Ouk, Anushka Anand, Jock Mackinlay, Bill Howe, and Jeffrey Heer. 2017. Voyager 2: Augmenting visual analysis with partial view specifications. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (2017), 2648–2659. https://doi.org/10.1145/3025453.3025768",
      "doi": "10.1145/3025453.3025768"
    },
    {
      "text": "Aoyu Wu, Wai Tong, Tim Dwyer, Bongshin Lee, Petra Isenberg, and Huamin Qu. 2021. MobileVisFixer: Tailoring Web Visualizations for Mobile Phones Leveraging an Explainable Reinforcement Learning Framework. IEEE Transactions on Visualization and Computer Graphics 27, 2(2021), 464–474. https://doi.org/10.1109/TVCG.2020.3030423",
      "doi": ""
    },
    {
      "text": "Aoyu Wu, Yun Wang, Xinhuan Shu, Dominik Moritz, Weiwei Cui, Haidong Zhang, Dongmei Zhang, and Huamin Qu. 2021. AI4VIS: Survey on Artificial Intelligence Approaches for Data Visualization. IEEE Transactions on Visualization and Computer Graphics (2021), 1–1. https://doi.org/10.1109/TVCG.2021.3099002",
      "doi": "10.1109/TVCG.2021.3099002"
    },
    {
      "text": "Aoyu Wu, Liwenhan Xie, Bongshin Lee, Yun Wang, Weiwei Cui, and Huamin Qu. 2021. Learning to Automate Chart Layout Configurations Using Crowdsourced Paired Comparison. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445179",
      "doi": ""
    },
    {
      "text": "Yingcai Wu, Xiaotong Liu, Shixia Liu, and Kwan-Liu Ma. 2012. ViSizer: a visualization resizing framework. IEEE Trans. Visualization & Comp. Graphics(2012). https://doi.org/10.1109/TVCG.2012.114",
      "doi": ""
    },
    {
      "text": "ZingSoft. 2009. ZingChart. https://www.zingchart.com/.",
      "doi": ""
    }
  ]
}