{
  "doi": "10.1145/3491102.3517465",
  "title": "Infosonics: Accessible Infographics for People who are Blind using Sonification and Voice",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2022,
  "badges": [],
  "abstract": "Data visualisations are increasingly used online to engage readers and enable independent analysis of the data underlying news stories. However, access to such infographics is problematic for readers who are blind or have low vision (BLV). Equitable access to information is a basic human right and essential for independence and inclusion. We introduce infosonics, the audio equivalent of infographics, as a new style of interactive sonification that uses a spoken introduction and annotation, non-speech audio and sound design elements to present data in an understandable and engaging way. A controlled user evaluation with 18 BLV adults found a COVID-19 infosonic enabled a clearer mental image than a traditional sonification. Further, infosonics prove complementary to text descriptions and facilitate independent understanding of the data. Based on our findings, we provide preliminary suggestions for infosonics design, which we hope will enable BLV people to gain equitable access to online news and information.",
  "authors": [
    {
      "name": "Leona M Holloway",
      "institution": "Department of Human-Centred Computing, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260925",
      "orcid": "0000-0001-9200-5164"
    },
    {
      "name": "Cagatay Goncu",
      "institution": "Department of Human-Centred Computing, Monash University, Australia",
      "img": "/do/10.1145/contrib-81418597482/rel-imgonly/cagatay__chatai__goncu_200x200_new.jpg",
      "acmid": "81418597482",
      "orcid": "0000-0001-7846-8795"
    },
    {
      "name": "Alon Ilsar",
      "institution": "Faculty of Information Technology/ Department of Human Centred Computing/ SensiLab, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82259112757",
      "orcid": "missing"
    },
    {
      "name": "Matthew Butler",
      "institution": "Department of Human-Centred Computing, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508687882",
      "orcid": "0000-0002-7950-5495"
    },
    {
      "name": "Kim Marriott",
      "institution": "Human-Centred Computing, Faculty of IT, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320492504",
      "orcid": "0000-0002-9813-0377"
    }
  ],
  "references": [
    {
      "text": "Dragan Ahmetovic, Cristian Bernareggi, João Guerreiro, Sergio Mascetti, and Anna Capietto. 2019. AudioFunctions. web: Multimodal Exploration of Mathematical Function Graphs. In Proceedings of the 16th Web For All 2019 Personalization-Personalizing the Web. 1–10.",
      "doi": ""
    },
    {
      "text": "Alonzo. 2001. A picture is worth 300 words: Writing visual descriptions for an art museum web site. In CSUN Assistive Technology Conference.",
      "doi": ""
    },
    {
      "text": "Malika Auvray, Sylvain Hanneton, and J. Kevin O’Regan. 2007. Learning to perceive with a visuo—auditory substitution system: localisation and object recognition with ‘The Voice’. Perception 36, 3 (2007), 416–430.",
      "doi": ""
    },
    {
      "text": "Elisabeth Salzhauer Axel, Virginia Hooper, Teresa Kardoulias, Sarah Stephenson Keyes, and Francesca Rosenberg. n.d.. ABS’s Guidelines for Verbal Description. Art Beyond Sight. http://www.artbeyondsight.org/handbook/acs-guidelines.shtml",
      "doi": ""
    },
    {
      "text": "Stephen Barrass and Paul Vickers. 2011. Sonification design and aesthetics. In The sonification handbook. Logos Verlag, 145–164.",
      "doi": ""
    },
    {
      "text": "Oded Ben-Tal and Jonathan Berger. 2004. Creative aspects of sonification. Leonardo 37, 3 (2004), 229–233.",
      "doi": ""
    },
    {
      "text": "N. Bonet, A. Kirke, and E. Miranda. 2016. Blyth-Eastbourne-Wembury: Sonification as a compositional tool in electroacoustic music. In Proceedings of the 2nd International Conference on New Musical Concepts.",
      "doi": ""
    },
    {
      "text": "Braille Authority of North America. 2010. Guidelines and Standards for Tactile Graphics. The Braille Authority of North America. http://www.brailleauthority.org/tg/web-manual/index.html",
      "doi": ""
    },
    {
      "text": "Stephen Brewster. 2002. Visualization tools for blind people using multiple modalities. Disability and rehabilitation 24, 11-12 (2002), 613–621.",
      "doi": ""
    },
    {
      "text": "Lorna Brown, Stephen Brewster, Ramesh Ramloll, Wai Yu, and Beate Riedel. 2002. Browsing modes for exploring sonified line graphs. In Proceedings of British Computer Society Human Computer Interaction Conference. Citeseer.",
      "doi": ""
    },
    {
      "text": "Lorna M. Brown, Stephen A. Brewster, S. A. Ramloll, R. Burton, and Beate Riedel. 2003. Design guidelines for audio presentation of graphs and tables. In Proc. International Conference on Auditory Display (ICAD).",
      "doi": ""
    },
    {
      "text": "Alberto Cairo. 2016. The truthful art: Data, charts, and maps for communication. New Riders.",
      "doi": ""
    },
    {
      "text": "Dustin Carroll, Suranjan Chakraborty, and Jonathan Lazar. 2013. Designing accessible visualizations: the case of designing a weather map for blind users. In International Conference on Universal Access in Human-Computer Interaction. Springer, 436–445.",
      "doi": "10.1007/978-3-642-39188-0_47"
    },
    {
      "text": "Stephen H. Choi and Bruce N. Walker. 2010. Digitizer auditory graph: making graphs accessible to the visually impaired. In CHI’10 Extended Abstracts on Human Factors in Computing Systems. 3445–3450.",
      "doi": ""
    },
    {
      "text": "Microsoft Corporation. 2019. Microsoft Soundscape: A map delivered in 3D sound. https://www.microsoft.com/en-us/research/product/soundscape/",
      "doi": ""
    },
    {
      "text": "Seniz Demir, David Oliver, Edward Schwartz, Stephanie Elzer, Sandra Carberry, Kathleen F. Mccoy, and Daniel Chester. 2010. Interactive SIGHT: textual access to simple bar charts. New Review of Hypermedia and Multimedia 16, 3 (2010), 245–279.",
      "doi": "10.1080/13614568.2010.534186"
    },
    {
      "text": "Murray Dick. 2020. The Infographic: A History of Data Graphics in News and Communications. MIT Press.",
      "doi": ""
    },
    {
      "text": "Steven Drucker, Samuel Huron, Robert Kosara, Jonathan Schwabish, and Nicholas Diakopoulos. 2019. Communicating Data to an Audience. https://hal.archives-ouvertes.fr/hal-02310515/document",
      "doi": ""
    },
    {
      "text": "Melanie Ehrenkranz. 2020. Vital Coronavirus Information is Failing the Blind and Visually Impaired. VICE 9 April(2020). https://www.vice.com/en_us/article/4ag9wb/vital-coronavirus-information-is-failing-the-blind-and-visually-impaired",
      "doi": ""
    },
    {
      "text": "Robert Wall Emerson and Dawn L. Anderson. 2018. Using description to convey mathematics content in visual images to students who are visually impaired. Journal of Visual Impairment & Blindness 112, 2 (2018), 157–168.",
      "doi": ""
    },
    {
      "text": "Jamie Ferguson and Stephen A. Brewster. 2017. Evaluation of psychoacoustic sound parameters for sonification. In Proceedings of the 19th ACM International Conference on Multimodal Interaction. 120–127.",
      "doi": "10.1145/3136755.3136783"
    },
    {
      "text": "Jamie Ferguson and Stephen A. Brewster. 2018. Investigating perceptual congruence between data and display dimensions in sonification. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–9.",
      "doi": "10.1145/3173574.3174185"
    },
    {
      "text": "Mikael Fernstrom, F. Brazil, and Liam Bannon. 2005. HCI design and interactive sonification for fingers and ears. IEEE MultiMedia 12, 2 (2005), 36–44.",
      "doi": "10.1109/MMUL.2005.27"
    },
    {
      "text": "Leo Ferres, Petro Verkhogliad, Gitte Lindgaard, Louis Boucher, Antoine Chretien, and Martin Lachance. 2007. Improving accessibility to statistical graphs: the iGraph-Lite system. In Proceedings of the 9th International ACM SIGACCESS Conference on Computers & Accessibility. ACM, 67–74.",
      "doi": "10.1145/1296843.1296857"
    },
    {
      "text": "John H. Flowers, Dion C. Buhman, and Kimberly D. Turnage. 1997. Cross-modal equivalence of visual and auditory scatterplots for exploring bivariate data samples. Human Factors 39, 3 (1997), 341–351.",
      "doi": ""
    },
    {
      "text": "John H. Flowers and Terry A. Hauer. 1993. “Sound” alternatives to visual graphics for exploratory data analysis. Behavior Research Methods, Instruments, & Computers 25, 2 (1993), 242–249.",
      "doi": ""
    },
    {
      "text": "John H. Flowers and Terry A. Hauer. 1995. Musical versus visual graphs: Cross-modal equivalence in perception of time series data. Human factors 37, 3 (1995), 553–569.",
      "doi": ""
    },
    {
      "text": "Louise Fryer. 2016. Audio introductions. Taylor & Francis Group, Book section 12.",
      "doi": ""
    },
    {
      "text": "John A. Gardner. 2002. Access by blind students and professionals to mainstream math and science. In International Conference on Computers for Handicapped Persons. Springer, 502–507.",
      "doi": ""
    },
    {
      "text": "Cagatay Goncu and Kim Marriott. 2015. GraCALC: An accessible graphing calculator. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. 311–312.",
      "doi": "10.1145/2700648.2811353"
    },
    {
      "text": "Giles Hamilton-Fletcher, Marianna Obrist, Phil Watten, Michele Mengucci, and Jamie Ward. 2016. ”I Always Wanted to See the Night Sky” Blind User Preferences for Sensory Substitution Devices. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 2162–2174.",
      "doi": "10.1145/2858036.2858241"
    },
    {
      "text": "Wilko Heuten, Daniel Wichmann, and Susanne Boll. 2006. Interactive 3D sonification for the exploration of city maps. In Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles. 155–164.",
      "doi": "10.1145/1182475.1182492"
    },
    {
      "text": "Andrew Holland. 2009. Audio Description in the Theatre and the Visual Arts: Images into Words. Palgrave Macmillan, London, UK, 170–185. https://doi.org/10.1057/9780230234581_13",
      "doi": ""
    },
    {
      "text": "Leona Holloway, Matthew Butler, Samuel Reinders, and Kim Marriott. 2020. Non-visual access to graphical information on COVID-19. In ASSETS ’20: The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. ACM, New York, NY, USA. https://doi.org/10.1145/3373625.3418015",
      "doi": "10.1145/3373625.3418015"
    },
    {
      "text": "Johan Kildal and Stephen Anthony Brewster. 2006. Providing size-independent overview of non-visual tables. In 12th International Conference on Auditory Display (ICAD2006). 8–15.",
      "doi": ""
    },
    {
      "text": "Megan Knight. 2015. Data journalism in the UK: A preliminary analysis of form and content. Journal of Media Practice 16, 1 (2015), 55–72.",
      "doi": ""
    },
    {
      "text": "Gregory Kramer, Bruce Walker, Terri Bonebright, Perry Cook, John H Flowers, Nadine Miner, and John Neuhoff. 2010. Sonification report: Status of the field and research agenda.",
      "doi": ""
    },
    {
      "text": "QSound Labs. 2013. Virtual Barber Shop. https://www.youtube.com/watch?v=IUDTlvagjJA",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Suranjan Chakraborty, Dustin Carroll, Robert Weir, Bryan Sizemore, and Haley Henderson. 2013. Development and Evaluation of Two Prototypes for Providing Weather Map Data to Blind Users Through Sonification.Journal of Usability Studies 8, 4 (2013).",
      "doi": ""
    },
    {
      "text": "Permagnus Lindborg. 2018. Interactive Sonification of Weather Data for The Locust Wrath, a Multimedia Dance Performance. Leonardo 51, 5 (2018), 466–474. https://doi.org/10.1162/LEON_a_01339",
      "doi": ""
    },
    {
      "text": "David Lunney and Robert C. Morrison. 1990. Auditory presentation of experimental data. In Extracting Meaning from Complex Data: Processing, Display, Interaction, Vol. 1259. International Society for Optics and Photonics, 140–146.",
      "doi": ""
    },
    {
      "text": "Douglass L. Mansur, Merra M. Blattner, and Kenneth I. Joy. 1985. Sound graphs: A numerical data analysis method for the blind. Journal of medical systems 9, 3 (1985), 163–174.",
      "doi": ""
    },
    {
      "text": "Oussama Metatla, Nick Bryan-Kinns, Tony Stockman, and Fiore Martin. 2016. Sonification of reference markers for auditory graphs: effects on non-visual point estimation tasks. PeerJ Computer Science 2(2016), e51. https://doi.org/10.7717/PEERJ-CS.51",
      "doi": ""
    },
    {
      "text": "Michael A. Nees. 2018. Auditory Graphs Are Not the “Killer App” of Sonification, But They Work. Ergonomics in Design: The Quarterly of Human Factors Applications 26, 4(2018), 25–28. https://doi.org/10.1177/1064804618773563",
      "doi": ""
    },
    {
      "text": "John G. Neuhoff. 2011. Chapter 4. Perception, Cognition and Action in Auditory Display.",
      "doi": ""
    },
    {
      "text": "Jaclyn Packer, Katie Vizenor, and Joshua Miele. 2015. An Overview of Video Description: History, Benefits, and Guidelines. Journal of Visual Impairment & Blindness 109, 2 (2015), 83–93. https://doi.org/10.1177/0145482X1510900204",
      "doi": ""
    },
    {
      "text": "Marty Quinn. 2001. Research set to music: The climate symphony and other sonifications of ice core, radar, DNA, seismic and solar wind data. In Proceedings of International Conference on Auditory Display (ICAD.",
      "doi": ""
    },
    {
      "text": "Round Table on Information Access for People with Print Disabilities Inc.2005. Guidelines on Conveying Visual Information. Round Table on Information Access for People with Print Disabilities Inc.",
      "doi": ""
    },
    {
      "text": "Round Table on Information Access for People with Print Disabilities Inc.2021 (in press). Guidelines for Producing Accessible Graphics. Round Table on Information Access for People with Print Disabilities Inc.http://printdisability.org/guidelines/graphics-2021/",
      "doi": ""
    },
    {
      "text": "Ather Sharif, Sanjana Shivani Cintalapati, Jacob O. Wobbrock, and Katharina Reinecke. 2021. Understanding Screen-Reader Users’ Experiences with Online Data Visualisations. In ASSETS ’21: The 23rd International ACM SIGACCESS Conference on Computers and Accessibility. ACM, New York, NY, USA.",
      "doi": "10.1145/3441852.3471202"
    },
    {
      "text": "Yue-Ting Siu. 2013. DIAGRAM Survey on Teaching with Accessible Image Description. Report. DIAGRAM Center.",
      "doi": ""
    },
    {
      "text": "Daniel R. Smith and Bruce N. Walker. 2002. Tick-marks, axes, and labels: The effects of adding context to auditory graphs. In Proc. International Conference on Auditory Display (ICAD).",
      "doi": ""
    },
    {
      "text": "Taliesin L. Smith and Emily B. Moore. 2020. Storytelling to Sensemaking: A Systematic Framework for Designing Auditory Description Display for Interactives. In CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376460",
      "doi": ""
    },
    {
      "text": "Florian Stalph. 2018. Classifying Data Journalism: A content analysis of daily data-driven stories. Journalism Practice 12, 10 (2018), 1332–1350.",
      "doi": ""
    },
    {
      "text": "Brianna J. Tomlinson, Jared Batterman, Yee Chieh Chew, Ashley Henry, and Bruce N. Walker. 2016. Exploring auditory graphing software in the classroom: The effect of auditory graphs on the classroom environment. ACM Transactions on Accessible Computing (TACCESS) 9, 1 (2016), 1–27.",
      "doi": "10.1145/2994606"
    },
    {
      "text": "David Trafimow and Michael Marks. 2015. Editorial. Basic and Applied Social Psychology 36, 37 (2015), 1–2. https://doi.org/10.1080/01973533.2015.1012991",
      "doi": ""
    },
    {
      "text": "Travelear. 2020. Travelear: Listen to the world. https://apps.apple.com/us/app/travelear-listen-to-the-world/id1159408401",
      "doi": ""
    },
    {
      "text": "Judy R. Twedt. 2018. Climate Music and Infosonics for Student Engagement. AGUFM 2018(2018), PA41B–02.",
      "doi": ""
    },
    {
      "text": "Judy R. Twedt, Dargan M. Frierson, Juan Pampin, and Cecilia M. Bitz. 2017. Can you hear the carbon rise? Evaluating multi-sensory climate media in undergraduate learning.AGUFM 2017(2017), PA13A–0221.",
      "doi": ""
    },
    {
      "text": "Joseph Tzelgov, Rafi Srebro, Avishai Henik, and Abraham Kushelevsky. 1987. Radiation detection by ear and by eye. Human Factors 29, 1 (1987), 87–98. https://doi.org/10.1177/001872088702900110",
      "doi": "10.1177/001872088702900110"
    },
    {
      "text": "Nikki Usher. 2016. Interactive journalism: Hackers, data, and code. University of Illinois Press.",
      "doi": ""
    },
    {
      "text": "Andreas Veglis and Charalampos Bratsas. 2017. Towards a Taxonomy of Data Journalism. Journal of Media Critiques (JMC) 3, 11 (2017). https://doi.org/10.17349/jmc117309",
      "doi": ""
    },
    {
      "text": "Paul Vickers. 2005. Ars Informatica–Ars Electronica: Improving Sonification Aesthetics. (2005).",
      "doi": ""
    },
    {
      "text": "World Wide Web Consortium (W3C). 2018. Web Content Accessibility Guidelines (WCAG 2.1). https://www.w3.org/TR/WCAG21/",
      "doi": ""
    },
    {
      "text": "Bruce N. Walker, Gregory Kramer, and David M. Lane. 2001. Psychophysical scaling of sonification mappings: A comparison of visually impaired and sighted listeners. In ICAD International Conference on Auditory Display. 90–94.",
      "doi": ""
    },
    {
      "text": "Bruce N. Walker and Lisa M. Mauney. 2010. Universal design of auditory graphs: A comparison of sonification mappings for visually impaired and sighted listeners. ACM Transactions on Accessible Computing (TACCESS) 2, 3 (2010), 1–16.",
      "doi": "10.1145/1714458.1714459"
    },
    {
      "text": "Ronald L. Wasserstein and Nicole A. Lazar. 2016. The ASA Statement on p-Values: Context, Process, and Purpose. The American Statistician 70, 2 (2016), 129–133. https://doi.org/10.1080/00031305.2016.1154108",
      "doi": ""
    },
    {
      "text": "Wibke Weber, Martin Engebretsen, and Helen Kennedy. 2018. Data stories: Rethinking journalistic storytelling in the context of data journalism. Studies in Communication Sciences 2018, 1 (2018), 191–206.",
      "doi": ""
    },
    {
      "text": "Duncan Alastair Hyatt Williams. 2016. Utility versus creativity in biomedical musification. Journal of Creative Music Systems(2016).",
      "doi": ""
    },
    {
      "text": "Mary Lynn Young, Alfred Hermida, and Johanna Fulda. 2017. What Makes for Great Data Journalism?Journalism Practice 12, 1 (2017), 115–135. https://doi.org/10.1080/17512786.2016.1270171",
      "doi": ""
    },
    {
      "text": "Haixia Zhao, Catherine Plaisant, Ben Shneiderman, and Jonathan Lazar. 2008. Data sonification for users with visual impairment: a case study with georeferenced data. ACM Transactions on Computer-Human Interaction (TOCHI) 15, 1(2008), 1–28.",
      "doi": "10.1145/1352782.1352786"
    },
    {
      "text": "Haixia Zhao, Benjamin K. Smith, Kent Norman, Catherine Plaisant, and Ben Shneiderman. 2005. Interactive sonification of choropleth maps. IEEE MultiMedia 12, 2 (2005), 26–35.",
      "doi": "10.1109/MMUL.2005.28"
    }
  ]
}