{
  "doi": "10.1145/3491102.3502049",
  "title": "Designing for the Bittersweet: Improving Sensitive Experiences with Recommender Systems",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [
    "Best Paper"
  ],
  "abstract": "It is difficult to design systems that honor the complex and often contradictory emotions that can be surfaced by sensitive encounters with recommender systems. To explore the design and ethical considerations in this space, we interviewed 20 people who had recently seen sensitive content through Facebook’s Memories feature. Interviewees typically described how (1) expectedness, (2) context of viewing, and (3) what we describe as “affective sense-making” were important factors for how they perceived “bittersweet” content, a sensitizing concept from our interviews that we expand upon. To address these user needs, we pose provocations to support critical work in this area and we suggest that researchers and designers: (1) draw inspiration from no/low-technology artifacts, (2) use empirical research to identify contextual features that have negative impacts on users, and (3) conduct user studies on affective sense-making.  CAUTION: This paper discusses difficult subject matter related to death and relationships.",
  "tags": [
    "breakup",
    "social media",
    "technology-mediated reflection",
    "death"
  ],
  "authors": [
    {
      "name": "Caitlin Lustig",
      "institution": "Human Centered Design & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548043956",
      "orcid": "missing"
    },
    {
      "name": "Artie Konrad",
      "institution": "Meta, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558085656",
      "orcid": "missing"
    },
    {
      "name": "Jed R. Brubaker",
      "institution": "Information Science, University of Colorado Boulder, United States",
      "img": "/do/10.1145/contrib-81482658286/rel-imgonly/81482658286.jpg",
      "acmid": "81482658286",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Xavier Amatriain, Josep M. Pujol, and Nuria Oliver. 2009. I Like It... I Like It Not: Evaluating User Ratings Noise in Recommender Systems. In User Modeling, Adaptation, and Personalization(Lecture Notes in Computer Science), Geert-Jan Houben, Gord McCalla, Fabio Pianesi, and Massimo Zancanaro (Eds.). Springer, Berlin, Heidelberg, 247–258. https://doi.org/10.1007/978-3-642-02247-0_24",
      "doi": ""
    },
    {
      "text": "Xavier Amatriain, Josep M. Pujol, Nava Tintarev, and Nuria Oliver. 2009. Rate it again: increasing recommendation accuracy by user re-rating. In Proceedings of the third ACM conference on Recommender systems(RecSys ’09). Association for Computing Machinery, New York, NY, USA, 173–180. https://doi.org/10.1145/1639714.1639744",
      "doi": "10.1145/1639714.1639744"
    },
    {
      "text": "Nazanin Andalibi, Pinar Ozturk, and Andrea Forte. 2017. Sensitive Self-disclosures, Responses, and Social Support on Instagram: The Case of #Depression. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1485–1500. https://doi.org/10.1145/2998181.2998243",
      "doi": "10.1145/2998181.2998243"
    },
    {
      "text": "E. Ashley-Dejo, S. Ngwira, and T. Zuva. 2015. A survey of Context-aware Recommender System and services. In 2015 International Conference on Computing, Communication and Security (ICCCS). 1–6. https://doi.org/10.1109/CCCS.2015.7374144",
      "doi": ""
    },
    {
      "text": "Matthew Baldwin, Monica Biernat, and Mark J. Landau. 2015. Remembering the real me: Nostalgia offers a window to the intrinsic self. Journal of Personality and Social Psychology 108, 1(2015), 128–147. https://doi.org/10.1037/a0038033 Place: US Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Krystine Irene Batcho. 2013. Nostalgia: The bittersweet history of a psychological concept. History of Psychology 16, 3 (2013), 165–176. https://doi.org/10.1037/a0032427 Place: US Publisher: Educational Publishing Foundation.",
      "doi": ""
    },
    {
      "text": "Eric PS Baumer and M. Six Silberman. 2011. When the implication is not to design (technology). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2271–2274.",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Bharat Bhole and Bríd Hanna. 2017. The effectiveness of online reviews in the presence of self-selection bias. Simulation Modelling Practice and Theory 77 (Sept. 2017), 108–123. https://doi.org/10.1016/j.simpat.2017.05.005",
      "doi": ""
    },
    {
      "text": "Kyoungsoo Bok, Jongtae Lim, Heetae Yang, and Jaesoo Yoo. 2016. Social group recommendation based on dynamic profiles and collaborative filtering. Neurocomputing 209 (Oct. 2016), 3–13. https://doi.org/10.1016/j.neucom.2015.11.120",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic Analysis. In APA handbook of research methods in psychology, Vol 2: Research designs: Quantitative, qualitative, neuropsychological, and biological., Harris Ed Cooper, Paul M. Camic, Debra L. Long, A. T. Panter, David Ed Rindskopf, and Kenneth J. Sher (Eds.). Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Jed R. Brubaker, Gillian R. Hayes, and Paul Dourish. 2013. Beyond the Grave: Facebook as a Site for the Expansion of Death and Mourning. The Information Society 29, 3 (May 2013), 152–163. https://doi.org/10.1080/01972243.2013.777300 Publisher: Routledge _eprint: https://doi.org/10.1080/01972243.2013.777300.",
      "doi": ""
    },
    {
      "text": "Eleanor R. Burgess, Kathryn E. Ringland, Jennifer Nicholas, Ashley A. Knapp, Jordan Eschler, David C. Mohr, and Madhu C. Reddy. 2019. ”I think people are powerful”: The Sociality of Individuals Managing Depression. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 41:1–41:29. https://doi.org/10.1145/3359143",
      "doi": "10.1145/3359143"
    },
    {
      "text": "Moira Burke and Mike Develin. 2016. Once More with Feeling: Supportive Responses to Social Sharing on Facebook. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing(CSCW ’16). Association for Computing Machinery, New York, NY, USA, 1462–1474. https://doi.org/10.1145/2818048.2835199",
      "doi": "10.1145/2818048.2835199"
    },
    {
      "text": "Stevie Chancellor, Eric P. S. Baumer, and Munmun De Choudhury. 2019. Who is the ”Human” in Human-Centered Machine Learning: The Case of Predicting Mental Health from Social Media. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 147:1–147:32. https://doi.org/10.1145/3359249",
      "doi": "10.1145/3359249"
    },
    {
      "text": "Stevie Chancellor, Michael L. Birnbaum, Eric D. Caine, Vincent M. B. Silenzio, and Munmun De Choudhury. 2019. A Taxonomy of Ethical Tensions in Inferring Mental Health States from Social Media. In Proceedings of the Conference on Fairness, Accountability, and Transparency(FAT* ’19). Association for Computing Machinery, New York, NY, USA, 79–88. https://doi.org/10.1145/3287560.3287587",
      "doi": "10.1145/3287560.3287587"
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing Grounded Theory. SAGE. Google-Books-ID: v_GGAwAAQBAJ.",
      "doi": ""
    },
    {
      "text": "Herbert H. Clark and Susan E. Brennan. 2004. Grounding in communication.In Perspectives on socially shared cognition.American Psychological Association, 127–149. https://doi.org/10.1037/10096-006",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, Eric J. Horvitz, and Aaron Hoff. 2014. Characterizing and predicting postpartum depression from shared facebook data. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing(CSCW ’14). Association for Computing Machinery, New York, NY, USA, 626–638. https://doi.org/10.1145/2531602.2531675",
      "doi": "10.1145/2531602.2531675"
    },
    {
      "text": "Munmun De Choudhury, Sanket S. Sharma, Tomaz Logar, Wouter Eekhout, and René Clausen Nielsen. 2017. Gender and Cross-Cultural Differences in Social Media Disclosures of Mental Illness. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). Association for Computing Machinery, New York, NY, USA, 353–369. https://doi.org/10.1145/2998181.2998220",
      "doi": "10.1145/2998181.2998220"
    },
    {
      "text": "Michael Ann DeVito, Darren Gergle, and Jeremy Birnholtz. 2017. ”Algorithms ruin everything”: #RIPTwitter, Folk Theories, and Resistance to Algorithmic Change in Social Media. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 3163–3174. https://doi.org/10.1145/3025453.3025659",
      "doi": "10.1145/3025453.3025659"
    },
    {
      "text": "Claire Burke Draucker, Donna S. Martsolf, and Candice Poole. 2009. Developing Distress Protocols for Research on Sensitive Topics. Archives of Psychiatric Nursing 23, 5 (Oct. 2009), 343–350. https://doi.org/10.1016/j.apnu.2008.10.008",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Karrie Karahalios, Christian Sandvig, Kristen Vaccaro, Aimee Rickman, Kevin Hamilton, and Alex Kirlik. 2016. First I ”like” it, then I hide it: Folk Theories of Social Feeds. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 2371–2382. https://doi.org/10.1145/2858036.2858494",
      "doi": "10.1145/2858036.2858494"
    },
    {
      "text": "Motahhare Eslami, Sneha R. Krishna Kumaran, Christian Sandvig, and Karrie Karahalios. 2018. Communicating Algorithmic Process in Online Behavioral Advertising. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174006",
      "doi": "10.1145/3173574.3174006"
    },
    {
      "text": "Motahhare Eslami, Aimee Rickman, Kristen Vaccaro, Amirhossein Aleyasen, Andy Vuong, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015. ”I Always Assumed That I Wasn’t Really That Close to [Her]”: Reasoning About Invisible Algorithms in News Feeds. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, New York, NY, USA, 153–162.",
      "doi": "10.1145/2702123.2702556"
    },
    {
      "text": "Jessica L. Feuston and Anne Marie Piper. 2018. Beyond the Coded Gaze: Analyzing Expression of Mental Health and Illness on Instagram. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (Nov. 2018), 51:1–51:21. https://doi.org/10.1145/3274320",
      "doi": "10.1145/3274320"
    },
    {
      "text": "Benjamin Fish and Luke Stark. 2020. Reflexive Design for Fairness and Other Human Values in Formal Models. arXiv:2010.05084 [cs] (Oct. 2020). http://arxiv.org/abs/2010.05084 arXiv:2010.05084.",
      "doi": ""
    },
    {
      "text": "Barton Friedland and Yutaka Yamauchi. 2011. Reflexive design thinking: putting more human in human-centered practices. Interactions 18, 2 (March 2011), 66–71. https://doi.org/10.1145/1925820.1925835",
      "doi": "10.1145/1925820.1925835"
    },
    {
      "text": "Arik Friedman, Bart P. Knijnenburg, Kris Vanhecke, Luc Martens, and Shlomo Berkovsky. 2015. Privacy Aspects of Recommender Systems. In Recommender Systems Handbook, Francesco Ricci, Lior Rokach, and Bracha Shapira (Eds.). Springer US, Boston, MA, 649–688. https://doi.org/10.1007/978-1-4899-7637-6_19",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2015. Disclosure, Stress, and Support During Gender Transition on Facebook. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing(CSCW ’15). Association for Computing Machinery, New York, NY, USA, 1176–1190. https://doi.org/10.1145/2675133.2675152",
      "doi": "10.1145/2675133.2675152"
    },
    {
      "text": "Nan Hu, Paul A. Pavlou, and Jennifer Zhang. 2006. Can online reviews reveal a product’s true quality? Empirical findings and analytical modeling of online word-of-mouth communication. In Proceedings of the 7th ACM conference on Electronic commerce(EC ’06). Association for Computing Machinery, New York, NY, USA, 324–330. https://doi.org/10.1145/1134707.1134743",
      "doi": "10.1145/1134707.1134743"
    },
    {
      "text": "Y. Hu, Y. Koren, and C. Volinsky. 2008. Collaborative Filtering for Implicit Feedback Datasets. In 2008 Eighth IEEE International Conference on Data Mining. 263–272. https://doi.org/10.1109/ICDM.2008.22 ISSN: 2374-8486.",
      "doi": ""
    },
    {
      "text": "Jevan A. Hutson, Jessie G. Taft, Solon Barocas, and Karen Levy. 2018. Debiasing Desire: Addressing Bias & Discrimination on Intimate Platforms. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (Nov. 2018), 73:1–73:18. https://doi.org/10.1145/3274342",
      "doi": "10.1145/3274342"
    },
    {
      "text": "Ellen Isaacs, Artie Konrad, Alan Walendowski, Thomas Lennig, Victoria Hollis, and Steve Whittaker. 2013. Echoes from the past: how technology mediated reflection improves well-being. In Proceedings of the SIGCHI conference on human factors in computing systems. 1071–1080.",
      "doi": "10.1145/2470654.2466137"
    },
    {
      "text": "Benjamin N. Jacobsen. 2020. Sculpting digital voids: The politics of forgetting on Facebook. Convergence (Feb. 2020), 1354856520907390. https://doi.org/10.1177/1354856520907390 Publisher: SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Gawesh Jawaheer, Martin Szomszor, and Patty Kostkova. 2010. Comparison of implicit and explicit feedback from an online music recommendation service. In Proceedings of the 1st International Workshop on Information Heterogeneity and Fusion in Recommender Systems(HetRec ’10). Association for Computing Machinery, New York, NY, USA, 47–51. https://doi.org/10.1145/1869446.1869453",
      "doi": "10.1145/1869446.1869453"
    },
    {
      "text": "Gawesh Jawaheer, Peter Weller, and Patty Kostkova. 2014. Modeling User Preferences in Recommender Systems: A Classification Framework for Explicit and Implicit User Feedback. ACM Transactions on Interactive Intelligent Systems 4, 2 (June 2014), 8:1–8:26. https://doi.org/10.1145/2512208",
      "doi": "10.1145/2512208"
    },
    {
      "text": "Arjan J. P. Jeckmans, Michael Beye, Zekeriya Erkin, Pieter Hartel, Reginald L. Lagendijk, and Qiang Tang. 2013. Privacy in Recommender Systems. In Social Media Retrieval, Naeem Ramzan, Roelof van Zwol, Jong-Seok Lee, Kai Clüver, and Xian-Sheng Hua (Eds.). Springer, London, 263–281. https://doi.org/10.1007/978-1-4471-4555-4_12",
      "doi": ""
    },
    {
      "text": "Jialun ”Aaron” Jiang and Jed R. Brubaker. 2018. Tending Unmarked Graves: Classification of Post-mortem Content on Social Media. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (Nov. 2018), 81:1–81:19. https://doi.org/10.1145/3274350",
      "doi": "10.1145/3274350"
    },
    {
      "text": "Michael Jugovac and Dietmar Jannach. 2017. Interacting with Recommenders–Overview and Research Directions. ACM Transactions on Interactive Intelligent Systems 7, 3 (Sept. 2017), 10:1–10:46. https://doi.org/10.1145/3001837",
      "doi": "10.1145/3001837"
    },
    {
      "text": "Radu Jurca, Florent Garcin, Arjun Talwar, and Boi Faltings. 2010. Reporting incentives and biases in online review forums. ACM Transactions on the Web 4, 2 (April 2010), 5:1–5:27. https://doi.org/10.1145/1734200.1734202",
      "doi": "10.1145/1734200.1734202"
    },
    {
      "text": "Elaine Kasket. 2009. Protocol for responding to participant distress, adapted version for telephone/skype. London Metropolitan University(2009).",
      "doi": ""
    },
    {
      "text": "Artie Konrad, Ellen Isaacs, and Steve Whittaker. 2016. Technology-mediated memory: is technology altering our memories and interfering with well-being?ACM Transactions on Computer-Human Interaction (TOCHI) 23, 4(2016), 1–29. Publisher: ACM New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Artie Konrad, Simon Tucker, John Crane, and Steve Whittaker. 2016. Technology and Reflection: Mood and Memory Mechanisms for Well-Being. Psychology of Well-Being 6, 1 (June 2016), 5. https://doi.org/10.1186/s13612-016-0045-3",
      "doi": ""
    },
    {
      "text": "Denis Kotkov, Shuaiqiang Wang, and Jari Veijalainen. 2016. A survey of serendipity in recommender systems. Knowledge-Based Systems 111 (Nov. 2016), 180–192. https://doi.org/10.1016/j.knosys.2016.08.014",
      "doi": ""
    },
    {
      "text": "Jeff T. Larsen and A. Peter McGraw. 2011. Further evidence for mixed emotions. Journal of Personality and Social Psychology 100, 6(2011), 1095–1110. https://doi.org/10.1037/a0021846 Place: US Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "JeongHyun Lee. 2020. Algorithmic Uses of Cybernetic Memory: Google Photos and a Genealogy of Algorithmically Generated “Memory”. Social Media + Society 6, 4 (Oct. 2020), 2056305120978968. https://doi.org/10.1177/2056305120978968 Publisher: SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Katie A. McLaughlin and Susan Nolen-Hoeksema. 2011. Rumination as a transdiagnostic factor in depression and anxiety. Behaviour Research and Therapy 49, 3 (March 2011), 186–193. https://doi.org/10.1016/j.brat.2010.12.006",
      "doi": ""
    },
    {
      "text": "Ana Lúcia Migowski and Willian Fernandes Araújo. 2019. “Looking back” at personal memories on Facebook: Co-constituitive agencies in contemporary remembrance practices. Journal of Aesthetics & Culture 11, sup1 (Nov. 2019), 1644130. https://doi.org/10.1080/20004214.2019.1644130 Publisher: Routledge _eprint: https://doi.org/10.1080/20004214.2019.1644130.",
      "doi": ""
    },
    {
      "text": "Itishree Mohallick and Özlem Özgöbek. 2017. Exploring privacy concerns in news recommender systems. In Proceedings of the International Conference on Web Intelligence(WI ’17). Association for Computing Machinery, New York, NY, USA, 1054–1061. https://doi.org/10.1145/3106426.3109435",
      "doi": ""
    },
    {
      "text": "Susan Nolen-Hoeksema. 1991. Responses to depression and their effects on the duration of depressive episodes. Journal of Abnormal Psychology 100, 4 (1991), 569–582. https://doi.org/10.1037/0021-843X.100.4.569 Place: US Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Susan Nolen-Hoeksema, Blair E. Wisco, and Sonja Lyubomirsky. 2008. Rethinking Rumination. Perspectives on Psychological Science 3, 5 (Sept. 2008), 400–424. https://doi.org/10.1111/j.1745-6924.2008.00088.x Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "James W. Pennebaker and Sandra K. Beall. 1986. Confronting a traumatic event: Toward an understanding of inhibition and disease. Journal of Abnormal Psychology 95, 3 (1986), 274–281. https://doi.org/10.1037/0021-843X.95.3.274 Place: US Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Anthony T. Pinter, Jialun Aaron Jiang, Katie Z. Gach, Melanie M. Sidwell, James E. Dykes, and Jed R. Brubaker. 2019. ”Am I Never Going to Be Free of All This Crap?” Upsetting Encounters with Algorithmically Curated Content About Ex-Partners. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23. Publisher: ACM New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Brady Robards, Sian Lincoln, Benjamin C. Pinkard, and Jane Harris. 2018. Remembering Through Facebook: Mediated Memory and Intimate Digital Traces. In Digital Intimate Publics and Social Media, Amy Shields Dobson, Brady Robards, and Nicholas Carah (Eds.). Springer International Publishing, Cham, 75–91. https://doi.org/10.1007/978-3-319-97607-5_5",
      "doi": ""
    },
    {
      "text": "Johnny Saldana. 2012. The Coding Manual for Qualitative Researchers. SAGE.",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Axel Janson, Pavel Karpashevich, Camille Nadal, Chengcheng Qu, Claudia Daudén Roquet, Muhammad Umair, Charles Windlin, Gavin Doherty, Kristina Höök, and Corina Sas. 2019. HCI and Affective Health: Taking stock of a decade of studies and charting future research directions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–17. https://doi.org/10.1145/3290605.3300475",
      "doi": "10.1145/3290605.3300475"
    },
    {
      "text": "Corina Sas and Steve Whittaker. 2013. Design for forgetting: disposing of digital possessions after a breakup. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1823–1832.",
      "doi": "10.1145/2470654.2466241"
    },
    {
      "text": "Constantine Sedikides and Tim Wildschut. 2016. A bittersweet emotion that confers psychological health benefits. In The Wiley Handbook of Positive Clinical Psychology, Alex M. Woodand Judith Johnson (Eds.). 125. Publisher: Wiley Online Library.",
      "doi": ""
    },
    {
      "text": "Sho Tsugawa, Yusuke Kikuchi, Fumio Kishino, Kosuke Nakajima, Yuichi Itoh, and Hiroyuki Ohsaki. 2015. Recognizing Depression from Twitter Activity. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, New York, NY, USA, 3187–3196. https://doi.org/10.1145/2702123.2702280",
      "doi": "10.1145/2702123.2702280"
    },
    {
      "text": "Bas Verplanken. 2012. When bittersweet turns sour: Adverse effects of nostalgia on habitual worriers. European Journal of Social Psychology 42, 3 (2012), 285–289. https://doi.org/10.1002/ejsp.1852 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/ejsp.1852.",
      "doi": ""
    },
    {
      "text": "David Watson and Kasey Stanton. 2017. Emotion Blends and Mixed Emotions in the Hierarchical Structure of Affect. Emotion Review 9, 2 (April 2017), 99–104. https://doi.org/10.1177/1754073916639659 Publisher: SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Maranke Wieringa. 2020. What to account for when accounting for algorithms: a systematic literature review on algorithmic accountability. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency(FAT* ’20). Association for Computing Machinery, New York, NY, USA, 1–18. https://doi.org/10.1145/3351095.3372833",
      "doi": "10.1145/3351095.3372833"
    },
    {
      "text": "Tim Wildschut, Constantine Sedikides, Jamie Arndt, and Clay Routledge. 2006. Nostalgia: content, triggers, functions. Journal of Personality and Social Psychology 91, 5 (Nov. 2006), 975–993. https://eprints.soton.ac.uk/40445/ Number: 5.",
      "doi": ""
    },
    {
      "text": "Hua Zhou and Kenneth Lange. 2009. Rating Movies and Rating the Raters Who Rate Them. The American Statistician 63, 4 (Nov. 2009), 297–307. https://doi.org/10.1198/tast.2009.08278 Publisher: Taylor & Francis _eprint: https://doi.org/10.1198/tast.2009.08278.",
      "doi": ""
    },
    {
      "text": "Xinyue Zhou, Constantine Sedikides, Tim Wildschut, and Ding-Guo Gao. 2008. Counteracting Loneliness: On the Restorative Function of Nostalgia. Psychological Science 19, 10 (Oct. 2008), 1023–1029. https://doi.org/10.1111/j.1467-9280.2008.02194.x Publisher: SAGE Publications Inc.",
      "doi": ""
    }
  ]
}