{
  "doi": "10.1145/3491102.3517571",
  "title": "Effects of Pedestrian Behavior, Time Pressure, and Repeated Exposure on Crossing Decisions in Front of Automated Vehicles Equipped with External Communication",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2022,
  "badges": [],
  "abstract": "Automated vehicles are expected to substitute driver-pedestrian communication via LED strips or displays. This communication is expected to improve trust and the crossing process in general. However, numerous factors such as other pedestrians’ behavior, perceived time pressure, or previous experience influence crossing decisions. Therefore, we report the results of a triply subdivided Virtual Reality study (N=18) evaluating these. Results show that external communication was perceived as hedonically pleasing, increased perceived safety and trust, and also that pedestrians’ behavior affected participants’ behavior. A timer did not alter crossing behavior, however, repeated exposure increased trust and reduced crossing times, showing a habituation effect. Our work helps better to integrate research on external communication in ecologically valid settings.",
  "tags": [
    "Autonomous vehicles",
    "Chicken Game",
    "External communication",
    "Pedestrian Behavior",
    "eHMI."
  ],
  "authors": [
    {
      "name": "Mark Colley",
      "institution": "Institute of Media Informatics, Ulm University, Germany",
      "img": "/do/10.1145/contrib-99659260328/rel-imgonly/img_6166.jpg",
      "acmid": "99659260328",
      "orcid": "0000-0001-5207-5029"
    },
    {
      "name": "Elvedin Bajrovic",
      "institution": "Institute of Media Informatics, Ulm University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239489",
      "orcid": "missing"
    },
    {
      "name": "Enrico Rukzio",
      "institution": "University of Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100239955",
      "orcid": "0000-0002-4213-2226"
    }
  ],
  "references": [
    {
      "text": "Claudia Ackermann, Matthias Beggiato, Sarah Schubert, and Josef F Krems. 2019. An experimental study to investigate design and assessment criteria: what is important for communication between pedestrians and automated vehicles?Applied ergonomics 75(2019), 272–282.",
      "doi": ""
    },
    {
      "text": "Sander Ackermans, Debargha Dey, Peter Ruijten, Raymond H. Cuijpers, and Bastian Pfleging. 2020. The Effects of Explicit Intention Communication, Conspicuous Sensors, and Pedestrian Attitude in Interactions with Automated Vehicles. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376197",
      "doi": "10.1145/3313831.3376197"
    },
    {
      "text": "Ashratuz Zavin Asha, Christopher Smith, Georgina Freeman, Sean Crump, Sowmya Somanath, Lora Oehlberg, and Ehud Sharlin. 2021. Co-Designing Interactions between Pedestrians in Wheelchairs and Autonomous Vehicles. In Designing Interactive Systems Conference 2021 (Virtual Event, USA) (DIS ’21). Association for Computing Machinery, New York, NY, USA, 339–351. https://doi.org/10.1145/3461778.3462068",
      "doi": "10.1145/3461778.3462068"
    },
    {
      "text": "Fanta Camara, Serhan Cosar, Nicola Bellotto, Natasha Merat, Charles Fox, 2020. Continuous Game Theory Pedestrian Modelling Method for Autonomous Vehicles.",
      "doi": ""
    },
    {
      "text": "Fanta Camara, Richard Romano, Gustav Markkula, Ruth Madigan, Natasha Merat, and Charles Fox. 2018. Empirical game theory of pedestrian interaction for autonomous vehicles., 238–244 pages.",
      "doi": ""
    },
    {
      "text": "Chia-Ming Chang, Koki Toda, Takeo Igarashi, Masahiro Miyata, and Yasuhiro Kobayashi. 2018. A Video-Based Study Comparing Communication Modalities between an Autonomous Car and a Pedestrian. In Adjunct Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Toronto, ON, Canada) (AutomotiveUI ’18). Association for Computing Machinery, New York, NY, USA, 104–109. https://doi.org/10.1145/3239092.3265950",
      "doi": "10.1145/3239092.3265950"
    },
    {
      "text": "Vicky Charisi, Azra Habibovic, Jonas Andersson, Jamy Li, and Vanessa Evers. 2017. Children’s Views on Identification and Intention Communication of Self-Driving Vehicles. In Proceedings of the 2017 Conference on Interaction Design and Children (Stanford, California, USA) (IDC ’17). Association for Computing Machinery, New York, NY, USA, 399–404. https://doi.org/10.1145/3078072.3084300",
      "doi": "10.1145/3078072.3084300"
    },
    {
      "text": "Mark Colley, Ali Askari, Marcel Walch, Marcel Woide, and Enrico Rukzio. 2021. ORIAS: On-The-Fly Object Identification and Action Selection for Highly Automated Vehicles. In 13th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. Association for Computing Machinery, New York, NY, USA, 79–89. https://doi.org/10.1145/3409118.3475134",
      "doi": "10.1145/3409118.3475134"
    },
    {
      "text": "Mark Colley, Jan Henry Belz, and Enrico Rukzio. 2021. Investigating the Effects of Feedback Communication of Autonomous Vehicles. In 13th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. Association for Computing Machinery, New York, NY, USA, 263–273. https://doi.org/10.1145/3409118.3475133",
      "doi": "10.1145/3409118.3475133"
    },
    {
      "text": "Mark Colley, Christian Bräuner, Mirjam Lanzer, Walch Marcel, Martin Baumann, and Rukzio Rukzio. 2020. Effect of Visualization of Pedestrian Intention Recognition on Trust and Cognitive Load. In Proceedings of the 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(AutomotiveUI ’20). ACM, Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3409120.3410648",
      "doi": "10.1145/3409120.3410648"
    },
    {
      "text": "Mark Colley, Benjamin Eder, Jan Ole Rixen, and Enrico Rukzio. 2021. Effects of Semantic Segmentation Visualization on Trust, Situation Awareness, and Cognitive Load in Highly Automated Vehicles. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 155, 11 pages. https://doi.org/10.1145/3411764.3445351",
      "doi": "10.1145/3411764.3445351"
    },
    {
      "text": "Mark Colley, Svenja Krauß, Mirjam Lanzer, and Enrico Rukzio. 2021. How Should Automated Vehicles Communicate Critical Situations? A Comparative Analysis of Visualization Concepts. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 5, 3, Article 94 (2021), 23 pages. https://doi.org/10.1145/3478111",
      "doi": "10.1145/3478111"
    },
    {
      "text": "Mark Colley, Mirjam Lanzer, Jan Henry Belz, Marcel Walch, and Enrico Rukzio. 2021. Evaluating the Impact of Decals on Driver Stereotype Perception and Exploration of Personalization of Automated Vehicles via Digital Decals. In 13th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. Association for Computing Machinery, New York, NY, USA, 296–306. https://doi.org/10.1145/3409118.3475132",
      "doi": "10.1145/3409118.3475132"
    },
    {
      "text": "Mark Colley, Surong Li, and Enrico Rukzio. 2021. Increasing Pedestrian Safety Using External Communication of Autonomous Vehicles for Signalling Hazards. In Proceedings of the 23rd International Conference on Mobile Human-Computer Interaction. Association for Computing Machinery, New York, NY, USA, Article 20, 10 pages. https://doi.org/10.1145/3447526.3472024",
      "doi": "10.1145/3447526.3472024"
    },
    {
      "text": "Mark Colley, Stefanos Mytilineos, Marcel Walch, Jan Gugenheimer, and Enrico Rukzio. 2022. Requirements for the Interaction With Highly Automated Construction Site Delivery Trucks. Frontiers in Human Dynamics 4 (2022), 8 pages. https://doi.org/10.3389/fhumd.2022.794890",
      "doi": ""
    },
    {
      "text": "Mark Colley, Stefanos Can Mytilineos, Marcel Walch, Jan Gugenheimer, and Enrico Rukzio. 2020. Evaluating Highly Automated Trucks as Signaling Lights. In Proceedings of the 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(AutomotiveUI ’20). ACM, Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3409120.3410647",
      "doi": "10.1145/3409120.3410647"
    },
    {
      "text": "Mark Colley and Rukzio Rukzio. 2020. A Design Space for External Communication of Autonomous Vehicles. In Proceedings of the 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(AutomotiveUI ’20). ACM, Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3409120.3410646",
      "doi": "10.1145/3409120.3410646"
    },
    {
      "text": "Mark Colley and Rukzio Rukzio. 2020. Towards a Design Space for External Communication of Autonomous Vehicles. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, Hawaii USA) (CHI ’20). ACM, Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3334480.3382844",
      "doi": "10.1145/3334480.3382844"
    },
    {
      "text": "Mark Colley, Marcel Walch, Jan Gugenheimer, Ali Askari, and Enrico Rukzio. 2020. Towards Inclusive External Communication of Autonomous Vehicles for Pedestrians with Vision Impairments. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376472",
      "doi": "10.1145/3313831.3376472"
    },
    {
      "text": "Mark Colley, Marcel Walch, Jan Gugenheimer, and Enrico Rukzio. 2019. Including People with Impairments from the Start: External Communication of Autonomous Vehicles. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications: Adjunct Proceedings (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 307–314. https://doi.org/10.1145/3349263.3351521",
      "doi": "10.1145/3349263.3351521"
    },
    {
      "text": "Mark Colley, Marcel Walch, and Enrico Rukzio. 2019. For a Better (Simulated) World: Considerations for VR in External Communication Research. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications: Adjunct Proceedings (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 442–449. https://doi.org/10.1145/3349263.3351523",
      "doi": "10.1145/3349263.3351523"
    },
    {
      "text": "Mark Colley, Marcel Walch, and Rukzio Rukzio. 2020. Unveiling the Lack of Scalability in Research on External Communication of Autonomous Vehicles. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, Hawaii USA) (CHI ’20). ACM, Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3334480.3382865",
      "doi": "10.1145/3334480.3382865"
    },
    {
      "text": "Shuchisnigdha Deb, Daniel W. Carruth, Muztaba Fuad, Laura M. Stanley, and Darren Frey. 2020. Comparison of Child and Adult Pedestrian Perspectives of External Features on Autonomous Vehicles Using Virtual Reality Experiment. In Advances in Human Factors of Transportation, Neville Stanton (Ed.). Springer International Publishing, Cham, 145–156.",
      "doi": ""
    },
    {
      "text": "Shuchisnigdha Deb, Lesley Strawderman, Daniel W Carruth, Janice DuBien, Brian Smith, and Teena M Garrison. 2017. Development and validation of a questionnaire to assess pedestrian receptivity toward fully autonomous vehicles. Transportation research part C: emerging technologies 84 (2017), 178–195.",
      "doi": ""
    },
    {
      "text": "Debargha Dey, Azra Habibovic, Andreas Löcken, Philipp Wintersberger, Bastian Pfleging, Andreas Riener, Marieke Martens, and Jacques Terken. 2020. Taming the eHMI jungle: A classification taxonomy to guide, compare, and assess the design principles of automated vehicles’ external human-machine interfaces. Transportation Research Interdisciplinary Perspectives 7 (2020), 100174.",
      "doi": ""
    },
    {
      "text": "Debargha Dey, Azra Habibovic, Bastian Pfleging, Marieke Martens, and Jacques Terken. 2020. Color and Animation Preferences for a Light Band EHMI in Interactions Between Automated Vehicles and Pedestrians. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376325",
      "doi": ""
    },
    {
      "text": "Debargha Dey, Kai Holländer, Melanie Berger, Berry Eggen, Marieke Martens, Bastian Pfleging, and Jacques Terken. 2020. Distance-Dependent EHMIs for the Interaction Between Automated Vehicles and Pedestrians. In 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Virtual Event, DC, USA) (AutomotiveUI ’20). Association for Computing Machinery, New York, NY, USA, 192–204. https://doi.org/10.1145/3409120.3410642",
      "doi": "10.1145/3409120.3410642"
    },
    {
      "text": "Debargha Dey, Marieke Martens, Chao Wang, Felix Ros, and Jacques Terken. 2018. Interface Concepts for Intent Communication from Autonomous Vehicles to Vulnerable Road Users. In Adjunct Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Toronto, ON, Canada) (AutomotiveUI ’18). Association for Computing Machinery, New York, NY, USA, 82–86. https://doi.org/10.1145/3239092.3265946",
      "doi": "10.1145/3239092.3265946"
    },
    {
      "text": "Debargha Dey, Francesco Walker, Marieke Martens, and Jacques Terken. 2019. Gaze Patterns in Pedestrian Interaction with Vehicles: Towards Effective Design of External Human-Machine Interfaces for Automated Vehicles. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 369–378. https://doi.org/10.1145/3342197.3344523",
      "doi": "10.1145/3342197.3344523"
    },
    {
      "text": "Liza Dixon. 2020. Autonowashing: the greenwashing of vehicle automation. Transportation research interdisciplinary perspectives 5 (2020), 100113.",
      "doi": ""
    },
    {
      "text": "J Dolphin, L Kennedy, S O’Donnell, and GJS Wilde. 1970. Factors influencing pedestrian violations.",
      "doi": ""
    },
    {
      "text": "Na Du, Jacob Haspiel, Qiaoning Zhang, Dawn Tilbury, Anuj K. Pradhan, X. Jessie Yang, and Lionel P. Robert. 2019. Look who’s talking now: Implications of AV’s explanations on driver’s trust, AV preference, anxiety and mental workload. Transportation Research Part C: Emerging Technologies 104 (2019), 428–442. https://doi.org/10.1016/j.trc.2019.05.025 ID: 271729.",
      "doi": ""
    },
    {
      "text": "Frida Eriksson, Angelos Malikoutis, Adeliina Aho Tarkka, Potus Unger, Pedram Nayeri, Anders Bäckman, Maria Kougioumoutzi, Karolina Söderberg, Julia andIngre, and Stas Krupenia. 2020. External HMI for Autonomous Buses - Results of the IQ Mobility project in preparation for Project Qatar Mobility.",
      "doi": ""
    },
    {
      "text": "Stefanie M. Faas, Andrea C. Kao, and Martin Baumann. 2020. A Longitudinal Video Study on Communicating Status and Intent for Self-Driving Vehicle – Pedestrian Interaction. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376484",
      "doi": "10.1145/3313831.3376484"
    },
    {
      "text": "Stefanie M Faas, Lesley-Ann Mathis, and Martin Baumann. 2020. External HMI for self-driving vehicles: Which information shall be displayed?Transportation Research Part F: Traffic Psychology and Behaviour 68 (2020), 171–186.",
      "doi": ""
    },
    {
      "text": "Daniel J Fagnant and Kara Kockelman. 2015. Preparing a nation for autonomous vehicles: opportunities, barriers and policy recommendations. Transportation Research Part A: Policy and Practice 77 (2015), 167–181.",
      "doi": ""
    },
    {
      "text": "Jolyon J Faria, Stefan Krause, and Jens Krause. 2010. Collective behavior in road crossing pedestrians: the role of social information. Behavioral ecology 21, 6 (2010), 1236–1242.",
      "doi": ""
    },
    {
      "text": "Franz Faul, Edgar Erdfelder, Axel Buchner, and Albert-Georg Lang. 2009. Statistical power analyses using G* Power 3.1: Tests for correlation and regression analyses. Behavior research methods 41, 4 (2009), 1149–1160.",
      "doi": ""
    },
    {
      "text": "Evelyn Florentine, Mark Adam Ang, Scott Drew Pendleton, Hans Andersen, and Marcelo H. Ang. 2016. Pedestrian Notification Methods in Autonomous Vehicles for Multi-Class Mobility-on-Demand Service. In Proceedings of the Fourth International Conference on Human Agent Interaction (Biopolis, Singapore) (HAI ’16). Association for Computing Machinery, New York, NY, USA, 387–392. https://doi.org/10.1145/2974804.2974833",
      "doi": "10.1145/2974804.2974833"
    },
    {
      "text": "Charles Fox, Fanta Camara, Gustav Markkula, Richard Romano, Ruth Madigan, Natasha Merat, 2018. When should the chicken cross the road?: Game theory for autonomous vehicle-human interactions.",
      "doi": ""
    },
    {
      "text": "David C. Funder and Daniel J. Ozer. 2019. Evaluating Effect Size in Psychological Research: Sense and Nonsense. Advances in Methods and Practices in Psychological Science 2, 2(2019), 156–168. https://doi.org/10.1177/2515245919847202 arXiv:https://doi.org/10.1177/2515245919847202",
      "doi": ""
    },
    {
      "text": "W Andrew Harrell. 1991. Factors influencing pedestrian cautiousness in crossing streets. The Journal of Social Psychology 131, 3 (1991), 367–372.",
      "doi": ""
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, Amsterdam, The Netherlands, 139–183.",
      "doi": ""
    },
    {
      "text": "Norman W Heimstra, James Nichols, and Gary Martin. 1969. An experimental methodology for analysis of child pedestrian behavior. Pediatrics 44, 5 (1969), 832–838.",
      "doi": ""
    },
    {
      "text": "Kai Holländer, Mark Colley, Enrico Rukzio, and Andreas Butz. 2021. A Taxonomy of Vulnerable Road Users for HCI Based On A Systematic Literature Review. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 158, 13 pages. https://doi.org/10.1145/3411764.3445480",
      "doi": "10.1145/3411764.3445480"
    },
    {
      "text": "Kai Holländer, Andy Krüger, and Andreas Butz. 2020. Save the Smombies: App-Assisted Street Crossing. In 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services (Oldenburg, Germany) (MobileHCI ’20). Association for Computing Machinery, New York, NY, USA, Article 22, 11 pages. https://doi.org/10.1145/3379503.3403547",
      "doi": "10.1145/3379503.3403547"
    },
    {
      "text": "Kai Holländer, Philipp Wintersberger, and Andreas Butz. 2019. Overtrust in External Cues of Automated Vehicles: An Experimental Investigation. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 211–221. https://doi.org/10.1145/3342197.3344528",
      "doi": "10.1145/3342197.3344528"
    },
    {
      "text": "Ming Hou, Karthik Mahadevan, Sowmya Somanath, Ehud Sharlin, and Lora Oehlberg. 2020. Autonomous Vehicle-Cyclist Interaction: Peril and Promise. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376884",
      "doi": "10.1145/3313831.3376884"
    },
    {
      "text": "Lynn M Hulse, Hui Xie, and Edwin R Galea. 2018. Perceptions of autonomous vehicles: Relationships with road users, risk, gender and age. Safety science 102(2018), 1–13.",
      "doi": ""
    },
    {
      "text": "Jeamin Koo, Jungsuk Kwac, Wendy Ju, Martin Steinert, Larry Leifer, and Clifford Nass. 2015. Why did my car just do that? Explaining semi-autonomous driving actions to improve driver understanding, trust, and performance. International Journal on Interactive Design and Manufacturing (IJIDeM) 9, 4(2015), 269–275.",
      "doi": ""
    },
    {
      "text": "Moritz Körber. 2019. Theoretical Considerations and Development of a Questionnaire to Measure Trust in Automation. In Proceedings of the 20th Congress of the International Ergonomics Association (IEA 2018), Sebastiano Bagnara, Riccardo Tartaglia, Sara Albolino, Thomas Alexander, and Yushi Fujita (Eds.). Springer International Publishing, Cham, 13–30.",
      "doi": "10.1007/978-"
    },
    {
      "text": "Moritz Körber, Eva Baseler, and Klaus Bengler. 2018. Introduction matters: Manipulating trust in automation and reliance in automated driving. Applied ergonomics 66(2018), 18–31. https://doi.org/10.1016/j.apergo.2017.07.006",
      "doi": ""
    },
    {
      "text": "Mirjam Lanzer, Franziska Babel, Fei Yan, Bihan Zhang, Fang You, Jianmin Wang, and Martin Baumann. 2020. Designing Communication Strategies of Autonomous Vehicles with Pedestrians: An Intercultural Study. In 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Virtual Event, DC, USA) (AutomotiveUI ’20). Association for Computing Machinery, New York, NY, USA, 122–131. https://doi.org/10.1145/3409120.3410653",
      "doi": "10.1145/3409120.3410653"
    },
    {
      "text": "Mirjam Lanzer, Tanja Stoll, Mark Colley, and Martin Baumann. 2021. Intelligent mobility in the city: the influence of system and context factors on drivers’ takeover willingness and trust in automated vehicles. Frontiers in Human Dynamics 3 (2021), 42. https://doi.org/10.3389/fhumd.2021.676667",
      "doi": ""
    },
    {
      "text": "Yee Mun Lee, Ruth Madigan, Oscar Giles, Laura Garach-Morcillo, Gustav Markkula, Charles Fox, Fanta Camara, Markus Rothmueller, Signe Alexandra Vendelbo-Larsen, Pernille Holm Rasmussen, 2021. Road users rarely use explicit communication when interacting in today’s traffic: implications for automated vehicles. Cognition, Technology & Work 23 (2021), 367–380.",
      "doi": "10.1007/s10111-020-00635-y"
    },
    {
      "text": "Monroe Lefkowitz, Robert R Blake, and Jane Srygley Mouton. 1955. Status factors in pedestrian violation of traffic signals.The Journal of Abnormal and Social Psychology 51, 3(1955), 704.",
      "doi": ""
    },
    {
      "text": "Andreas Löcken, Carmen Golling, and Andreas Riener. 2019. How Should Automated Vehicles Interact with Pedestrians? A Comparative Analysis of Interaction Concepts in Virtual Reality. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 262–274. https://doi.org/10.1145/3342197.3344544",
      "doi": "10.1145/3342197.3344544"
    },
    {
      "text": "Victor Malmsten Lundgren, Azra Habibovic, Jonas Andersson, Tobias Lagström, Maria Nilsson, Anna Sirkka, Johan Fagerlönn, Rikard Fredriksson, Claes Edgren, Stas Krupenia, and Dennis Saluäär. 2017. Will There Be New Communication Needs When Introducing Automated Vehicles to the Urban Context?. In Advances in Human Aspects of Transportation, Neville A. Stanton, Steven Landry, Giuseppe Di Bucchianico, and Andrea Vallicelli (Eds.). Springer International Publishing, Cham, 485–497.",
      "doi": ""
    },
    {
      "text": "Haiko Lüpsen. 2020. R-Funktionen zur Varianzanalyse. http://www.uni-koeln.de/~luepsen/R/. [Online; accessed 25-SEPTEMBER-2020].",
      "doi": ""
    },
    {
      "text": "Karthik Mahadevan, Sowmya Somanath, and Ehud Sharlin. 2018. Communicating Awareness and Intent in Autonomous Vehicle-Pedestrian Interaction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174003",
      "doi": "10.1145/3173574.3174003"
    },
    {
      "text": "Dylan Moore, Rebecca Currano, and David Sirkin. 2020. Sound Decisions: How Synthetic Motor Sounds Improve Autonomous Vehicle-Pedestrian Interactions. In 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. Association for Computing Machinery, New York, NY, USA, 94–103.",
      "doi": ""
    },
    {
      "text": "Dylan Moore, Rebecca Currano, G. Ella Strack, and David Sirkin. 2019. The Case for Implicit External Human-Machine Interfaces for Autonomous Vehicles. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 295–307. https://doi.org/10.1145/3342197.3345320",
      "doi": "10.1145/3342197.3345320"
    },
    {
      "text": "Trung Thanh Nguyen, Kai Holländer, Marius Hoggenmueller, Callum Parker, and Martin Tomitsch. 2019. Designing for Projection-Based Communication between Autonomous Vehicles and Pedestrians. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 284–294. https://doi.org/10.1145/3342197.3344543",
      "doi": "10.1145/3342197.3344543"
    },
    {
      "text": "Aaron Powers and Sara Kiesler. 2006. The Advisor Robot: Tracing People’s Mental Model from a Robot’s Physical Attributes. In Proceedings of the 1st ACM SIGCHI/SIGART Conference on Human-Robot Interaction (Salt Lake City, Utah, USA) (HRI ’06). Association for Computing Machinery, New York, NY, USA, 218–225. https://doi.org/10.1145/1121241.1121280",
      "doi": "10.1145/1121241.1121280"
    },
    {
      "text": "Amir Rasouli, Iuliia Kotseruba, and John K Tsotsos. 2017. Understanding pedestrian behavior in complex traffic scenes. IEEE Transactions on Intelligent Vehicles 3, 1 (2017), 61–70.",
      "doi": ""
    },
    {
      "text": "Amir Rasouli and John K Tsotsos. 2019. Autonomous vehicles that interact with pedestrians: A survey of theory and practice. IEEE Transactions on Intelligent Transportation Systems 21, 3(2019), 900–918.",
      "doi": ""
    },
    {
      "text": "Shadan Sadeghian, Marc Hassenzahl, and Kai Eckoldt. 2020. An Exploration of Prosocial Aspects of Communication Cues between Automated Vehicles and Pedestrians. In 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Virtual Event, DC, USA) (AutomotiveUI ’20). Association for Computing Machinery, New York, NY, USA, 205–211. https://doi.org/10.1145/3409120.3410657",
      "doi": "10.1145/3409120.3410657"
    },
    {
      "text": "Hatice Sahin, Heiko Mueller, Shadan Sadeghian, Debargha Dey, Andreas Löcken, Andrii Matviienko, Mark Colley, Azra Habibovic, and Philipp Wintersberger. 2021. Workshop on Prosocial Behavior in Future Mixed Traffic. In 13th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. Association for Computing Machinery, New York, NY, USA, 167–170. https://doi.org/10.1145/3473682.3477438",
      "doi": "10.1145/3473682.3477438"
    },
    {
      "text": "P Schioldborg. 1976. Children, traffic and traffic training: analysis of the Children’s Traffic Club. The Voice of the Pedestrian 6 (1976), 12–19.",
      "doi": ""
    },
    {
      "text": "Martin Schrepp, Andreas Hinderks, and Jörg Thomaschewski. 2017. Design and Evaluation of a Short Version of the User Experience Questionnaire (UEQ-S).International Journal of Interactive Multimedia and Artificial Intelligence 4, 6 (2017), 103–108. https://doi.org/10.9781/ijimai.2017.09.001",
      "doi": ""
    },
    {
      "text": "Nirajan Shiwakoti, Richard Tay, and Peter Stasinopoulos. 2017. Exploring jaywalking at intersections.",
      "doi": ""
    },
    {
      "text": "Andreas Sieß, Kathleen Hübel, Daniel Hepperle, Andreas Dronov, Christian Hufnagel, Julia Aktun, and Matthias Wölfel. 2015. Hybrid City Lighting-Improving Pedestrians’ Safety through Proactive Street Lighting. In 2015 International Conference on Cyberworlds (CW). IEEE, New York, NY, USA, 46–49.",
      "doi": "10.1109/CW.2015.51"
    },
    {
      "text": "Matus Sucha, Daniel Dostal, and Ralf Risser. 2017. Pedestrian-driver communication and decision strategies at marked crossings. Accident Analysis & Prevention 102 (2017), 41–50.",
      "doi": ""
    },
    {
      "text": "Unity Technologies. 2021. Unity. Unity Technologies.",
      "doi": ""
    },
    {
      "text": "Tianjiao Wang, Jianping Wu, Pengjun Zheng, and Mike McDonald. 2010. Study of pedestrians’ gap acceptance behavior when they jaywalk outside crossing facilities. In 13th International IEEE Conference on Intelligent Transportation Systems. IEEE, IEEE, New York, NY, USA, 1295–1300.",
      "doi": ""
    },
    {
      "text": "Annette Werner. 2018. New Colours for Autonomous Driving: An Evaluation of Chromaticities for the External Lighting Equipment of Autonomous Vehicles. https://doi.org/10.25538/tct.v0i1.692 Number: 1.",
      "doi": ""
    },
    {
      "text": "Dana Yagil. 2000. Beliefs, motives and situational factors related to pedestrians’ self-reported behavior at signal-controlled crossings. Transportation Research Part F: Traffic Psychology and Behaviour 3, 1(2000), 1–13.",
      "doi": ""
    },
    {
      "text": "Raphael Zimmermann and Reto Wettach. 2017. First Step into Visceral Interaction with Autonomous Vehicles. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Oldenburg, Germany) (AutomotiveUI ’17). Association for Computing Machinery, New York, NY, USA, 58–64. https://doi.org/10.1145/3122986.3122988",
      "doi": "10.1145/3122986.3122988"
    }
  ]
}