{
  "doi": "10.1145/3491102.3501944",
  "title": "Understanding Emotion Changes in Mobile Experience Sampling",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "Mobile experience sampling methods (ESMs) are widely used to measure users’ affective states by randomly sending self-report requests. However, this random probing can interrupt users and adversely influence users’ emotional states by inducing disturbance and stress. This work aims to understand how ESMs themselves may compromise the validity of ESM responses and what contextual factors contribute to changes in emotions when users respond to ESMs. Towards this goal, we analyze 2,227 samples of the mobile ESM data collected from 78 participants. Our results show ESM interruptions positively or negatively affected users’ emotional states in at least 38% of ESMs, and the changes in emotions are closely related to the contexts users were in prior to ESMs. Finally, we discuss the implications of using the ESM and possible considerations for mitigating the variability in emotional responses in the context of mobile data collection for affective computing.",
  "authors": [
    {
      "name": "Soowon Kang",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260359",
      "orcid": "missing"
    },
    {
      "name": "Cheul Young Park",
      "institution": "KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659576777",
      "orcid": "missing"
    },
    {
      "name": "Auk Kim",
      "institution": "Department of Computer Science and Engineering, Kangwon National University, Korea, Republic of",
      "img": "/do/10.1145/contrib-87958893057/rel-imgonly/aukkim.jpg",
      "acmid": "87958893057",
      "orcid": "missing"
    },
    {
      "name": "Narae Cha",
      "institution": "KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659320323",
      "orcid": "missing"
    },
    {
      "name": "Uichin Lee",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81317496784",
      "orcid": "0000-0002-1888-1569"
    }
  ],
  "references": [
    {
      "text": "Erik M Altmann and J Gregory Trafton. 2002. Memory for goals: An activation-based model. Cognitive science 26, 1 (2002), 39–83.",
      "doi": ""
    },
    {
      "text": "Brian P Bailey and Shamsi T Iqbal. 2008. Understanding changes in mental workload during execution of goal-directed tasks and its application for interruption management. ACM Transactions on Computer-Human Interaction 14, 4(2008), 1–28.",
      "doi": "10.1145/1314683.1314689"
    },
    {
      "text": "Brian P Bailey and Joseph A Konstan. 2006. On the need for attention-aware systems: Measuring effects of interruption on task performance, error rate, and affective state. Computers in human behavior 22, 4 (2006), 685–708.",
      "doi": ""
    },
    {
      "text": "Brian P Bailey, Joseph A Konstan, and John V Carlis. 2001. The Effects of Interruptions on Task Performance, Annoyance, and Anxiety in the User Interface.. In Interact, Vol. 1. 593–601.",
      "doi": ""
    },
    {
      "text": "Daniel J Beal. 2015. ESM 2.0: State of the art and future potential of experience sampling methods in organizational research. Annual Review of Organizational Psychology and Organizational Behavior 2, 1(2015), 383–407.",
      "doi": ""
    },
    {
      "text": "Andrey Bogomolov, Bruno Lepri, Michela Ferron, Fabio Pianesi, and Alex Sandy Pentland. 2014. Daily Stress Recognition from Mobile Phone Data, Weather Conditions and Individual Traits. In Proceedings of the 22nd ACM international conference on Multimedia. ACM, 477–486.",
      "doi": "10.1145/2647868.2654933"
    },
    {
      "text": "Margaret M Bradley and Peter J Lang. 1994. Measuring emotion: the self-assessment manikin and the semantic differential. Journal of behavior therapy and experimental psychiatry 25, 1(1994), 49–59.",
      "doi": "10.1016/0005-7916%2894%2990063-9"
    },
    {
      "text": "Narae Cha, Auk Kim, Cheul Young Park, Soowon Kang, Mingyu Park, Jae-Gil Lee, Sangsu Lee, and Uichin Lee. 2020. Hello There! Is Now a Good Time to Talk? Opportune Moments for Proactive Interactions with Smart Speakers. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 3 (2020), 1–28.",
      "doi": "10.1145/3411810"
    },
    {
      "text": "Yawen Chan, Suzanne Ho-wai So, Arthur Dun Ping Mak, Kewin Tien Ho Siah, Wai Chan, and Justin C. Y. Wu. 2019. The temporal relationship of daily life stress, emotions, and bowel symptoms in irritable bowel syndrome—Diarrhea subtype: A smartphone-based experience sampling study. Neurogastroenterology & Motility 31, 3 (2019), e13514.",
      "doi": ""
    },
    {
      "text": "Tamlin Conner Christensen, Lisa Feldman Barrett, Eliza Bliss-Moreau, Kirsten Lebo, and Cynthia Kaschub. 2003. A practical guide to experience-sampling procedures. Journal of Happiness Studies 4, 1 (2003), 53–78.",
      "doi": ""
    },
    {
      "text": "Matteo Ciman and Katarzyna Wac. 2016. Individuals’ stress assessment using human-smartphone interaction analysis. IEEE Transactions on Affective Computing 9, 1 (2016), 51–65.",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 2013. Statistical power analysis for the behavioral sciences. Academic press.",
      "doi": ""
    },
    {
      "text": "Sheldon Cohen. 1988. Perceived stress in a probability sample of the United States.The Social Psychology of Health(1988).",
      "doi": ""
    },
    {
      "text": "Sheldon Cohen, Tom Kamarck, and Robin Mermelstein. 1983. A global measure of perceived stress. Journal of health and social behavior(1983), 385–396.",
      "doi": ""
    },
    {
      "text": "Christian Collet, Evelyne Vernet-Maury, Georges Delhomme, and André Dittmar. 1997. Autonomic nervous system response patterns specificity to basic emotions. Journal of the autonomic nervous system 62, 1-2 (1997), 45–57.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo and Miriam Walker. 2003. Using the experience sampling method to evaluate ubicomp applications. IEEE Pervasive Computing 2, 2 (2003), 24–31.",
      "doi": "10.1109/MPRV.2003.1203750"
    },
    {
      "text": "Mihaly Csikszentmihalyi, Reed Larson, and Suzanne Prescott. 1977. The ecology of adolescent activity and experience. Journal of Youth and Adolescence 6, 3 (1977), 281–294.",
      "doi": ""
    },
    {
      "text": "Paco Developers. 2018. PACO - Apps on Google Play. https://play.google.com/store/apps/details?id=com.pacoapp.paco&hl=en",
      "doi": ""
    },
    {
      "text": "Kari M Eddington, Chris J Burgin, Paul J Silvia, Niloofar Fallah, Catherine Majestic, and Thomas R Kwapil. 2017. The effects of psychotherapy for major depressive disorder on daily mood and functioning: a longitudinal experience sampling study. Cognitive therapy and research 41, 2 (2017), 266–277.",
      "doi": ""
    },
    {
      "text": "Gudrun Eisele, Hugo Vachon, Ginette Lafit, Peter Kuppens, Marlies Houben, Inez Myin-Germeys, and Wolfgang Viechtbauer. 2020. The effects of sampling frequency and questionnaire length on perceived burden, compliance, and careless responding in experience sampling data in a student population. Assessment (2020), 1073191120957102.",
      "doi": ""
    },
    {
      "text": "Gudrun Eisele, Hugo Vachon, Inez Myin-Germeys, and Wolfgang Viechtbauer. 2021. Reported affect changes as a function of response delay: Findings from a pooled dataset of nine experience sampling studies. Frontiers in psychology 12 (2021).",
      "doi": ""
    },
    {
      "text": "Paul Ekman. [n.d.]. Expression and the nature of emotion. Approaches to emotion 3, 19 ([n. d.]), 344.",
      "doi": ""
    },
    {
      "text": "Anja Exler, Andrea Schankin, Christoph Klebsattel, and Michael Beigl. 2016. A wearable system for mood assessment considering smartphone features and data from mobile ECGs. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct. ACM, 1153–1161.",
      "doi": ""
    },
    {
      "text": "Surjya Ghosh, Niloy Ganguly, Bivas Mitra, and Pradipta De. 2019. Designing an experience sampling method for smartphone based emotion detection. IEEE Transactions on Affective Computing(2019).",
      "doi": "10.1109/TAFFC.2019.2905561"
    },
    {
      "text": "Joyce Ho and Stephen S Intille. 2005. Using context-aware computing to reduce the perceived burden of interruptions from mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 909–918.",
      "doi": "10.1145/1054972.1055100"
    },
    {
      "text": "Victoria Hollis, Artie Konrad, Aaron Springer, Matthew Antoun, Christopher Antoun, Rob Martin, and Steve Whittaker. 2017. What does all this data mean for my future mood? Actionable analytics and targeted reflection for emotional well-being. Human–Computer Interaction 32, 5-6 (2017), 208–267.",
      "doi": ""
    },
    {
      "text": "Victoria Hollis, Artie Konrad, and Steve Whittaker. 2015. Change of heart: emotion tracking to promote behavior change. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 2643–2652.",
      "doi": "10.1145/2702123.2702196"
    },
    {
      "text": "Karen Holtzblatt and Hugh Beyer. 1997. Contextual design: defining customer-centered systems. Elsevier.",
      "doi": ""
    },
    {
      "text": "Karen Hovsepian, Mustafa al’Absi, Emre Ertin, Thomas Kamarck, Motohiro Nakajima, and Santosh Kumar. 2015. cStress: towards a gold standard for continuous stress assessment in the mobile environment. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 493–504.",
      "doi": "10.1145/2750858.2807526"
    },
    {
      "text": "Heming Jiang, Mikko Siponen, and Aggeliki Tsohou. 2021. Personal use of technology at work: a literature review and a theoretical model for understanding how it affects employee job performance. European Journal of Information Systems(2021), 1–15.",
      "doi": ""
    },
    {
      "text": "Oliver P John, Eileen M Donahue, and Robert L Kentle. 1991. Big five inventory. Journal of Personality and Social Psychology (1991).",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman, Alan B Krueger, David A Schkade, Norbert Schwarz, and Arthur A Stone. 2004. A survey method for characterizing daily life experience: The day reconstruction method. Science 306, 5702 (2004), 1776–1780.",
      "doi": ""
    },
    {
      "text": "Nicky Kern and Bernt Schiele. 2003. Context-aware notification for wearable computing. In Seventh IEEE International Symposium on Wearable Computers, 2003. Proceedings. IEEE, 223–230.",
      "doi": ""
    },
    {
      "text": "Auk Kim, Woohyeok Choi, Jungmi Park, Kyeyoon Kim, and Uichin Lee. 2018. Interrupting Drivers for Interactions: Predicting Opportune Moments for In-Vehicle Proactive Auditory-Verbal Tasks. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 4, Article 175 (dec 2018), 28 pages.",
      "doi": "10.1145/3287053"
    },
    {
      "text": "Auk Kim, Jung-Mi Park, and Uichin Lee. 2020. Interruptibility for in-vehicle multitasking: influence of voice task demands and adaptive behaviors. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 1 (2020), 1–22.",
      "doi": "10.1145/3415161"
    },
    {
      "text": "Jonghwa Kim and Elisabeth André. 2008. Emotion recognition based on physiological changes in music listening. IEEE transactions on pattern analysis and machine intelligence 30, 12(2008), 2067–2083.",
      "doi": "10.1109/TPAMI.2008.26"
    },
    {
      "text": "Ji-Hyeon Kim, Bok-Hwan Kim, and Moon-Sun Ha. 2011. Validation of a Korean version of the Big Five Inventory. Journal of Human Understanding and Counseling 32, 1(2011), 47–65.",
      "doi": ""
    },
    {
      "text": "Zachary D King, Judith Moskowitz, Begum Egilmez, Shibo Zhang, Lida Zhang, Michael Bass, John Rogers, Roozbeh Ghaffari, Laurie Wakschlag, and Nabil Alshurafa. 2019. micro-Stress EMA: A Passive Sensing Framework for Detecting in-the-wild Stress in Pregnant Mothers. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 3 (2019), 91.",
      "doi": "10.1145/3351249"
    },
    {
      "text": "Predrag Klasnja, Beverly L Harrison, Louis LeGrand, Anthony LaMarca, Jon Froehlich, and Scott E Hudson. 2008. Using wearable sensors and real time inference to understand human recall of routine activities. In Proceedings of the 10th international conference on Ubiquitous computing. 154–163.",
      "doi": "10.1145/1409635.1409656"
    },
    {
      "text": "Sander Koelstra, Christian Muhl, Mohammad Soleymani, Jong-Seok Lee, Ashkan Yazdani, Touradj Ebrahimi, Thierry Pun, Anton Nijholt, and Ioannis Patras. 2011. Deap: A database for emotion analysis; using physiological signals. IEEE Transactions on Affective Computing 3, 1 (2011), 18–31.",
      "doi": "10.1109/T-AFFC.2011.15"
    },
    {
      "text": "Peter Kuppens, Zita Oravecz, and Francis Tuerlinckx. 2010. Feelings change: accounting for individual differences in the temporal dynamics of affect. Journal of personality and social psychology 99, 6(2010), 1042.",
      "doi": ""
    },
    {
      "text": "Hosub Lee, Young Sang Choi, Sunjae Lee, and IP Park. 2012. Towards unobtrusive emotion recognition for affective social communication. In 2012 IEEE Consumer Communications and Networking Conference (CCNC). IEEE, 260–264.",
      "doi": ""
    },
    {
      "text": "Hao-Ping Lee, Kuan-Yin Chen, Chih-Heng Lin, Chia-Yu Chen, Yu-Lin Chung, Yung-Ju Chang, and Chien-Ru Sun. 2019. Does who matter? Studying the impact of relationship characteristics on receptivity to mobile IM messages. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300756"
    },
    {
      "text": "Robert LiKamWa, Yunxin Liu, Nicholas D Lane, and Lin Zhong. 2013. Moodscope: Building a mood sensor from smartphone usage patterns. In Proceeding of the 11th annual international conference on Mobile systems, applications, and services. ACM, 389–402.",
      "doi": ""
    },
    {
      "text": "Geoffrey R Loftus. 1978. On interpretation of interactions. Memory & Cognition 6, 3 (1978), 312–319.",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Daniela Gudith, and Ulrich Klocke. 2008. The cost of interrupted work: more speed and stress. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 107–110.",
      "doi": "10.1145/1357054.1357072"
    },
    {
      "text": "Gloria Mark, Yiran Wang, and Melissa Niiya. 2014. Stress and multitasking in everyday college life: an empirical study of online activity. In Proceedings of the SIGCHI conference on human factors in computing systems. 41–50.",
      "doi": "10.1145/2556288.2557361"
    },
    {
      "text": "Gerald Matthews, Dylan M Jones, and A Graham Chamberlain. 1990. Refining the measurement of mood: The UWIST mood adjective checklist. British journal of psychology 81, 1 (1990), 17–42.",
      "doi": ""
    },
    {
      "text": "Abhinav Mehrotra, Mirco Musolesi, Robert Hendley, and Veljko Pejovic. 2015. Designing content-driven intelligent notification mechanisms for mobile applications. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 813–824.",
      "doi": "10.1145/2750858.2807544"
    },
    {
      "text": "Abhinav Mehrotra, Veljko Pejovic, Jo Vermeulen, Robert Hendley, and Mirco Musolesi. 2016. My Phone and Me: Understanding People’s Receptivity to Mobile Notifications. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1021–1032.",
      "doi": ""
    },
    {
      "text": "Abhinav Mehrotra, Fani Tsapeli, Robert Hendley, and Mirco Musolesi. 2017. MyTraces: Investigating Correlation and Causation between Users’ Emotional States and Mobile Phone Interaction. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 83.",
      "doi": "10.1145/3130948"
    },
    {
      "text": "Christopher A Monk, J Gregory Trafton, and Deborah A Boehm-Davis. 2008. The effect of interruption duration and demand on resuming suspended goals.Journal of experimental psychology: Applied 14, 4 (2008), 299.",
      "doi": ""
    },
    {
      "text": "Inez Myin-Germeys, Machteld Marcelis, Lydia Krabbendam, Philippe Delespaul, and Jim van Os. 2005. Subtle Fluctuations in Psychotic Phenomena as Functional States of Abnormal Dopamine Reactivity in Individuals at Risk. Biological Psychiatry 58, 2 (2005), 105–110.",
      "doi": ""
    },
    {
      "text": "I. Myin-Germeys, F. Peeters, R. Havermans, N. A. Nicolson, M. W. DeVries, P. Delespaul, and J. Van Os. 2003. Emotional reactivity to daily life stress in psychosis and affective disorder: an experience sampling study. Acta Psychiatrica Scandinavica 107, 2 (2003), 124–131.",
      "doi": ""
    },
    {
      "text": "Inez Myin-Germeys, Jim van Os, Joseph E. Schwartz, Arthur A. Stone, and Philippe A. Delespaul. 2001. Emotional Reactivity to Daily Life Stress in Psychosis. Archives of General Psychiatry 58, 12 (12 2001), 1137–1144.",
      "doi": ""
    },
    {
      "text": "Mikio Obuchi, Wataru Sasaki, Tadashi Okoshi, Jin Nakazawa, and Hideyuki Tokuda. 2016. Investigating interruptibility at activity breakpoints using smartphone activity recognition API. In Proc. of the 2016 ACM Intern. Joint Conf. on Pervasive and Ubiquitous Computing: Adjunct. 1602–1607.",
      "doi": "10.1145/2968219.2968556"
    },
    {
      "text": "Simon Ollander, Christelle Godin, Aurélie Campagne, and Sylvie Charbonnier. 2016. A comparison of wearable and stationary sensors for stress detection. In 2016 IEEE International Conference on Systems, Man, and Cybernetics (SMC). IEEE, 004362–004366.",
      "doi": "10.1109/SMC.2016.7844917"
    },
    {
      "text": "Cheul Young Park. 2020. Toolbox for Emotion Analysis using Physiological signals (TEAP) in Python. https://github.com/cheulyop/PyTEAP.",
      "doi": ""
    },
    {
      "text": "Martin Pielot, Bruno Cardoso, Kleomenis Katevas, Joan Serrà, Aleksandar Matic, and Nuria Oliver. 2017. Beyond Interruptibility: Predicting Opportune Moments to Engage Mobile Phone Users. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3, Article 91 (Sept. 2017), 25 pages. https://doi.org/10.1145/3130956",
      "doi": "10.1145/3130956"
    },
    {
      "text": "John P Pollak, Phil Adams, and Geri Gay. 2011. PAM: a photographic affect meter for frequent, in situ measurement of affect. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 725–734.",
      "doi": "10.1145/1978942.1979047"
    },
    {
      "text": "Ho-Kyeong Ra, Jungmo Ahn, Hee Jung Yoon, Dukyong Yoon, Sang Hyuk Son, and JeongGil Ko. 2017. I am a” smart” watch, smart enough to know the accuracy of my own heart rate sensor. In Proceedings of the 18th International Workshop on Mobile Computing Systems and Applications. 49–54.",
      "doi": "10.1145/3032970.3032977"
    },
    {
      "text": "James A Russell. 1980. A circumplex model of affect.Journal of personality and social psychology 39, 6(1980), 1161.",
      "doi": ""
    },
    {
      "text": "Sohrab Saeb, Mi Zhang, Christopher J Karr, Stephen M Schueller, Marya E Corden, Konrad P Kording, and David C Mohr. 2015. Mobile phone sensor correlates of depressive symptom severity in daily-life behavior: an exploratory study. Journal of medical Internet research 17, 7 (2015), e175.",
      "doi": ""
    },
    {
      "text": "Dario D Salvucci, Niels A Taatgen, and Jelmer P Borst. 2009. Toward a unified theory of the multitasking continuum: From concurrent performance to task switching, interruption, and resumption. In Proceedings of the SIGCHI conference on human factors in computing systems. 1819–1828.",
      "doi": "10.1145/1518701.1518981"
    },
    {
      "text": "Akane Sano and Rosalind W Picard. 2013. Stress recognition using wearable sensors and mobile phones. In 2013 Humaine association conference on affective computing and intelligent interaction. IEEE, 671–676.",
      "doi": ""
    },
    {
      "text": "Ulrich Schimmack and Reisenzein Rainer. 2002. Experiencing activation: Energetic arousal and tense arousal are not mixtures of valence and activation.Emotion 2, 4 (2002), 412.",
      "doi": ""
    },
    {
      "text": "Philip Schmidt, Attila Reiss, Robert Dürichen, and Kristof Van Laerhoven. 2018. Labelling Affective States” in the Wild” Practical Guidelines and Lessons Learned. In Proceedings of the 2018 ACM International Joint Conference and 2018 International Symposium on Pervasive and Ubiquitous Computing and Wearable Computers. 654–659.",
      "doi": ""
    },
    {
      "text": "Maude Schneider, Thomas Vaessen, Esther DA van Duin, Zuzana Kasanova, Wolfgang Viechtbauer, Ulrich Reininghaus, Claudia Vingerhoets, Jan Booij, Ann Swillen, Jacob AS Vorstman, 2020. Affective and psychotic reactivity to daily-life stress in adults with 22q11DS: a study using the experience sampling method. Journal of Neurodevelopmental Disorders 12, 1 (2020), 1–11.",
      "doi": ""
    },
    {
      "text": "Christie Scollon, Chu Kim-Prieto, and Ed Diener. 2003. Experience Sampling: Promises and Pitfalls, Strengths and Weaknesses. Journal of Happiness Studies 4, 1 (2003), 5–34.",
      "doi": ""
    },
    {
      "text": "Saya Shacham. 1983. A shortened version of the Profile of Mood States.Journal of personality assessment(1983).",
      "doi": ""
    },
    {
      "text": "D Siewiorek, A Smailagic, J Furukawa, A Krause, N Moraveji, K Reiger, J Shaffer, and Fei Lung Wong. 2003. SenSay: a context-aware mobile phone. In Seventh IEEE International Symposium on Wearable Computers, 2003. Proceedings. IEEE, 248–249.",
      "doi": ""
    },
    {
      "text": "Rolf Steyer, Peter Schwenkmezger, Peter Notz, and Michael Eid. 1997. Der Mehrdimensionale Befindlichkeitsfragebogen MDBF [Multidimensional mood questionnaire]. Göttingen, Germany: Hogrefe(1997).",
      "doi": ""
    },
    {
      "text": "Arthur A Stone and Saul Shiffman. 1994. Ecological momentary assessment (EMA) in behavorial medicine.Annals of Behavioral Medicine(1994).",
      "doi": ""
    },
    {
      "text": "Yoshihiko Suhara, Yinzhan Xu, and Alex’Sandy’ Pentland. 2017. Deepmood: Forecasting depressed mood based on self-reported histories via recurrent neural networks. In Proceedings of the 26th International Conference on World Wide Web. ACM, 715–724.",
      "doi": "10.1145/3038912.3052676"
    },
    {
      "text": "T. and Brian P. Bailey. 2005. Investigating the Effectiveness of Mental Workload as a Predictor of Opportune Moments for Interruption(CHI EA ’05). ACM, New York, NY, USA, 4. https://doi.org/10.1145/1056808.1056948",
      "doi": ""
    },
    {
      "text": "Shelley E Taylor, William T Welch, Heejung S Kim, and David K Sherman. 2007. Cultural differences in the impact of social support on psychological and biological stress responses. Psychological science 18, 9 (2007), 831–837.",
      "doi": ""
    },
    {
      "text": "Robert E Thayer. 1990. The biopsychology of mood and arousal. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Artem Timoshenko and John R Hauser. 2019. Identifying customer needs from user-generated content. Marketing Science 38, 1 (2019), 1–20.",
      "doi": ""
    },
    {
      "text": "Peter Totterdell and Simon Folkard. 1992. In situ repeated measures of affect and cognitive performance facilitated by use of a hand-held computer. Behavior Research Methods, Instruments, & Computers 24, 4 (1992), 545–553.",
      "doi": ""
    },
    {
      "text": "William Trochim and James Donnelly. 2008. Research methods knowledge base. Donnelly. Mason, OH: Cenage Learning(2008).",
      "doi": ""
    },
    {
      "text": "Endel Tulving and Daniel L Schacter. 1990. Priming and human memory systems. Science 247, 4940 (1990), 301–306.",
      "doi": ""
    },
    {
      "text": "Endel Tulving and Donald M Thomson. 1973. Encoding specificity and retrieval processes in episodic memory.Psychological review 80, 5 (1973), 352.",
      "doi": ""
    },
    {
      "text": "Liam D Turner, Stuart M Allen, and Roger M Whitaker. 2015. Interruptibility prediction for ubiquitous systems: conventions and new directions from a growing field. In Proceedings of the 2015 ACM international joint conference on pervasive and ubiquitous computing. 801–812.",
      "doi": "10.1145/2750858.2807514"
    },
    {
      "text": "Niels van Berkel, Denzil Ferreira, and Vassilis Kostakos. 2018. The Experience Sampling Method on Mobile Devices. ACM Computing Surveys (CSUR) 50, 6 (2018), 93.",
      "doi": "10.1145/3123988"
    },
    {
      "text": "Niels van Berkel, Jorge Goncalves, Lauri Lovén, Denzil Ferreira, Simo Hosio, and Vassilis Kostakos. 2019. Effect of experience sampling schedules on response rate and recall accuracy of objective self-reports. International Journal of Human-Computer Studies 125 (2019), 118–128.",
      "doi": "10.1016/j.ijhcs.2018.12.002"
    },
    {
      "text": "Ruud Van Winkel, Cécile Henquet, Araceli Rosa, Sergi Papiol, Lourdes Faňanás, Marc De Hert, Jozef Peuskens, Jim van Os, and Inez Myin-Germeys. 2008. Evidence that the COMTVal158Met polymorphism moderates sensitivity to stress in psychosis: An experience-sampling study. American Journal of Medical Genetics Part B: Neuropsychiatric Genetics 147B, 1(2008), 10–17.",
      "doi": ""
    },
    {
      "text": "Rui Wang, Fanglin Chen, Zhenyu Chen, Tianxing Li, Gabriella Harari, Stefanie Tignor, Xia Zhou, Dror Ben-Zeev, and Andrew T Campbell. 2014. StudentLife: assessing mental health, academic performance and behavioral trends of college students using smartphones. In Proceedings of the 2014 ACM international joint conference on pervasive and ubiquitous computing. 3–14.",
      "doi": "10.1145/2632048.2632054"
    },
    {
      "text": "David Watson, Lee Anna Clark, and Auke Tellegen. 1988. Development and validation of brief measures of positive and negative affect: the PANAS scales.Journal of personality and social psychology 54, 6(1988), 1063.",
      "doi": ""
    },
    {
      "text": "Mario Wenzel, Zarah Rowland, and Thomas Kubiak. 2021. Like clouds in a windy sky: Mindfulness training reduces negative affect reactivity in daily life in a randomized controlled trial. Stress and Health 37, 2 (2021), 232–242.",
      "doi": ""
    },
    {
      "text": "Ladd Wheeler and Harry T Reis. 1991. Self-recording of everyday life events: Origins, types, and uses. Journal of personality 59, 3 (1991), 339–354.",
      "doi": ""
    },
    {
      "text": "Raf Widdershoven, Marieke Wichers, Peter Kuppens, Jessica Hartmann, Claudia Menne-Lothmann, Claudia Simons, and Jojanneke Bastiaansen. 2019. Effect of self-monitoring through experience sampling on emotion differentiation in depression. Journal of Affective Disorders(2019), 71–77.",
      "doi": ""
    },
    {
      "text": "Peter Wilhelm and Dominik Schoebi. 2007. Assessing mood in daily life. European Journal of Psychological Assessment 23, 4(2007), 258–267.",
      "doi": ""
    },
    {
      "text": "Fengpeng Yuan, Xianyi Gao, and Janne Lindqvist. 2017. How busy are you? Predicting the interruptibility intensity of mobile users. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 5346–5360.",
      "doi": "10.1145/3025453.3025946"
    },
    {
      "text": "Vincent W Zheng, Yu Zheng, Xing Xie, and Qiang Yang. 2010. Collaborative location and activity recommendations with GPS history data. In Proceedings of the 19th international conference on World wide web. 1029–1038.",
      "doi": "10.1145/1772690.1772795"
    },
    {
      "text": "Manuela Züger and Thomas Fritz. 2015. Interruptibility of software developers and its prediction using psycho-physiological sensors. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2981–2990.",
      "doi": "10.1145/2702123.2702593"
    }
  ]
}