{
  "doi": "10.1145/3491102.3501893",
  "title": "Juvenile Graphical Perception: A Comparison between Children and Adults",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "Data visualization is pervasive in the lives of children as they encounter graphs and charts in early education and online media. In spite of this prevalence, our guidelines and understanding of how children perceive graphs stem primarily from studies conducted with adults. Previous psychology and education research indicates that children’s cognitive abilities are different from adults. Therefore, we conducted a classic graphical perception study on a population of children aged 8–12 enrolled in the Ivy After School Program in Boston, MA and adult computer science students enrolled in Northeastern University to determine how accurately participants judge differences in particular graphical encodings. We record the accuracy of participants’ answers for five encodings most commonly used with quantitative data. The results of our controlled experiment show that children have remarkably similar graphical perception to adults, but are consistently less accurate at interpreting the visual encodings. We found similar effectiveness rankings, relative differences in error between the different encodings, and patterns of bias across encoding types. Based on our findings, we provide design guidelines and recommendations for creating visualizations for children. This paper and all supplemental materials are available at https://osf.io/ygrdv.",
  "tags": [
    "Visualization Literacy",
    "Graphical Perception",
    "Data Visualization"
  ],
  "authors": [
    {
      "name": "Liudas Panavas",
      "institution": "Khoury College, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234922",
      "orcid": "missing"
    },
    {
      "name": "Amy E. Worth",
      "institution": "Teacher, Ivy After School Program, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233496",
      "orcid": "missing"
    },
    {
      "name": "Tarik Crnovrsanin",
      "institution": "Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442615473",
      "orcid": "missing"
    },
    {
      "name": "Tejas Sathyamurthi",
      "institution": "Khoury College of Computer Science, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233554",
      "orcid": "missing"
    },
    {
      "name": "Sara Cordes",
      "institution": "Department of Psychology, Boston College, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235490",
      "orcid": "missing"
    },
    {
      "name": "Michelle A. Borkin",
      "institution": "Khoury College of Computer Sciences, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350585455",
      "orcid": "missing"
    },
    {
      "name": "Cody Dunne",
      "institution": "Northeastern University, United States",
      "img": "/do/10.1145/contrib-81384605317/rel-imgonly/cody_dunne_2016_ccis_photo_shoot_small.jpg",
      "acmid": "81384605317",
      "orcid": "0000-0002-1609-9776"
    }
  ],
  "references": [
    {
      "text": "Hirotogu Akaike. 1998. Information theory and an extension of the maximum likelihood principle. In Selected papers of hirotugu akaike. Springer, 199–213.",
      "doi": ""
    },
    {
      "text": "Basak Alper, Nathalie Henry Riche, Fanny Chevalier, Jeremy Boy, and Metin Sezgin. 2017. Visualization literacy at elementary school. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 5485–5497. https://doi.org/10.1145/3025453.3025877",
      "doi": "10.1145/3025453.3025877"
    },
    {
      "text": "Yoav Benjamini and Yosef Hochberg. 1995. Controlling the false discovery rate: a practical and powerful approach to multiple testing. Journal of the Royal statistical society: series B (Methodological) 57, 1(1995), 289–300. https://doi.org/10.1111/j.2517-6161.1995.tb02031.x",
      "doi": ""
    },
    {
      "text": "Fearn Bishop, Johannes Zagermann, Ulrike Pfeil, Gemma Sanderson, Harald Reiterer, and Uta Hinrichs. 2019. Construct-a-vis: Exploring the free-form visualization processes of children. IEEE transactions on visualization and computer graphics 26, 1(2019), 451–460. https://doi.org/10.1109/TVCG.2019.2934804",
      "doi": ""
    },
    {
      "text": "Rita Borgo, Johannes Kehrer, David HS Chung, Eamonn Maguire, Robert S Laramee, Helwig Hauser, Matthew Ward, and Min Chen. 2013. Glyph-based Visualization: Foundations, Design Guidelines, Techniques and Applications.. In Eurographics (State of the Art Reports). 39–63. https://doi.org/10.2312/conf/EG2013/stars/039-063",
      "doi": ""
    },
    {
      "text": "Katy Börner, Adam Maltese, Russell Nelson Balliet, and Joe Heimlich. 2016. Investigating aspects of data visualization literacy using 20 information visualizations and 273 science museum visitors. Information Visualization 15, 3 (2016), 198–213. https://doi.org/10.1177/1473871615594652",
      "doi": "10.1177/1473871615594652"
    },
    {
      "text": "Jeremy Boy, Ronald A Rensink, Enrico Bertini, and Jean-Daniel Fekete. 2014. A principled way of assessing visualization literacy. IEEE transactions on visualization and computer graphics 20, 12(2014), 1963–1972. https://doi.org/10.1109/TVCG.2014.2346984",
      "doi": ""
    },
    {
      "text": "Ty W Boyer, Susan C Levine, and Janellen Huttenlocher. 2008. Development of proportional reasoning: where young children go wrong.Developmental psychology 44, 5 (2008), 1478. https://doi.org/10.1037/a0013110",
      "doi": ""
    },
    {
      "text": "Kenneth P Burnham and David R Anderson. 2004. Multimodel inference: understanding AIC and BIC in model selection. Sociological methods & research 33, 2 (2004), 261–304. https://doi.org/10.1177/0049124104268644",
      "doi": ""
    },
    {
      "text": "C Melody Carswell. 1992. Choosing specifiers: An evaluation of the basic tasks model of graphical perception. Human factors 34, 5 (1992), 535–554. https://doi.org/10.1177/001872089203400503",
      "doi": ""
    },
    {
      "text": "CDC. 2021. COVID Data Tracker. https://covid.cdc.gov/covid-data-tracker/#county-view",
      "doi": ""
    },
    {
      "text": "Chaomei Chen. 2005. Top 10 unsolved information visualization problems. IEEE computer graphics and applications 25, 4 (2005), 12–16. https://doi.org/10.1109/MCG.2005.91",
      "doi": "10.1109/MCG.2005.91"
    },
    {
      "text": "Fanny Chevalier, Nathalie Henry Riche, Basak Alper, Catherine Plaisant, Jeremy Boy, and Niklas Elmqvist. 2018. Observations and reflections on visualization literacy in elementary school. IEEE computer graphics and applications 38, 3 (2018), 21–29. https://doi.org/10.1109/MCG.2018.032421650",
      "doi": ""
    },
    {
      "text": "William S Cleveland and Robert McGill. 1984. Graphical perception: Theory, experimentation, and application to the development of graphical methods. Journal of the American statistical association 79, 387(1984), 531–554. https://doi.org/10.2307/2288400",
      "doi": ""
    },
    {
      "text": "William S Cleveland and Robert McGill. 1985. Graphical perception and graphical methods for analyzing scientific data. Science 229, 4716 (1985), 828–833. https://doi.org/10.1126/science.229.4716.828",
      "doi": ""
    },
    {
      "text": "William S Cleveland and Robert McGill. 1986. An experiment in graphical perception. International Journal of Man-Machine Studies 25, 5 (1986), 491–500. https://doi.org/10.1016/S0020-7373(86)80019-0",
      "doi": "10.1016/S0020-7373%2886%2980019-0"
    },
    {
      "text": "William S Cleveland and Robert McGill. 1987. Graphical perception: The visual decoding of quantitative information on graphical displays of data. Journal of the Royal Statistical Society: Series A (General) 150, 3(1987), 192–210. https://doi.org/10.2307/2981473",
      "doi": ""
    },
    {
      "text": "William Jay Conover. 1998. Practical nonparametric statistics. Vol. 350. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Geoff Cumming. 2014. The New Statistics: Why and How. Psychological Science 25, 1 (2014), 7–29. https://doi.org/10.1177/0956797613504966",
      "doi": ""
    },
    {
      "text": "Frances R Curcio. 1987. Comprehension of mathematical relationships expressed in graphs. Journal for research in mathematics education 18, 5 (1987), 382–393. https://doi.org/10.2307/749086",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic. 2016. Fair Statistical Communication in HCI. Springer International Publishing, Cham, 291–330. https://doi.org/10.1007/978-3-319-26633-6_13",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic. 2016. Fair statistical communication in HCI. In Modern statistical methods for HCI. Springer, 291–330.",
      "doi": ""
    },
    {
      "text": "Bradley Efron. 1987. Better bootstrap confidence intervals. Journal of the American statistical Association 82, 397(1987), 171–185. https://doi.org/10.2307/2289144",
      "doi": ""
    },
    {
      "text": "Susan N Friel, Frances R Curcio, and George W Bright. 2001. Making sense of graphs: Critical factors influencing comprehension and instructional implications. Journal for Research in mathematics Education 32, 2 (2001), 124–158. https://doi.org/10.2307/749671",
      "doi": ""
    },
    {
      "text": "Johannes Gäbler, Christoph Winkler, Nóra Lengyel, Wolfgang Aigner, Christina Stoiber, Günter Wallner, and Simone Kriglstein. 2019. Diagram safari: A visualization literacy game for young children. In Extended Abstracts of the Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts. 389–396. https://doi.org/10.1145/3341215.3356283",
      "doi": "10.1145/3341215.3356283"
    },
    {
      "text": "Lars Grammel, Melanie Tory, and Margaret-Anne Storey. 2010. How information visualization novices construct visualizations. IEEE transactions on visualization and computer graphics 16, 6(2010), 943–952. https://doi.org/10.1109/TVCG.2010.164",
      "doi": "10.1109/TVCG.2010.164"
    },
    {
      "text": "Samuel Gratzl, Alexander Lex, Nils Gehlenborg, Hanspeter Pfister, and Marc Streit. 2013. Lineup: Visual analysis of multi-attribute rankings. IEEE transactions on visualization and computer graphics 19, 12(2013), 2277–2286. https://doi.org/10.1109/TVCG.2013.173",
      "doi": ""
    },
    {
      "text": "Sander Greenland, Stephen J Senn, Kenneth J Rothman, John B Carlin, Charles Poole, Steven N Goodman, and Douglas G Altman. 2016. Statistical tests, P values, confidence intervals, and power: a guide to misinterpretations. European journal of epidemiology 31, 4 (2016), 337–350. https://doi.org/10.1007/s10654-016-0149-3",
      "doi": ""
    },
    {
      "text": "Charlotte Hanisch, Jürgen Konczak, and Christian Dohle. 2001. The effect of the Ebbinghaus illusion on grasping behaviour of children. Experimental Brain Research 137, 2 (2001), 237–245. https://doi.org/10.1007/s002210000655",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In Proceedings of the SIGCHI conference on human factors in computing systems. 203–212. https://doi.org/10.1145/1753326.1753357",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Joseph Henrich, Steven J Heine, and Ara Norenzayan. 2010. Most people are not WEIRD. Nature 466, 7302 (2010), 29–29. https://doi.org/10.1038/466029a",
      "doi": ""
    },
    {
      "text": "JG Hollands and Brian P Dyre. 2000. Bias in proportion judgments: the cyclical power model.Psychological review 107, 3 (2000), 500. https://doi.org/10.1037//0033-295X.107.3.500",
      "doi": ""
    },
    {
      "text": "Michelle A Hurst and Sara Cordes. 2018. Attending to relations: Proportional reasoning in 3-to 6-year-old children.Developmental psychology 54, 3 (2018), 428. https://doi.org/10.1037/dev0000440",
      "doi": ""
    },
    {
      "text": "Elaine Huynh, Angela Nyhout, Patricia Ganea, and Fanny Chevalier. 2020. Designing Narrative-Focused Role-Playing Games for Visualization Literacy in Young Children. IEEE Transactions on Visualization and Computer Graphics 27, 2(2020), 924–934. https://doi.org/10.1109/TVCG.2020.3030464",
      "doi": ""
    },
    {
      "text": "Yoonkyung Jeong, Susan C Levine, and Janellen Huttenlocher. 2007. The development of proportional reasoning: Effect of continuous versus discrete quantities. Journal of Cognition and Development 8, 2 (2007), 237–256. https://doi.org/10.1080/15248370701202471",
      "doi": ""
    },
    {
      "text": "Pete R Jones and Tessa M Dekker. 2018. The development of perceptual averaging: Learning what to do, not just how to do it. Developmental Science 21, 3 (2018), e12584. https://doi.org/10.1111/desc.12584",
      "doi": ""
    },
    {
      "text": "Yael Kali and Marcia C Linn. 2008. Designing effective visualizations for elementary school science. The elementary school journal 109, 2 (2008), 181–198. https://doi.org/10.1086/590525",
      "doi": ""
    },
    {
      "text": "Jennifer A Kaminski and Vladimir M Sloutsky. 2013. Extraneous perceptual information interferes with children’s acquisition of mathematical knowledge.Journal of Educational Psychology 105, 2 (2013), 351. https://doi.org/10.1037/a0031040",
      "doi": ""
    },
    {
      "text": "Helen Kennedy and Rosemary Lucy Hill. 2018. The feeling of numbers: Emotions in everyday engagements with data and their visualisation. Sociology 52, 4 (2018), 830–848. https://doi.org/10.1177/0038038516674675",
      "doi": ""
    },
    {
      "text": "Robert Kosara. 2019. Evidence for area as the primary visual cue in pie charts. In 2019 IEEE Visualization Conference (VIS). IEEE, 101–105. https://doi.org/10.1109/VISUAL.2019.8933547",
      "doi": ""
    },
    {
      "text": "Kevin Lai, Julio Cabrera, Jonathan M Vitale, Jacquie Madhok, Robert Tinker, and Marcia C Linn. 2016. Measuring graph comprehension, critique, and construction in science. Journal of Science Education and Technology 25, 4 (2016), 665–681. https://doi.org/10.1007/s10956-016-9621-9",
      "doi": ""
    },
    {
      "text": "Sukwon Lee, Bum Chul Kwon, Jiming Yang, Byung Cheol Lee, and Sung-Hee Kim. 2019. The correlation between users’ cognitive characteristics and visualization literacy. Applied Sciences 9, 3 (2019), 488. https://doi.org/10.3390/app9030488",
      "doi": ""
    },
    {
      "text": "Tom Lowrie and Carmel M Diezmann. 2009. National numeracy tests: A graphic tells a thousand words. Australian Journal of Education 53, 2 (2009), 141–158. https://doi.org/10.1177/000494410905300204",
      "doi": ""
    },
    {
      "text": "Andrew Manches and Lydia Plowman. 2021. Smart toys and children’s understanding of personal data. International Journal of Child-Computer Interaction (2021), 100333. https://doi.org/10.1016/j.ijcci.2021.100333",
      "doi": "10.1016/j.ijcci.2021.100333"
    },
    {
      "text": "Wenke Möhring, Andrea Frick, and Nora S Newcombe. 2018. Spatial scaling, proportional thinking, and numerical understanding in 5-to 7-year-old children. Cognitive Development 45(2018), 57–67. https://doi.org/10.1016/j.cogdev.2017.12.001",
      "doi": ""
    },
    {
      "text": "Wenke Möhring, Nora S Newcombe, Susan C Levine, and Andrea Frick. 2016. Spatial proportional reasoning is associated with formal knowledge about fractions. Journal of Cognition and Development 17, 1 (2016), 67–84. https://doi.org/10.1080/15248372.2014.996289",
      "doi": ""
    },
    {
      "text": "Mavuto M Mukaka. 2012. A guide to appropriate use of correlation coefficient in medical research. Malawi medical journal 24, 3 (2012), 69–71.",
      "doi": ""
    },
    {
      "text": "Tamara Munzner. 2014. Visualization analysis and design. CRC press.",
      "doi": ""
    },
    {
      "text": "Marko Nardini, Rachael Bedford, and Denis Mareschal. 2010. Fusion of visual cues is not mandatory in children. Proceedings of the National Academy of Sciences 107, 39(2010), 17041–17046. https://doi.org/10.1073/pnas.1001699107",
      "doi": ""
    },
    {
      "text": "Brian A Nosek, Charles R Ebersole, Alexander C DeHaven, and David T Mellor. 2018. The preregistration revolution. Proceedings of the National Academy of Sciences 115, 11(2018), 2600–2606. https://doi.org/10.1073/pnas.1708274114",
      "doi": ""
    },
    {
      "text": "Darko Odic. 2018. Children’s intuitive sense of number develops independently of their perception of area, density, length, and time. Developmental Science 21, 2 (2018), e12533. https://doi.org/10.1111/desc.12533",
      "doi": ""
    },
    {
      "text": "Rene S Parmar and Barbara R Signer. 2005. Sources of error in constructing and interpreting graphs: A study of fourth-and fifth-grade students with LD. Journal of learning disabilities 38, 3 (2005), 250–261. https://doi.org/10.1177/00222194050380030601",
      "doi": ""
    },
    {
      "text": "Evan M Peck, Sofia E Ayuso, and Omar El-Etr. 2019. Data is personal: Attitudes and perceptions of data visualization in rural pennsylvania. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12. https://doi.org/10.1145/3290605.3300474",
      "doi": "10.1145/3290605.3300474"
    },
    {
      "text": "Steven Pinker. 1990. A theory of graph comprehension. Artificial intelligence and the future of testing (1990), 73–126.",
      "doi": ""
    },
    {
      "text": "Chiara Piroddi, Federica Fragapane, and Christine Guthry. 2018. Planet Earth: infographics for discovering our world. White Star Kids.",
      "doi": ""
    },
    {
      "text": "Rebecca Pop. 2021. Who Will Shape the Future of Data Visualization? Today’s Kids!https://medium.com/nightingale/who-will-shape-the-future-of-data-visualizations-todays-kids-75d1111d346e",
      "doi": ""
    },
    {
      "text": "Vicky Rideout. 2015. The common sense census: Media use by tweens and teens. (2015).",
      "doi": ""
    },
    {
      "text": "Puripant Ruchikachorn, Patchar Duangklad, and Thanisara Ruangdej. [n.d.]. A Case Study of Data Visualization and Storytelling Workshop for Middle School Students. ([n. d.]).",
      "doi": ""
    },
    {
      "text": "Bahador Saket, Alex Endert, and John Stasko. 2016. Beyond usability and performance: A review of user experience-focused evaluations in visualization. In Proceedings of the Sixth Workshop on Beyond Time and Errors on Novel Evaluation Methods for Visualization. 133–142. https://doi.org/10.1145/2993901.2993903",
      "doi": "10.1145/2993901.2993903"
    },
    {
      "text": "Priti Shah and James Hoeffner. 2002. Review of graph comprehension research: Implications for instruction. Educational psychology review 14, 1 (2002), 47–69. https://doi.org/10.1023/A:1013180410169",
      "doi": ""
    },
    {
      "text": "Priti Shah, Richard E Mayer, and Mary Hegarty. 1999. Graphs as aids to knowledge construction: Signaling techniques for guiding the process of graph comprehension.Journal of educational psychology 91, 4 (1999), 690. https://doi.org/10.1037/0022-0663.91.4.690",
      "doi": ""
    },
    {
      "text": "S Shaphiro and M Wilk. 1965. An analysis of variance test for normality. Biometrika 52, 3 (1965), 591–611. https://doi.org/10.2307/2333709",
      "doi": ""
    },
    {
      "text": "Emily Slusser and Hilary Barth. 2017. Intuitive proportion judgment in number-line estimation: Converging evidence from multiple tasks. Journal of Experimental Child Psychology 162 (2017), 181–198. https://doi.org/10.1016/j.jecp.2017.04.010",
      "doi": ""
    },
    {
      "text": "Emily B Slusser, Rachel T Santiago, and Hilary C Barth. 2013. Developmental change in numerical estimation.Journal of Experimental Psychology: General 142, 1 (2013), 193. https://doi.org/10.1037/a0028560",
      "doi": ""
    },
    {
      "text": "Ian Spence. 1990. Visual psychophysics of simple graphical elements.Journal of Experimental Psychology: Human Perception and Performance 16, 4(1990), 683. https://doi.org/10.1037//0096-1523.16.4.683",
      "doi": ""
    },
    {
      "text": "Ian Spence and Peter Krizel. 1994. Children’s perception of proportion in graphs. Child Development 65, 4 (1994), 1193–1213. https://doi.org/10.1111/j.1467-8624.1994.tb00812.x",
      "doi": ""
    },
    {
      "text": "Justin Talbot, Vidya Setlur, and Anushka Anand. 2014. Four experiments on the perception of bar charts. IEEE transactions on visualization and computer graphics 20, 12(2014), 2152–2160. https://doi.org/10.1109/TVCG.2014.2346320",
      "doi": ""
    },
    {
      "text": "Common Core Standards Writing Team. 2013. Progressions for the Common Core State Standards in Mathematics.",
      "doi": ""
    },
    {
      "text": "The New York Times. [n.d.]. What’s going on in this graph?https://www.nytimes.com/column/whats-going-on-in-this-graph",
      "doi": ""
    },
    {
      "text": "Edward R Tufte, Nora Hillman Goeler, and Richard Benson. 1990. Envisioning information. Vol. 2. Graphics press Cheshire, CT.",
      "doi": ""
    },
    {
      "text": "Ellen Storey Vasu and Ann C Howe. 1989. The effect of visual and verbal modes of presentation on children’s retention of images and words. Journal of Research in Science Teaching 26, 5 (1989), 401–407. https://doi.org/10.1002/tea.3660260505",
      "doi": ""
    },
    {
      "text": "Howard Wainer. 1980. A test of graphicacy in children. Applied Psychological Measurement 4, 3 (1980), 331–340. https://doi.org/10.1177/014662168000400305",
      "doi": ""
    },
    {
      "text": "Ronald L Wasserstein and Nicole A Lazar. 2016. The ASA statement on p-values: context, process, and purpose. https://doi.org/10.1080/00031305.2016.1154108",
      "doi": ""
    },
    {
      "text": "Evan James Williams. 1949. Experimental designs balanced for the estimation of residual effects of treatments. Australian Journal of Chemistry 2, 2 (1949), 149–168. https://doi.org/10.1071/CH9490149",
      "doi": ""
    }
  ]
}