{
  "doi": "10.1145/3491102.3517791",
  "title": "You Complete Me: Human-AI Teams and Complementary Expertise",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-28",
  "year": 2022,
  "badges": [],
  "abstract": "People consider recommendations from AI systems in diverse domains ranging from recognizing tumors in medical images to deciding which shoes look cute with an outfit. Implicit in the decision process is the perceived expertise of the AI system. In this paper, we investigate how people trust and rely on an AI assistant that performs with different levels of expertise relative to the person, ranging from completely overlapping expertise to perfectly complementary expertise. Through a series of controlled online lab studies where participants identified objects with the help of an AI assistant, we demonstrate that participants were able to perceive when the assistant was an expert or non-expert within the same task and calibrate their reliance on the AI to improve team performance. We also demonstrate that communicating expertise through the linguistic properties of the explanation text was effective, where embracing language increased reliance and distancing language reduced reliance on AI.",
  "tags": [
    "human-AI teams",
    "explainable AI",
    "complementary expertise",
    "trust"
  ],
  "authors": [
    {
      "name": "Qiaoning Zhang",
      "institution": "University of Michigan-Ann Arbor, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528926",
      "orcid": "missing"
    },
    {
      "name": "Matthew L Lee",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660049684",
      "orcid": "0000-0003-2620-2623"
    },
    {
      "name": "Scott Carter",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238112",
      "orcid": "0000-0002-2942-972X"
    }
  ],
  "references": [
    {
      "text": "Ashraf Abdul, Christian von der Weth, Mohan Kankanhalli, and Brian Y Lim. 2020. COGAM: Measuring and Moderating Cognitive Load in Machine Learning Model Explanations. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376615"
    },
    {
      "text": "Annette Baier. 1986. Trust and Antitrust. Ethics 96, 2 (Jan. 1986), 231–260.",
      "doi": ""
    },
    {
      "text": "Gagan Bansal, Besmira Nushi, Ece Kamar, Walter S Lasecki, Daniel S Weld, and Eric Horvitz. 2019. Beyond Accuracy: The Role of Mental Models in Human-AI Team Performance. HCOMP 7, 1 (Oct. 2019), 2–11.",
      "doi": ""
    },
    {
      "text": "Gagan Bansal, Besmira Nushi, Ece Kamar, Daniel S Weld, Walter S Lasecki, and Eric Horvitz. 2019. Updates in Human-AI Teams: Understanding and Addressing the Performance/Compatibility Tradeoff. AAAI 33, 01 (July 2019), 2429–2437.",
      "doi": "10.1609/aaai.v33i01.33012429"
    },
    {
      "text": "Gagan Bansal, Tongshuang Wu, Joyce Zhou, Raymond Fok, Besmira Nushi, Ece Kamar, Marco Tulio Ribeiro, and Daniel Weld. 2021. Does the Whole Exceed its Parts? The Effect of AI Explanations on Complementary Team Performance. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21, Article 81). Association for Computing Machinery, New York, NY, USA, 1–16.",
      "doi": "10.1145/3411764.3445717"
    },
    {
      "text": "Carrie J Cai, Jonas Jongejan, and Jess Holbrook. 2019. The effects of example-based explanations in a machine learning interface. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 258–262.",
      "doi": "10.1145/3301275.3302289"
    },
    {
      "text": "Carrie J Cai, Samantha Winter, David Steiner, Lauren Wilcox, and Michael Terry. 2021. Onboarding Materials as Cross-functional Boundary Objects for Developing AI Assistants. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–7.",
      "doi": "10.1145/3411763.3443435"
    },
    {
      "text": "Meng Chen, Robert A Bell, and Laramie D Taylor. 2017. Persuasive effects of point of view, protagonist competence, and similarity in a health narrative about type 2 diabetes. Journal of health communication 22, 8 (2017), 702–712.",
      "doi": ""
    },
    {
      "text": "Alexandra Chouldechova, Diana Benavides-Prado, Oleksandr Fialko, and Rhema Vaithianathan. 2018. A case study of algorithm-assisted decision making in child maltreatment hotline screening decisions. In Proceedings of the 1st Conference on Fairness, Accountability and Transparency(Proceedings of Machine Learning Research, Vol. 81), Sorelle A Friedler and Christo Wilson (Eds.). PMLR, 134–148.",
      "doi": ""
    },
    {
      "text": "Sam Corbett-Davies, Emma Pierson, Avi Feller, Sharad Goel, and Aziz Huq. 2017. Algorithmic Decision Making and the Cost of Fairness. In Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining(Halifax, NS, Canada) (KDD ’17). Association for Computing Machinery, New York, NY, USA, 797–806.",
      "doi": "10.1145/3097983.3098095"
    },
    {
      "text": "Devleena Das, Siddhartha Banerjee, and Sonia Chernova. 2021. Explainable AI for Robot Failures: Generating Explanations that Improve User Assistance in Fault Recovery. In Proceedings of the 2021 ACM/IEEE International Conference on Human-Robot Interaction (Boulder, CO, USA) (HRI ’21). Association for Computing Machinery, New York, NY, USA, 351–360.",
      "doi": "10.1145/3434073.3444657"
    },
    {
      "text": "Maartje M A de Graaf and Bertram F Malle. 2017. How People Explain Action (and Autonomous Intelligent Systems Should Too). In 2017 AAAI Fall Symposium Series.",
      "doi": ""
    },
    {
      "text": "Upol Ehsan, Q Vera Liao, Michael Muller, Mark O Riedl, and Justin D Weisz. 2021. Expanding Explainability: Towards Social Transparency in AI systems. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–19.",
      "doi": "10.1145/3411764.3445188"
    },
    {
      "text": "Upol Ehsan, Pradyumna Tambwekar, Larry Chan, Brent Harrison, and Mark O Riedl. 2019. Automated rationale generation: a technique for explainable AI and its effects on human perceptions. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 263–274.",
      "doi": "10.1145/3301275.3302316"
    },
    {
      "text": "Shi Feng and Jordan Boyd-Graber. 2019. What can AI do for me? evaluating machine learning interpretations in cooperative play. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 229–239.",
      "doi": "10.1145/3301275.3302265"
    },
    {
      "text": "Shi Feng and Jordan Boyd-Graber. 2019. What can AI do for me? evaluating machine learning interpretations in cooperative play. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 229–239.",
      "doi": "10.1145/3301275.3302265"
    },
    {
      "text": "Katy Ilonka Gero, Zahra Ashktorab, Casey Dugan, Qian Pan, James Johnson, Werner Geyer, Maria Ruiz, Sarah Miller, David R Millen, Murray Campbell, Sadhana Kumaravel, and Wei Zhang. 2020. Mental Models of AI Agents in a Cooperative Game Setting. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": "10.1145/3313831.3376316"
    },
    {
      "text": "Maaike Harbers, Karel van den Bosch, and John-Jules Ch Meyer. 2009. A Study into Preferred Explanations of Virtual Agent Behavior. In Intelligent Virtual Agents. Springer Berlin Heidelberg, 132–145.",
      "doi": ""
    },
    {
      "text": "Rafal Kocielnik, Saleema Amershi, and Paul N Bennett. 2019. Will You Accept an Imperfect AI? Exploring Designs for Adjusting End-user Expectations of AI Systems. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3290605.3300641"
    },
    {
      "text": "Moritz Körber, Eva Baseler, and Klaus Bengler. 2018. Introduction matters: Manipulating trust in automation and reliance in automated driving. Appl. Ergon. 66 (Jan. 2018), 18–31.",
      "doi": ""
    },
    {
      "text": "Todd Kulesza, Simone Stumpf, Margaret Burnett, Sherry Yang, Irwin Kwan, and Weng-Keen Wong. 2013. Too much, too little, or just right? Ways explanations impact end users’ mental models. In 2013 IEEE Symposium on Visual Languages and Human Centric Computing. ieeexplore.ieee.org, 3–10.",
      "doi": ""
    },
    {
      "text": "Vivian Lai, Chacha Chen, Q Vera Liao, Alison Smith-Renner, and Chenhao Tan. 2021. Towards a Science of Human-AI Decision Making: A Survey of Empirical Studies. (Dec. 2021). arxiv:2112.11471 [cs.AI]",
      "doi": ""
    },
    {
      "text": "Vivian Lai and Chenhao Tan. 2019. On Human Predictions with Explanations and Predictions of Machine Learning Models: A Case Study on Deception Detection. In Proceedings of the Conference on Fairness, Accountability, and Transparency (Atlanta, GA, USA) (FAT* ’19). Association for Computing Machinery, New York, NY, USA, 29–38.",
      "doi": "10.1145/3287560.3287590"
    },
    {
      "text": "J Lee and N Moray. 1992. Trust, control strategies and allocation of function in human-machine systems. Ergonomics 35, 10 (Oct. 1992), 1243–1270.",
      "doi": ""
    },
    {
      "text": "Ariel Levy, Monica Agrawal, Arvind Satyanarayan, and David Sontag. 2021. Assessing the Impact of Automated Suggestions on Decision Making: Domain Experts Mediate Model Errors but Take Less Initiative. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21, Article 72). Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3411764.3445522"
    },
    {
      "text": "Nira Liberman, Yaacov Trope, Elena Stephan, and Others. 2007. Psychological distance. Social psychology: Handbook of basic principles 2 (2007), 353–383.",
      "doi": ""
    },
    {
      "text": "Alexandra Lorson, Chris Cummins, and Hannah Rohde. 2021. Strategic use of (un) certainty expressions. Frontiers in Communication 6 (2021), 28.",
      "doi": ""
    },
    {
      "text": "Zhuoran Lu and Ming Yin. 2021. Human Reliance on Machine Learning Models When Performance Feedback is Limited: Heuristics and Risks. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21, Article 78). Association for Computing Machinery, New York, NY, USA, 1–16.",
      "doi": "10.1145/3411764.3445562"
    },
    {
      "text": "Bertram F Malle. 2006. How the Mind Explains Behavior: Folk Explanations, Meaning, and Social Interaction. MIT Press.",
      "doi": ""
    },
    {
      "text": "Bertram F Malle. 2006. How the mind explains behavior: Folk explanations, meaning, and social interaction. MIT press.",
      "doi": ""
    },
    {
      "text": "Bertram F Malle, Joshua Knobe, Matthew J O’Laughlin, Gale E Pearce, and Sarah E Nelson. 2000. Conceptual structure and social functions of behavior explanations: Beyond person–situation attributions. J. Pers. Soc. Psychol. 79, 3 (Sept. 2000), 309–326.",
      "doi": ""
    },
    {
      "text": "Roger C Mayer, James H Davis, and F David Schoorman. 1995. An integrative model of organizational trust. Acad. Manage. Rev. 20, 3 (July 1995), 709–734.",
      "doi": ""
    },
    {
      "text": "Tim Miller. 2019. Explanation in artificial intelligence: Insights from the social sciences. Artif. Intell. 267 (Feb. 2019), 1–38.",
      "doi": ""
    },
    {
      "text": "B M Muir and N Moray. 1996. Trust in automation. Part II. Experimental studies of trust and human intervention in a process control simulation. Ergonomics 39, 3 (March 1996), 429–460.",
      "doi": ""
    },
    {
      "text": "Frederik Naujoks, Yannick Forster, Katharina Wiedemann, and Alexandra Neukum. 2017. A Human-Machine Interface for Cooperative Highly Automated Driving. In Advances in Human Aspects of Transportation. Springer International Publishing, 585–595.",
      "doi": ""
    },
    {
      "text": "Mahsan Nourani, Joanie King, and Eric Ragan. 2020. The Role of Domain Expertise in User Trust and the Impact of First Impressions with Intelligent Systems. HCOMP 8, 1 (Oct. 2020), 112–121.",
      "doi": ""
    },
    {
      "text": "Catherine Pelachaud. 2009. Studies on gesture expressivity for a virtual agent. Speech Commun. 51, 7 (July 2009), 630–639.",
      "doi": "10.1016/j.specom.2008.04.009"
    },
    {
      "text": "Forough Poursabzi-Sangdeh, Daniel G Goldstein, Jake M Hofman, Jennifer Wortman Wortman Vaughan, and Hanna Wallach. 2021. Manipulating and Measuring Model Interpretability. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21, Article 237). Association for Computing Machinery, New York, NY, USA, 1–52.",
      "doi": "10.1145/3411764.3445315"
    },
    {
      "text": "Ajay Sandhu and Peter Fussey. 2021. The ‘uberization of policing’? How police negotiate and operationalise predictive policing technology. Policing Soc. 31, 1 (Jan. 2021), 66–81.",
      "doi": ""
    },
    {
      "text": "James Schaffer, John O’Donovan, James Michaelis, Adrienne Raglin, and Tobias Höllerer. 2019. I can do better than your AI: expertise and explanations. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 240–251.",
      "doi": "10.1145/3301275.3302308"
    },
    {
      "text": "James Schaffer, John O’Donovan, James Michaelis, Adrienne Raglin, and Tobias Höllerer. 2019. I can do better than your AI: expertise and explanations. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 240–251.",
      "doi": "10.1145/3301275.3302308"
    },
    {
      "text": "Younho Seong and Ann M Bisantz. 2008. The impact of cognitive feedback on judgment performance and trust with decision aids. Int. J. Ind. Ergon. 38, 7 (July 2008), 608–625.",
      "doi": ""
    },
    {
      "text": "N A Stanton and M S Young. 1998. Vehicle automation and driving performance. Ergonomics 41, 7 (July 1998), 1014–1028.",
      "doi": ""
    },
    {
      "text": "Selina Jeanne Sutton, Paul Foulkes, David Kirk, and Shaun Lawson. 2019. Voice as a Design Material: Sociophonetic Inspired Design Strategies in Human-Computer Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3290605.3300833"
    },
    {
      "text": "Chun-Hua Tsai, Yue You, Xinning Gui, Yubo Kou, and John M Carroll. 2021. Exploring and Promoting Diagnostic Transparency and Explainability in Online Symptom Checkers. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–17.",
      "doi": "10.1145/3411764.3445101"
    },
    {
      "text": "Dakuo Wang, Liuping Wang, Zhan Zhang, Ding Wang, Haiyi Zhu, Yvonne Gao, Xiangmin Fan, and Feng Tian. 2021. “Brilliant AI Doctor” in Rural Clinics: Challenges in AI-Powered Clinical Decision Support System Deployment. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–18.",
      "doi": "10.1145/3411764.3445432"
    },
    {
      "text": "Danding Wang, Qian Yang, Ashraf Abdul, and Brian Y Lim. 2019. Designing Theory-Driven User-Centric Explainable AI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–15.",
      "doi": "10.1145/3290605.3300831"
    },
    {
      "text": "Katharina Weitz, Dominik Schiller, Ruben Schlagowski, Tobias Huber, and Elisabeth André. 2019. “Do you trust me?”: Increasing User-Trust by Integrating Virtual Agents in Explainable AI Interaction Design. In Proceedings of the 19th ACM International Conference on Intelligent Virtual Agents (Paris, France) (IVA ’19). Association for Computing Machinery, New York, NY, USA, 7–9.",
      "doi": "10.1145/3308532.3329441"
    },
    {
      "text": "Katharina Weitz, Dominik Schiller, Ruben Schlagowski, Tobias Huber, and Elisabeth André. 2021. “Let me explain!”: exploring the potential of virtual agents in explainable AI interaction design. Journal on Multimodal User Interfaces 15, 2 (June 2021), 87–98.",
      "doi": ""
    },
    {
      "text": "Ming Yin, Jennifer Wortman Vaughan, and Hanna Wallach. 2019. Understanding the Effect of Accuracy on Trust in Machine Learning Models. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19, Paper 279). Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": "10.1145/3290605.3300509"
    },
    {
      "text": "Kun Yu, Shlomo Berkovsky, Ronnie Taib, Jianlong Zhou, and Fang Chen. 2019. Do I trust my machine teammate? an investigation from perception to decision. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 460–468.",
      "doi": "10.1145/3301275.3302277"
    },
    {
      "text": "Yunfeng Zhang, Q Vera Liao, and Rachel K E Bellamy. 2020. Effect of confidence and explanation on accuracy and trust calibration in AI-assisted decision making. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency (Barcelona, Spain) (FAT* ’20). Association for Computing Machinery, New York, NY, USA, 295–305.",
      "doi": "10.1145/3351095.3372852"
    }
  ]
}