{
  "doi": "10.1145/3491102.3502068",
  "title": "Characterizing Practices, Limitations, and Opportunities Related to Text Information Extraction Workflows: A Human-in-the-loop Perspective",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "Information extraction (IE) approaches often play a pivotal role in text analysis and require significant human intervention. Therefore, a deeper understanding of existing IE practices and related challenges from a human-in-the-loop perspective is warranted. In this work, we conducted semi-structured interviews in an industrial environment and analyzed the reported IE approaches and limitations. We observed that data science workers often follow an iterative task model consisting of information foraging and sensemaking loops across all the phases of an IE workflow. The task model is generalizable and captures diverse goals across these phases (e.g., data preparation, modeling, evaluation.) We found several limitations in both foraging (e.g., data exploration) and sensemaking (e.g., qualitative debugging) loops stemming from a lack of adherence to existing cognitive engineering principles. Moreover, we identified that due to the iterative nature of an IE workflow, the requirement of provenance is often implied but rarely supported by existing systems. Based on these findings, we discuss design implications for supporting IE workflows and future research directions.",
  "tags": [
    "Data science workflows",
    "Information extraction",
    "Human-AI collaboration"
  ],
  "authors": [
    {
      "name": "Sajjadur Rahman",
      "institution": "Megagon Labs, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658746978",
      "orcid": "missing"
    },
    {
      "name": "Eser Kandogan",
      "institution": "Megagon Labs, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81461646619",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Saleema Amershi, Maya Cakmak, William Bradley Knox, and Todd Kulesza. 2014. Power to the people: The role of humans in interactive machine learning. AI Magazine 35, 4 (2014), 105–120.",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Max Chickering, Steven M Drucker, Bongshin Lee, Patrice Simard, and Jina Suh. 2015. Modeltracker: Redesigning performance analysis tools for machine learning. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 337–346.",
      "doi": "10.1145/2702123.2702509"
    },
    {
      "text": "Santiago Angée, Silvia I Lozano-Argel, Edwin N Montoya-Munera, Juan-David Ospina-Arango, and Marta S Tabares-Betancur. 2018. Towards an improved ASUM-DM process methodology for cross-disciplinary multi-organization big data & analytics projects. In International Conference on Knowledge Management in Organizations. Springer, New York, NY, USA, 613–624.",
      "doi": ""
    },
    {
      "text": "Stefanos Angelidis, Reinald Kim Amplayo, Yoshihiko Suhara, Xiaolan Wang, and Mirella Lapata. 2021. Extractive opinion summarization in quantized transformer spaces. Transactions of the Association for Computational Linguistics 9 (2021), 277–293.",
      "doi": ""
    },
    {
      "text": "Rob Ashmore, Radu Calinescu, and Colin Paterson. 2021. Assuring the machine learning lifecycle: Desiderata, methods, and challenges. ACM Computing Surveys (CSUR) 54, 5 (2021), 1–39.",
      "doi": "10.1145/3453444"
    },
    {
      "text": "Jürgen Bernard, Marco Hutter, Michael Sedlmair, Matthias Zeppelzauer, and Tamara Munzner. 2021. A Taxonomy of Property Measures to Unify Active Learning and Human-Centered Approaches to Data Labeling. ACM Trans. Interact. Intell. Syst. 11, 3–4, Article 20 (Aug. 2021), 42 pages.",
      "doi": "10.1145/3439333"
    },
    {
      "text": "Aditya Bharadwaj, Pao Siangliulue, Adam Marcus, and Kurt Luther. 2019. Critter: Augmenting Creative Work with Dynamic Checklists, Automated Quality Assurance, and Contextual Reviewer Feedback. In Proceedings of CHI 2019. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3290605.3300769"
    },
    {
      "text": "Nikita Bhutani, Yoshihiko Suhara, Wang-Chiew Tan, Alon Halevy, and HV Jagadish. 2019. Open Information Extraction from Question-Answer Pairs. In Proceedings of NAACL-HLT. ACL, Stroudsburg,PA, USA, 2294–2305.",
      "doi": ""
    },
    {
      "text": "Nikita Bhutani, Aaron Traylor, Chen Chen, Xiaolan Wang, Behzad Golshan, and Wang-Chiew Tan. 2020. SAMPO: Unsupervised Knowledge Base Construction for Opinions and Implications. In AKBC. Openreview, Openreview.net, 1–17.",
      "doi": ""
    },
    {
      "text": "Razvan C Bunescu and Raymond J Mooney. 2007. Extracting relations from text: From word sequences to dependency paths. In Natural language processing and text mining. Springer, New York, NY, USA, 29–44.",
      "doi": ""
    },
    {
      "text": "Akemi T Chatfield, Vivian N Shlemoon, Wilbur Redublado, and Faizur Rahman. 2014. Data scientists as game changers in big data environments. In Proc. ACIS. ACIS, Australia, 1–11.",
      "doi": ""
    },
    {
      "text": "Sherry Y Chen and Robert D Macredie. 2005. The assessment of usability of electronic shopping: A heuristic evaluation. International journal of information management 25, 6(2005), 516–532.",
      "doi": ""
    },
    {
      "text": "Codait. 2021. Text Extensions for Pandas. IBM. Retrieved March 17, 2021 from https://codait.github.io/text-extensions-for-pandas/",
      "doi": ""
    },
    {
      "text": "Jim Cowie and Wendy Lehnert. 1996. Information extraction. Commun. ACM 39, 1 (1996), 80–91.",
      "doi": "10.1145/234173.234209"
    },
    {
      "text": "Robert A DeLine. 2021. Glinda: Supporting Data Science with Live Programming, GUIs and a Domain-specific Language. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–11.",
      "doi": "10.1145/3411764.3445267"
    },
    {
      "text": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers). Association for Computational Linguistics, Minneapolis, Minnesota, 4171–4186. https://doi.org/10.18653/v1/N19-1423",
      "doi": ""
    },
    {
      "text": "Eduard Dragut, Yunyao Li, Lucian Popa, and Slobodan Vucetic (Eds.). 2021. Proceedings of the Second Workshop on Data Science with Human in the Loop: Language Advances. ACL, Online. https://aclanthology.org/2021.dash-1.0",
      "doi": ""
    },
    {
      "text": "Wafaa S El-Kassas, Cherif R Salama, Ahmed A Rafea, and Hoda K Mohamed. 2021. Automatic text summarization: A comprehensive survey. Expert Systems with Applications 165 (2021), 113679.",
      "doi": ""
    },
    {
      "text": "Oren Etzioni, Michele Banko, Stephen Soderland, and Daniel S Weld. 2008. Open information extraction from the web. Commun. ACM 51, 12 (2008), 68–74.",
      "doi": "10.1145/1409360.1409378"
    },
    {
      "text": "Sebastian S Feger, Sünje Dallmeier-Tiessen, Paweł W Woźniak, and Albrecht Schmidt. 2019. The Role of HCI in Reproducible Science: Understanding, Supporting and Motivating Core Practices. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–6.",
      "doi": ""
    },
    {
      "text": "Glenn Fulcher. 2003. Interface design in computer-based language testing. Language testing 20, 4 (2003), 384–408.",
      "doi": ""
    },
    {
      "text": "Timnit Gebru, Jamie Morgenstern, Briana Vecchione, Jennifer Wortman Vaughan, Hanna Wallach, Hal Daumé III, and Kate Crawford. 2018. Datasheets for datasets.",
      "doi": ""
    },
    {
      "text": "Jill Gerhardt-Powals. 1996. Cognitive engineering principles for enhancing human-computer performance. International Journal of Human-Computer Interaction 8, 2(1996), 189–211.",
      "doi": "10.1080/10447319609526147"
    },
    {
      "text": "Brian Granger, Chris Colbert, and Ian Rose. 2017. JupyterLab: The next generation jupyter frontend.",
      "doi": ""
    },
    {
      "text": "Jonathan Grudin. 2001. Partitioning digital worlds: focal and peripheral awareness in multiple monitor use. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, New York, NY, USA, 458–465.",
      "doi": "10.1145/365024.365312"
    },
    {
      "text": "Philip J Guo, Sean Kandel, Joseph M Hellerstein, and Jeffrey Heer. 2011. Proactive wrangling: Mixed-initiative end-user programming of data transformation scripts. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, New York, NY, USA, 65–74.",
      "doi": "10.1145/2047196.2047205"
    },
    {
      "text": "Andrew Head, Fred Hohman, Titus Barik, Steven M. Drucker, and Robert DeLine. 2019. Managing Messes in Computational Notebooks. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300500",
      "doi": ""
    },
    {
      "text": "Sarah Holland, Ahmed Hosny, Sarah Newman, Joshua Joseph, and Kasia Chmielinski. 2018. The dataset nutrition label: A framework to drive higher data quality standards.",
      "doi": ""
    },
    {
      "text": "Sungsoo Ray Hong, Jessica Hullman, and Enrico Bertini. 2020. Human factors in model interpretability: Industry practices, challenges, and needs. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–26.",
      "doi": "10.1145/3392878"
    },
    {
      "text": "Eric Horvitz. 1999. Principles of mixed-initiative user interfaces. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 159–166.",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "Heng Ji and Ralph Grishman. 2011. Knowledge base population: Successful approaches and challenges. In Proceedings of the 49th annual meeting of the association for computational linguistics: Human language technologies. ACL, Stroudsburg,PA, USA, 1148–1158.",
      "doi": ""
    },
    {
      "text": "Jing Jiang. 2012. Information extraction from text. In Mining text data. Springer, New York, NY, USA, 11–41.",
      "doi": ""
    },
    {
      "text": "Ger Joyce and Mariana Lilley. 2014. Towards the development of usability heuristics for native smartphone mobile applications. In International Conference of Design, User Experience, and Usability. Springer, New York, NY, USA, 465–474.",
      "doi": ""
    },
    {
      "text": "Eser Kandogan, Aruna Balakrishnan, Eben M. Haber, and Jeffrey S. Pierce. 2014. From Data to Insight: Work Practices of Analysts in the Enterprise. IEEE Computer Graphics and Applications 34, 5 (2014), 42–50. https://doi.org/10.1109/MCG.2014.62",
      "doi": ""
    },
    {
      "text": "Mary Beth Kery, Marissa Radensky, Mahima Arya, Bonnie E John, and Brad A Myers. 2018. The story in the notebook: Exploratory data science using a literate programming tool. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–11.",
      "doi": "10.1145/3173574.3173748"
    },
    {
      "text": "John King and Roger Magoulas. 2015. 2015 data science salary survey. O’Reilly Media, Incorporated, Sebastopol, CA, USA.",
      "doi": ""
    },
    {
      "text": "Thomas Kluyver, Benjamin Ragan-Kelley, Fernando Pérez, Brian E Granger, Matthias Bussonnier, Jonathan Frederic, Kyle Kelley, Jessica B Hamrick, Jason Grout, Sylvain Corlay, 2016. Jupyter Notebooks-a publishing format for reproducible computational workflows. Vol. 2016. IOS Press, Amsterdam, Netherlands.",
      "doi": ""
    },
    {
      "text": "Hanna Köpcke and Erhard Rahm. 2010. Frameworks for entity matching: A comparison. Data & Knowledge Engineering 69, 2 (2010), 197–210. https://doi.org/10.1016/j.datak.2009.10.003",
      "doi": "10.1016/j.datak.2009.10.003"
    },
    {
      "text": "Georgia Kougka, Anastasios Gounaris, and Alkis Simitsis. 2018. The many faces of data-centric workflow optimization: a survey. International Journal of Data Science and Analytics 6, 2 (2018), 81–107.",
      "doi": ""
    },
    {
      "text": "Doris Jung-Lin Lee, Dixin Tang, Kunal Agarwal, Thyne Boonmark, Caitlyn Chen, Jake Kang, Ujjaini Mukhopadhyay, Jerry Song, Micah Yong, Marti A Hearst, 2021. Lux: Always-on Visualization Recommendations for Exploratory Data Science.",
      "doi": ""
    },
    {
      "text": "Yuliang Li, Jinfeng Li, Yoshihiko Suhara, Jin Wang, Wataru Hirota, and Wang-Chiew Tan. 2021. Deep Entity Matching: Challenges and Opportunities. Journal of Data and Information Quality (JDIQ) 13, 1 (2021), 1–17.",
      "doi": "10.1145/3431816"
    },
    {
      "text": "Sasu Mäkinen, Henrik Skogström, Eero Laaksonen, and Tommi Mikkonen. 2021. Who Needs MLOps: What Data Scientists Seek to Accomplish and How Can MLOps Help?",
      "doi": ""
    },
    {
      "text": "Yaoli Mao, Dakuo Wang, Michael Muller, Kush R Varshney, Ioana Baldini, Casey Dugan, and Aleksandra Mojsilović. 2019. How data scientistswork together with domain experts in scientific collaborations: To find the right answer or to ask the right question?Proceedings of the ACM on Human-Computer Interaction 3, GROUP(2019), 1–23.",
      "doi": ""
    },
    {
      "text": "Zhengjie Miao, Yuliang Li, Xiaolan Wang, and Wang-Chiew Tan. 2020. Snippext: Semi-supervised opinion mining with augmented data. In Proceedings of The Web Conference 2020. ACM, New York, NY, USA, 617–628.",
      "doi": "10.1145/3366423.3380144"
    },
    {
      "text": "Margaret Mitchell, Simone Wu, Andrew Zaldivar, Parker Barnes, Lucy Vasserman, Ben Hutchinson, Elena Spitzer, Inioluwa Deborah Raji, and Timnit Gebru. 2019. Model cards for model reporting. In Proceedings of the conference on fairness, accountability, and transparency. ACM, New York, NY, USA, 220–229.",
      "doi": "10.1145/3287560.3287596"
    },
    {
      "text": "Michael Muller, Ingrid Lange, Dakuo Wang, David Piorkowski, Jason Tsay, Q Vera Liao, Casey Dugan, and Thomas Erickson. 2019. How data science workers work with data: Discovery, capture, curation, design, creation. In Proceedings of the 2019 CHI conference on human factors in computing systems. ACM, New York, NY, USA, 1–15.",
      "doi": "10.1145/3290605.3300356"
    },
    {
      "text": "Bonnie A Nardi and James R Miller. 1991. Twinkling lights and nested loops: distributed problem solving and spreadsheet development. International Journal of Man-Machine Studies 34, 2 (1991), 161–184.",
      "doi": "10.1016/0020-7373%2891%2990040-E"
    },
    {
      "text": "Vinh Nguyen, Tommy Dang, and Fang Jin. 2018. Predict saturated thickness using tensorboard visualization.",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen and Rolf Molich. 1990. Heuristic evaluation of user interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, New York, NY, USA, 249–256.",
      "doi": "10.1145/97243.97281"
    },
    {
      "text": "Samir Passi and Steven Jackson. 2017. Data vision: Learning to see through algorithmic abstraction. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. ACM, New York, NY, USA, 2436–2447.",
      "doi": "10.1145/2998181.2998331"
    },
    {
      "text": "Samir Passi and Steven J Jackson. 2018. Trust in data science: Collaboration, translation, and accountability in corporate data science projects. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–28.",
      "doi": "10.1145/3274405"
    },
    {
      "text": "Kayur Patel, Naomi Bancroft, Steven M Drucker, James Fogarty, Andrew J Ko, and James Landay. 2010. Gestalt: integrated support for implementation and analysis in machine learning. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. ACM, New York, NY, USA, 37–46.",
      "doi": "10.1145/1866029.1866038"
    },
    {
      "text": "Kathleen H Pine and Max Liboiron. 2015. The politics of measurement and action. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 3147–3156.",
      "doi": "10.1145/2702123.2702298"
    },
    {
      "text": "Peter Pirolli and Stuart Card. 1999. Information foraging.Psychological review 106, 4 (1999), 643.",
      "doi": ""
    },
    {
      "text": "Peter Pirolli and Stuart Card. 2005. The sensemaking process and leverage points for analyst technology as identified through cognitive task analysis. In Proceedings of international conference on intelligence analysis, Vol. 5. McLean, VA, USA, 2–4.",
      "doi": ""
    },
    {
      "text": "Sajjadur Rahman, Mangesh Bendre, Yuyang Liu, Shichu Zhu, Zhaoyuan Su, Karrie Karahalios, and Aditya Parameswaran. 2021. NOAH: Interactive Spreadsheet Exploration with Dynamic Hierarchical Overviews. Proceedings of the VLDB Endowment 14, 6 (2021), 970–983.",
      "doi": "10.14778/3447689.3447701"
    },
    {
      "text": "Sajjadur Rahman, Peter Griggs, and Çağatay Demiralp. 2021. Leam: An Interactive System for In-situ Visual Text Analysis. In CIDR. CIDRDB, cidrdb.org, 1–7.",
      "doi": ""
    },
    {
      "text": "Sajjadur Rahman, Pao Siangliulue, and Adam Marcus. 2020. MixTAPE: Mixed-initiative Team Action Plan Creation Through Semi-structured Notes, Automatic Task Generation, and Task Classification. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–26.",
      "doi": "10.1145/3415240"
    },
    {
      "text": "Gonzalo Ramos, Christopher Meek, Patrice Simard, Jina Suh, and Soroush Ghorashi. 2020. Interactive machine teaching: a human-centered approach to building machine-learned models. Human–Computer Interaction 35, 5-6 (2020), 413–451.",
      "doi": ""
    },
    {
      "text": "Adam Rule, Aurélien Tabard, and James D Hollan. 2018. Exploration and explanation in computational notebooks. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3173574.3173606"
    },
    {
      "text": "Daniel M Russell, Mark J Stefik, Peter Pirolli, and Stuart K Card. 1993. The cost structure of sensemaking. In Proceedings of the INTERACT’93 and CHI’93 conference on Human factors in computing systems. ACM, New York, NY, USA, 269–276.",
      "doi": "10.1145/169059.169209"
    },
    {
      "text": "Michelle Salmona, Eli Lieber, and Dan Kaczynski. 2019. Qualitative and mixed methods data analysis using Dedoose: A practical approach for research across the social sciences. Sage Publications, Thousand Oaks, CA, USA.",
      "doi": ""
    },
    {
      "text": "Colin Shearer. 2000. The CRISP-DM model: the new blueprint for data mining. Journal of data warehousing 5, 4 (2000), 13–22.",
      "doi": ""
    },
    {
      "text": "Hemlata Shelar, Gagandeep Kaur, Neha Heda, and Poorva Agrawal. 2020. Named entity recognition approaches and their comparison for custom ner model. Science & Technology Libraries 39, 3 (2020), 324–337.",
      "doi": ""
    },
    {
      "text": "Jiaming Shen, Zeqiu Wu, Dongming Lei, Jingbo Shang, Xiang Ren, and Jiawei Han. 2017. Setexpan: Corpus-based set expansion via context feature selection and rank ensemble. In Joint European Conference on Machine Learning and Knowledge Discovery in Databases. Springer, New York, NY, USA, 288–304.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman and Pattie Maes. 1997. Direct manipulation vs. interface agents. interactions 4, 6 (1997), 42–61.",
      "doi": ""
    },
    {
      "text": "LA Snider and SE Swedo. 2004. PANDAS: current status and directions for research. Molecular psychiatry 9, 10 (2004), 900–907.",
      "doi": ""
    },
    {
      "text": "Justin Talbot, Bongshin Lee, Ashish Kapoor, and Desney S Tan. 2009. EnsembleMatrix: interactive visualization to support machine learning with multiple classifiers. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, New York, NY, USA, 1283–1292.",
      "doi": "10.1145/1518701.1518895"
    },
    {
      "text": "Ian Tenney, James Wexler, Jasmijn Bastings, Tolga Bolukbasi, Andy Coenen, Sebastian Gehrmann, Ellen Jiang, Mahima Pushkarna, Carey Radebaugh, Emily Reif, and Ann Yuan. 2020. The Language Interpretability Tool: Extensible, Interactive Visualizations and Analysis for NLP Models. In EMNLP. ACL, Stroudsburg,PA, USA, 107–118.",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Justin D Weisz, Michael Muller, Parikshit Ram, Werner Geyer, Casey Dugan, Yla Tausczik, Horst Samulowitz, and Alexander Gray. 2019. Human-ai collaboration in data science: Exploring data scientists’ perceptions of automated ai. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–24.",
      "doi": "10.1145/3359313"
    },
    {
      "text": "Xiaolan Wang, Yoshihiko Suhara, Natalie Nuno, Yuliang Li, Jinfeng Li, Nofar Carmeli, Stefanos Angelidis, Eser Kandogann, and Wang-Chiew Tan. 2020. ExtremeReader: An interactive explorer for customizable and explainable review summarization. In Companion Proceedings of the Web Conference 2020. ACM, New York, NY, USA, 176–180.",
      "doi": "10.1145/3366424.3383535"
    },
    {
      "text": "Jennifer Watts-Perotti and David D Woods. 1999. How experienced users avoid getting lost in large display networks. International Journal of Human-Computer Interaction 11, 4(1999), 269–299.",
      "doi": ""
    },
    {
      "text": "Samuel F Way, Daniel B Larremore, and Aaron Clauset. 2016. Gender, productivity, and prestige in computer science faculty hiring networks. In Proceedings of the 25th International Conference on World Wide Web. ACM, New York, NY, USA, 1169–1179.",
      "doi": "10.1145/2872427.2883073"
    },
    {
      "text": "Xing Wei and W Bruce Croft. 2006. LDA-based document models for ad-hoc retrieval. In Proceedings of the 29th annual international ACM SIGIR conference on Research and development in information retrieval. ACM, New York, NY, USA, 178–185.",
      "doi": "10.1145/1148170.1148204"
    },
    {
      "text": "Karl E Weick. 1995. Sensemaking in organizations. Vol. 3. Sage Publications, Thousand Oaks, CA, USA.",
      "doi": ""
    },
    {
      "text": "Mark E Whiting, Allie Blaising, Chloe Barreau, Laura Fiuza, Nik Marda, Melissa Valentine, and Michael S Bernstein. 2019. Did it have to end this way? Understanding the consistency of team fracture. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": ""
    },
    {
      "text": "Mark E Whiting, Irena Gao, Michelle Xing, N’godjigui Junior Diarrassouba, Tonya Nguyen, and Michael S Bernstein. 2020. Parallel worlds: Repeated initializations of the same team to improve team viability. proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–22.",
      "doi": "10.1145/3392877"
    },
    {
      "text": "Yifan Wu, Joseph M. Hellerstein, and Arvind Satyanarayan. 2020. B2: Bridging Code and Interactive Visualization in Computational Notebooks. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 152–165.",
      "doi": "10.1145/3379337.3415851"
    },
    {
      "text": "Doris Xin, Eva Yiwei Wu, Doris Jung-Lin Lee, Niloufar Salehi, and Aditya Parameswaran. 2021. Whither AutoML? Understanding the Role of Automation in Machine Learning Workflows. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–16.",
      "doi": "10.1145/3411764.3445306"
    },
    {
      "text": "Qian Yang, Jina Suh, Nan-Chen Chen, and Gonzalo Ramos. 2018. Grounding interactive machine learning tool design in how non-experts actually build models. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM, New York, NY, USA, 573–584.",
      "doi": "10.1145/3196709.3196729"
    },
    {
      "text": "Matei Zaharia, Andrew Chen, Aaron Davidson, Ali Ghodsi, Sue Ann Hong, Andy Konwinski, Siddharth Murching, Tomas Nykodym, Paul Ogilvie, Mani Parkhe, 2018. Accelerating the machine learning lifecycle with MLflow.IEEE Data Eng. Bull. 41, 4 (2018), 39–45.",
      "doi": ""
    },
    {
      "text": "Amy X Zhang, Michael Muller, and Dakuo Wang. 2020. How do data science workers collaborate? roles, workflows, and tools. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–23.",
      "doi": "10.1145/3392826"
    }
  ]
}