{
  "doi": "10.1145/3491102.3502016",
  "title": "The Last Decade of HCI Research on Children and Voice-based Conversational Agents",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2022,
  "badges": [],
  "abstract": "Voice-based Conversational Agents (CAs) are increasingly being used by children. Through a review of 38 research papers, this work maps trends, themes, and methods of empirical research on children and CAs in HCI research over the last decade. A thematic analysis of the research found that work in this domain focuses on seven key topics: ascribing human-like qualities to CAs, CAs? support of children?s learning, the use and role of CAs in the home and family context, CAs? support of children?s play, children?s storytelling with CA, issues concerning the collection of information revealed by CAs, and CAs designed for children with differing abilities. Based on our findings, we identify the needs to account for children’s intersectional identities and linguistic and cultural diversity and theories from multiple disciples in the design of CAs, develop heuristics for child-centric interaction with CAs, to investigate implications of CAs on social cognition and interpersonal relationships, and to examine and design for multi-party interactions with CAs for different domains and contexts.",
  "tags": [
    "parents",
    "smart speakers",
    "systematic literature review",
    "voice interfaces",
    "family",
    "literature review",
    "voice user interfaces",
    "children",
    "voice agents",
    "virtual assistants",
    "conversational agents"
  ],
  "authors": [
    {
      "name": "Radhika Garg",
      "institution": "School of Information Studies, Syracuse University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260587",
      "orcid": "0000-0002-2073-0567"
    },
    {
      "name": "Hua Cui",
      "institution": "School of Information Studies, Syracuse University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659897684",
      "orcid": "missing"
    },
    {
      "name": "Spencer Seligson",
      "institution": "School of Information Studies, Syracuse University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660232849",
      "orcid": "missing"
    },
    {
      "name": "Bo Zhang",
      "institution": "School of Information Studies, Syracuse University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659902181",
      "orcid": "missing"
    },
    {
      "name": "Martin Porcheron",
      "institution": "Computer Science, Swansea University, United Kingdom",
      "img": "/do/10.1145/contrib-87958771157/rel-imgonly/martinporcheron2021-square.png",
      "acmid": "87958771157",
      "orcid": "0000-0003-3814-7174"
    },
    {
      "name": "Leigh Clark",
      "institution": "Computer Science, Swansea University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658644284",
      "orcid": "0000-0002-9237-1057"
    },
    {
      "name": "Benjamin R. Cowan",
      "institution": "School of Information & Communication Studies, University College Dublin, Ireland",
      "img": "/do/10.1145/contrib-81453633311/rel-imgonly/photo6.jpg",
      "acmid": "81453633311",
      "orcid": "0000-0002-8595-8132"
    },
    {
      "name": "Erin Beneteau",
      "institution": "Information School, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365459",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ali Abdolrahmani, Maya Howes Gupta, Mei-Lian Vader, Ravi Kuber, and Stacy Branham. 2021. Towards More Transactional Voice Assistants: Investigating the Potential for a Multimodal Voice-Activated Indoor Navigation Assistant for Blind and Sighted Travelers. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 495, 16 pages. https://doi.org/10.1145/3411764.3445638",
      "doi": "10.1145/3411764.3445638"
    },
    {
      "text": "Ali Abdolrahmani, Kevin M. Storer, Antony Rishin Mukkath Roy, Ravi Kuber, and Stacy M. Branham. 2020. Blind Leading the Sighted: Drawing Design Insights from Blind Users towards More Productivity-Oriented Voice Interfaces. ACM Trans. Access. Comput. 12, 4, Article 18 (Jan. 2020), 35 pages. https://doi.org/10.1145/3368426",
      "doi": "10.1145/3368426"
    },
    {
      "text": "Deanne M Adams, Richard E Mayer, Andrew MacNamara, Alan Koenig, and Richard Wainess. 2012. Narrative games for learning: Testing the discovery and narrative hypotheses.Journal of educational psychology 104, 1 (2012), 235. https://doi.org/10.1037/a0025595",
      "doi": ""
    },
    {
      "text": "Sara Aeschlimann, Marco Bleiker, Michael Wechner, and Anja Gampe. 2020. Communicative and social consequences of interactions with voice assistants. Computers in Human Behavior 112 (2020), 106466. https://doi.org/10.1016/j.chb.2020.106466",
      "doi": ""
    },
    {
      "text": "Yoko Akama and Joyce Yee. 2016. Seeking stronger plurality: Intimacy and integrity in designing for social innovation. In Cumulus Hong Kong 2016 (Hong Kong). Cumulus Association, Aalto, Finland, 12 pages.",
      "doi": ""
    },
    {
      "text": "Mehdi Alaimi, Edith Law, Kevin Daniel Pantasdo, Pierre-Yves Oudeyer, and Hélène Sauzeon. 2020. Pedagogical Agents for Fostering Question-Asking Skills in Children. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376776",
      "doi": "10.1145/3313831.3376776"
    },
    {
      "text": "Mohammad Rafayet Ali, Seyedeh Zahra Razavi, Raina Langevin, Abdullah Al Mamun, Benjamin Kane, Reza Rawassizadeh, Lenhart K. Schubert, and Ehsan Hoque. 2020. A Virtual Conversational Agent for Teens with Autism Spectrum Disorder: Experimental Results and Design Lessons. In Proceedings of the 20th ACM International Conference on Intelligent Virtual Agents (Virtual Event, Scotland, UK) (IVA ’20). Association for Computing Machinery, New York, NY, USA, Article 2, 8 pages. https://doi.org/10.1145/3383652.3423900",
      "doi": "10.1145/3383652.3423900"
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi-org/10.1145/3290605.3300233",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Sean Andrist, Iolanda Leite, and Jill Lehman. 2013. Fun and Fair: Influencing Turn-Taking in a Multi-Party Game with a Virtual Agent. In Proceedings of the 12th International Conference on Interaction Design and Children (New York, New York, USA) (IDC ’13). Association for Computing Machinery, New York, NY, USA, 352–355. https://doi.org/10.1145/2485760.2485800",
      "doi": "10.1145/2485760.2485800"
    },
    {
      "text": "Petter Bae Bae Brandtzæg, Marita Skjuve, Kim Kristoffer Kristoffer Dysthe, and Asbjørn Følstad. 2021. When the Social Becomes Non-Human: Young People’s Perception of Social Support in Chatbots. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 257, 13 pages. https://doi.org/10.1145/3411764.3445318",
      "doi": "10.1145/3411764.3445318"
    },
    {
      "text": "Anshul Bawa, Pranav Khadpe, Pratik Joshi, Kalika Bali, and Monojit Choudhury. 2020. Do Multilingual Users Prefer Chat-Bots That Code-Mix? Let’s Nudge and Find Out!Proc. ACM Hum.-Comput. Interact. 4, CSCW1, Article 041 (May 2020), 23 pages. https://doi.org/10.1145/3392846",
      "doi": "10.1145/3392846"
    },
    {
      "text": "Helen Benedict. 1979. Early lexical development: comprehension and production. Journal of Child Language 6, 2 (1979), 183–200. https://doi.org/10.1017/S0305000900002245",
      "doi": ""
    },
    {
      "text": "Erin Beneteau, Ashley Boone, Yuxing Wu, Julie A. Kientz, Jason Yip, and Alexis Hiniker. 2020. Parenting with Alexa: Exploring the Introduction of Smart Speakers on Family Dynamics. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376344",
      "doi": "10.1145/3313831.3376344"
    },
    {
      "text": "Erin Beneteau, Yini Guan, Olivia K. Richards, Mingrui Ray Zhang, Julie A. Kientz, Jason Yip, and Alexis Hiniker. 2020. Assumptions Checked: How Families Learn About and Use the Echo Dot. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 1, Article 3 (March 2020), 23 pages. https://doi.org/10.1145/3380993",
      "doi": "10.1145/3380993"
    },
    {
      "text": "Erin Beneteau, Olivia K. Richards, Mingrui Zhang, Julie A. Kientz, Jason Yip, and Alexis Hiniker. 2019. Communication Breakdowns Between Families and Alexa. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300473",
      "doi": "10.1145/3290605.3300473"
    },
    {
      "text": "Rolf Black, Annalu Waller, Ross Turner, and Ehud Reiter. 2012. Supporting Personal Narrative for Children with Complex Communication Needs. ACM Trans. Comput.-Hum. Interact. 19, 2, Article 15 (July 2012), 35 pages. https://doi.org/10.1145/2240156.2240163",
      "doi": "10.1145/2240156.2240163"
    },
    {
      "text": "Elena Bodrova and Deborah J Leong. 2006. Tools of the mind. Pearson Australia Pty Limited, Melbourne, Vic, Australia.",
      "doi": ""
    },
    {
      "text": "Peter Börjesson, Wolmet Barendregt, Eva Eriksson, and Olof Torgersson. 2015. Designing Technology for and with Developmentally Diverse Children: A Systematic Literature Review. In Proceedings of the 14th International Conference on Interaction Design and Children (Boston, Massachusetts) (IDC ’15). Association for Computing Machinery, New York, NY, USA, 79–88. https://doi.org/10.1145/2771839.2771848",
      "doi": "10.1145/2771839.2771848"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Barbara E Bullock and Almeida Jacqueline Toribio. 2009. Themes in the study of code-switching.Cambridge University Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Harry Bunt. 2009. The DIT++ taxonomy for functional dialogue markup. In Proceedings of 8th International Conference on Autonomous Agents and Multiagent Systems (Budapest, Hungary) (AAMAS 2009). International Foundation for Autonomous Agents and Multiagent Systems, Richland, SC, USA, 13–24.",
      "doi": ""
    },
    {
      "text": "Canadian Institutes of Health Research. 2006. Randomized controlled trials registration/application checklist (12/2006). Technical Report. Government of Canada. http://www.cihr-irsc.gc.ca/e/documents/rct_reg_e.pdf",
      "doi": ""
    },
    {
      "text": "Fabio Catania, Micol Spitale, Giulia Cosentino, and Franca Garzotto. 2020. Conversational Agents to Promote Children’s Verbal Communication Skills. In International Workshop on Chatbot Research and Design. Springer, Cham, Switzerland, 158–172. https://doi.org/10.1007/978-3-030-68288-0_11",
      "doi": ""
    },
    {
      "text": "Theodora Chaspari, Chi-Chun Lee, and Shrikanth Narayanan. 2012. Interplay between verbal response latency and physiology of children with autism during ECA interactions. In Thirteenth Annual Conference of the International Speech Communication Association (Portland, OR, USA) (INTERSPEECH 2012). International Speech Communication Association, Grenoble, France, 1319–1322.",
      "doi": ""
    },
    {
      "text": "Ying-Yu Chen, Ziyue Li, Daniela Rosner, and Alexis Hiniker. 2019. Understanding Parents’ Perspectives on Mealtime Technology. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 1, Article 5 (March 2019), 19 pages. https://doi.org/10.1145/3314392",
      "doi": "10.1145/3314392"
    },
    {
      "text": "Leigh Clark, Benjamin R. Cowan, Abi Roper, Stephen Lindsay, and Owen Sheers. 2020. Speech Diversity and Speech Interfaces: Considering an Inclusive Future through Stammering. In Proceedings of the 2nd Conference on Conversational User Interfaces (Bilbao, Spain) (CUI ’20). Association for Computing Machinery, New York, NY, USA, Article 24, 3 pages. https://doi.org/10.1145/3405755.3406139",
      "doi": "10.1145/3405755.3406139"
    },
    {
      "text": "Leigh Clark, Philip Doyle, Diego Garaialde, Emer Gilmartin, Stephan Schlögl, Jens Edlund, Matthew Aylett, João Cabral, Cosmin Munteanu, Justin Edwards, 2019. The state of speech in HCI: Trends, themes and challenges. Interacting with Computers 31, 4 (2019), 349–371. https://doi.org/10.1093/iwc/iwz016",
      "doi": ""
    },
    {
      "text": "Leigh Clark, Abdulmalik Ofemile, Svenja Adolphs, and Tom Rodden. 2016. A Multimodal Approach to Assessing User Experiences with Agent Helpers. ACM Trans. Interact. Intell. Syst. 6, 4, Article 29 (Nov. 2016), 31 pages. https://doi.org/10.1145/2983926",
      "doi": "10.1145/2983926"
    },
    {
      "text": "Leigh Clark, Abdulmalik Ofemile, and Benjamin R Cowan. 2021. Exploring Verbal Uncanny Valley Effects with Vague Language in Computer Speech. In Voice Attractiveness. Springer, Singapore, 317–330. https://doi.org/10.1007/978-981-15-6627-1_17",
      "doi": ""
    },
    {
      "text": "Lynn Schofield Clark. 2011. Parental mediation theory for the digital age. Communication theory 21, 4 (2011), 323–343. https://doi-org/10.1111/j.1468-2885.2011.01391.x",
      "doi": ""
    },
    {
      "text": "Eric Corbett and Astrid Weber. 2016. What Can I Say? Addressing User Experience Challenges of a Mobile Voice User Interface for Accessibility. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 72–82. https://doi.org/10.1145/2935334.2935386",
      "doi": "10.1145/2935334.2935386"
    },
    {
      "text": "Benjamin R Cowan, Holly P Branigan, Mateo Obregón, Enas Bugis, and Russell Beale. 2015. Voice anthropomorphism, interlocutor modelling and alignment effects on syntactic choices in human- computer dialogue. International Journal of Human-Computer Studies 83 (2015), 27–42. https://doi.org/10.1016/j.ijhcs.2015.05.008",
      "doi": "10.1016/j.ijhcs.2015.05.008"
    },
    {
      "text": "Nicola Dell and Neha Kumar. 2016. The Ins and Outs of HCI for Development. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 2220–2232. https://doi.org/10.1145/2858036.2858081",
      "doi": "10.1145/2858036.2858081"
    },
    {
      "text": "Eric Deng, Bilge Mutlu, and Maja J Mataric. 2019. Embodiment in Socially Interactive Robots. Foundations and Trends® in Robotics 7, 4 (2019), 251–356. https://doi.org/10.1561/2300000056",
      "doi": ""
    },
    {
      "text": "Rita Kaur Dhamoon. 2011. Considerations on mainstreaming intersectionality. Political Research Quarterly 64, 1 (2011), 230–243.",
      "doi": ""
    },
    {
      "text": "Joao Dias and Ana Paiva. 2005. Feeling and reasoning: A computational model for emotional characters. In Portuguese conference on artificial intelligence. Springer, Berlin, Germany, 127–140. https://doi.org/10.1007/11595014_13",
      "doi": "10.1007/11595014_13"
    },
    {
      "text": "Tawanna R. Dillahunt, Xinyi Wang, Earnest Wheeler, Hao Fei Cheng, Brent Hecht, and Haiyi Zhu. 2017. The Sharing Economy in Computing: A Systematic Literature Review. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 38 (Dec. 2017), 26 pages. https://doi.org/10.1145/3134673",
      "doi": "10.1145/3134673"
    },
    {
      "text": "Philip R Doyle, Leigh Clark, and Benjamin R. Cowan. 2021. What Do We See in Them? Identifying Dimensions of Partner Models for Speech Interfaces Using a Psycholexical Approach. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 244, 14 pages. https://doi.org/10.1145/3411764.3445206",
      "doi": "10.1145/3411764.3445206"
    },
    {
      "text": "Philip R. Doyle, Justin Edwards, Odile Dumbleton, Leigh Clark, and Benjamin R. Cowan. 2019. Mapping Perceptions of Humanness in Intelligent Personal Assistant Interaction. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei, Taiwan) (MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, Article 5, 12 pages. https://doi.org/10.1145/3338286.3340116",
      "doi": "10.1145/3338286.3340116"
    },
    {
      "text": "Stefania Druga, Randi Williams, Cynthia Breazeal, and Mitchel Resnick. 2017. ”Hey Google is It OK If I Eat You?”: Initial Explorations in Child-Agent Interaction. In Proceedings of the 2017 Conference on Interaction Design and Children (Stanford, California, USA) (IDC ’17). Association for Computing Machinery, New York, NY, USA, 595–600. https://doi.org/10.1145/3078072.3084330",
      "doi": "10.1145/3078072.3084330"
    },
    {
      "text": "Daniel A. Epstein, Clara Caldeira, Mayara Costa Figueiredo, Xi Lu, Lucas M. Silva, Lucretia Williams, Jong Ho Lee, Qingyang Li, Simran Ahuja, Qiuer Chen, Payam Dowlatyari, Craig Hilby, Sazeda Sultana, Elizabeth V. Eikey, and Yunan Chen. 2020. Mapping and Taking Stock of the Personal Informatics Literature. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 4, Article 126 (Dec. 2020), 38 pages. https://doi.org/10.1145/3432231",
      "doi": "10.1145/3432231"
    },
    {
      "text": "Julia Fink, Séverin Lemaignan, Pierre Dillenbourg, Philippe Rétornaz, Florian Vaussard, Alain Berthoud, Francesco Mondada, Florian Wille, and Karmen Franinović. 2014. Which Robot Behavior Can Motivate Children to Tidy up Their Toys? Design and Evaluation of ”Ranger”. In Proceedings of the 2014 ACM/IEEE International Conference on Human-Robot Interaction (Bielefeld, Germany) (HRI ’14). Association for Computing Machinery, New York, NY, USA, 439–446. https://doi.org/10.1145/2559636.2559659",
      "doi": "10.1145/2559636.2559659"
    },
    {
      "text": "Joel E Fischer, Stuart Reeves, Martin Porcheron, and Rein Ove Sikveland. 2019. Progressivity for Voice Interface Design. In Proceedings of the 1st International Conference on Conversational User Interfaces (Dublin, Ireland) (CUI ’19). ACM, New York, NY, USA, Article 26, 8 pages. https://doi.org/10.1145/3342775.3342788",
      "doi": "10.1145/3342775.3342788"
    },
    {
      "text": "Daniel Fitton, Janet C Read, Gavin Sim, and Brendan Cassidy. 2018. Co-Designing Voice User Interfaces with Teenagers in the Context of Smart Homes. In Proceedings of the 17th ACM Conference on Interaction Design and Children (Trondheim, Norway) (IDC ’18). Association for Computing Machinery, New York, NY, USA, 55–66. https://doi.org/10.1145/3202185.3202744",
      "doi": "10.1145/3202185.3202744"
    },
    {
      "text": "Centers for Disease Control and Prevention. 2020. Child Development. Retrieved July 7, 2021 from https://www.cdc.gov/ncbddd/childdevelopment/positiveparenting/index.html",
      "doi": ""
    },
    {
      "text": "Jon Froehlich, Leah Findlater, and James Landay. 2010. The Design of Eco-Feedback Technology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1999–2008. https://doi.org/10.1145/1753326.1753629",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "James J Gallagher and Mary Jane Aschner. 1963. A preliminary report on analyses of classroom interaction. Merrill-Palmer Quarterly of Behavior and Development 9, 3(1963), 183–194.",
      "doi": ""
    },
    {
      "text": "Adriana Galván. 2017. The neuroscience of adolescence. Cambridge University Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Ge Gao, Sun Young Hwang, Gabriel Culbertson, Susan R. Fussell, and Malte F. Jung. 2017. Beyond Information Content: The Effects of Culture on Affective Grounding in Instant Messaging Conversations. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 48 (Dec. 2017), 18 pages. https://doi.org/10.1145/3134683",
      "doi": "10.1145/3134683"
    },
    {
      "text": "Radhika Garg and Subhasree Sengupta. 2019. ”When You Can Do It, Why Can’t I?”: Racial and Socioeconomic Differences in Family Technology Use and Non-Use. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 63 (Nov. 2019), 22 pages. https://doi.org/10.1145/3359165",
      "doi": "10.1145/3359165"
    },
    {
      "text": "Radhika Garg and Subhasree Sengupta. 2020. Conversational Technologies for In-Home Learning: Using Co-Design to Understand Children’s and Parents’ Perspectives. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376631",
      "doi": "10.1145/3313831.3376631"
    },
    {
      "text": "Radhika Garg and Subhasree Sengupta. 2020. He Is Just Like Me: A Study of the Long-Term Use of Smart Speakers by Parents and Children. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 1, Article 11 (March 2020), 24 pages. https://doi.org/10.1145/3381002",
      "doi": "10.1145/3381002"
    },
    {
      "text": "David Antonio Gómez Jáuregui, Léonor Philip, Céline Clavel, Stéphane Padovani, Mahin Bailly, and Jean-Claude Martin. 2013. Video Analysis of Approach-Avoidance Behaviors of Teenagers Speaking with Virtual Agents. In Proceedings of the 15th ACM on International Conference on Multimodal Interaction (Sydney, Australia) (ICMI ’13). Association for Computing Machinery, New York, NY, USA, 189–196. https://doi.org/10.1145/2522848.2522891",
      "doi": "10.1145/2522848.2522891"
    },
    {
      "text": "Michal Gordon and Cynthia Breazeal. 2015. Designing a Virtual Assistant for In-Car Child Entertainment. In Proceedings of the 14th International Conference on Interaction Design and Children (Boston, Massachusetts) (IDC ’15). Association for Computing Machinery, New York, NY, USA, 359–362. https://doi.org/10.1145/2771839.2771916",
      "doi": "10.1145/2771839.2771916"
    },
    {
      "text": "Betty Hart and Todd R Risley. 1995. Meaningful differences in the everyday experience of young American children.Paul H Brookes Publishing, Baltimore, MD, USA.",
      "doi": ""
    },
    {
      "text": "Geert Hofstede. 1983. National cultures in four dimensions: A research-based theory of cultural differences among nations. International Studies of Management & Organization 13, 1-2(1983), 46–74.",
      "doi": ""
    },
    {
      "text": "Geert Hofstede. 2011. Dimensionalizing cultures: The Hofstede model in context. Online readings in psychology and culture 2, 1 (2011), 2307–0919.",
      "doi": ""
    },
    {
      "text": "Kenneth Holstein, Jennifer Wortman Vaughan, Hal Daumé, Miro Dudik, and Hanna Wallach. 2019. Improving Fairness in Machine Learning Systems: What Do Industry Practitioners Need?. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3290605.3300830",
      "doi": "10.1145/3290605.3300830"
    },
    {
      "text": "Inseok Hwang, Youngki Lee, Chungkuk Yoo, Chulhong Min, Dongsun Yim, and John Kim. 2019. Towards Interpersonal Assistants: Next-Generation Conversational Agents. IEEE Pervasive Computing 18, 2 (2019), 21–31. https://doi.org/10.1109/MPRV.2019.2922907",
      "doi": "10.1109/MPRV.2019.2922907"
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial Computing: A Lens on Design and Development. Association for Computing Machinery, New York, NY, USA, 1311–1320. https://doi-org/10.1145/1753326.1753522",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Alexis D. Jacq, Séverin Lemaignan, Fernando Garcia, Pierre Dillenbourg, and Ana Paiva. 2016. Building Successful Long Child-Robot Interactions in a Learning Context. In The Eleventh ACM/IEEE International Conference on Human Robot Interaction (Christchurch, New Zealand) (HRI ’16). IEEE Press, New York, NY, USA, 239–246.",
      "doi": "10.5555/2906831.2906874"
    },
    {
      "text": "Kristiina Jokinen and Michael McTear. 2009. Spoken Dialogue Systems. Synthesis Lectures on Human Language Technologies 2, 1(2009), 1–151.",
      "doi": ""
    },
    {
      "text": "Peter H Kahn, Batya Friedman, Deanne R Perez-Granados, and Nathan G Freier. 2006. Robotic pets in the lives of preschool children. Interaction Studies 7, 3 (2006), 405–436.",
      "doi": ""
    },
    {
      "text": "Peter H. Kahn Jr, Heather E. Gary, and Solace Shen. 2013. Children’s Social Relationships With Current and Near-Future Robots. Child Development Perspectives 7, 1 (2013), 32–37. https://doi.org/10.1111/cdep.12011",
      "doi": ""
    },
    {
      "text": "Naveena Karusala, Apoorva Bhalla, and Neha Kumar. 2019. Privacy, Patriarchy, and Participation on Social Media. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 511–526. https://doi.org/10.1145/3322276.3322355",
      "doi": "10.1145/3322276.3322355"
    },
    {
      "text": "Saba Kawas, Ye Yuan, Akeiylah DeWitt, Qiao Jin, Susanne Kirchner, Abigail Bilger, Ethan Grantham, Julie A Kientz, Andrea Tartaro, and Svetlana Yarosh. 2020. Another Decade of IDC Research: Examining and Reflecting on Values and Ethics. In Proceedings of the Interaction Design and Children Conference (London, UK) (IDC ’20). Association for Computing Machinery, New York, NY, USA, 205–215. https://doi.org/10.1145/3392063.3394436",
      "doi": "10.1145/3392063.3394436"
    },
    {
      "text": "Saba Kawas, Ye Yuan, Akeiylah DeWitt, Qiao Jin, Susanne Kirchner, Abigail Bilger, Ethan Grantham, Julie A Kientz, Andrea Tartaro, and Svetlana Yarosh. 2020. Another Decade of IDC Research: Examining and Reflecting on Values and Ethics. In Proceedings of the Interaction Design and Children Conference (London, UK) (IDC ’20). Association for Computing Machinery, New York, NY, USA, 205–215. https://doi.org/10.1145/3392063.3394436",
      "doi": "10.1145/3392063.3394436"
    },
    {
      "text": "Minkyung Kim, Soonhyung Yi, and Donghun Lee. 2019. Between living and nonliving: Young children’s animacy judgments and reasoning about humanoid robots. PloS one 14, 6 (2019), e0216869.",
      "doi": ""
    },
    {
      "text": "Walter Kintsch. 1988. The role of knowledge in discourse comprehension: A construction-integration model.Psychological review 95, 2 (1988), 163.",
      "doi": ""
    },
    {
      "text": "Raina Langevin, Ross J Lordon, Thi Avrahami, Benjamin R. Cowan, Tad Hirsch, and Gary Hsieh. 2021. Heuristic Evaluation of Conversational Agents. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 632, 15 pages. https://doi.org/10.1145/3411764.3445312",
      "doi": "10.1145/3411764.3445312"
    },
    {
      "text": "Richard S Lazarus. 1991. Emotion and Adaptation. Oxford University Press, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Gaël Lejeune, François Rioult, and Bruno Crémilleux. 2016. Highlighting Psychological Features for Predicting Child Interjections During Story Telling. In Interspeech 2016 (San Francisco, CA, USA). International Speech Communication Association, Grenoble, France, 2056–2059. https://doi.org/10.21437/Interspeech.2016-527",
      "doi": ""
    },
    {
      "text": "Oliver Lemon. 2012. Conversational interfaces. In Data-Driven Methods for Adaptive Spoken Dialogue Systems. Springer, New York, NY, USA, 1–4. https://doi.org/10.1007/978-1-4614-4803-7_1",
      "doi": ""
    },
    {
      "text": "James C. Lester, Sharolyn A. Converse, Susan E. Kahler, S. Todd Barlow, Brian A. Stone, and Ravinder S. Bhogal. 1997. The Persona Effect: Affective Impact of Animated Pedagogical Agents. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’97). Association for Computing Machinery, New York, NY, USA, 359–366. https://doi.org/10.1145/258549.258797",
      "doi": "10.1145/258549.258797"
    },
    {
      "text": "Alessandro Liberati, Douglas G Altman, Jennifer Tetzlaff, Cynthia Mulrow, Peter C Gøtzsche, John PA Ioannidis, Mike Clarke, Philip J Devereaux, Jos Kleijnen, and David Moher. 2009. The PRISMA statement for reporting systematic reviews and meta-analyses of studies that evaluate health care interventions: explanation and elaboration. Journal of clinical epidemiology 62, 10 (2009), e1–e34. https://doi.org/10.1016/j.jclinepi.2009.06.006",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner, Ken Anderson, and Paul Dourish. 2012. Cultural Appropriation: Information Technologies as Sites of Transnational Imagination. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (Seattle, Washington, USA) (CSCW ’12). Association for Computing Machinery, New York, NY, USA, 77–86. https://doi.org/10.1145/2145204.2145220",
      "doi": "10.1145/2145204.2145220"
    },
    {
      "text": "Gustavo Lopez and Luis A. Guerrero. 2017. Awareness Supporting Technologies Used in Collaborative Systems: A Systematic Literature Review. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 808–820. https://doi.org/10.1145/2998181.2998281",
      "doi": "10.1145/2998181.2998281"
    },
    {
      "text": "Silvia Lovato and Anne Marie Piper. 2015. ”Siri, is This You?”: Understanding Young Children’s Interactions with Voice Input Systems. In Proceedings of the 14th International Conference on Interaction Design and Children (Boston, Massachusetts) (IDC ’15). Association for Computing Machinery, New York, NY, USA, 335–338. https://doi.org/10.1145/2771839.2771910",
      "doi": "10.1145/2771839.2771910"
    },
    {
      "text": "Silvia B. Lovato, Anne Marie Piper, and Ellen A. Wartella. 2019. Hey Google, Do Unicorns Exist? Conversational Agents as a Path to Answers to Children’s Questions. In Proceedings of the 18th ACM International Conference on Interaction Design and Children (Boise, ID, USA) (IDC ’19). Association for Computing Machinery, New York, NY, USA, 301–313. https://doi.org/10.1145/3311927.3323150",
      "doi": "10.1145/3311927.3323150"
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. ”Like Having a Really Bad PA”: The Gulf between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 5286–5297. https://doi.org/10.1145/2858036.2858288",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Michal Luria, Rebecca Zheng, Bennett Huffman, Shuangni Huang, John Zimmerman, and Jodi Forlizzi. 2020. Social Boundaries for Personal Agents in the Interpersonal Space of the Home. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376311",
      "doi": "10.1145/3313831.3376311"
    },
    {
      "text": "EM Mahone and HE Schneider. 2012. Assessment of attention in preschoolers. Neuropsychology review 22, 4 (2012), 361–383.",
      "doi": ""
    },
    {
      "text": "Richard E Mayer, Kristina Sobko, and Patricia D Mautone. 2003. Social cues in multimedia learning: Role of speaker’s voice.Journal of educational Psychology 95, 2 (2003), 419.",
      "doi": ""
    },
    {
      "text": "Erica F McClure. 1977. Aspects of code-switching in the discourse of bilingual Mexican-American children. Technical Report. University of Illinois at Urbana-Champaign, Champaign, IL, USA.",
      "doi": ""
    },
    {
      "text": "Emily McReynolds, Sarah Hubbard, Timothy Lau, Aditya Saraf, Maya Cakmak, and Franziska Roesner. 2017. Toys That Listen: A Study of Parents, Children, and Internet-Connected Toys. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 5197–5207. https://doi.org/10.1145/3025453.3025735",
      "doi": "10.1145/3025453.3025735"
    },
    {
      "text": "Gail F Melson, Peter H Kahn Jr, Alan Beck, Batya Friedman, Trace Roberts, Erik Garrett, and Brian T Gill. 2009. Children’s behavior toward and understanding of robotic and living dogs. Journal of Applied Developmental Psychology 30, 2 (2009), 92–102.",
      "doi": ""
    },
    {
      "text": "Ellen Moran, David Warden, Lindsey Macleod, Gillian Mayes, and John Gillies. 1997. Stranger-danger: What do children know?Child Abuse Review: Journal of the British Association for the Study and Prevention of Child Abuse and Neglect 6, 1 (1997), 11–23.",
      "doi": ""
    },
    {
      "text": "Masahiro Mori, Karl F MacDorman, and Norri Kageki. 2012. The uncanny valley [from the field]. IEEE Robotics & Automation Magazine 19, 2 (2012), 98–100. https://doi.org/10.1109/MRA.2012.2192811",
      "doi": ""
    },
    {
      "text": "Emily Mower, Chi-Chun Lee, James Gibson, Theodora Chaspari, Marian E Williams, and Shrikanth Narayanan. 2011. Analyzing the nature of ECA interactions in children with autism. In Twelfth Annual Conference of the International Speech Communication Association(INTERSPEECH 2011). International Speech Communication Association, Grenoble, France, 2989–2992.",
      "doi": ""
    },
    {
      "text": "Christine Murad, Cosmin Munteanu, Benjamin R. Cowan, and Leigh Clark. 2021. Finding a New Voice: Transitioning Designers from GUI to VUI Design. In CUI 2021 - 3rd Conference on Conversational User Interfaces (Bilbao (online), Spain) (CUI ’21). Association for Computing Machinery, New York, NY, USA, Article 22, 12 pages. https://doi.org/10.1145/3469595.3469617",
      "doi": "10.1145/3469595.3469617"
    },
    {
      "text": "Clifford Nass and Youngme Moon. 2000. Machines and mindlessness: Social responses to computers. Journal of Social Issues 56, 1 (2000), 81–103.",
      "doi": "10.1111/0022-4537.00153"
    },
    {
      "text": "Amy Ogan, Samantha Finkelstein, Elijah Mayfield, Claudia D’Adamo, Noboru Matsuda, and Justine Cassell. 2012. ”Oh Dear Stacy!”: Social Interaction, Elaboration, and Learning with Teachable Agents. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 39–48. https://doi.org/10.1145/2207676.2207684",
      "doi": "10.1145/2207676.2207684"
    },
    {
      "text": "Andrew Ortony, Gerald L Clore, and Allan Collins. 1990. The Cognitive Structure of Emotions. Cambridge University Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Luiza Superti Pantoja, Kyle Diederich, Liam Crawford, and Juan Pablo Hourcade. 2019. Voice Agents Supporting High-Quality Social Play. In Proceedings of the 18th ACM International Conference on Interaction Design and Children (Boise, ID, USA) (IDC ’19). Association for Computing Machinery, New York, NY, USA, 314–325. https://doi.org/10.1145/3311927.3323151",
      "doi": "10.1145/3311927.3323151"
    },
    {
      "text": "Sunjeong Park and Youn-kyung Lim. 2020. Investigating User Expectations on the Roles of Family-Shared AI Speakers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376450",
      "doi": "10.1145/3313831.3376450"
    },
    {
      "text": "Jean Piaget. 1976. Piaget’s Theory. In Piaget and His School: A Reader in Developmental Psychology, Bärbel Inhelder, Harold H. Chipman, and Charles Zwingmann (Eds.). Springer, Berlin, Germany, 11–23. https://doi.org/10.1007/978-3-642-46323-5_2",
      "doi": ""
    },
    {
      "text": "Luke Pittaway, Maxine Robertson, Kamal Munir, David Denyer, and Andy Neely. 2004. Networking and Innovation in the UK: On the Systematic Literature Review. Technical Report. Advanced Institute for Management Research.",
      "doi": ""
    },
    {
      "text": "Kaundefinedka Porayska-Pomsta, Alyssa M. Alcorn, Katerina Avramides, Sandra Beale, Sara Bernardini, Mary Ellen Foster, Christopher Frauenberger, Judith Good, Karen Guldberg, Wendy Keay-Bright, Lila Kossyvaki, Oliver Lemon, Marilena Mademtzi, Rachel Menzies, Helen Pain, Gnanathusharan Rajendran, Annalu Waller, Sam Wass, and Tim J. Smith. 2018. Blending Human and Artificial Intelligence to Support Autistic Children’s Social Communication Skills. ACM Trans. Comput.-Hum. Interact. 25, 6, Article 35 (Dec. 2018), 35 pages. https://doi.org/10.1145/3271484",
      "doi": "10.1145/3271484"
    },
    {
      "text": "Martin Porcheron. 2021. What’s in a Name and Does CUI Matter?. In CUI 2021 - 3rd Conference on Conversational User Interfaces (Bilbao (online), Spain) (CUI ’21). Association for Computing Machinery, New York, NY, USA, Article 24, 3 pages. https://doi.org/10.1145/3469595.3469619",
      "doi": "10.1145/3469595.3469619"
    },
    {
      "text": "Martin Porcheron, Joel E Fischer, and Stuart Reeves. 2021. Pulling Back the Curtain on the Wizards of Oz. Proc. ACM Hum.-Comput. Interact. 4, CSCW3, Article 243 (jan 2021), 22 pages. https://doi.org/10.1145/3432942",
      "doi": "10.1145/3432942"
    },
    {
      "text": "Martin Porcheron, Joel E Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice Interfaces in Everyday Life. In Proceedings of the 2018 ACM Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, Article 640, 12 pages. https://doi.org/10.1145/3173574.3174214",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "Martin Porcheron, Joel E Fischer, and Sarah Sharples. 2017. “Do Animals Have Accents?”: Talking with Agents in Multi-Party Conversation. In Proceedings of the 20th ACM Conference on Computer-Supported Cooperative Work & Social Computing(CSCW ’17). ACM, New York, NY, USA, 207–219. https://doi.org/10.1145/2998181.2998298",
      "doi": "10.1145/2998181.2998298"
    },
    {
      "text": "Barry M Prizant, Amy M Wetherby, Emily Rubin, and Amy C Laurent. 2003. The SCERTS model: A transactional, family-centered approach to enhancing communication and socioemotional abilities of children with autism spectrum disorder. Infants & Young Children 16, 4 (2003), 296–316.",
      "doi": ""
    },
    {
      "text": "Emilee Rader, Margaret Echelbarger, and Justine Cassell. 2011. Brick by Brick: Iterating Interventions to Bridge the Achievement Gap with Virtual Peers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2971–2974. https://doi.org/10.1145/1978942.1979382",
      "doi": "10.1145/1978942.1979382"
    },
    {
      "text": "Ashwin Ram. 1991. A theory of questions and question asking. Journal of the Learning Sciences 1, 3-4 (1991), 273–318. https://doi.org/10.1080/10508406.1991.9671973",
      "doi": ""
    },
    {
      "text": "Amon Rapp, Lorenzo Curti, and Arianna Boldi. 2021. The human side of human-chatbot interaction: A systematic literature review of ten years of research on text-based chatbots. International Journal of Human-Computer Studies 151 (2021), 102630. https://doi.org/10.1016/j.ijhcs.2021.102630",
      "doi": ""
    },
    {
      "text": "Amon Rapp, Lorenzo Curti, and Arianna Boldi. 2021. The human side of human-chatbot interaction: A systematic literature review of ten years of research on text-based chatbots. International Journal of Human-Computer Studies 151 (2021), 102630. https://doi.org/10.1016/j.ijhcs.2021.102630",
      "doi": ""
    },
    {
      "text": "Karen Renaud and Judy van Biljon. 2008. Predicting Technology Acceptance and Adoption by the Elderly: A Qualitative Study. In Proceedings of the 2008 Annual Research Conference of the South African Institute of Computer Scientists and Information Technologists on IT Research in Developing Countries: Riding the Wave of Technology (Wilderness, South Africa) (SAICSIT ’08). Association for Computing Machinery, New York, NY, USA, 210–219. https://doi.org/10.1145/1456659.1456684",
      "doi": ""
    },
    {
      "text": "Minjin Rheu, Ji Youn Shin, Wei Peng, and Jina Huh-Yoo. 2021. Systematic review: Trust-building factors and implications for conversational agent design. International Journal of Human–Computer Interaction 37, 1(2021), 81–96. https://doi.org/10.1080/10447318.2020.1807710",
      "doi": ""
    },
    {
      "text": "Simon Robinson, Jennifer Pearson, Shashank Ahire, Rini Ahirwar, Bhakti Bhikne, Nimish Maravi, and Matt Jones. 2018. Revisiting “Hole in the Wall” Computing: Private Smart Speakers and Public Slum Settings. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3174072",
      "doi": "10.1145/3173574.3174072"
    },
    {
      "text": "Everett M Rogers. 2010. Diffusion of innovations. Simon and Schuster, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Daniel Rough and Benjamin Cowan. 2020. Don’t Believe The Hype! White Lies of Conversational User Interface Creation Tools. In Proceedings of the 2nd Conference on Conversational User Interfaces (Bilbao, Spain) (CUI ’20). Association for Computing Machinery, New York, NY, USA, Article 17, 3 pages. https://doi.org/10.1145/3405755.3406140",
      "doi": "10.1145/3405755.3406140"
    },
    {
      "text": "Sherry Ruan, Jiayu He, Rui Ying, Jonathan Burkle, Dunia Hakim, Anna Wang, Yufeng Yin, Lily Zhou, Qianyao Xu, Abdallah AbuHashem, Griffin Dietz, Elizabeth L. Murnane, Emma Brunskill, and James A. Landay. 2020. Supporting Children’s Math Learning with Feedback-Augmented Narrative Technology. In Proceedings of the Interaction Design and Children Conference (London, UK) (IDC ’20). Association for Computing Machinery, New York, NY, USA, 567–580. https://doi.org/10.1145/3392063.3394400",
      "doi": "10.1145/3392063.3394400"
    },
    {
      "text": "Stuart Russell and Peter Norvig. 2002. Artificial Intelligence: A Modern Approach(2 ed.). Prentice Hall, Hoboken, NJ, USA.",
      "doi": ""
    },
    {
      "text": "Kyle-Althea Santos, Ethel Ong, and Ron Resurreccion. 2020. Therapist Vibe: Children’s Expressions of Their Emotions through Storytelling with a Chatbot. In Proceedings of the Interaction Design and Children Conference (London, UK) (IDC ’20). Association for Computing Machinery, New York, NY, USA, 483–494. https://doi.org/10.1145/3392063.3394405",
      "doi": "10.1145/3392063.3394405"
    },
    {
      "text": "Ari Schlesinger, W. Keith Edwards, and Rebecca E. Grinter. 2017. Intersectional HCI: Engaging Identity through Gender, Race, and Class. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 5412–5427. https://doi.org/10.1145/3025453.3025766",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I. Hong. 2018. ”Hey Alexa, What’s Up?”: A Mixed-Methods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 857–868. https://doi.org/10.1145/3196709.3196772",
      "doi": "10.1145/3196709.3196772"
    },
    {
      "text": "Subhasree Sengupta and Radhika Garg. 2019. Impact of Voice-based Interaction on Learning Practices and Behavior of Children.. In IUI Workshops. CEUR Workshops, Aachen, Germany, 3 pages.",
      "doi": ""
    },
    {
      "text": "Ovidiu Serban, Mukesh Barange, Sahba Zojaji, Alexandre Pauchet, Adeline Richard, and Emilie Chanoni. 2017. Interactive Narration with a Child: Impact of Prosody and Facial Expressions. In Proceedings of the 19th ACM International Conference on Multimodal Interaction (Glasgow, UK) (ICMI ’17). Association for Computing Machinery, New York, NY, USA, 23–31. https://doi.org/10.1145/3136755.3136797",
      "doi": "10.1145/3136755.3136797"
    },
    {
      "text": "Yedendra B. Shrinivasan, Mohit Jain, Deva P. Seetharam, Abhishek Choudhary, Elaine M. Huang, Tawanna Dillahunt, and Jennifer Mankoff. 2013. Deep Conservation in Urban India and Its Implications for the Design of Conservation Technologies. Association for Computing Machinery, New York, NY, USA, 1969–1978. https://doi.org/10.1145/2470654.2466261",
      "doi": ""
    },
    {
      "text": "Catherine Snow. 1983. Literacy and language: Relationships during the preschool years. Harvard educational review 53, 2 (1983), 165–189.",
      "doi": ""
    },
    {
      "text": "Micol Spitale, Silvia Silleresi, Giulia Cosentino, Francesca Panzeri, and Franca Garzotto. 2020. ”Whom Would You like to Talk with?”: Exploring Conversational Agents for Children’s Linguistic Assessment. In Proceedings of the Interaction Design and Children Conference (London, UK) (IDC ’20). Association for Computing Machinery, New York, NY, USA, 262–272. https://doi.org/10.1145/3392063.3394421",
      "doi": "10.1145/3392063.3394421"
    },
    {
      "text": "Statista.com. 2020. Smart Speaker Ownership Worldwide by Country. Retrieved June 7, 2021 from https://www.statista.com/statistics/1130208/smart-speaker-ownership-worldwide-by-country",
      "doi": ""
    },
    {
      "text": "Reed Stevens and Lori Takeuchi. 2011. The new coviewing: Designing for learning through joint media engagement. Technical Report. The Joan Ganz Cooney Center.",
      "doi": ""
    },
    {
      "text": "Kevin M. Storer, Tejinder K. Judge, and Stacy M. Branham. 2020. ”All in the Same Boat”: Tradeoffs of Voice Assistant Ownership for Mixed-Visual-Ability Families. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376225",
      "doi": "10.1145/3313831.3376225"
    },
    {
      "text": "Ann Swidler. 1986. Culture in action: Symbols and strategies. American sociological review 51, 2 (apr 1986), 273–286.",
      "doi": ""
    },
    {
      "text": "Anuj Tewari and John Canny. 2014. What Did Spot Hide? A Question-Answering Game for Preschool Children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1807–1816. https://doi.org/10.1145/2556288.2557205",
      "doi": "10.1145/2556288.2557205"
    },
    {
      "text": "Pablo Vicente Torres-Carrión, Carina Soledad González-González, Silvana Aciar, and Germania Rodríguez-Morales. 2018. Methodology for systematic literature review applied to engineering and education. In 2018 IEEE Global engineering education conference (EDUCON). IEEE, New York, NY, USA, 1364–1373. https://doi.org/10.1109/EDUCON.2018.8363388",
      "doi": ""
    },
    {
      "text": "Daniel C. Tozadore and Roseli A. F. Romero. 2020. Multimodal Fuzzy Assessment for Robot Behavioral Adaptation in Educational Children-Robot Interaction. In Companion Publication of the 2020 International Conference on Multimodal Interaction (Virtual Event, Netherlands) (ICMI ’20 Companion). Association for Computing Machinery, New York, NY, USA, 392–399. https://doi.org/10.1145/3395035.3425201",
      "doi": ""
    },
    {
      "text": "Esko Ukkonen. 2009. Maximal and minimal representations of gapped and non-gapped motifs of a string. Theoretical Computer Science 410, 43 (2009), 4341–4349.",
      "doi": "10.1016/j.tcs.2009.07.015"
    },
    {
      "text": "Patti M Valkenburg, Marina Krcmar, Allerd L Peeters, and Nies M Marseille. 1999. Developing a scale to assess three styles of television mediation:“Instructive mediation,”“restrictive mediation,” and “social coviewing”. Journal of broadcasting & electronic media 43, 1 (1999), 52–66.",
      "doi": ""
    },
    {
      "text": "Mike van Duuren and Michael Scaife. 1996. “Because a robot’s brain hasn’t got a brain, it just controls itself”—Children’s attributions of brain related behaviour to intelligent artefacts. European Journal of Psychology of Education 11, 4 (1996), 365–376.",
      "doi": ""
    },
    {
      "text": "Viswanath Venkatesh, Michael G Morris, Gordon B Davis, and Fred D Davis. 2003. User acceptance of information technology: Toward a unified view. MIS quarterly 27, 3 (sept 2003), 425–478. https://doi.org/10.2307/30036540",
      "doi": ""
    },
    {
      "text": "Michael Villano, Charles R. Crowell, Kristin Wier, Karen Tang, Brynn Thomas, Nicole Shea, Lauren M. Schmitt, and Joshua J. Diehl. 2011. DOMER: A Wizard of Oz Interface for Using Interactive Robots to Scaffold Social Skills for Children with Autism Spectrum Disorders. In Proceedings of the 6th International Conference on Human-Robot Interaction (Lausanne, Switzerland) (HRI ’11). Association for Computing Machinery, New York, NY, USA, 279–280. https://doi.org/10.1145/1957656.1957770",
      "doi": "10.1145/1957656.1957770"
    },
    {
      "text": "Voicebot.AI. 2020. U.S. Smart Speaker Growth Flat Lined in 2020. Retrieved June 7, 2021 from https://voicebot.ai/2021/04/14/u-s-smart-speaker-growth-flat-lined-in-2020/",
      "doi": ""
    },
    {
      "text": "Lev Semenovich Vygotsky. 1980. Mind in society: The development of higher psychological processes. Harvard University Press, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Wayne Ward, Ronald Cole, Daniel Bolaños, Cindy Buchenroth-Martin, Edward Svirsky, Sarel Van Vuuren, Timothy Weston, Jing Zheng, and Lee Becker. 2011. My Science Tutor: A Conversational Multimedia Virtual Tutor for Elementary School Science. ACM Trans. Speech Lang. Process. 7, 4, Article 18 (Aug. 2011), 29 pages. https://doi.org/10.1145/1998384.1998392",
      "doi": "10.1145/1998384.1998392"
    },
    {
      "text": "Zhuxiaona Wei and James A. Landay. 2018. Evaluating Speech-Based Smart Devices Using New Usability Heuristics. IEEE Pervasive Computing 17, 2 (2018), 84–96. https://doi.org/10.1109/MPRV.2018.022511249",
      "doi": "10.1109/MPRV.2018.022511249"
    },
    {
      "text": "Joseph Weizenbaum. 1983. ELIZA — a Computer Program for the Study of Natural Language Communication between Man and Machine. Commun. ACM 26, 1 (Jan. 1983), 23–28. https://doi.org/10.1145/357980.357991",
      "doi": "10.1145/357980.357991"
    },
    {
      "text": "Iain Werry, Kerstin Dautenhahn, Bernard Ogden, and William Harwin. 2001. Can Social Interaction Skills Be Taught by a Social Agent? The Role of a Robotic Mediator in Autism Therapy. In International Conference on Cognitive Technology(CT 2001). Springer, Berlin, Germany, 57–74. https://doi.org/10.1007/3-540-44617-6_6",
      "doi": ""
    },
    {
      "text": "Jacqueline M. Kory Westlund, Hae Won Park, Randi Williams, and Cynthia Breazeal. 2018. Measuring Young Children’s Long-Term Relationships with Social Robots. In Proceedings of the 17th ACM Conference on Interaction Design and Children (Trondheim, Norway) (IDC ’18). Association for Computing Machinery, New York, NY, USA, 207–218. https://doi.org/10.1145/3202185.3202732",
      "doi": "10.1145/3202185.3202732"
    },
    {
      "text": "James Wilson and Daniel Rosenberg. 1988. Rapid prototyping for user interface design. In Handbook of human-computer interaction. Elsevier, Amsterdam, Netherlands, Chapter 39, 859–875. https://doi.org/10.1016/B978-0-444-70536-5.50044-0",
      "doi": ""
    },
    {
      "text": "Terry Winograd, Fernando Flores, and Fernando F Flores. 1986. Understanding Computers and Cognition: A New Foundation for Design. Addison Wesley, Reading, MA, USA.",
      "doi": "10.5555/576359"
    },
    {
      "text": "Julia Woodward, Zari McFadden, Nicole Shiver, Amir Ben-hayon, Jason C. Yip, and Lisa Anthony. 2018. Using Co-Design to Examine How Children Conceptualize Intelligent Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3174149",
      "doi": "10.1145/3173574.3174149"
    },
    {
      "text": "Yunhan Wu, Daniel Rough, Anna Bleakley, Justin Edwards, Orla Cooney, Philip R. Doyle, Leigh Clark, and Benjamin R. Cowan. 2020. See What I’m Saying? Comparing Intelligent Personal Assistant Use for Native and Non-Native Language Speakers. In 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services (Oldenburg, Germany) (MobileHCI ’20). Association for Computing Machinery, New York, NY, USA, Article 34, 9 pages. https://doi.org/10.1145/3379503.3403563",
      "doi": "10.1145/3379503.3403563"
    },
    {
      "text": "Susan Wyche, Tawanna R. Dillahunt, Nightingale Simiyu, and Sharon Alaka. 2015. ”If God Gives Me the Chance i Will Design My Own Phone”: Exploring Mobile Phone Repair and Postcolonial Approaches to Design in Rural Kenya. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing(Osaka, Japan) (UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 463–473. https://doi.org/10.1145/2750858.2804249",
      "doi": "10.1145/2750858.2804249"
    },
    {
      "text": "Ying Xu and Mark Warschauer. 2020. A Content Analysis of Voice-Based Apps on the Market for Early Literacy Development. In Proceedings of the Interaction Design and Children Conference (London, UK) (IDC ’20). Association for Computing Machinery, New York, NY, USA, 361–371. https://doi.org/10.1145/3392063.3394418",
      "doi": "10.1145/3392063.3394418"
    },
    {
      "text": "Ying Xu and Mark Warschauer. 2020. Exploring Young Children’s Engagement in Joint Reading with a Conversational Agent. In Proceedings of the Interaction Design and Children Conference (London, UK) (IDC ’20). Association for Computing Machinery, New York, NY, USA, 216–228. https://doi.org/10.1145/3392063.3394417",
      "doi": "10.1145/3392063.3394417"
    },
    {
      "text": "Ying Xu and Mark Warschauer. 2020. What Are You Talking To?: Understanding Children’s Perceptions of Conversational Agents. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376416",
      "doi": "10.1145/3313831.3376416"
    },
    {
      "text": "Svetlana Yarosh, Stryker Thompson, Kathleen Watson, Alice Chase, Ashwin Senthilkumar, Ye Yuan, and A. J. Bernheim Brush. 2018. Children Asking Questions: Speech Interface Reformulations and Personification Preferences. In Proceedings of the 17th ACM Conference on Interaction Design and Children (Trondheim, Norway) (IDC ’18). Association for Computing Machinery, New York, NY, USA, 300–312. https://doi.org/10.1145/3202185.3202207",
      "doi": "10.1145/3202185.3202207"
    },
    {
      "text": "Serdar Yildirim, Shrikanth Narayanan, and Alexandros Potamianos. 2011. Detecting emotional state of a child in a conversational computer game. Computer Speech & Language 25, 1 (2011), 29–44. https://doi.org/10.1016/j.csl.2009.12.004 Affective Speech in Real-Life Interactions.",
      "doi": "10.1016/j.csl.2009.12.004"
    },
    {
      "text": "Jason C. Yip, Kiley Sobel, Xin Gao, Allison Marie Hishikawa, Alexis Lim, Laura Meng, Romaine Flor Ofiana, Justin Park, and Alexis Hiniker. 2019. Laughing is Scary, but Farting is Cute: A Conceptual Model of Children’s Perspectives of Creepy Technologies. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300303",
      "doi": ""
    },
    {
      "text": "Charles Young and Richard Horton. 2005. Putting clinical trials into context. The Lancet 366, 9480 (2005), 107–108. https://doi.org/10.1016/S0140-6736(05)67370-9",
      "doi": ""
    },
    {
      "text": "Ye Yuan, Stryker Thompson, Kathleen Watson, Alice Chase, Ashwin Senthilkumar, AJ Bernheim Brush, and Svetlana Yarosh. 2019. Speech interface reformulations and voice assistant personification preferences of children and parents. International Journal of Child-Computer Interaction 21 (2019), 77–88. https://doi.org/10.1016/j.ijcci.2019.04.005",
      "doi": "10.1016/j.ijcci.2019.04.005"
    },
    {
      "text": "Bieke Zaman, Marije Nouwen, Jeroen Vanattenhoven, Evelien De Ferrerre, and Jan Van Looy. 2016. A qualitative inquiry into the contextualized parental mediation practices of young children’s digital media use at home. Journal of Broadcasting & Electronic Media 60, 1 (2016), 1–22. https://doi-org/10.1080/08838151.2015.1127240",
      "doi": ""
    }
  ]
}