{
  "doi": "10.1145/3491102.3501927",
  "title": "ASTEROIDS: Exploring Swarms of Mini-Telepresence Robots for Physical Skill Demonstration",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "Online synchronous tutoring allows for immediate engagement between instructors and audiences over distance. However, tutoring physical skills remains challenging because current telepresence approaches may not allow for adequate spatial awareness, viewpoint control of the demonstration activities scattered across an entire work area, and the instructor’s sufficient awareness of the audience. We present Asteroids, a novel approach for tangible robotic telepresence, to enable workbench-scale physical embodiments of remote people and tangible interactions by the instructor. With Asteroids, the audience can actively control a swarm of mini-telepresence robots, change camera positions, and switch to other robots’ viewpoints. Demonstrators can perceive the audiences’ physical presence while using tangible manipulations to control the audience’s viewpoints and presentation flow. We conducted an exploratory evaluation for Asteroids with 12 remote participants in a model-making tutorial scenario with an architectural expert demonstrator. Results suggest our unique features benefitted participants’ engagement, sense of presence, and understanding.",
  "authors": [
    {
      "name": "Jiannan Li",
      "institution": "Department of Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260950",
      "orcid": "0000-0001-8409-4910"
    },
    {
      "name": "Maurício Sousa",
      "institution": "Department of Computer Science, University of Toronto, Canada",
      "img": "/do/10.1145/contrib-99658657870/rel-imgonly/mauricio.jpeg",
      "acmid": "99658657870",
      "orcid": "0000-0003-1438-2882"
    },
    {
      "name": "Chu Li",
      "institution": "University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238299",
      "orcid": "missing"
    },
    {
      "name": "Jessie Liu",
      "institution": "Department of Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239531",
      "orcid": "missing"
    },
    {
      "name": "Yan Chen",
      "institution": "Department of Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81545656256",
      "orcid": "missing"
    },
    {
      "name": "Ravin Balakrishnan",
      "institution": "Department of Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100503904",
      "orcid": "0000-0002-3379-7680"
    },
    {
      "name": "Tovi Grossman",
      "institution": "Department of Computer Science, University of Toronto, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    }
  ],
  "references": [
    {
      "text": "Parastoo Abtahi, David Y. Zhao, Jane L. E., and James A. Landay. 2017. Drone Near Me: Exploring Touch-Based Human-Drone Interaction. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3, Article 34 (Sept. 2017), 8 pages. https://doi.org/10.1145/3130899",
      "doi": "10.1145/3130899"
    },
    {
      "text": "Sigurdur Orn Adalgeirsson and Cynthia Breazeal. 2010. MeBot: A robotic platform for socially embodied telepresence. In 2010 5th ACM/IEEE International Conference on Human-Robot Interaction (HRI). 15–22. https://doi.org/10.1109/HRI.2010.5453272",
      "doi": ""
    },
    {
      "text": "Felix Brandt, Vincent Conitzer, and Ulle Endriss. 2012. Computational social choice. Multiagent systems (2012), 213–283.",
      "doi": ""
    },
    {
      "text": "William A. S. Buxton. 1992. Telepresence: Integrating Shared Task and Person Spaces. In Proceedings of the Conference on Graphics Interface ’92 (Vancouver, British Columbia, Canada). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, 123–129.",
      "doi": "10.5555/155294.155309"
    },
    {
      "text": "Jessica R. Cauchard, Jane L. E, Kevin Y. Zhai, and James A. Landay. 2015. Drone & Me: An Exploration into Natural Human-Drone Interaction. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Osaka, Japan) (UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 361–365. https://doi.org/10.1145/2750858.2805823",
      "doi": "10.1145/2750858.2805823"
    },
    {
      "text": "Elizabeth Cha, Samantha Chen, and Maja J Mataric. 2017. Designing telepresence robots for K-12 education. In 2017 26th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 683–688.",
      "doi": "10.1109/ROMAN.2017.8172377"
    },
    {
      "text": "Alexandra Gendreau Chakarov, Jeffrey Bush, Quentin L Biddy, Jennifer Jacobs, Colin Hennessy Elliott, and Tamara Sumner. 2021. Challenges and Unexpected Affordances of Physical Computing Going Remote. In Interaction Design and Children. Association for Computing Machinery, New York, NY, USA, 276–282. https://doi.org/10.1145/3459990.3460711",
      "doi": ""
    },
    {
      "text": "Linfeng Chen, Kazuki Takashima, Kazuyuki Fujita, and Yoshifumi Kitamura. 2021. PinpointFly: An Egocentric Position-Control Drone Interface Using Mobile AR. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 150, 13 pages. https://doi.org/10.1145/3411764.3445110",
      "doi": "10.1145/3411764.3445110"
    },
    {
      "text": "Yan Chen, Walter S Lasecki, and Tao Dong. 2021. Towards Supporting Programming Education at Scale via Live Streaming. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–19.",
      "doi": "10.1145/3434168"
    },
    {
      "text": "Marc Christie, Patrick Olivier, and Jean-Marie Normand. 2008. Camera Control in Computer Graphics. Computer Graphics Forum 27, 8 (2008), 2197–2218. https://doi.org/10.1111/j.1467-8659.2008.01181.x arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1467-8659.2008.01181.x",
      "doi": ""
    },
    {
      "text": "Silvia Coradeschi, Amy Loutfi, Annica Kristoffersson, Gabriella Cortellessa, and Kerstin Severinson Eklundh. 2011. Social robotic telepresence. In 2011 6th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 5–6.",
      "doi": "10.1145/1957656.1957660"
    },
    {
      "text": "Barrett Ens, Joel Lanir, Anthony Tang, Scott Bateman, Gun Lee, Thammathip Piumsomboon, and Mark Billinghurst. 2019. Revisiting collaboration through mixed reality: The evolution of groupware. International Journal of Human-Computer Studies 131 (2019), 81–98. https://doi.org/10.1016/j.ijhcs.2019.05.011 50 years of the International Journal of Human-Computer Studies. Reflections on the past, present and future of human-centred technologies.",
      "doi": "10.1016/j.ijhcs.2019.05.011"
    },
    {
      "text": "Naomi T Fitter, Nisha Raghunath, Elizabeth Cha, Christopher A Sanchez, Leila Takayama, and Maja J Matarić. 2020. Are we there yet? Comparing remote learning technologies in the university classroom. IEEE Robotics and Automation Letters 5, 2 (2020), 2706–2713.",
      "doi": ""
    },
    {
      "text": "Terrence Fong, Charles Thorpe, and Betty Glass. 2003. Pdadriver: A handheld system for remote driving. In IEEE international conference on advanced robotics.",
      "doi": ""
    },
    {
      "text": "C. Ailie Fraser, Joy O. Kim, Alison Thornsberry, Scott Klemmer, and Mira Dontcheva. 2019. Sharing the Studio: How Creative Livestreaming Can Inspire, Educate, and Engage. In Proceedings of the 2019 on Creativity and Cognition (San Diego, CA, USA) (C&C ’19). Association for Computing Machinery, New York, NY, USA, 144–155. https://doi.org/10.1145/3325480.3325485",
      "doi": "10.1145/3325480.3325485"
    },
    {
      "text": "Robert M Gagne and Walter Dick. 1983. Instructional psychology. Annual review of psychology 34, 1 (1983), 261–295.",
      "doi": ""
    },
    {
      "text": "Tara Gallien and Jody Oomen-Early. 2008. Personalized Versus Collective Instructor Feedback in the Online Courseroom: Does Type of Feedback Affect Student Satisfaction, Academic Performance and Perceived Connectedness With the Instructor?International Journal on E-Learning 7, 3 (July 2008), 463–476. https://www.learntechlib.org/p/23582",
      "doi": ""
    },
    {
      "text": "S. Garrido-Jurado, R. Muñoz-Salinas, F.J. Madrid-Cuevas, and M.J. Marín-Jiménez. 2014. Automatic generation and detection of highly reliable fiducial markers under occlusion. Pattern Recognition 47, 6 (2014), 2280–2292. https://doi.org/10.1016/j.patcog.2014.01.005",
      "doi": "10.1016/j.patcog.2014.01.005"
    },
    {
      "text": "Steffen Gauglitz, Benjamin Nuernberger, Matthew Turk, and Tobias Höllerer. 2014. In Touch with the Remote World: Remote Collaboration with Augmented Reality Drawings and Virtual Navigation. In Proceedings of the 20th ACM Symposium on Virtual Reality Software and Technology (Edinburgh, Scotland) (VRST ’14). Association for Computing Machinery, New York, NY, USA, 197–205. https://doi.org/10.1145/2671015.2671016",
      "doi": "10.1145/2671015.2671016"
    },
    {
      "text": "William W. Gaver, Abigail Sellen, Christian Heath, and Paul Luff. 1993. One is Not Enough: Multiple Views in a Media Space. In Proceedings of the INTERACT ’93 and CHI ’93 Conference on Human Factors in Computing Systems (Amsterdam, The Netherlands) (CHI ’93). Association for Computing Machinery, New York, NY, USA, 335–341. https://doi.org/10.1145/169059.169268",
      "doi": "10.1145/169059.169268"
    },
    {
      "text": "Cheng Guo, James Everett Young, and Ehud Sharlin. 2009. Touch and Toys: New Techniques for Interaction with a Remote Group of Robots. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 491–500. https://doi.org/10.1145/1518701.1518780",
      "doi": "10.1145/1518701.1518780"
    },
    {
      "text": "Pavel Gurevich, Joel Lanir, Benjamin Cohen, and Ran Stone. 2012. TeleAdvisor: A Versatile Augmented Reality Tool for Remote Assistance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 619–622. https://doi.org/10.1145/2207676.2207763",
      "doi": "10.1145/2207676.2207763"
    },
    {
      "text": "Carl Gutwin and Saul Greenberg. 2002. A descriptive framework of workspace awareness for real-time groupware. Computer Supported Cooperative Work (CSCW) 11, 3 (2002), 411–446.",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "Zorah Hilvert-Bruce, James T Neill, Max Sjöblom, and Juho Hamari. 2018. Social motivations of live-streaming viewer engagement on Twitch. Computers in Human Behavior 84 (2018), 58–67.",
      "doi": "10.1016/j.chb.2018.02.013"
    },
    {
      "text": "Guy Hoffman and Wendy Ju. 2014. Designing Robots with Movement in Mind. J. Hum.-Robot Interact. 3, 1 (Feb. 2014), 91–122. https://doi.org/10.5898/JHRI.3.1.Hoffman",
      "doi": "10.5898/JHRI.3.1.Hoffman"
    },
    {
      "text": "Kari Hortos, Donald Sefcik, Suzanne G Wilson, John T McDaniel, and Eric Zemper. 2013. Synchronous videoconferencing: impact on achievement of medical students. Teaching and learning in medicine 25, 3 (2013), 211–215.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii, Daniel Leithinger, Sean Follmer, Amit Zoran, Philipp Schoessler, and Jared Counts. 2015. TRANSFORM: Embodiment of” Radical Atoms” at Milano Design Week. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. 687–694.",
      "doi": "10.1145/2702613.2702969"
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible Bits: Towards Seamless Interfaces between People, Bits and Atoms. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’97). Association for Computing Machinery, New York, NY, USA, 234–241. https://doi.org/10.1145/258549.258715",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Seungwoo Je, Hyunseung Lim, Kongpyung Moon, Shan-Yuan Teng, Jas Brooks, Pedro Lopes, and Andrea Bianchi. 2021. Elevate: A Walkable Pin-Array for Large Shape-Changing Terrains. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 127, 11 pages. https://doi.org/10.1145/3411764.3445454",
      "doi": "10.1145/3411764.3445454"
    },
    {
      "text": "Brennan Jones, Anna Witcraft, Scott Bateman, Carman Neustaedter, and Anthony Tang. 2015. Mechanics of camera work in mobile video collaboration. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 957–966.",
      "doi": "10.1145/2702123.2702345"
    },
    {
      "text": "Mitchell Karchemsky, JD Zamfirescu-Pereira, Kuan-Ju Wu, François Guimbretière, and Bjoern Hartmann. 2019. Heimdall: A Remotely Controlled Inspection Workbench For Debugging Microcontroller Projects. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300728"
    },
    {
      "text": "Karen Kear, Frances Chetwynd, Judith Williams, and Helen Donelan. 2012. Web conferencing for synchronous online tutorials: Perspectives of tutors using a new medium. Computers & Education 58, 3 (2012), 953–963. https://doi.org/10.1016/j.compedu.2011.10.015",
      "doi": "10.1016/j.compedu.2011.10.015"
    },
    {
      "text": "Lawrence H. Kim, Daniel S. Drew, Veronika Domova, and Sean Follmer. 2020. User-Defined Swarm Robot Control. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376814",
      "doi": "10.1145/3313831.3376814"
    },
    {
      "text": "Lawrence H. Kim and Sean Follmer. 2019. SwarmHaptics: Haptic Display with Swarm Robots. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300918",
      "doi": ""
    },
    {
      "text": "Robert E Kraut, Susan R Fussell, and Jane Siegel. 2003. Visual information as a conversational resource in collaborative physical tasks. Human–computer interaction 18, 1-2 (2003), 13–49.",
      "doi": ""
    },
    {
      "text": "Walter S Lasecki, Kyle I Murray, Samuel White, Robert C Miller, and Jeffrey P Bigham. 2011. Real-time crowd control of existing interfaces. In Proceedings of the 24th annual ACM symposium on User interface software and technology. 23–32.",
      "doi": "10.1145/2047196.2047200"
    },
    {
      "text": "Mathieu Le Goc, Lawrence H. Kim, Ali Parsaei, Jean-Daniel Fekete, Pierre Dragicevic, and Sean Follmer. 2016. Zooids: Building Blocks for Swarm User Interfaces. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 97–109. https://doi.org/10.1145/2984511.2984547",
      "doi": "10.1145/2984511.2984547"
    },
    {
      "text": "Min Kyung Lee and Leila Takayama. 2011. ”Now, i Have a Body”: Uses and Social Norms for Mobile Remote Presence in the Workplace. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 33–42. https://doi.org/10.1145/1978942.1978950",
      "doi": "10.1145/1978942.1978950"
    },
    {
      "text": "Jiannan Li, Ravin Balakrishnan, and Tovi Grossman. 2020. StarHopper: A Touch Interface for Remote Object-Centric Drone Navigation. In Proceedings of Graphics Interface 2020 (University of Toronto) (GI 2020). Canadian Human-Computer Communications Society / Société canadienne du dialogue humain-machine, 317 – 326. https://doi.org/10.20380/GI2020.32",
      "doi": ""
    },
    {
      "text": "Jiannan Li, Maurício Sousa, Ravin Balakrishnan, and Tovi Grossman. 2021. Constellation: A Multi-User Interface for Remote Drone Tours. In Proceedings of the 9th International Conference on Human-Agent Interaction (Virtual Event, Japan) (HAI ’21). Association for Computing Machinery, New York, NY, USA, 277–282. https://doi.org/10.1145/3472307.3484685",
      "doi": "10.1145/3472307.3484685"
    },
    {
      "text": "Zhicong Lu, Michelle Annett, Mingming Fan, and Daniel Wigdor. 2019. ”I Feel It is My Responsibility to Stream”: Streaming and Engaging with Intangible Cultural Heritage through Livestreaming. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300459",
      "doi": "10.1145/3290605.3300459"
    },
    {
      "text": "Zhicong Lu, Haijun Xia, Seongkook Heo, and Daniel Wigdor. 2018. You watch, you give, and you engage: a study of live streaming practices in China. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3174040"
    },
    {
      "text": "Paul Luff, Christian Heath, Hideaki Kuzuoka, Jon Hindmarsh, Keiichi Yamazaki, and Shinya Oyama. 2003. Fractured ecologies: creating environments for collaboration. Human–Computer Interaction 18, 1-2 (2003), 51–84.",
      "doi": ""
    },
    {
      "text": "Michal Luria, Samantha Reig, Xiang Zhi Tan, Aaron Steinfeld, Jodi Forlizzi, and John Zimmerman. 2019. Re-Embodiment and Co-Embodiment: Exploration of Social Presence for Robots and Conversational Agents. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 633–644. https://doi.org/10.1145/3322276.3322340",
      "doi": "10.1145/3322276.3322340"
    },
    {
      "text": "Julia M Markel and Philip J Guo. 2020. Designing the Future of Experiential Learning Environments for a Post-COVID World: A Preliminary Case Study. (2020).",
      "doi": ""
    },
    {
      "text": "Francois Michaud, Patrick Boissy, Daniel Labonte, Helene Corriveau, Andrew Grant, Michel Lauria, Richard Cloutier, Marc-André Roux, Daniel Iannuzzi, and Marie-Pier Royer. 2007. Telepresence Robot for Home Care Assistance.. In AAAI spring symposium: multidisciplinary collaboration for socially assistive robotics. California, USA, 50–55.",
      "doi": ""
    },
    {
      "text": "Terrance Mok and Lora Oehlberg. 2017. Critiquing physical prototypes for a remote audience. In Proceedings of the 2017 Conference on Designing Interactive Systems. 1295–1307.",
      "doi": "10.1145/3064663.3064722"
    },
    {
      "text": "Ken Nakagaki, Joanne Leong, Jordan L. Tappa, João Wilbert, and Hiroshi Ishii. 2020. HERMITS: Dynamically Reconfiguring the Interactivity of Self-Propelled TUIs with Mechanical Shell Add-Ons. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 882–896. https://doi.org/10.1145/3379337.3415831",
      "doi": "10.1145/3379337.3415831"
    },
    {
      "text": "Carman Neustaedter and Saul Greenberg. 2012. Intimacy in long-distance relationships over video chat. In Proceedings of the SIGCHI conference on human factors in computing systems. 753–762.",
      "doi": "10.1145/2207676.2207785"
    },
    {
      "text": "Carman Neustaedter, Gina Venolia, Jason Procyk, and Daniel Hawkins. 2016. To Beam or Not to Beam: A Study of Remote Telepresence Attendance at an Academic Conference. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 418–431. https://doi.org/10.1145/2818048.2819922",
      "doi": "10.1145/2818048.2819922"
    },
    {
      "text": "Gary M Olson and Judith S Olson. 2000. Distance matters. Human–computer interaction 15, 2-3 (2000), 139–178.",
      "doi": ""
    },
    {
      "text": "Eric Paulos and John Canny. 2001. Social tele-embodiment: Understanding presence. Autonomous Robots 11, 1 (2001), 87–95.",
      "doi": "10.1023/A%3A1011264330469"
    },
    {
      "text": "David Pitman and Mary L Cummings. 2012. Collaborative exploration with a micro aerial vehicle: a novel interaction method for controlling a mav with a hand-held device. Advances in Human-Computer Interaction 2012 (2012).",
      "doi": ""
    },
    {
      "text": "Thammathip Piumsomboon, Gun A. Lee, Jonathon D. Hart, Barrett Ens, Robert W. Lindeman, Bruce H. Thomas, and Mark Billinghurst. 2018. Mini-Me: An Adaptive Avatar for Mixed Reality Remote Collaboration. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173620",
      "doi": "10.1145/3173574.3173620"
    },
    {
      "text": "Irene Rae, Bilge Mutlu, and Leila Takayama. 2014. Bodies in Motion: Mobility, Presence, and Task Awareness in Telepresence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2153–2162. https://doi.org/10.1145/2556288.2557047",
      "doi": "10.1145/2556288.2557047"
    },
    {
      "text": "Irene Rae, Gina Venolia, John C Tang, and David Molnar. 2015. A framework for understanding and designing telepresence. In Proceedings of the 18th ACM conference on computer supported cooperative work & social computing. 1552–1566.",
      "doi": "10.1145/2675133.2675141"
    },
    {
      "text": "Dennis Ramirez, Jenny Saucerman, and Jeremy Dietmeier. 2014. Twitch plays pokemon: a case study in big g games. In Proceedings of DiGRA. 3–6.",
      "doi": ""
    },
    {
      "text": "Abhishek Ranjan, Jeremy P. Birnholtz, and Ravin Balakrishnan. 2007. Dynamic Shared Visual Spaces: Experimenting with Automatic Camera Control in a Remote Repair Task. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1177–1186. https://doi.org/10.1145/1240624.1240802",
      "doi": "10.1145/1240624.1240802"
    },
    {
      "text": "Wilko Schwarting, Javier Alonso-Mora, and Daniela Rus. 2018. Planning and Decision-Making for Autonomous Vehicles. Annual Review of Control, Robotics, and Autonomous Systems 1, 1(2018), 187–210. https://doi.org/10.1146/annurev-control-060117-105157",
      "doi": ""
    },
    {
      "text": "Yasaman S. Sefidgar, Prerna Agarwal, and Maya Cakmak. 2017. Situated Tangible Robot Programming. In 2017 12th ACM/IEEE International Conference on Human-Robot Interaction (HRI. 473–482.",
      "doi": ""
    },
    {
      "text": "Alexa F. Siu, Shenli Yuan, Hieu Pham, Eric Gonzalez, Lawrence H. Kim, Mathieu Le Goc, and Sean Follmer. 2018. Investigating Tangible Collaboration for Design Towards Augmented Physical Telepresence. Springer International Publishing, Cham, 131–145. https://doi.org/10.1007/978-3-319-60967-6_7",
      "doi": ""
    },
    {
      "text": "Thomas Smith, Marianna Obrist, and Peter Wright. 2013. Live-streaming changes the (video) game. In Proceedings of the 11th european conference on Interactive TV and video. 131–138.",
      "doi": "10.1145/2465958.2465971"
    },
    {
      "text": "Rajinder S Sodhi, Brett R Jones, David Forsyth, Brian P Bailey, and Giuliano Maciocci. 2013. BeThere: 3D mobile collaboration with spatial input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 179–188.",
      "doi": "10.1145/2470654.2470679"
    },
    {
      "text": "Ryo Suzuki, Junichi Yamaoka, Daniel Leithinger, Tom Yeh, Mark D. Gross, Yoshihiro Kawahara, and Yasuaki Kakehi. 2018. Dynablock: Dynamic 3D Printing for Instant and Reconstructable Shape Formation. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology(Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 99–111. https://doi.org/10.1145/3242587.3242659",
      "doi": "10.1145/3242587.3242659"
    },
    {
      "text": "Ryo Suzuki, Clement Zheng, Yasuaki Kakehi, Tom Yeh, Ellen Yi-Luen Do, Mark D. Gross, and Daniel Leithinger. 2019. ShapeBots: Shape-Changing Swarm Robots. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 493–505. https://doi.org/10.1145/3332165.3347911",
      "doi": "10.1145/3332165.3347911"
    },
    {
      "text": "Anthony Tang, Michel Pahud, Kori Inkpen, Hrvoje Benko, John C Tang, and Bill Buxton. 2010. Three’s company: understanding communication channels in three-way distributed collaboration. In Proceedings of the 2010 ACM conference on Computer supported cooperative work. 271–280.",
      "doi": "10.1145/1718918.1718969"
    },
    {
      "text": "Balasaravanan Thoravi Kumaravel, Fraser Anderson, George Fitzmaurice, Bjoern Hartmann, and Tovi Grossman. 2019. Loki: Facilitating Remote Instruction of Physical Tasks Using Bi-Directional Mixed-Reality Telepresence. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 161–174. https://doi.org/10.1145/3332165.3347872",
      "doi": "10.1145/3332165.3347872"
    },
    {
      "text": "Brygg Ullmer, Hiroshi Ishii, and Robert J. K. Jacob. 2005. Token+constraint Systems for Tangible Interaction with Digital Information. ACM Trans. Comput.-Hum. Interact. 12, 1 (mar 2005), 81–118. https://doi.org/10.1145/1057237.1057242",
      "doi": "10.1145/1057237.1057242"
    },
    {
      "text": "Ana M Villanueva, Ziyi Liu, Zhengzhe Zhu, Xin Du, Joey Huang, Kylie A Peppler, and Karthik Ramani. 2021. RobotAR: An Augmented Reality Compatible Teleconsulting Robotics Toolkit for Augmented Makerspace Experiences. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445726",
      "doi": ""
    },
    {
      "text": "Lillian Yang, Brennan Jones, Carman Neustaedter, and Samarth Singhal. 2018. Shopping over distance through a telepresence robot. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–18.",
      "doi": "10.1145/3274460"
    },
    {
      "text": "Matin Yarmand, Jaemarie Solyst, Scott Klemmer, and Nadir Weibel. 2021. “It Feels Like I Am Talking into a Void”: Understanding Interaction Gaps in Synchronous Online Classrooms. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 351, 9 pages. https://doi.org/10.1145/3411764.3445240",
      "doi": "10.1145/3411764.3445240"
    }
  ]
}