{
  "doi": "10.1145/3491102.3501929",
  "title": "Negotiating sustainable futures in communities through participatory speculative design and experiments in living",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "This paper responds to sustainable HCI’s call to design long-term participatory projects with grassroots communities to counter the local effects of climate change and support more viable practices. We contribute a methodological approach to participatory speculative design as a series of interrelated experiments in living, working in symbiosis with a food-growing community moving towards collective resilience and food sovereignty. As an example of sustainability research within HCI, community food-growing has predominantly focused on collaborative acts of growing rather than disagreements, divergences and frictions. Limited attention has been paid to the challenges of effectively negotiating collaborative, sustainable speculative futures in this context. This paper reports on a workshop series on sustainable community food-growing using situated participatory speculation to address potential tensions when working collaboratively towards socio-technical alternatives.",
  "tags": [
    "Food Growing",
    "Participatory Speculative Design",
    "Visioning",
    "Sustainability",
    "Grassroots Communities"
  ],
  "authors": [
    {
      "name": "Simran Chopra",
      "institution": "Northumbria University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659068058",
      "orcid": "missing"
    },
    {
      "name": "Rachel E Clarke",
      "institution": "Open Lab, Newcastle University, United Kingdom",
      "img": "/do/10.1145/contrib-81501686180/rel-imgonly/people-rachel-clarke-medium.jpg",
      "acmid": "81501686180",
      "orcid": "missing"
    },
    {
      "name": "Adrian K Clear",
      "institution": "School of Computer Science, NUI Galway, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548005965",
      "orcid": "0000-0002-4409-9255"
    },
    {
      "name": "Sara Heitlinger",
      "institution": "Department of Computer Science, City, University of London, United Kingdom",
      "img": "/do/10.1145/contrib-83458882657/rel-imgonly/sara.jpg",
      "acmid": "83458882657",
      "orcid": "missing"
    },
    {
      "name": "Ozge Dilaver",
      "institution": "Entrepreneurship, Innovation and Strategy, Northumbria University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658771051",
      "orcid": "missing"
    },
    {
      "name": "Christina Vasiliou",
      "institution": "Northumbria University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81551086856",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aloha Hufana Ambe, Margot Brereton, Alessandro Soro, Laurie Buys, and Paul Roe. 2019. The adventures of older authors: Exploring futures through co-design fictions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3290605.3300588"
    },
    {
      "text": "Kristina Andersen. 2013. Making magic machines. In 10th European Academy of Design Conference.",
      "doi": ""
    },
    {
      "text": "Kristina Andersen and Ron Wakkary. 2019. The magic machine workshops: making personal design knowledge. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300342"
    },
    {
      "text": "James Auger. 2013. Speculative design: crafting the speculation. Digital Creativity 24, 1 (2013), 11–35.",
      "doi": ""
    },
    {
      "text": "Corelia Baibarac and Doina Petrescu. 2017. Co-design and urban resilience: visioning tools for commoning resilience practices. CoDesign (2017).",
      "doi": ""
    },
    {
      "text": "Liam Bannon, Jeffrey Bardzell, and Susanne Bødker. 2018. Introduction: Reimagining participatory design—Emerging voices. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 1(2018), 1–8.",
      "doi": "10.1145/3177794"
    },
    {
      "text": "Shaowen Bardzell. 2018. Utopias of participation: Feminism, design, and the futures. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 1(2018), 1–24.",
      "doi": "10.1145/3127359"
    },
    {
      "text": "Stewart Barr and Justin Pollard. 2017. Geographies of Transition: Narrating environmental activism in an age of climate change and ‘Peak Oil’. Environment and Planning A: Economy and Space 49, 1 (2017), 47–64.",
      "doi": ""
    },
    {
      "text": "Karl Baumann, Benjamin Stokes, François Bar, and Ben Caldwell. 2016. Designing in” constellations” sustaining participatory design for neighborhoods. In Proceedings of the 14th Participatory Design Conference: Short Papers, Interactive Exhibitions, Workshops-Volume 2. 5–8.",
      "doi": "10.1145/2948076.2948083"
    },
    {
      "text": "Karl Baumann, Benjamin Stokes, François Bar, and Ben Caldwell. 2017. Infrastructures of the Imagination: Community Design for Speculative Urban Technologies. In Proceedings of the 8th International Conference on Communities and Technologies. 266–269.",
      "doi": "10.1145/3083671.3083700"
    },
    {
      "text": "Genevieve Bell, Mark Blythe, and Phoebe Sengers. 2005. Making by making strange: Defamiliarization and the design of domestic technologies. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 2(2005), 149–173.",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Roy Bendor. 2012. Analytic and deictic approaches to the design of sustainability decision-support tools. In Proceedings of the 2012 iConference. 215–222.",
      "doi": "10.1145/2132176.2132204"
    },
    {
      "text": "Heidi R Biggs and Audrey Desjardins. 2020. High Water Pants: Designing Embodied Environmental Speculation. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376429"
    },
    {
      "text": "Aksel Biørn-Hansen and Maria Håkansson. 2018. Building Momentum: Scaling up Change in Community Organizations. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173984"
    },
    {
      "text": "Erling Bjögvinsson, Pelle Ehn, and Per-Anders Hillgren. 2012. Design things and design thinking: Contemporary participatory design challenges. Design issues 28, 3 (2012), 101–116.",
      "doi": ""
    },
    {
      "text": "Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2012. Agonistic participatory design: working with marginalised social movements. CoDesign 8, 2-3 (2012), 127–144.",
      "doi": ""
    },
    {
      "text": "Eli Blevis and Susan Coleman Morse. 2009. Sustainably ours food, dude. interactions 16, 2 (2009), 58–62.",
      "doi": ""
    },
    {
      "text": "Mark Blythe, Kristina Andersen, Rachel Clarke, and Peter Wright. 2016. Anti-solutionist strategies: Seriously silly design fiction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 4968–4978.",
      "doi": "10.1145/2858036.2858482"
    },
    {
      "text": "Mark Blythe, Jamie Steane, Jenny Roe, and Caroline Oliver. 2015. Solutionism, the game: design fictions for positive aging. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 3849–3858.",
      "doi": "10.1145/2702123.2702491"
    },
    {
      "text": "Augusto Boal. 2002. Games for actors and non-actors. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Susanne Bødker and Morten Kyng. 2018. Participatory design that matters—Facing the big issues. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 1(2018), 1–31.",
      "doi": "10.1145/3152421"
    },
    {
      "text": "Laurens Boer and Jared Donovan. 2012. Provotypes for participatory innovation. In Proceedings of the designing interactive systems conference. 388–397.",
      "doi": "10.1145/2317956.2318014"
    },
    {
      "text": "Robin Bourgeois, Esther Penunia, Sonali Bisht, and Don Boruk. 2017. Foresight for all: Co-elaborative scenario building and empowerment. Technological Forecasting and Social Change 124 (2017), 178–188.",
      "doi": ""
    },
    {
      "text": "Tone Bratteteig and Wagner Ina. 2012. Disentangling power and decision-making in participatory design.. In Proceedings of the 12th Participatory Design Conference: Research Papers-Volume 1.",
      "doi": "10.1145/2347635.2347642"
    },
    {
      "text": "Pam Briggs, Mark Blythe, John Vines, Stephen Lindsay, Paul Dunphy, James Nicholson, David Green, Jim Kitson, Andrew Monk, and Patrick Olivier. 2012. Invisible design: exploring insights and ideas through ambiguous film scenarios. In Proceedings of the Designing Interactive Systems Conference. 534–543.",
      "doi": "10.1145/2317956.2318036"
    },
    {
      "text": "Hronn Brynjarsdottir, Maria Håkansson, James Pierce, Eric Baumer, Carl DiSalvo, and Phoebe Sengers. 2012. Sustainably unpersuaded: how persuasion narrows our vision of sustainability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 947–956.",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Edward Burnell. 2018. Design for survivability: a participatory design fiction approach to sustainability. In Proceedings of the 2018 Workshop on Computing within Limits. 1–4.",
      "doi": "10.1145/3232617.3232628"
    },
    {
      "text": "Stuart Candy. 2010. The futures of everyday life: Politics and the design of experiential scenarios. University of (2010).",
      "doi": ""
    },
    {
      "text": "Stuart Candy and Jake Dunagan. 2017. Designing an experiential scenario: The people who vanished. Futures 86(2017), 136–153.",
      "doi": ""
    },
    {
      "text": "Andrea Capaccioli, Giacomo Poderi, Mela Bettega, and Vincenzo D’Andrea. 2016. Participatory infrastructuring of community energy. In Proceedings of the 14th Participatory Design Conference: Short Papers, Interactive Exhibitions, Workshops-Volume 2. 9–12.",
      "doi": "10.1145/2948076.2948089"
    },
    {
      "text": "Alan Chamberlain, Andy Crabtree, Tom Rodden, Matt Jones, and Yvonne Rogers. 2012. Research in the wild: understanding’in the wild’approaches to design and development. In Proceedings of the Designing Interactive Systems Conference. 795–796.",
      "doi": "10.1145/2317956.2318078"
    },
    {
      "text": "Jaz Hee-jeong Choi and Mark Graham. 2014. Urban food futures: ICTs and opportunities.",
      "doi": ""
    },
    {
      "text": "Rachel Clarke, Sara Heitlinger, Marcus Foth, Carl DiSalvo, Ann Light, and Laura Forlano. 2018. More-than-human urban futures: Speculative participatory design to avoid ecocidal smart cities. In Proceedings of the 15th Participatory Design Conference: Short Papers, Situated Actions, Workshops and Tutorial-Volume 2. 1–4.",
      "doi": "10.1145/3210604.3210641"
    },
    {
      "text": "Jon Corbett. 2009. Good practices in participatory mapping: a review prepared for the International Fund for Agricultural Development (IFAD). (2009).",
      "doi": ""
    },
    {
      "text": "Paul Coulton, Dan Burnett, and Adrian Ioan Gradinar. 2016. Games as speculative design: allowing players to consider alternate presents and plausible futures. (2016).",
      "doi": ""
    },
    {
      "text": "Paul Coulton, Joseph Galen Lindley, Miriam Sturdee, and Michael Stead. 2017. Design fiction as world building. (2017).",
      "doi": ""
    },
    {
      "text": "Christopher A Le Dantec and Carl DiSalvo. 2013. Infrastructuring and the formation of publics in participatory design. Social Studies of Science 43, 2 (2013), 241–264.",
      "doi": ""
    },
    {
      "text": "Luiza Prado de O. Martins and Pedro JS Vieira de Oliveira. 2016. Breaking the cycle of Macondo: design and decolonial futures. XRDS: Crossroads, The ACM Magazine for Students 22, 4 (2016), 28–32.",
      "doi": "10.1145/2930880"
    },
    {
      "text": "Audrey Desjardins, Cayla Key, Heidi R Biggs, and Kelsey Aschenbeck. 2019. Bespoke booklets: A method for situated co-speculation. In Proceedings of the 2019 on Designing Interactive Systems Conference. 697–709.",
      "doi": "10.1145/3322276.3322311"
    },
    {
      "text": "Tawanna Dillahunt, Jennifer Mankoff, Eric Paulos, and Susan Fussell. 2009. It’s not all about” Green” energy use in low-income communities. In Proceedings of the 11th international conference on Ubiquitous computing. 255–264.",
      "doi": "10.1145/1620545.1620583"
    },
    {
      "text": "Carl DiSalvo. 2012. Adversarial design. Mit Press.",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Carl DiSalvo, Andrew Clement, and Volkmar Pipek. 2012. Participatory design for, with, and by communities. (2012).",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Tom Jenkins, and Thomas Lodato. 2016. Designing speculative civics. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 4979–4990.",
      "doi": "10.1145/2858036.2858505"
    },
    {
      "text": "Carl DiSalvo, Illah Nourbakhsh, David Holstius, Ayça Akin, and Marti Louw. 2008. The Neighborhood Networks project: a case study of critical engagement and creative expression through participatory design. In Proceedings of the tenth anniversary conference on participatory design 2008. 41–50.",
      "doi": "10.5555/1795234.1795241"
    },
    {
      "text": "Marketa Dolejsova. 2018. Edible speculations in the parlour of food futures. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. 1–10.",
      "doi": "10.1145/3170427.3188406"
    },
    {
      "text": "Paul Dourish. 2010. HCI and environmental sustainability: the politics of design and the design of politics. In Proceedings of the 8th ACM conference on designing interactive systems. 1–10.",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Andy Dow, Rob Comber, and John Vines. 2019. Communities to the left of me, bureaucrats to the right… here I am, stuck in the middle. interactions 26, 5 (2019), 26–33.",
      "doi": ""
    },
    {
      "text": "Anthony Dunne. 2008. Hertzian tales: Electronic products, aesthetic experience, and critical design. Ph.D. Dissertation. Royal College of Art.",
      "doi": "10.5555/1205303"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative everything: design, fiction, and social dreaming. MIT press.",
      "doi": "10.5555/2613526"
    },
    {
      "text": "E Melanie DuPuis and David Goodman. 2005. Should we go “home” to eat?: toward a reflexive politics of localism. Journal of rural studies 21, 3 (2005), 359–371.",
      "doi": ""
    },
    {
      "text": "Pelle Ehn. 2014. Utopias lost and futures-in-the-making: marginal notes on innovation, design and democracy. In Proceedings of the 13th Participatory Design Conference: Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts-Volume 2. 191–193.",
      "doi": "10.1145/2662155.2662214"
    },
    {
      "text": "Chris Elsden, David Chatting, Abigail C Durrant, Andrew Garbett, Bettina Nissen, John Vines, and David S Kirk. 2017. On speculative enactments. In Proceedings of the 2017 CHI conference on human factors in computing systems. 5386–5399.",
      "doi": "10.1145/3025453.3025503"
    },
    {
      "text": "Laura Forlano and Anijo Mathew. 2014. From design fiction to design friction: Speculative and participatory design of values-embedded urban technology. Journal of Urban Technology 21, 4 (2014), 7–24.",
      "doi": ""
    },
    {
      "text": "Arthur W Frank. 2010. Letting stories breathe: A socio-narratology. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Cally Gatehouse. 2020. A hauntology of participatory speculation. In Proceedings of the 2020 Participatory Design Conference.",
      "doi": "10.1145/3385010.3385024"
    },
    {
      "text": "Alix Gerber. 2018. Participatory speculation: futures of public safety. In Proceedings of the 15th Participatory Design Conference: Short Papers, Situated Actions, Workshops and Tutorial-Volume 2. 1–4.",
      "doi": "10.1145/3210604.3210640"
    },
    {
      "text": "Katarina L Gidlund. 2012. Designing for all and no one-practitioners understandings of citizen driven development of public e-services. In Proceedings of the 12th Participatory Design Conference: Research Papers-Volume 1. 11–19.",
      "doi": "10.1145/2347635.2347638"
    },
    {
      "text": "Daniel Gooch, Matthew Barker, Lorraine Hudson, Ryan Kelly, Gerd Kortuem, Janet Van Der Linden, Marian Petre, Rebecca Brown, Anna Klis-Davies, Hannah Forbes, 2018. Amplifying quiet voices: Challenges and opportunities for participatory design at an urban scale. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 1(2018), 1–34.",
      "doi": "10.1145/3139398"
    },
    {
      "text": "Elizabeth Grosz. 2001. Architecture from the outside: Essays on virtual and real space. MIT press.",
      "doi": ""
    },
    {
      "text": "Xinning Gui and Bonnie Nardi. 2015. Foster the” mores”, counter the” limits”. First Monday (2015).",
      "doi": ""
    },
    {
      "text": "Xinning Gui and Bonnie Nardi. 2015. Sustainability begins in the street: A story of Transition Town Totnes. In EnviroInfo and ICT for Sustainability 2015. Atlantis Press.",
      "doi": ""
    },
    {
      "text": "Kim Halskov and Nicolai Brodersen Hansen. 2015. The diversity of participatory design research practice at PDC 2002–2012. International Journal of Human-Computer Studies 74 (2015), 81–92.",
      "doi": "10.1016/j.ijhcs.2014.09.003"
    },
    {
      "text": "Karin Hansson, Laura Forlano, Jaz Hee-jeong Choi, Carl DiSalvo, Teresa Cerratto Pargman, Shaowen Bardzell, Silvia Lindtner, and Somya Joshi. 2018. Provocation, conflict, and appropriation: the role of the designer in making publics. Design Issues 34, 4 (2018), 3–7.",
      "doi": ""
    },
    {
      "text": "Donna Jeanne Haraway. 2003. The companion species manifesto: Dogs, people, and significant otherness. Vol. 1. Prickly Paradigm Press Chicago.",
      "doi": ""
    },
    {
      "text": "Donna J Haraway. 2013. SF: Science fiction, speculative fabulation, string figures, so far. (2013).",
      "doi": ""
    },
    {
      "text": "Steve Harrison and Paul Dourish. 1996. Re-place-ing space: the roles of place and space in collaborative systems. In Proceedings of the 1996 ACM conference on Computer supported cooperative work. 67–76.",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Brad Haylock. 2019. What is critical design?In Undesign: Critical Practices at the Intersection of Art and Design. Routledge, Oxford, Chapter 1, 9–23.",
      "doi": ""
    },
    {
      "text": "Marie Heidingsfelder, Kora Kimpel, Kathinka Best, and Martina Schraudner. 2015. Shaping future—Adapting design know-how to reorient innovation towards public preferences. Technological forecasting and social change 101 (2015), 291–298.",
      "doi": ""
    },
    {
      "text": "Marie Lena Heidingsfelder, Fabian Bitter, and Ronja Ullrich. 2019. Debate through design. Incorporating contrary views on new and emerging technologies. The Design Journal 22, sup1 (2019), 723–735.",
      "doi": ""
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Janis Jefferies. 2013. Sustainable HCI for grassroots urban food-growing communities. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration. 255–264.",
      "doi": "10.1145/2541016.2541023"
    },
    {
      "text": "Sara Heitlinger, Rachel Clarke, Adrian K Clear, Simran Chopra, and Özge Dilaver. 2019. Co-Creating” Smart” Sustainable Food Futures with Urban Food Growers. In Proceedings of the 9th International Conference on Communities & Technologies-Transforming Communities. 114–120.",
      "doi": "10.1145/3328320.3328399"
    },
    {
      "text": "Charlotte Hess and Elinor Ostrom. 2007. Introduction: An overview of the knowledge commons. (2007).",
      "doi": ""
    },
    {
      "text": "Sohail Inayatullah. 1990. Deconstructing and reconstructing the future: Predictive, cultural and critical epistemologies. Futures 22, 2 (1990), 115–141.",
      "doi": ""
    },
    {
      "text": "Ole Sejer Iversen and Christian Dindler. 2014. Sustaining participatory design initiatives. CoDesign 10, 3-4 (2014), 153–170.",
      "doi": ""
    },
    {
      "text": "Helena Karasti. 2014. Infrastructuring in participatory design. In Proceedings of the 13th Participatory Design Conference: Research Papers-Volume 1. 141–150.",
      "doi": "10.1145/2661435.2661450"
    },
    {
      "text": "Bran Knowles, Oliver Bates, and Maria Håkansson. 2018. This changes sustainable hci. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3174045"
    },
    {
      "text": "Sandjar Kozubaev, Chris Elsden, Noura Howell, Marie Louise Juul Søndergaard, Nick Merrill, Britta Schulte, and Richmond Y Wong. 2020. Expanding Modes of Reflection in Design Futuring. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376526"
    },
    {
      "text": "Kari Kuutti and Liam J Bannon. 2014. The turn to practice in HCI: towards a research agenda. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3543–3552.",
      "doi": "10.1145/2556288.2557111"
    },
    {
      "text": "Bruno Latour. 2005. From realpolitik to dingpolitik. Making things public: Atmospheres of democracy 1444 (2005).",
      "doi": ""
    },
    {
      "text": "Giacomo Lepri and Andrew McPherson. 2019. Making up instruments: Design fiction for value discovery in communities of musical practice. In Proceedings of the 2019 on Designing Interactive Systems Conference. 113–126.",
      "doi": "10.1145/3322276.3322353"
    },
    {
      "text": "Ann Light and Yoko Akama. 2018. The nature of ‘obligation’in doing design with communities: Participation, politics and care. Tricky Design: The Ethics of Things 131 (2018).",
      "doi": ""
    },
    {
      "text": "Kristina Lindström and Åsa Ståhl. 2020. Un/Making in the Aftermath of Design. In Proceedings of the 16th Participatory Design Conference 2020-Participation (s) Otherwise-Volume 1. 12–21.",
      "doi": ""
    },
    {
      "text": "Szu-Yu Liu, Shaowen Bardzell, and Jeffrey Bardzell. 2019. Symbiotic encounters: HCI and sustainable agriculture. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300547"
    },
    {
      "text": "Sus Lyckvi, Virpi Roto, Elizabeth Buie, and Yiying Wu. 2018. The role of design fiction in participatory design processes. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction. 976–979.",
      "doi": "10.1145/3240167.3240258"
    },
    {
      "text": "Peter Lyle, Jaz Hee-jeong Choi, and Marcus Foth. 2015. Growing food in the city: design ideations for urban residential gardeners. In Proceedings of the 7th International Conference on Communities and Technologies. 89–97.",
      "doi": "10.1145/2768545.2768549"
    },
    {
      "text": "Noortje Marres. 2007. The issues deserve more credit: Pragmatist contributions to the study of public involvement in controversy. Social studies of science 37, 5 (2007), 759–780.",
      "doi": ""
    },
    {
      "text": "Noortje Marres. 2012. The experiment in living. Inventive methods: The happening of the social (2012), 76–95.",
      "doi": ""
    },
    {
      "text": "Ramia Mazé. 2019. Politics of designing visions of the future. Journal of Futures Studies 23, 3 (2019), 23–38.",
      "doi": ""
    },
    {
      "text": "Timon McPhearson, David M Iwaniec, and Xuemei Bai. 2016. Positive visions for guiding urban transformations toward sustainable futures. Current opinion in environmental sustainability 22 (2016), 33–40.",
      "doi": ""
    },
    {
      "text": "Annemarie Mol. 2008. The logic of care: Health and the problem of patient choice. Routledge.",
      "doi": ""
    },
    {
      "text": "Chantal Mouffe. 1999. Deliberative democracy or agonistic pluralism?Social research (1999), 745–758.",
      "doi": ""
    },
    {
      "text": "Bonnie Nardi, Bill Tomlinson, Donald J Patterson, Jay Chen, Daniel Pargman, Barath Raghavan, and Birgit Penzenstadler. 2018. Computing within limits. Commun. ACM 61, 10 (2018), 86–93.",
      "doi": "10.1145/3183582"
    },
    {
      "text": "Juliet Norton, Birgit Penzenstadler, and Bill Tomlinson. 2019. Implications of grassroots sustainable agriculture community values on the design of information systems. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–22.",
      "doi": "10.1145/3359136"
    },
    {
      "text": "Juliet Norton, Ankita Raturi, Bonnie Nardi, Sebastian Prost, Samantha McDonald, Daniel Pargman, Oliver Bates, Maria Normark, Bill Tomlinson, Nico Herbig, 2017. A grand challenge for HCI: food+ sustainability. interactions 24, 6 (2017), 50–55.",
      "doi": "10.1145/3137095"
    },
    {
      "text": "Daniel Pargman, Elina Eriksson, Mattias Höjer, Ulrika Gunnarsson Östling, and Luciane Aguiar Borges. 2017. The (un) sustainability of imagined future information societies. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 773–785.",
      "doi": "10.1145/3025453.3025858"
    },
    {
      "text": "Daniel Pargman and Barath Raghavan. 2014. Rethinking sustainability in computing: from buzzword to non-negotiable limits. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational. 638–647.",
      "doi": "10.1145/2639189.2639228"
    },
    {
      "text": "Sebastian Prost, Clara Crivellaro, Andy Haddon, and Rob Comber. 2018. Food democracy in the making: Designing with local food networks. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3173574.3173907"
    },
    {
      "text": "Sebastian Prost, Elke Mattheiss, and Manfred Tscheligi. 2015. From awareness to empowerment: Using design fiction to explore paths towards a sustainable energy future. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 1649–1658.",
      "doi": "10.1145/2675133.2675281"
    },
    {
      "text": "Barath Raghavan, Bonnie Nardi, Sarah T Lovell, Juliet Norton, Bill Tomlinson, and Donald J Patterson. 2016. Computational agroecology: Sustainable food ecosystem design. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 423–435.",
      "doi": "10.1145/2851581.2892577"
    },
    {
      "text": "Ankita Raturi, Juliet Norton, Bill Tomlinson, Eli Blevis, and Lynn Dombrowski. 2017. Designing sustainable food systems. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 609–616.",
      "doi": "10.1145/3027063.3027075"
    },
    {
      "text": "Christian Remy, Oliver Bates, Alan Dix, Vanessa Thomas, Mike Hazas, Adrian Friday, and Elaine M Huang. 2018. Evaluation beyond usability: Validating sustainable HCI research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3173574.3173790"
    },
    {
      "text": "Marco C Rozendaal, Marie L Heidingsfelder, and Frank Kupper. 2016. Exploring embodied speculation in participatory design and innovation. In Proceedings of the 14th Participatory Design Conference: Short Papers, Interactive Exhibitions, Workshops-Volume 2. 100–102.",
      "doi": "10.1145/2948076.2948102"
    },
    {
      "text": "Juan Sanin. 2020. Designing with as People. In Proceedings of the 16th Participatory Design Conference 2020-Participation (s) Otherwise-Volume 2. 124–127.",
      "doi": "10.1145/3384772.3385150"
    },
    {
      "text": "Vandana Shiva. 1993. Monocultures of the mind: Perspectives on biodiversity and biotechnology. Palgrave Macmillan.",
      "doi": ""
    },
    {
      "text": "M Six Silberman, Lisa Nathan, Bran Knowles, Roy Bendor, Adrian Clear, Maria Håkansson, Tawanna Dillahunt, and Jennifer Mankoff. 2014. Next steps for sustainable HCI. interactions 21, 5 (2014), 66–69.",
      "doi": ""
    },
    {
      "text": "Robert Soden and Nate Kauffman. 2019. Infrastructuring the Imaginary: How Sea-Level Rise Comes to Matter in the San Francisco Bay Area. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3290605.3300516"
    },
    {
      "text": "Shenando Stals, Michael Smyth, and Oli Mival. 2019. UrbanIxD: From Ethnography to Speculative Design Fictions for the Hybrid City. In Proceedings of the Halfway to the Future Symposium 2019. 1–10.",
      "doi": "10.1145/3363384.3363486"
    },
    {
      "text": "Susan Leigh Star and Karen Ruhleder. 1996. Steps toward an ecology of infrastructure: Design and access for large information spaces. Information systems research 7, 1 (1996), 111–134.",
      "doi": ""
    },
    {
      "text": "Marc Steen. 2013. Co-design as a process of joint inquiry and imagination. Design Issues 29, 2 (2013), 16–28.",
      "doi": ""
    },
    {
      "text": "Joshua Tanenbaum, Marcel Pufal, and Karen Tanenbaum. 2016. Furious futures and apocalyptic design fictions: popular narratives of sustainability. interactions 24, 1 (2016), 64–67.",
      "doi": "10.1145/3022123"
    },
    {
      "text": "Bruce M Tharp and Stephanie M Tharp. 2019. Discursive design: critical, speculative, and alternative things. MIT Press.",
      "doi": ""
    },
    {
      "text": "Mikey Tomkins. 2012. You are Hungry: Flâneuring, Edible Mapping and Feeding Imaginations. FOOTPRINT (2012), 15–36.",
      "doi": ""
    },
    {
      "text": "Jasper Tran O’Leary, Sara Zewde, Jennifer Mankoff, and Daniela K Rosner. 2019. Who gets to future? Race, representation, and design methods in Africatown. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300791"
    },
    {
      "text": "Ron Wakkary, Audrey Desjardins, Sabrina Hauser, and Leah Maestri. 2013. A sustainable design fiction: Green practices. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 4(2013), 1–34.",
      "doi": "10.1145/2494265"
    },
    {
      "text": "Ron Wakkary, William Odom, Sabrina Hauser, Garnet Hertz, and Henry Lin. 2015. Material speculation: actual artifacts for critical inquiry. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives. 97–108.",
      "doi": "10.7146/aahcc.v1i1.21299"
    },
    {
      "text": "Ron Wakkary and Karen Tanenbaum. 2009. A sustainable identity: the creativity of an everyday designer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 365–374.",
      "doi": "10.1145/1518701.1518761"
    },
    {
      "text": "Jon Whittle. 2014. How much participation is enough? A comparison of six participatory design projects in terms of outcomes. In Proceedings of the 13th Participatory Design Conference: Research Papers-Volume 1. 121–130.",
      "doi": ""
    },
    {
      "text": "Kelly Widdicks and Daniel Pargman. 2019. Breaking the Cornucopian Paradigm: Towards Moderate Internet Use in Everyday Life. In Proceedings of the Fifth Workshop on Computing within Limits. 1–8.",
      "doi": "10.1145/3338103.3338105"
    }
  ]
}