{
  "doi": "10.1145/3491102.3502039",
  "title": "The TAC Toolkit: Supporting Design for User Acceptance of Health Technologies from a Macro-Temporal Perspective",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [
    "Best Paper"
  ],
  "abstract": "User acceptance is key for the successful uptake and use of health technologies, but also impacted by numerous factors not always easily accessible nor operationalised by designers in practice. This work seeks to facilitate the application of acceptance theory in design practice through the Technology Acceptance (TAC) toolkit: a novel theory-based design tool and method comprising 16 cards, 3 personas, 3 scenarios, a virtual think-space, and a website, which we evaluated through workshops conducted with 21 designers of health technologies. Findings showed that the toolkit revised and extended designers’ knowledge of technology acceptance, fostered their appreciation, empathy and ethical values while designing for acceptance, and contributed towards shaping their future design practice. We discuss implications for considering user acceptance a dynamic, multi-stage process in design practice, and better supporting designers in imagining distant acceptance challenges. Finally, we examine the generative value of the TAC toolkit and its possible future evolution.",
  "authors": [
    {
      "name": "Camille Nadal",
      "institution": "School of Computer Science and Statistics, Trinity College Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365871",
      "orcid": "0000-0002-0166-113X"
    },
    {
      "name": "Shane McCully",
      "institution": "School of Computer Science and Statistics, Trinity College Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238578",
      "orcid": "missing"
    },
    {
      "name": "Kevin Doherty",
      "institution": "Copenhagen Center for Health Technology, Technical University of Denmark, Denmark",
      "img": "/do/10.1145/contrib-99659283723/rel-imgonly/profile_gray_round_resized.png",
      "acmid": "99659283723",
      "orcid": "missing"
    },
    {
      "name": "Corina Sas",
      "institution": "School of Computing and Communications, Lancaster University, United Kingdom",
      "img": "/do/10.1145/contrib-81100639942/rel-imgonly/dsc_0976_close_up.jpg",
      "acmid": "81100639942",
      "orcid": "missing"
    },
    {
      "name": "Gavin Doherty",
      "institution": "School of Computer Science and Statistics, Trinity College Dublin, Ireland",
      "img": "/do/10.1145/contrib-81100175529/rel-imgonly/81100175529.jpg",
      "acmid": "81100175529",
      "orcid": "0000-0002-9617-7008"
    }
  ],
  "references": [
    {
      "text": "Icek Ajzen and Thomas J Madden. 1986. Prediction of goal-directed behavior: Attitudes, intentions, and perceived behavioral control. Journal of experimental social psychology 22, 5 (1986), 453–474.",
      "doi": ""
    },
    {
      "text": "Khadeeja Alkhuzai and Alena Denisova. 2021. Evaluating the Use of Persuasive Design Cards for Novice Designers. Journal of Usability Studies 16, 2 (2021).",
      "doi": ""
    },
    {
      "text": "Daniel Andrews and Chris Baber. 2014. Visualizing Interactive Narratives: Employing a Branching Comic to Tell a Story and Show Its Readings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1895–1904. https://doi.org/10.1145/2556288.2557296",
      "doi": "10.1145/2556288.2557296"
    },
    {
      "text": "Balbir S Barn and Ravinder Barn. 2018. Human and value sensitive aspects of mobile app design: a Foucauldian perspective. In International Conference on Advanced Information Systems Engineering. Springer, 103–118.",
      "doi": ""
    },
    {
      "text": "Tilde Bekker and Alissa N Antle. 2011. Developmentally situated design (DSD) making theoretical knowledge accessible to designers of children’s technology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2531–2540.",
      "doi": "10.1145/1978942.1979312"
    },
    {
      "text": "Steve Benford and Gabriella Giannachi. 2008. Temporal trajectories in shared interactive narratives. In Proceedings of the sigchi conference on human factors in computing systems. 73–82.",
      "doi": "10.1145/1357054.1357067"
    },
    {
      "text": "Steve Benford, Gabriella Giannachi, Boriana Koleva, and Tom Rodden. 2009. From Interaction to Trajectories: Designing Coherent Journeys through User Experiences. Association for Computing Machinery, New York, NY, USA, 709–718. https://doi.org/10.1145/1518701.1518812",
      "doi": ""
    },
    {
      "text": "Nis Bornoe, Anders Bruun, and Jan Stage. 2016. Facilitating redesign with design cards: experiences with novice designers. In Proceedings of the 28th Australian Conference on Computer-Human Interaction. 452–461.",
      "doi": "10.1145/3010915.3010921"
    },
    {
      "text": "Dionne Bowie-DaBreo, Heather Iles-Smith, Sandra-Ilona Sunram-Lea, and Corina Sas. 2020. Transdisciplinary ethical principles and standards for mobile mental health. Mental Wellbeing: Future Agenda Drawing from Design, HCI, and Big Data (2020).",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis. (2012).",
      "doi": ""
    },
    {
      "text": "Jacob Buur, Mads Vedel Jensen, and Tom Djajadiningrat. 2004. Hands-only scenarios and video action walls: novel methods for tangible user interaction design. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques. 185–192.",
      "doi": "10.1145/1013115.1013141"
    },
    {
      "text": "Man Lai Cheung, Ka Yin Chau, Michael Huen Sum Lam, Gary Tse, Ka Yan Ho, Stuart W Flint, David R Broom, Ejoe Kar Ho Tso, and Ka Yiu Lee. 2019. Examining consumers’ adoption of wearable healthcare technology: The role of health attributes. International journal of environmental research and public health 16, 13(2019), 2257.",
      "doi": ""
    },
    {
      "text": "Lucas Colusso, Cynthia L Bennett, Gary Hsieh, and Sean A Munson. 2017. Translational resources: Reducing the gap between academic research and HCI practice. In Proceedings of the 2017 Conference on Designing Interactive Systems. 957–968.",
      "doi": "10.1145/3064663.3064667"
    },
    {
      "text": "Lucas Colusso, Ridley Jones, Sean A Munson, and Gary Hsieh. 2019. A translational science model for HCI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300231"
    },
    {
      "text": "Kay Connelly. 2007. On developing a technology acceptance model for pervasive computing. In 9th International Conference on Ubiquitous Computing (UBICOMP)-Workshop of Ubiquitous System Evaluation (USE), Springer, Innsbruck, Austria. Citeseer, 520.",
      "doi": ""
    },
    {
      "text": "Alan Cooper, Robert Reimann, and David Cronin. 2012. About Face 3: The Essentials of Interaction Design. John Wiley & Sons.",
      "doi": "10.5555/1207736"
    },
    {
      "text": "Peter Dalsgaard and Christian Dindler. 2014. Between Theory and Practice: Bridging Concepts in HCI Research(CHI ’14). Association for Computing Machinery, New York, NY, USA, 1635–1644. https://doi.org/10.1145/2556288.2557342",
      "doi": ""
    },
    {
      "text": "Claudia Daudén Roquet and Corina Sas. 2020. Body Matters: Exploration of the Human Body as a Resource for the Design of Technologies for Meditation. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 533–546. https://doi.org/10.1145/3357236.3395499",
      "doi": "10.1145/3357236.3395499"
    },
    {
      "text": "Claudia Daudén Roquet and Corina Sas. 2021. Interoceptive Interaction: An Embodied Metaphor Inspired Approach to Designing for Meditation. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445137",
      "doi": ""
    },
    {
      "text": "Fred D Davis. 1985. A technology acceptance model for empirically testing new end-user information systems: Theory and results. Ph. D. Dissertation. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Fred D Davis, Richard P Bagozzi, and Paul R Warshaw. 1989. User acceptance of computer technology: a comparison of two theoretical models. Management science 35, 8 (1989), 982–1003.",
      "doi": "10.5555/2797314.2797319"
    },
    {
      "text": "Henrik Detjen, Sarah Faltaous, Bastian Pfleging, Stefan Geisler, and Stefan Schneegass. 2021. How to Increase Automated Vehicles’ Acceptance through In-Vehicle Interaction Design: A Review. International Journal of Human–Computer Interaction 37, 4(2021), 308–330.",
      "doi": ""
    },
    {
      "text": "Devendra Dhagarra, Mohit Goswami, and Gopal Kumar. 2020. Impact of trust and privacy concerns on technology acceptance in healthcare: an Indian perspective. International journal of medical informatics 141 (2020), 104164.",
      "doi": ""
    },
    {
      "text": "Verena Distler, Carine Lallemand, and Thierry Bellet. 2018. Acceptability and acceptance of autonomous mobility on demand: The impact of an immersive experience. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–10.",
      "doi": "10.1145/3173574.3174186"
    },
    {
      "text": "Alan Dix, Alan John Dix, Janet Finlay, Gregory D Abowd, and Russell Beale. 2003. Human-computer interaction. Pearson Education.",
      "doi": ""
    },
    {
      "text": "Kevin Doherty and Gavin Doherty. 2018. The construal of experience in HCI: Understanding self-reports. International Journal of Human-Computer Studies 110 (2018), 63–74.",
      "doi": "10.1016/j.ijhcs.2017.10.006"
    },
    {
      "text": "Kaili Dou, Ping Yu, Ning Deng, Fang Liu, YingPing Guan, Zhenye Li, Yumeng Ji, Ningkai Du, Xudong Lu, and Huilong Duan. 2017. Patients’ acceptance of smartphone health technology for chronic disease management: a theoretical model and empirical test. JMIR mHealth and uHealth 5, 12 (2017), e177.",
      "doi": ""
    },
    {
      "text": "Arnaud D’Argembeau and Martial Van der Linden. 2004. Phenomenal characteristics associated with projecting oneself back into the past and forward into the future: Influence of valence and temporal distance. Consciousness and cognition 13, 4 (2004), 844–858.",
      "doi": ""
    },
    {
      "text": "Emmanuel Eilu. 2021. Design Strategies for Improving Anticipated User Experience in a Developing Country Setting: Case of Uganda. In Digital Literacy and Socio-Cultural Acceptance of ICT in Developing Countries. Springer, 65–77.",
      "doi": ""
    },
    {
      "text": "Giorgio P Faconti and Mieke Massink. 2000. Continuity in human computer interaction. In CHI’00 extended abstracts on Human factors in computing systems. 364–364.",
      "doi": ""
    },
    {
      "text": "Jodi Forlizzi and Katja Battarbee. 2004. Understanding Experience in Interactive Systems. In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques(Cambridge, MA, USA) (DIS ’04). Association for Computing Machinery, New York, NY, USA, 261–268. https://doi.org/10.1145/1013115.1013152",
      "doi": "10.1145/1013115.1013152"
    },
    {
      "text": "Giovanny Arbelaez Garces, Auguste Rakotondranaivo, and Eric Bonjour. 2016. An acceptability estimation and analysis methodology based on Bayesian networks. International Journal of Industrial Ergonomics 53 (2016), 245–256.",
      "doi": ""
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: cultural probes. interactions 6, 1 (1999), 21–29.",
      "doi": ""
    },
    {
      "text": "Tom Gayler, Corina Sas, and Vaiva Kalnikaitundefined. 2021. Sensory Probes: An Exploratory Design Research Method for Human-Food Interaction. Association for Computing Machinery, New York, NY, USA, 666–682. https://doi.org/10.1145/3461778.3462013",
      "doi": ""
    },
    {
      "text": "Kim Halskov and Peter Dalsgård. 2006. Inspiration card workshops. In Proceedings of the 6th conference on Designing Interactive systems. 2–11.",
      "doi": "10.1145/1142405.1142409"
    },
    {
      "text": "Susanne Hensely-Schinkinger, Aparecido Fabiano Pinatti de Carvalho, Michael Glanznig, and Hilda Tellioğlu. 2015. The definition and use of personas in the design of technologies for informal caregivers. In International Conference on Human-Computer Interaction. Springer, 202–213.",
      "doi": ""
    },
    {
      "text": "Godfrey Hochbaum, Irwin Rosenstock, and Stephen Kegels. 1952. Health belief model. United states public health service 1 (1952).",
      "doi": ""
    },
    {
      "text": "Mahsa Honary, Roisin McNaney, and Fiona Lobban. 2018. Designing Video Stories around the Lived Experience of Severe Mental Illness. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (Oslo, Norway) (NordiCHI ’18). Association for Computing Machinery, New York, NY, USA, 25–38. https://doi.org/10.1145/3240167.3240188",
      "doi": "10.1145/3240167.3240188"
    },
    {
      "text": "Kristina Höök and Jonas Löwgren. 2012. Strong concepts: Intermediate-level knowledge in interaction design research. ACM Transactions on Computer-Human Interaction (TOCHI) 19, 3(2012), 1–18.",
      "doi": "10.1145/2362364.2362371"
    },
    {
      "text": "Eva Hornecker. 2010. Creative idea exploration within the structure of a guiding framework: the card brainstorming game. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction. 101–108.",
      "doi": "10.1145/1709886.1709905"
    },
    {
      "text": "Chien-Lung Hsu, Ming-Ren Lee, and Chien-Hui Su. 2013. The role of privacy protection in healthcare information systems adoption. Journal of medical systems 37, 5 (2013), 1–12.",
      "doi": "10.1007/s10916-013-9966-z"
    },
    {
      "text": "Chung-Ching Huang and Erik Stolterman. 2011. Temporality in Interaction Design. In Proceedings of the 2011 Conference on Designing Pleasurable Products and Interfaces (Milano, Italy) (DPPI ’11). Association for Computing Machinery, New York, NY, USA, Article 62, 8 pages. https://doi.org/10.1145/2347504.2347572",
      "doi": "10.1145/2347504.2347572"
    },
    {
      "text": "Armağan Karahanoğlu and Yekta Bakırlıoğlu. 2020. Evaluation of the usefulness of path of long-term user experience model in design process. Behaviour & Information Technology(2020), 1–19.",
      "doi": ""
    },
    {
      "text": "Evangelos Karapanos, John Zimmerman, Jodi Forlizzi, and Jean-Bernard Martens. 2009. User Experience over Time: An Initial Framework. Association for Computing Machinery, New York, NY, USA, 729–738. https://doi.org/10.1145/1518701.1518814",
      "doi": ""
    },
    {
      "text": "Irni Eliana Khairuddin, Corina Sas, and Chris Speed. 2019. BlocKit: A Physical Kit for Materializing and Designing for Blockchain Infrastructure. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 1449–1462. https://doi.org/10.1145/3322276.3322370",
      "doi": "10.1145/3322276.3322370"
    },
    {
      "text": "Jeongeun Kim and Hyeoun-Ae Park. 2012. Development of a health information technology acceptance model using consumers’ health behavior intention. Journal of medical Internet research 14, 5 (2012), e133.",
      "doi": ""
    },
    {
      "text": "Sandjar Kozubaev, Chris Elsden, Noura Howell, Marie Louise Juul Søndergaard, Nick Merrill, Britta Schulte, and Richmond Y. Wong. 2020. Expanding Modes of Reflection in Design Futuring. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376526",
      "doi": "10.1145/3313831.3376526"
    },
    {
      "text": "David Ledo, Steven Houben, Jo Vermeulen, Nicolai Marquardt, Lora Oehlberg, and Saul Greenberg. 2018. Evaluation strategies for HCI toolkit research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3173574.3173610"
    },
    {
      "text": "Andrés Lucero and Juha Arrasvuori. 2010. PLEX Cards: A Source of Inspiration When Designing for Playfulness. In Proceedings of the 3rd International Conference on Fun and Games (Leuven, Belgium) (Fun and Games ’10). Association for Computing Machinery, New York, NY, USA, 28–37. https://doi.org/10.1145/1823818.1823821",
      "doi": "10.1145/1823818.1823821"
    },
    {
      "text": "Nikola Marangunić and Andrina Granić. 2015. Technology acceptance model: a literature review from 1986 to 2013. Universal access in the information society 14, 1 (2015), 81–95.",
      "doi": ""
    },
    {
      "text": "Nicola Marsden and Maren Haag. 2016. Stereotypes and politics: reflections on personas. In Proceedings of the 2016 CHI conference on human factors in computing systems. 4017–4031.",
      "doi": "10.1145/2858036.2858151"
    },
    {
      "text": "Nicolas Martin, Séverine Erhel, Éric Jamet, and Géraldine Rouxel. 2015. What links between user experience and acceptability?. In Proceedings of the 27th Conference on l’Interaction Homme-Machine. 1–6.",
      "doi": "10.1145/2820619.2825015"
    },
    {
      "text": "Mark Matthews, Geri Gay, and Gavin Doherty. 2014. Taking part: role-play in the design of therapeutic systems. In Proceedings of the SIGCHI conference on human factors in computing systems. 643–652.",
      "doi": "10.1145/2556288.2557103"
    },
    {
      "text": "Mark Matthews, Stephen Voida, Saeed Abdullah, Gavin Doherty, Tanzeem Choudhury, Sangha Im, and Geri Gay. 2015. In situ design for mental illness: Considering the pathology of bipolar disorder in mhealth design. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services. 86–97.",
      "doi": "10.1145/2785830.2785866"
    },
    {
      "text": "John McCarthy and Peter Wright. 2004. Technology as experience. interactions 11, 5 (2004), 42–43.",
      "doi": ""
    },
    {
      "text": "S McCarthy, P O’Raghallaigh, S Woodworth, YY Lim, LC Kenny, and F Adam. 2020. The “Integrated Patient Journey Map”: A Design Tool for Embedding the Pillars of Quality in Health Information Technology Solutions. JMIR Hum Factors (2020).",
      "doi": ""
    },
    {
      "text": "Jack Mezirow 1990. How critical reflection triggers transformative learning. Fostering critical reflection in adulthood 1, 20 (1990), 1–6.",
      "doi": ""
    },
    {
      "text": "Miro. 2021. Online Whiteboard for Visual Collaboration. https://miro.com/",
      "doi": ""
    },
    {
      "text": "Gary C Moore and Izak Benbasat. 1991. Development of an instrument to measure the perceptions of adopting an information technology innovation. Information systems research 2, 3 (1991), 192–222.",
      "doi": ""
    },
    {
      "text": "Florian Mueller, Martin R Gibbs, Frank Vetere, and Darren Edge. 2014. Supporting the creative game design process with exertion cards. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2211–2220.",
      "doi": "10.1145/2556288.2557272"
    },
    {
      "text": "Camille Nadal, Gavin Doherty, and Corina Sas. 2019. Technology acceptability, acceptance and adoption-definitions and measurement. In 2019 CHI Conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "Camille Nadal, Shane McCully, Kevin Doherty, Corina Sas, and Gavin Doherty. 2021. TAC Toolkit. http://ehealthacceptancedesign.com/",
      "doi": ""
    },
    {
      "text": "Camille Nadal, Corina Sas, and Gavin Doherty. 2020. Technology acceptance in mobile health: scoping review of definitions, models, and measurement. Journal of Medical Internet Research 22, 7 (2020), e17256.",
      "doi": ""
    },
    {
      "text": "Marcin Paska. 2021. The Aspect of Ethics Determined by Technological Impact. (2021).",
      "doi": ""
    },
    {
      "text": "Olga Perski and Camille E Short. 2021. Acceptability of digital health interventions: embracing the complexity. Translational Behavioral Medicine(2021).",
      "doi": ""
    },
    {
      "text": "Dorian Peters, Lian Loke, and Naseem Ahmadpour. 2020. Toolkits, cards and games–a review of analogue tools for collaborative ideation. CoDesign (2020), 1–25.",
      "doi": ""
    },
    {
      "text": "Claudette Pretorius, Darragh McCashin, Naoise Kavanagh, and David Coyle. 2020. Searching for mental health: a mixed-methods study of young people’s online help-seeking. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376328"
    },
    {
      "text": "Chengcheng Qu, Corina Sas, and Gavin Doherty. 2020. Reviewing and evaluating mobile apps for memory impairments in depression. In 25th annual international CyberPsychology, CyberTherapy & Social Networking Conference.",
      "doi": ""
    },
    {
      "text": "Amon Rapp, William Odom, Larissa Pschetz, and Daniela Petrelli. 2021. Introduction to the special issue on time and HCI. Human–Computer Interaction(2021), 1–14.",
      "doi": ""
    },
    {
      "text": "Everett M Rogers. 1983. Diffusion of innovations. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Antti Salovaara, Kristina Höök, Keith Cheverst, Michael Twidale, Matthew Chalmers, and Corina Sas. 2011. Appropriation and Creative Use: Linking User Studies and Design. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI EA ’11). Association for Computing Machinery, New York, NY, USA, 37–40. https://doi.org/10.1145/1979742.1979585",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Axel Janson, Pavel Karpashevich, Camille Nadal, Chengcheng Qu, Claudia Daudén Roquet, Muhammad Umair, Charles Windlin, Gavin Doherty, Kristina Höök, 2019. HCI and Affective Health: Taking stock of a decade of studies and charting future research directions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3290605.3300475"
    },
    {
      "text": "Corina Sas, Nigel Davies, Sarah Clinch, Peter Shaw, Mateusz Mikusz, Madeleine Steeds, and Lukas Nohrer. 2020. Supporting Stimulation Needs in Dementia Care through Wall-Sized Displays. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376361",
      "doi": "10.1145/3313831.3376361"
    },
    {
      "text": "Corina Sas, Kobi Hartley, and Muhammad Umair. 2020. ManneqKit cards: A kinesthetic empathic design tool communicating depression experiences. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 1479–1493.",
      "doi": "10.1145/3357236.3395556"
    },
    {
      "text": "Corina Sas and Carman Neustaedter. 2017. Exploring DIY practices of complex home technologies. ACM Transactions on Computer-Human Interaction (TOCHI) 24, 2(2017), 1–29.",
      "doi": "10.1145/3057863"
    },
    {
      "text": "Corina Sas, Steve Whittaker, Steven Dow, Jodi Forlizzi, and John Zimmerman. 2014. Generating implications for design through design research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1971–1980.",
      "doi": "10.1145/2556288.2557357"
    },
    {
      "text": "Corina Sas and Chenyan Zhang. 2010. Do Emotions Matter in Creative Design?. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (Aarhus, Denmark) (DIS ’10). Association for Computing Machinery, New York, NY, USA, 372–375. https://doi.org/10.1145/1858171.1858241",
      "doi": "10.1145/1858171.1858241"
    },
    {
      "text": "Israel Scheffler. 1981. In praise of the cognitive emotions. Thinking: the Journal of Philosophy for Children 3, 2 (1981), 16–23.",
      "doi": ""
    },
    {
      "text": "Eva-Maria Schomakers, Chantal Lidynia, and Martina Ziefle. 2019. Listen to my heart? How privacy concerns shape users’ acceptance of e-health technologies. In 2019 International Conference on Wireless and Mobile Computing, Networking and Communications (WiMob). IEEE, 306–311.",
      "doi": ""
    },
    {
      "text": "Mandeep Sekhon, Martin Cartwright, and Jill J Francis. 2017. Acceptability of healthcare interventions: an overview of reviews and development of a theoretical framework. BMC health services research 17, 1 (2017), 88.",
      "doi": ""
    },
    {
      "text": "Orit Shaer and Eva Hornecker. 2010. Tangible user interfaces: past, present, and future directions. Now Publishers Inc.",
      "doi": ""
    },
    {
      "text": "Vimal Sharma, Suvodeep Das, and Susheel Kewaley. 2015. Design Thing’ing: methodology for understanding and discovering Use cases in IoT scenarios. In Proceedings of the 7th International Conference on HCI, IndiaHCI 2015. 113–115.",
      "doi": "10.1145/2835966.2836280"
    },
    {
      "text": "Roger Silverstone and Eric Hirsch. 1992. Consuming technologies: Media and information in domestic spaces. Routledge.",
      "doi": ""
    },
    {
      "text": "Michael R Simonson, Matthew Maurer, Mary Montag-Torardi, and Mary Whitaker. 1987. Development of a standardized test of computer literacy and a computer anxiety index. Journal of educational computing research 3, 2 (1987), 231–247.",
      "doi": ""
    },
    {
      "text": "A Somat, E Jamet, G Menguy, JF Forzy, and M El-Jaafari. 2012. Acceptabilité individuelle, sociale & acceptation. Livrable L5 3(2012).",
      "doi": ""
    },
    {
      "text": "Dorothy Szinay, Olga Perski, Andy Jones, Tim Chadborn, Jamie Brown, and Felix Naughton. 2021. Influences on the Uptake of Health and Well-being Apps and Curated App Portals: Think-Aloud and Interview Study. JMIR mHealth and uHealth 9, 4 (2021), e27173.",
      "doi": ""
    },
    {
      "text": "Guillaume Tabourdeau and Camille Grange. 2020. From User Acceptance to Social Acceptance. (2020).",
      "doi": ""
    },
    {
      "text": "Shirley Taylor and Peter A Todd. 1995. Understanding information technology usage: A test of competing models. Information systems research 6, 2 (1995), 144–176.",
      "doi": ""
    },
    {
      "text": "Florence Terrade, Hélène Pasquier, Juliette Reerinck-Boulanger, Gérard Guingouain, and Alain Somat. 2009. L’acceptabilité sociale: la prise en compte des déterminants sociaux dans l’analyse de l’acceptabilité des systèmes technologiques. Le travail humain 72, 4 (2009), 383–395.",
      "doi": ""
    },
    {
      "text": "Muhammad Umair, Corina Sas, and Miquel Alfaras. 2020. ThermoPixels: Toolkit for Personalizing Arousal-Based Interfaces through Hybrid Crafting. Association for Computing Machinery, New York, NY, USA, 1017–1032. https://doi.org/10.1145/3357236.3395512",
      "doi": "10.1145/3357236.3395512"
    },
    {
      "text": "Thea M Van Der Geest and Hendrik P Buimer. 2015. User-centered priority setting for accessible devices and applications. In Mensch und Computer 2015–Workshopband. De Gruyter, 383–390.",
      "doi": ""
    },
    {
      "text": "Lex Van Velsen, Lisette van Gemert-Pijnen, Nicol Nijland, Desirée Beaujean, and Jim Van Steenbergen. 2012. Personas: The linking pin in holistic design for eHealth. In The Fourth International Conference on eHealth, Telemedicine, and Social Medicine (eTELEMED 2012), IARIA. 128–133.",
      "doi": ""
    },
    {
      "text": "Raphael Velt, Steve Benford, and Stuart Reeves. 2017. A survey of the trajectories conceptual framework: Investigating theory use in HCI. In Proceedings of the 2017 CHI conference on human factors in computing systems. 2091–2105.",
      "doi": "10.1145/3025453.3026022"
    },
    {
      "text": "Raphael Velt, Steve Benford, and Stuart Reeves. 2020. Translations and Boundaries in the Gap Between HCI Theory and Design Practice. ACM Transactions on Computer-Human Interaction (TOCHI) 27, 4(2020), 1–28.",
      "doi": "10.1145/3386247"
    },
    {
      "text": "Viswanath Venkatesh. 2000. Determinants of perceived ease of use: Integrating control, intrinsic motivation, and emotion into the technology acceptance model. Information systems research 11, 4 (2000), 342–365.",
      "doi": ""
    },
    {
      "text": "Viswanath Venkatesh and Hillol Bala. 2008. Technology acceptance model 3 and a research agenda on interventions. Decision sciences 39, 2 (2008), 273–315.",
      "doi": ""
    },
    {
      "text": "Viswanath Venkatesh and Fred D Davis. 1996. A model of the antecedents of perceived ease of use: Development and test. Decision sciences 27, 3 (1996), 451–481.",
      "doi": ""
    },
    {
      "text": "Viswanath Venkatesh and Fred D Davis. 2000. A theoretical extension of the technology acceptance model: Four longitudinal field studies. Management science 46, 2 (2000), 186–204.",
      "doi": "10.5555/2786232.2786234"
    },
    {
      "text": "Viswanath Venkatesh, Michael G Morris, Gordon B Davis, and Fred D Davis. 2003. User acceptance of information technology: Toward a unified view. MIS quarterly (2003), 425–478.",
      "doi": "10.5555/2017197.2017202"
    },
    {
      "text": "Viswanath Venkatesh, James YL Thong, and Xin Xu. 2012. Consumer acceptance and use of information technology: extending the unified theory of acceptance and use of technology. MIS quarterly (2012), 157–178.",
      "doi": ""
    },
    {
      "text": "Sandra Vosbergen, JMR Mulder-Wiggers, JP Lacroix, HMC Kemps, Roderik A Kraaijenhagen, Monique WM Jaspers, and Niels Peek. 2015. Using personas to tailor educational messages to the preferences of coronary heart disease patients. Journal of biomedical informatics 53 (2015), 100–112.",
      "doi": "10.1016/j.jbi.2014.09.004"
    },
    {
      "text": "Annika Waern, Paulina Rajkowska, Karin B Johansson, Jon Bac, Jocelyn Spence, and Anders Sundnes Løvlie. 2020. Sensitizing Scenarios: Sensitizing Designer Teams to Theory. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376620"
    },
    {
      "text": "Pontus Wärnestål, Petra Svedberg, Susanne Lindberg, and Jens M Nygren. 2017. Effects of using child personas in the development of a digital peer support service for childhood cancer survivors. Journal of medical Internet research 19, 5 (2017), e161.",
      "doi": ""
    },
    {
      "text": "Bard O Wartena and Hylke W van Dijk. 2013. Bias Blaster–aiding cognitive bias modification-interpretation through a bubble shooter induced gameflow. In Games for health. Springer, 47–60.",
      "doi": ""
    },
    {
      "text": "Jane Webster and Joseph J Martocchio. 1992. Microcomputer playfulness: Development of a measure with workplace implications. MIS quarterly (1992), 201–226.",
      "doi": ""
    },
    {
      "text": "Richard M Young and Phil Barnard. 1986. The use of scenarios in human-computer interaction research: Turbocharging the tortoise of cumulative science. In Proceedings of the SIGCHI/GI conference on Human factors in computing systems and graphics interface. 291–296.",
      "doi": "10.1145/30851.275645"
    }
  ]
}