{
  "doi": "10.1145/3491102.3517617",
  "title": "Monitoring Pets, Deterring Intruders, and Casually Spying on Neighbors: Everyday Uses of Smart Home Cameras",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-25",
  "year": 2022,
  "badges": [],
  "abstract": "The increased adoption of smart home cameras (SHCs) foregrounds issues of surveillance, power, and privacy in homes and neighborhoods. However, questions remain about how people are currently using these devices to monitor and surveil, what the benefits and limitations are for users, and what privacy and security tensions arise between primary users and other stakeholders. We present an empirical study with 14 SHC users to understand how these devices are used and integrated within everyday life. Based on semi-structured qualitative interviews, we investigate users’ motivations, practices, privacy concerns, and social negotiations. Our findings highlight the SHC as a perceptually powerful and spatially sensitive device that enables a variety of surveillant uses outside of basic home security—from formally surveilling domestic workers, to casually spying on neighbors, to capturing memories. We categorize surveillant SHC uses, clarify distinctions between primary and non-primary users, and highlight under-considered design directions for addressing power imbalances among primary and non-primary users.",
  "authors": [
    {
      "name": "Neilly H. Tan",
      "institution": "Human Centered Design and Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659897752",
      "orcid": "missing"
    },
    {
      "name": "Richmond Y. Wong",
      "institution": "Center for Long-Term Cybersecurity, University of California Berkeley, United States",
      "img": "/do/10.1145/contrib-99658688813/rel-imgonly/glasses_profile_pic_square.jpg",
      "acmid": "99658688813",
      "orcid": "0000-0001-8613-0380"
    },
    {
      "name": "Audrey Desjardins",
      "institution": "School of Art + Art History + Design, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484656227",
      "orcid": "0000-0002-1980-1292"
    },
    {
      "name": "Sean A. Munson",
      "institution": "Human Centered Design & Engineering, University of Washington, United States",
      "img": "/do/10.1145/contrib-81416604516/rel-imgonly/12239463_533957215446_4643031366914155723_n.jpg",
      "acmid": "81416604516",
      "orcid": "0000-0002-0472-6138"
    },
    {
      "name": "James Pierce",
      "institution": "School of Art + Art History + Design, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100303073",
      "orcid": "0000-0002-2192-1728"
    }
  ],
  "references": [
    {
      "text": "William Ablondi. 2018. Smart Home Reports. Strategy Analytics. Retrieved from https://www.strategyanalytics.com/access-services/devices/connected-home/smart-home/reports/report-detail/global-smart-home-surveillance-camera-market-forecast-2012-to-2023?slid=918459&spg=4",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti, Idris Adjerid, Rebecca Balebako, Laura Brandimarte, Lorrie Faith Cranor, Saranga Komanduri, Pedro Giovanni Leon, Norman Sadeh, Florian Schaub, Manya Sleeper, and others. 2017. Nudges for privacy and security: Understanding and assisting users’ choices online. ACM Comput. Surv. CSUR 50, 3 (2017), 1–41.",
      "doi": "10.1145/3054926"
    },
    {
      "text": "Shane Ahern, Dean Eckles, Nathaniel S Good, Simon King, Mor Naaman, and Rahul Nair. 2007. Over-exposed? Privacy patterns and considerations in online and mobile photo sharing. In Proceedings of the SIGCHI conference on Human factors in computing systems, 357–366.",
      "doi": "10.1145/1240624.1240683"
    },
    {
      "text": "Imtiaz Ahmad, Rosta Farzan, Apu Kapadia, and Adam J Lee. 2020. Tangible privacy: Towards user-centric sensor designs for bystander privacy. Proc. ACM Hum.-Comput. Interact. 4, CSCW2 (2020), 1–28.",
      "doi": "10.1145/3415187"
    },
    {
      "text": "Ryan Aipperspach, Ben Hooker, and Allison Woodruff. 2008. The heterogeneous home. In Proceedings of the 10th international conference on Ubiquitous computing, 222–231.",
      "doi": "10.1145/1409635.1409666"
    },
    {
      "text": "Tawfiq Ammari, Jofish Kaye, Janice Y. Tsai, and Frank Bentley. 2019. Music, Search, and IoT: How People (Really) Use Voice Assistants. ACM Trans. Comput.-Hum. Interact. 26, 3 (June 2019), 1–28.",
      "doi": "10.1145/3311956"
    },
    {
      "text": "Louise Amoore. 2020. Cloud ethics. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Mike Ananny and Kate Crawford. 2018. Seeing without knowing: Limitations of the transparency ideal and its application to algorithmic accountability. New Media Soc. 20, 3 (2018), 973–989.",
      "doi": ""
    },
    {
      "text": "Solon Barocas and Karen Levy. 2020. Privacy Dependencies. Wash. Law Rev. 95, 2 (June 2020), 555.",
      "doi": ""
    },
    {
      "text": "Eric PS Baumer. 2015. Reflective informatics: conceptual dimensions for designing technologies of reflection. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 585–594.",
      "doi": "10.1145/2702123.2702234"
    },
    {
      "text": "Eric P.S. Baumer. 2015. Usees. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, Seoul Republic of Korea, 3295–3298.",
      "doi": ""
    },
    {
      "text": "Eric PS Baumer, Phil Adams, Vera D Khovanskaya, Tony C Liao, Madeline E Smith, Victoria Schwanda Sosik, and Kaiton Williams. 2013. Limiting, leaving, and (re) lapsing: an exploration of facebook non-use practices and experiences. In Proceedings of the SIGCHI conference on human factors in computing systems, 3257–3266.",
      "doi": "10.1145/2470654.2466446"
    },
    {
      "text": "Rosanna Bellini, Angelika Strohmayer, Patrick Olivier, and Clara Crivellaro. 2019. Mapping the Margins: Navigating the Ecologies of Domestic Violence Service Provision. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, Glasgow Scotland Uk, 1–13.",
      "doi": "10.1145/3290605.3300352"
    },
    {
      "text": "Erin Beneteau, Yini Guan, Olivia K. Richards, Mingrui Ray Zhang, Julie A. Kientz, Jason Yip, and Alexis Hiniker. 2020. Assumptions Checked: How Families Learn About and Use the Echo Dot. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 1 (March 2020), 1–23.",
      "doi": "10.1145/3380993"
    },
    {
      "text": "Jesse Josua Benjamin, Arne Berger, Nick Merrill, and James Pierce. 2021. Machine Learning Uncertainty as a Design Material: A Post-Phenomenological Inquiry. Proc. 2021 CHI Conf. Hum. Factors Comput. Syst. (May 2021), 1–14.",
      "doi": "10.1145/3411764.3445481"
    },
    {
      "text": "Frank Bentley, Chris Luvogt, Max Silverman, Rushani Wirasinghe, Brooke White, and Danielle Lottridge. 2018. Understanding the Long-Term Use of Smart Speaker Assistants. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 3 (September 2018), 1–24.",
      "doi": "10.1145/3264901"
    },
    {
      "text": "Francine Berman and Vinton G. Cerf. 2017. Social and ethical behavior in the internet of things. Commun. ACM 60, 2 (January 2017), 6–7.",
      "doi": "10.1145/3036698"
    },
    {
      "text": "Clara Berridge, Jodi Halpern, and Karen Levy. 2019. Cameras on beds: The ethics of surveillance in nursing home rooms. AJOB Empir. Bioeth. 10, 1 (January 2019), 55–62.",
      "doi": ""
    },
    {
      "text": "Susanne Bødker. 2006. When second wave HCI meets third wave challenges. In Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles, 1–8.",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Nellie Bowles. 2018. Thermostats, Locks and Lights: Digital Tools of Domestic Abuse. The New York Times. Retrieved from https://www.nytimes.com/2018/06/23/technology/smart-home-devices-domestic-abuse.html",
      "doi": ""
    },
    {
      "text": "Phoebe Braithwaite. 2018. Smart home tech is being turned into a tool for domestic abuse. Wired UK. Retrieved from https://www.wired.co.uk/article/internet-of-things-smart-home-domestic-abuse",
      "doi": ""
    },
    {
      "text": "Simone Browne. 2015. Dark Matters: On the Surveillance of Blackness. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Jed R. Brubaker, Gina Venolia, and John C. Tang. 2012. Focusing on shared experiences: moving beyond the camera in video communication. In Proceedings of the Designing Interactive Systems Conference on - DIS ’12, ACM Press, Newcastle Upon Tyne, United Kingdom, 96.",
      "doi": ""
    },
    {
      "text": "AJ Bernheim Brush, Jaeyeon Jung, Ratul Mahajan, and Frank Martinez. 2013. Digital neighborhood watch: Investigating the sharing of camera data amongst neighbors. In Proceedings of the 2013 conference on Computer supported cooperative work, 693–700.",
      "doi": "10.1145/2441776.2441853"
    },
    {
      "text": "A.J. Bernheim Brush, Bongshin Lee, Ratul Mahajan, Sharad Agarwal, Stefan Saroiu, and Colin Dixon. 2011. Home automation in the wild: challenges and opportunities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, Vancouver BC Canada, 2115–2124.",
      "doi": ""
    },
    {
      "text": "Taina Bucher. 2012. Want to be on the top? Algorithmic power and the threat of invisibility on Facebook. New Media Soc. 14, 7 (2012), 1164–1180.",
      "doi": ""
    },
    {
      "text": "Will Burns. 2018. The “Nestie Awards” From Nest Is A Content Idea Firing On All Cylinders. Forbes. Retrieved from https://www.forbes.com/sites/willburns/2018/03/02/the-nestie-awards-from-nest-is-a-content-idea-firing-on-all-cylinders/",
      "doi": ""
    },
    {
      "text": "George Chalhoub, Ivan Flechais, Norbert Nthala, and Ruba Abu-Salma. 2020. Innovation inaction or in action? the role of user experience in the security and privacy design of smart home cameras. In Sixteenth Symposium on Usable Privacy and Security (SOUPS 2020), 185–204.",
      "doi": ""
    },
    {
      "text": "George Chalhoub, Martin J Kraemer, Norbert Nthala, and Ivan Flechais. 2021. “It did not give me an option to decline”: A Longitudinal Analysis of the User Experience of Security and Privacy in Smart Home Products. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–16.",
      "doi": "10.1145/3411764.3445691"
    },
    {
      "text": "Yuxin Chen, Huiying Li, Shan-Yuan Teng, Steven Nagels, Zhijing Li, Pedro Lopes, Ben Y Zhao, and Haitao Zheng. 2020. Wearable microphone jamming. In Proceedings of the 2020 chi conference on human factors in computing systems, 1–12.",
      "doi": "10.1145/3313831.3376304"
    },
    {
      "text": "Yu-Ting Cheng, Mathias Funk, Wenn-Chieh Tsai, and Lin-Lin Chen. 2019. Peekaboo Cam: Designing an Observational Camera for Home Ecologies Concerning Privacy. In Proceedings of the 2019 on Designing Interactive Systems Conference, ACM, San Diego CA USA, 823–836.",
      "doi": "10.1145/3322276.3323699"
    },
    {
      "text": "Marshini Chetty, Ja-Young Sung, and Rebecca E. Grinter. 2007. How Smart Homes Learn: The Evolution of the Networked Home and Household. In UbiComp 2007: Ubiquitous Computing, John Krumm, Gregory D. Abowd, Aruna Seneviratne and Thomas Strang (eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 127–144.",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Sunny Consolvo, Jaeyeon Jung, Beverly Harrison, and Julie A. Kientz. 2011. Living in a glass house: a survey of private moments in the home. In Proceedings of the 13th international conference on Ubiquitous computing - UbiComp ’11, ACM Press, Beijing, China, 41.",
      "doi": ""
    },
    {
      "text": "Danielle Keats Citron. 2014. Hate crimes in cyberspace. Harvard University Press.",
      "doi": "10.5555/3051927"
    },
    {
      "text": "Andy Crabtree, Peter Tolmie, and Will Knight. 2017. Repacking ‘Privacy’ for a Networked World. Comput. Support. Coop. Work CSCW 26, 4 (December 2017), 453–488.",
      "doi": "10.1007/s10606-017-9276-y"
    },
    {
      "text": "Kate Crawford. 2021. Atlas of AI: Power, Politics, and the Planetary Costs of Artificial Intelligence. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Christopher Dandeker. 2006. Surveillance and Military Transformation: Organizational Trends in Twenty First Century Armed Services. New Polit. Surveill. Visibility (2006), 225–249.",
      "doi": ""
    },
    {
      "text": "Dries De Roeck, Karin Slegers, Johan Criel, Marc Godon, Laurence Claeys, Katriina Kilpi, and An Jacobs. 2012. I would DiYSE for it! A manifesto for do-it-yourself internet-of-things creation. In NordiCHI ’12 Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design, AMC, 170–179.",
      "doi": "10.1145/2399016.2399044"
    },
    {
      "text": "Gilles Deleuze. 1992. Postscript on the Societies of Control. October 59, (1992), 3–7.",
      "doi": ""
    },
    {
      "text": "George Demiris, Brian K Hensel, Marjorie Skubic, and Marilyn Rantz. 2008. Senior residents’ perceived need of and preferences for “smart home” sensor technologies. Int. J. Technol. Assess. Health Care 24, 1 (2008), 120–124.",
      "doi": ""
    },
    {
      "text": "Tamara Denning, Zakariya Dehlawi, and Tadayoshi Kohno. 2014. In situ with bystanders of augmented reality glasses: perspectives on recording and privacy-mediating technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, Toronto Ontario Canada, 2377–2386.",
      "doi": "10.1145/2556288.2557352"
    },
    {
      "text": "Audrey Desjardins, Jeremy E. Viny, Cayla Key, and Nouela Johnston. 2019. Alternative Avenues for IoT: Designing with Non-Stereotypical Homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, ACM Press, Glasgow, Scotland Uk, 1–13.",
      "doi": "10.1145/3290605.3300581"
    },
    {
      "text": "Paul Dourish and Genevieve Bell. 2011. Divining a digital future: Mess and mythology in ubiquitous computing. Mit Press.",
      "doi": "10.5555/2018772"
    },
    {
      "text": "Serge Egelman and Eyal Peer. 2015. The Myth of the Average User: Improving Privacy and Security Systems through Individualization. In Proceedings of the 2015 New Security Paradigms Workshop, ACM, Twente Netherlands, 16–28.",
      "doi": "10.1145/2841113.2841115"
    },
    {
      "text": "Daniel Fallman. 2011. The new good: exploring the potential of philosophy of technology to contribute to human-computer interaction. In Proceedings of the SIGCHI conference on human factors in computing systems, 1051–1060.",
      "doi": "10.1145/1978942.1979099"
    },
    {
      "text": "Michel Foucault. 2012. Discipline and punish: The birth of the prison. Vintage.",
      "doi": ""
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2018. “A Stalker's Paradise”: How Intimate Partner Abusers Exploit Technology. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–13.",
      "doi": "10.1145/3173574.3174241"
    },
    {
      "text": "Alisa Frik, Leysan Nurgalieva, Julia Bernd, Joyce Lee, Florian Schaub, and Serge Egelman. 2019. Privacy and security threat models and mitigation strategies of older adults. In Fifteenth Symposium on Usable Privacy and Security (SOUPS 2019), 21–40.",
      "doi": ""
    },
    {
      "text": "Ester Fritsch, Irina Shklovski, and Rachel Douglas-Jones. 2018. Calling for a Revolution: An Analysis of IoT Manifestos. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–13.",
      "doi": "10.1145/3173574.3173876"
    },
    {
      "text": "Christian Fuchs. 2010. How Can Surveillance Be Defined? Remarks on Theoretical Foundations of Surveillance Studies. The Internet (2010), 24.",
      "doi": ""
    },
    {
      "text": "Kit Galloway and Sherrie Rabinowitz. A Hole-In-Space, 1980. Retrieved from http://www.ecafe.com/getty/HIS/index.html",
      "doi": ""
    },
    {
      "text": "William W Gaver. 2006. The video window: my life with a ludic system. Pers. Ubiquitous Comput. 10, 2–3 (2006), 60–65.",
      "doi": "10.1007/s00779-005-0002-2"
    },
    {
      "text": "William W. Gaver, John Bowers, Kirsten Boehner, Andy Boucher, David W.T. Cameron, Mark Hauenstein, Nadine Jarvis, and Sarah Pennington. 2013. Indoor weather stations: investigating a ludic approach to environmental HCI through batch prototyping. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, Paris France, 3451–3460.",
      "doi": "10.1145/2470654.2466474"
    },
    {
      "text": "Timnit Gebru, Jamie Morgenstern, Briana Vecchione, Jennifer Wortman Vaughan, Hanna Wallach, Hal Daumé III, and Kate Crawford. 2018. Datasheets for datasets. ArXiv Prepr. ArXiv180309010 (2018).",
      "doi": ""
    },
    {
      "text": "Christine Geeng and Franziska Roesner. 2019. Who's In Control?: Interactions In Multi-User Smart Homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, Glasgow Scotland Uk, 1–13.",
      "doi": "10.1145/3290605.3300498"
    },
    {
      "text": "Chris Gilliard and David Golumbia. 2021. Luxury Surveillance. Real Life. Retrieved from https://reallifemag.com/luxury-surveillance/",
      "doi": ""
    },
    {
      "text": "Barney G Glaser and Anselm L Strauss. 2017. Discovery of grounded theory: Strategies for qualitative research. Routledge.",
      "doi": ""
    },
    {
      "text": "Jake Goldenfein, Deirdre K Mulligan, Helen Nissenbaum, and Wendy Ju. 2020. Through the Handoff Lens: Competing Visions of Autonomous Futures. Berkeley Tech LJ 35, (2020), 835.",
      "doi": ""
    },
    {
      "text": "Ellen P Goodman and Julia Powles. 2019. Urbanism under Google: Lessons from Sidewalk Toronto. Fordham Rev 88, (2019), 457.",
      "doi": ""
    },
    {
      "text": "Stephen Graham and David Wood. 2003. Digitizing Surveillance: Categorization, Space, Inequality. Crit. Soc. Policy 23, 2 (May 2003), 227–248.",
      "doi": ""
    },
    {
      "text": "Colin M Gray, Cristiana Santos, Nataliia Bielova, Michael Toth, and Damian Clifford. 2021. Dark patterns and the legal requirements of consent banners: An interaction criticism perspective. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–18.",
      "doi": "10.1145/3411764.3445779"
    },
    {
      "text": "Byung-Chul Han. 2017. In the swarm: Digital prospects. MIT Press.",
      "doi": ""
    },
    {
      "text": "Jenny Hansson. Fearless feline chases coyote in Portland neighborhood. KOIN.com. Retrieved from https://www.koin.com/news/animals/fearless-feline-chases-coyote-in-portland-neighborhood/",
      "doi": ""
    },
    {
      "text": "Woodrow Hartzog. 2018. Privacy's blueprint. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Adam Harvey. 2020. CV Dazzle: Computer Vision Dazzle Camouflage. Retrieved from https://cvdazzle.com/",
      "doi": ""
    },
    {
      "text": "Harry Hochheiser, Jinjuan Feng, and Jonathan Lazar. 2008. Challenges in universally usable privacy and security. In Symposium On Usable Privacy and Security (SOUPS).",
      "doi": ""
    },
    {
      "text": "Sun-ha Hong. 2020. Technologies of Speculation. New York University Press.",
      "doi": ""
    },
    {
      "text": "Heather A Horst, Cherry Baylosis, and Sheba Mohammid. 2021. Looking professional: How women decide what to wear with and through automated technologies. Convergence 27, 5 (October 2021), 1250–1263.",
      "doi": ""
    },
    {
      "text": "Roberto Hoyle, Robert Templeman, Steven Armes, Denise Anthony, David Cr, and All Apu Kapadia. Privacy Behaviors of Lifeloggers using Wearable Cameras. UbiComp, 571–582.",
      "doi": ""
    },
    {
      "text": "Tung-Hui Hu. 2015. A Prehistory of the Cloud. MIT press.",
      "doi": ""
    },
    {
      "text": "Don Ihde. 1990. Technology and the lifeworld: From garden to earth. (1990).",
      "doi": ""
    },
    {
      "text": "Alan Jacobs. Attending to Technology: Theses for Disputation. The New Atlantis. Retrieved from https://www.thenewatlantis.com/publications/attending-to-technology-theses-for-disputation",
      "doi": ""
    },
    {
      "text": "Steven Johnson, Irene Rae, Bilge Mutlu, and Leila Takayama. 2015. Can You See Me Now?: How Field of View Affects Collaboration in Robotic Telepresence. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, Seoul Republic of Korea, 2397–2406.",
      "doi": "10.1145/2702123.2702526"
    },
    {
      "text": "Daniel Kahneman. 2011. Thinking, Fast and Slow. Macmillan.",
      "doi": ""
    },
    {
      "text": "Evangelos Karapanos, Rúben Gouveia, Marc Hassenzahl, and Jodi Forlizzi. 2016. Wellbeing in the making: peoples’ experiences with wearable activity trackers. Psychol. Well-Being 6, 1 (2016), 1–17.",
      "doi": ""
    },
    {
      "text": "Lauren Kilgour. 2020. The ethics of aesthetics: Stigma, information, and the politics of electronic ankle monitor design. Inf. Soc. 36, 3 (May 2020), 131–146.",
      "doi": ""
    },
    {
      "text": "Vinay Koshy, Joon Sung Sung Park, Ti-Chung Cheng, and Karrie Karahalios. 2021. “We Just Use What They Give Us”: Understanding Passenger User Perspectives in Smart Homes. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–14.",
      "doi": "10.1145/3411764.3445598"
    },
    {
      "text": "Sandjar Kozubaev, Fernando Rochaix, Carl DiSalvo, and Christopher A. Le Dantec. 2019. Spaces and Traces: Implications of Smart Technology in Public Housing. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, Glasgow Scotland Uk, 1–13.",
      "doi": ""
    },
    {
      "text": "Joshua A Kroll, Joanna Huey, Solon Barocas, Edward W Felten, Joel R Reidenberg, David G Robinson, and Harlan Yu. Accountable Algorithms. Univ. Pa. Law Rev. 165, 74.",
      "doi": ""
    },
    {
      "text": "Josephine Lau, Benjamin Zimmerman, and Florian Schaub. 2018. Alexa, Are You Listening?: Privacy Perceptions, Concerns and Privacy-seeking Behaviors with Smart Speakers. Proc. ACM Hum.-Comput. Interact. 2, CSCW (November 2018), 1–31.",
      "doi": "10.1145/3274371"
    },
    {
      "text": "Roxanne Leitão. 2018. Digital Technologies and their Role in Intimate Partner Violence. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–6.",
      "doi": "10.1145/3170427.3180305"
    },
    {
      "text": "Melissa Lemieux. 2019. Watch the Viral Video of a Small Boy Filling an Empty Trick-or-Treat Bowl With His Halloween Candy. Newsweek. Retrieved from https://www.newsweek.com/watch-viral-video-small-boy-filling-empty-trick-treat-bowl-his-halloween-candy-1469331",
      "doi": ""
    },
    {
      "text": "Karen E C Levy. 2014. Intimate Surveillance. Ida. Law Rev. 51, (2014), 679.",
      "doi": ""
    },
    {
      "text": "Yanni Alexander Loukissas. 2019. All data are local: Thinking critically in a data-driven society. MIT Press.",
      "doi": ""
    },
    {
      "text": "Dominique Machuletz, Henrik Sendt, Stefan Laube, and Rainer Böhme. 2016. Users protect their privacy if they can: Determinants of webcam covering behavior. In Proceedings of the European Workshop on Usable Security at the Privacy Enhaning Technologies Symposium (EuroSEC’16)(EuroUSEC’16). Internet Society, Reston, VA.",
      "doi": ""
    },
    {
      "text": "Nathan Malkin, Joe Deatrick, Allen Tong, Primal Wijesekera, Serge Egelman, and David Wagner. 2019. Privacy Attitudes of Smart Speaker Users. Proc. Priv. Enhancing Technol. 2019, 4 (October 2019), 250–271.",
      "doi": ""
    },
    {
      "text": "Shrirang Mare, Franziska Roesner, and Tadayoshi Kohno. 2020. Smart Devices in Airbnbs: Considering Privacy and Security for both Guests and Hosts. Proc. Priv. Enhancing Technol. 2020, 2 (April 2020), 436–458.",
      "doi": ""
    },
    {
      "text": "Tara Matthews, Kathleen O'Leary, Anna Turner, Manya Sleeper, Jill Palzkill Woelfer, Martin Shelton, Cori Manthorne, Elizabeth F. Churchill, and Sunny Consolvo. 2017. Stories from Survivors: Privacy & Security Practices when Coping with Intimate Partner Abuse. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, ACM, Denver Colorado USA, 2189–2201.",
      "doi": "10.1145/3025453.3025875"
    },
    {
      "text": "Emily McReynolds, Sarah Hubbard, Timothy Lau, Aditya Saraf, Maya Cakmak, and Franziska Roesner. 2017. Toys that Listen: A Study of Parents, Children, and Internet-Connected Toys. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, ACM, Denver Colorado USA, 5197–5207.",
      "doi": "10.1145/3025453.3025735"
    },
    {
      "text": "Sarah Mennicken and Elaine M Huang. 2012. Hacking the natural habitat: an in-the-wild study of smart homes, their development, and the people who live in them. In International conference on pervasive computing, Springer, 143–160.",
      "doi": "10.1007/978-3-642-31205-2_10"
    },
    {
      "text": "Jochen Meyer, Jochen Schnauber, Wilko Heuten, Harm Wienbergen, Rainer Hambrecht, Hans-Jürgen Appelrath, and Susanne Boll. 2016. Exploring Longitudinal Use of Activity Trackers. In 2016 IEEE International Conference on Healthcare Informatics (ICHI), IEEE, 198–206.",
      "doi": ""
    },
    {
      "text": "Matthew B Miles and A Michael Huberman. 1994. Qualitative data analysis: An expanded sourcebook. sage.",
      "doi": ""
    },
    {
      "text": "Elizabeth C Nelson, Tibert Verhagen, and Matthijs L Noordzij. 2016. Health empowerment through activity trackers: An empirical smart wristband study. Comput. Hum. Behav. 62, (2016), 364–374.",
      "doi": "10.1016/j.chb.2016.03.065"
    },
    {
      "text": "Helen Nissenbaum. 2004. Privacy as contextual integrity. Wash Rev 79, (2004), 119.",
      "doi": ""
    },
    {
      "text": "William Odom. 2015. Understanding Long-Term Interactions with a Slow Technology: an Investigation of Experiences with FutureMe. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, Seoul Republic of Korea, 575–584.",
      "doi": "10.1145/2702123.2702221"
    },
    {
      "text": "Antti Oulasvirta, Aurora Pihlajamaa, Jukka Perkiö, Debarshi Ray, Taneli Vähäkangas, Tero Hasu, Niklas Vainio, and Petri Myllymäki. 2012. Long-term effects of ubiquitous surveillance in the home. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing, 41–50.",
      "doi": "10.1145/2370216.2370224"
    },
    {
      "text": "Kentrell Owens, Camille Cobb, and Lorrie Cranor. 2021. “You Gotta Watch What You Say”: Surveillance of Communication with Incarcerated People. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–18.",
      "doi": "10.1145/3411764.3445055"
    },
    {
      "text": "Seung-min Park, Daeyoun D Won, Brian J Lee, Diego Escobedo, Andre Esteva, Amin Aalipour, T Jessie Ge, Jung Ha Kim, Susie Suh, Elliot H Choi, and others. 2020. A mountable toilet system for personalized health monitoring via the analysis of excreta. Nat. Biomed. Eng. 4, 6 (2020), 624–635.",
      "doi": ""
    },
    {
      "text": "S Tejaswi Peesapati, Victoria Schwanda, Johnathon Schultz, Matt Lepage, So-yae Jeong, and Dan Cosley. 2010. Pensieve: supporting everyday reminiscence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2027–2036.",
      "doi": "10.1145/1753326.1753635"
    },
    {
      "text": "James Pierce. 2012. Undesigning technology: considering the negation of design by design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 957–966.",
      "doi": "10.1145/2207676.2208540"
    },
    {
      "text": "James Pierce. 2019. Smart Home Security Cameras and Shifting Lines of Creepiness: A Design-Led Inquiry. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3290605.3300275"
    },
    {
      "text": "James Pierce, Richmond Y. Wong, and Nick Merrill. 2020. Sensor Illumination: Exploring Design Qualities and Ethical Implications of Smart Cameras and Image/Video Analytics. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, ACM, Honolulu HI USA, 1–19.",
      "doi": "10.1145/3313831.3376347"
    },
    {
      "text": "Irene Rae, Gina Venolia, John C. Tang, and David Molnar. 2015. A Framework for Understanding and Designing Telepresence. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, Vancouver BC Canada, 1552–1566.",
      "doi": "10.1145/2675133.2675141"
    },
    {
      "text": "Horst WJ Rittel and Melvin M Webber. 1974. Wicked Problems. Man-Made Futur. 26, 1 (1974), 272–280.",
      "doi": ""
    },
    {
      "text": "Gilad Rosner and Erin Kenneally. 2018. Clearly opaque: Privacy risks of the internet of things. In Rosner, Gilad and Kenneally, Erin, Clearly Opaque: Privacy Risks of the Internet of Things (May 1, 2018). IoT Privacy Forum.",
      "doi": ""
    },
    {
      "text": "James B Rule. 2007. Privacy in peril: How we are sacrificing a fundamental right in exchange for security and convenience. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Vasiliki Tsaknaki, Asreen Rostami, and Barry Brown. 2020. Under Surveillance: Technology Practices of those Monitored by the State. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, ACM, Honolulu HI USA, 1–13.",
      "doi": "10.1145/3313831.3376889"
    },
    {
      "text": "Christine Satchell and Paul Dourish. 2009. Beyond the user: use and non-use in HCI. In Proceedings of the 21st annual conference of the Australian computer-human interaction special interest group: Design: Open 24/7, 9–16.",
      "doi": "10.1145/1738826.1738829"
    },
    {
      "text": "Johann Schrammel, Christina Köffel, and Manfred Tscheligi. 2009. Personality traits, usage patterns and information disclosure in online communities. In In BCS HCI ’09: Proceedings of the 2009 British Computer Society Conference on Human-Computer Interaction, 169–174.",
      "doi": ""
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph'Jofish’ Kaye. 2005. Reflective Design. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility, 49–58.",
      "doi": ""
    },
    {
      "text": "William Seymour, Reuben Binns, Petr Slovak, Max Van Kleek, and Nigel Shadbolt. 2020. Strangers in the Room: Unpacking Perceptions of “Smartness” and Related Ethical Concerns in the Home. In Proceedings of the 2020 ACM Designing Interactive Systems Conference, ACM, Eindhoven Netherlands, 841–854.",
      "doi": "10.1145/3357236.3395501"
    },
    {
      "text": "Mark Shepard. Sentient City Survival Kit. Retrieved March 9, 2022 from http://survival.sentientcity.net/umbrella.html",
      "doi": ""
    },
    {
      "text": "Samarth Singhal, Carman Neustaedter, Thecla Schiphorst, Anthony Tang, Abhisekh Patra, and Rui Pan. 2016. You are Being Watched: Bystanders’ Perspective on the Use of Camera Devices in Public Spaces. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, ACM, San Jose California USA, 3197–3203.",
      "doi": "10.1145/2851581.2892522"
    },
    {
      "text": "Robert H Sloan and Richard Warner. 2014. Beyond notice and choice: Privacy, norms, and consent. J High Tech L 14, (2014), 370.",
      "doi": ""
    },
    {
      "text": "Daniel J Solove. 2012. Introduction: Privacy self-management and the consent dilemma. Harv Rev 126, (2012), 1880.",
      "doi": ""
    },
    {
      "text": "Anne Spaa, Abigail Durrant, Chris Elsden, and John Vines. 2019. Understanding the Boundaries between Policymaking and HCI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1–15.",
      "doi": "10.1145/3290605.3300314"
    },
    {
      "text": "Luke Stark and Karen Levy. 2018. The surveillant consumer. Media Cult. Soc. 40, 8 (November 2018), 1202–1220.",
      "doi": ""
    },
    {
      "text": "Yolande Strengers, Jenny Kennedy, Paula Arcari, Larissa Nicholls, and Melissa Gregg. 2019. Protection, Productivity and Pleasure in the Smart Home: Emerging Expectations and Gendered Insights from Australian Early Adopters. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, Glasgow Scotland Uk, 1–13.",
      "doi": "10.1145/3290605.3300875"
    },
    {
      "text": "Tactical Tech. The Glass Room – Looking into your online life. Retrieved from https://www.theglassroom.org/en/home/",
      "doi": ""
    },
    {
      "text": "Marc Teyssier, Marion Koelle, Paul Strohmeier, Bruno Fruchard, and Jürgen Steimle. 2021. Eyecam: Revealing Relations between Humans and Sensing Devices through an Anthropomorphic Webcam. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–13.",
      "doi": "10.1145/3411764.3445491"
    },
    {
      "text": "Emily Troshynski, Charlotte Lee, and Paul Dourish. 2011. Accountabilities of presence: reframing location-based systems. Droit Cult. Rev. Int. Interdiscip. 61 (2011), 171–193.",
      "doi": ""
    },
    {
      "text": "Khai Truong, Shwetak Patel, Jay Summet, and Gregory Abowd. 2005. Preventing Camera Recording by Designing a Capture-Resistant Environment.",
      "doi": ""
    },
    {
      "text": "Blase Ur, Jaeyeon Jung, and Stuart Schechter. 2014. Intruders versus intrusiveness: teens’ and parents’ perspectives on home-entryway surveillance. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing, ACM, Seattle Washington, 129–139.",
      "doi": "10.1145/2632048.2632107"
    },
    {
      "text": "Peter-Paul Verbeek. 2005. What Things Do: Philosophical Reflections on Technology, Agency, and Design. Penn State University Press.",
      "doi": ""
    },
    {
      "text": "Ron Wakkary. 2021. Things We Could Design: For More Than Human-Centered Worlds. MIT Press, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Ron Wakkary and Leah Maestri. 2007. The resourcefulness of everyday design. In Proceedings of the 6th ACM SIGCHI conference on Creativity & Cognition (C&C ’07), Association for Computing Machinery, New York, NY, USA, 163–172.",
      "doi": "10.1145/1254960.1254984"
    },
    {
      "text": "Jayne Wallace, Jon Rogers, Michael Shorter, Pete Thomas, Martin Skelly, and Richard Cook. 2018. The SelfReflector: Design, IoT and the High Street. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–12.",
      "doi": "10.1145/3173574.3173997"
    },
    {
      "text": "Yang Wang. 2017. The Third Wave?: Inclusive Privacy and Security. In Proceedings of the 2017 New Security Paradigms Workshop, ACM, Santa Cruz CA USA, 122–130.",
      "doi": "10.1145/3171533.3171538"
    },
    {
      "text": "Kelly Widdicks, Tina Ringenson, Daniel Pargman, Vishnupriya Kuppusamy, and Patricia Lago. 2018. Undesigning the Internet: An Exploratory Study of Reducing Everyday Internet Connectivity. In EPiC Series in Computing, EasyChair, 384–397.",
      "doi": ""
    },
    {
      "text": "Oscar Williams. 2017. Nestie Awards 2017: Hilarious Moments Caught On Home Security Cameras. HuffPost UK. Retrieved from https://www.huffingtonpost.co.uk/entry/nestie-awards-2017-hilarious-moments-caught-on-home-security-cameras_uk_58c6a2d6e4b0d1078ca806f4",
      "doi": ""
    },
    {
      "text": "Richmond Y. Wong and Deirdre K. Mulligan. 2019. Bringing Design to the Privacy Table: Broadening “Design” in “Privacy by Design” Through the Lens of HCI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, New York, NY, USA, 1–17.",
      "doi": ""
    },
    {
      "text": "Allison Woodruff, Sally Augustin, and Brooke Foucault. 2007. Sabbath Day Home Automation: “It's Like Mixing Technology and Religion\". In In Proceedings of the 2007 Conference on Human Factors in Computing Systems (CHI 2007), ACM Press.",
      "doi": "10.1145/1240624.1240710"
    },
    {
      "text": "Yaxing Yao, Justin Reed Basdeo, Oriana Rosata Mcdonough, and Yang Wang. 2019. Privacy Perceptions and Designs of Bystanders in Smart Homes. Proc. ACM Hum.-Comput. Interact. 3, CSCW (November 2019), 1–24.",
      "doi": "10.1145/3359161"
    },
    {
      "text": "Yaxing Yao, Huichuan Xia, Yun Huang, and Yang Wang. 2017. Privacy Mechanisms for Drones: Perceptions of Drone Controllers and Bystanders. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, ACM, Denver Colorado USA, 6777–6788.",
      "doi": "10.1145/3025453.3025907"
    },
    {
      "text": "MinYoung Yoo, William Odom, and Arne Berger. 2021. Understanding Everyday Experiences of Reminiscence for People with Blindness: Practices, Tensions and Probing New Design Possibilities. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), Association for Computing Machinery, New York, NY, USA, 1–15.",
      "doi": "10.1145/3411764.3445212"
    },
    {
      "text": "Eric Zeng, Shrirang Mare, and Franziska Roesner. End User Security & Privacy Concerns with Smart Homes. 17.",
      "doi": ""
    },
    {
      "text": "Serena Zheng, Noah Apthorpe, Marshini Chetty, and Nick Feamster. 2018. User Perceptions of Smart Home IoT Privacy. Proc. ACM Hum.-Comput. Interact. 2, CSCW (November 2018), 200:1-200:20.",
      "doi": "10.1145/3274469"
    },
    {
      "text": "Shoshana Zuboff. 2018. The Age of Surveillance Capitalism: The Fight for a Human Future at the New Frontier of Power (1st ed.).",
      "doi": ""
    },
    {
      "text": "2016. 61% Of Smart-Home Revenue Came From Security Cameras In The Last Year. TWICE. Retrieved from https://www.twice.com/news/61-smart-home-revenue-came-security-cameras-last-year-62631",
      "doi": ""
    }
  ]
}