{
  "doi": "10.1145/3491102.3501856",
  "title": "“A Voice that Suits the Situation”: Understanding the Needs and Challenges for Supporting End-User Voice Customization",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2022,
  "badges": [],
  "abstract": "Although there is a potential demand for customizing voices, most customization is limited to the visual appearance of a figure (e.g., avatars). To better understand the users’ need, we first conducted an online survey with 104 participants. Then we conducted a semi-structured interview with a prototype with 14 participants to identify design considerations for supporting voice customization. The results show that there is a desire for voice customization especially for non-face-to-face conversations with someone unfamiliar. In addition, the findings revealed that different voices are favored for different contexts from a better version of one’s own voice for improving delivery to a completely different voice for securing identity. As future work, we plan to extend this study by investigating voice synthesis techniques for end-users who wish to design their own voices for various contexts.",
  "authors": [
    {
      "name": "Hyeon Jeong Byeon",
      "institution": "Computer Science and Engineering, Ewha Womans University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659894443",
      "orcid": "0000-0002-0811-2504"
    },
    {
      "name": "Chaerin Lee",
      "institution": "Computer Science and Engineering, Ewha Womans University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237423",
      "orcid": "missing"
    },
    {
      "name": "Jeemin Lee",
      "institution": "Ewha Womans University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237339",
      "orcid": "missing"
    },
    {
      "name": "Uran Oh",
      "institution": "Computer Science and engineering, Ewha womans university, Korea, Republic of",
      "img": "/do/10.1145/contrib-81558395756/rel-imgonly/81558395756.jpg",
      "acmid": "81558395756",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. Business of Apps Roblox Statistics. https://www.businessofapps.com/data/roblox-statistics/. Accessed: 2022-01-06.",
      "doi": ""
    },
    {
      "text": "David W Addington. 1968. The relationship of selected vocal characteristics to personality perception. (1968).",
      "doi": ""
    },
    {
      "text": "Max V Birk and Regan L Mandryk. 2018. Combating attrition in digital self-improvement programs using avatar customization. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3173574.3174234"
    },
    {
      "text": "Michael Braun, Anja Mainz, Ronee Chadowitz, Bastian Pfleging, and Florian Alt. 2019. At your service: Designing voice assistant personalities to improve automotive user interfaces. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3290605.3300270"
    },
    {
      "text": "Raymond H Colton and Jo A Estill. 1981. Elements of voice quality: perceptual, acoustic, and physiologic aspects. In Speech and Language. Vol. 5. Elsevier, 311–403.",
      "doi": ""
    },
    {
      "text": "Igor Dolgov, William J Graves, Matthew R Nearents, Jeremy D Schwark, and C Brooks Volkman. 2014. Effects of cooperative gaming and avatar customization on subsequent spontaneous helping behavior. Computers in human behavior 33 (2014), 49–55.",
      "doi": ""
    },
    {
      "text": "Michelle Drouin, Daniel Miller, Shaun MJ Wehle, and Elisa Hernandez. 2016. Why do people lie online?“Because everyone lies on the internet”. Computers in Human Behavior 64 (2016), 134–142.",
      "doi": "10.1016/j.chb.2016.06.052"
    },
    {
      "text": "T Ehrette, N Chateau, Christophe d’Alessandro, and V Maffiolo. 2002. Prosodic parameters of perceived emotions in vocal server voices. In Speech Prosody 2002, International Conference.",
      "doi": ""
    },
    {
      "text": "Jerry Bryan Fuller, Tim Barnett, Kim Hester, Clint Relyea, and Len Frey. 2007. An exploratory examination of voice behavior from an impression management perspective. Journal of Managerial Issues(2007), 134–151.",
      "doi": ""
    },
    {
      "text": "Marylou Pausewang Gelfer. 1988. Perceptual attributes of voice: Development and use of rating scales. Journal of Voice 2, 4 (1988), 320–326.",
      "doi": ""
    },
    {
      "text": "Marylou Pausewang Gelfer. 1993. A multidimensional scaling study of voice quality in females. Phonetica 50, 1 (1993), 15–27.",
      "doi": ""
    },
    {
      "text": "Christer Gobl and Ailbhe Ní Chasaide. 2000. Testing affective correlates of voice quality through analysis and resynthesis. In ISCA tutorial and research workshop (ITRW) on Speech and Emotion.",
      "doi": ""
    },
    {
      "text": "Mark Grimshaw. 2014. The Oxford handbook of virtuality. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Rosalie Hooi and Hichang Cho. 2014. Avatar-driven self-disclosure: The virtual me is the actual me. Computers in Human Behavior 39 (2014), 20–28.",
      "doi": "10.1016/j.chb.2014.06.019"
    },
    {
      "text": "Daniel J Hruschka, Deborah Schwartz, Daphne Cobb St. John, Erin Picone-Decaro, Richard A Jenkins, and James W Carey. 2004. Reliability in coding open-ended data: Lessons learned from HIV behavioral research. Field methods 16, 3 (2004), 307–331.",
      "doi": ""
    },
    {
      "text": "Yukara Ikemiya, Katsutoshi Itoyama, and Hiroshi G Okuno. 2014. Transferring vocal expression of f0 contour using singing voice synthesizer. In International Conference on Industrial, Engineering and Other Applications of Applied Intelligent Systems. Springer, 250–259.",
      "doi": "10.1007/978-3-319-07467-2_27"
    },
    {
      "text": "Mohammad Muzammil Khan and Anam Saiyeda. 2021. Reader: Speech Synthesizer and Speech Recognizer. In International Conference on Innovative Computing and Communications. Springer, 877–886.",
      "doi": ""
    },
    {
      "text": "Keunhyoung Luke Kim, Jongpil Lee, Sangeun Kum, Chae Lin Park, and Juhan Nam. 2020. Semantic Tagging of Singing Voices in Popular Music Recordings. IEEE/ACM Transactions on Audio, Speech, and Language Processing 28 (2020), 1656–1668.",
      "doi": "10.1109/TASLP.2020.2993893"
    },
    {
      "text": "Kwan Min Lee, Katharine Liao, and Seoungho Ryu. 2007. Children’s responses to computer-synthesized speech in educational media: gender consistency and gender similarity effects. Human communication research 33, 3 (2007), 310–329.",
      "doi": ""
    },
    {
      "text": "Kwan Min Lee and Clifford Nass. 2003. Designing social presence of social actors in human computer interaction. In Proceedings of the SIGCHI conference on Human factors in computing systems. 289–296.",
      "doi": "10.1145/642611.642662"
    },
    {
      "text": "Richard E Mayer, Kristina Sobko, and Patricia D Mautone. 2003. Social cues in multimedia learning: Role of speaker’s voice.Journal of educational Psychology 95, 2 (2003), 419.",
      "doi": ""
    },
    {
      "text": "Eman Mubarak, Tooba Shahid, Maryam Mustafa, and Mustafa Naseem. 2020. Does Gender and Accent of Voice Matter? An Interactive Voice Response (IVR) experiment. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development. 1–5.",
      "doi": ""
    },
    {
      "text": "Andreea Niculescu, Betsy van Dijk, Anton Nijholt, Haizhou Li, and Swee Lan See. 2013. Making social robots more attractive: the effects of voice pitch, humor and empathy. International journal of social robotics 5, 2 (2013), 171–191.",
      "doi": ""
    },
    {
      "text": "Marilena Phillips. 2017. Talking the talk: The effect of vocalics in an interview. (2017).",
      "doi": ""
    },
    {
      "text": "Klaus R Scherer. 1978. Personality inference from voice quality: The loud voice of extroversion. European Journal of Social Psychology 8, 4 (1978), 467–487.",
      "doi": ""
    },
    {
      "text": "Eliane Schlemmer, Daiana Trein, and Cristoffer Oliveira. 2009. The metaverse: Telepresence in 3D avatar-driven digital-virtual worlds. @ tic. revista d’innovació educativa2 (2009), 26–32.",
      "doi": ""
    },
    {
      "text": "Richard J Sebastian and Ellen Bouchard Ryan. 2018. Speech cues and social evaluation: Markers of ethnicity, social class, and age. In Recent advances in language, communication, and social psychology. Routledge, 112–143.",
      "doi": ""
    },
    {
      "text": "Stefano Taddei and Bastianina Contena. 2013. Privacy, trust and control: Which relationships with online self-disclosure?Computers in human behavior 29, 3 (2013), 821–826.",
      "doi": ""
    },
    {
      "text": "Rie Tamagawa, Catherine I Watson, I Han Kuo, Bruce A MacDonald, and Elizabeth Broadbent. 2011. The effects of synthesized voice accents on user perceptions of robots. International Journal of Social Robotics 3, 3 (2011), 253–262.",
      "doi": ""
    },
    {
      "text": "Sonja A Trent. 1995. Voice quality: Listener identification of African-American versus Caucasian speakers. The Journal of the Acoustical Society of America 98, 5 (1995), 2936–2936.",
      "doi": ""
    },
    {
      "text": "Stefano Triberti, Ilaria Durosini, Filippo Aschieri, Daniela Villani, and Giuseppe Riva. 2017. A frame effect in avatar customization: How users’ attitudes towards their avatars may change depending on virtual context. (2017).",
      "doi": ""
    },
    {
      "text": "Selen Turkay. 2012. User experiences with avatar customization in Second Life and Lord of the Rings Online. In Proceedings on Teachers College Educational Technology Conference. Citeseer, 78–79.",
      "doi": ""
    },
    {
      "text": "Selen Turkay and Charles K Kinzer. 2015. The effects of avatar-based customization on player identification. In Gamification: Concepts, methodologies, tools, and applications. IGI Global, 247–272.",
      "doi": ""
    },
    {
      "text": "Kyle James Tusing and James Price Dillard. 2000. The sounds of dominance. Vocal precursors of perceived dominance during interpersonal influence. Human Communication Research 26, 1 (2000), 148–171.",
      "doi": ""
    },
    {
      "text": "Asimina Vasalou and Adam N Joinson. 2009. Me, myself and I: The role of interactional context on self-presentation through avatars. Computers in human behavior 25, 2 (2009), 510–520.",
      "doi": "10.1016/j.chb.2008.11.007"
    },
    {
      "text": "Daniela Villani, Elena Gatti, Stefano Triberti, Emanuela Confalonieri, and Giuseppe Riva. 2016. Exploration of virtual body-representation in adolescence: the role of age and sex in avatar customization. SpringerPlus 5, 1 (2016), 1–13.",
      "doi": ""
    },
    {
      "text": "Greg Wadley, Marcus Carter, and Martin Gibbs. 2015. Voice in virtual worlds: The design, use, and influence of voice chat in online play. Human–Computer Interaction 30, 3-4 (2015), 336–365.",
      "doi": ""
    },
    {
      "text": "Steven Weinberger. 2015. Speech accent archive. george mason university. Online:http://accent.gmu.edu (2015).",
      "doi": ""
    },
    {
      "text": "Dmitri Williams, Scott Caplan, and Li Xiong. 2007. Can you hear me now? The impact of voice in an online gaming community. Human communication research 33, 4 (2007), 427–449.",
      "doi": ""
    },
    {
      "text": "Kuang-Wen Wu, Shaio Yan Huang, David C Yen, and Irina Popova. 2012. The effect of online privacy policy on consumer privacy concern and trust. Computers in human behavior 28, 3 (2012), 889–897.",
      "doi": ""
    },
    {
      "text": "Lotus Zhang, Lucy Jiang, Nicole Washington, Augustina Ao Liu, Jingyao Shao, Adam Fourney, Meredith Ringel Morris, and Leah Findlater. 2021. Social Media through Voice: Synthesized Voice Qualities and Self-presentation. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–21.",
      "doi": "10.1145/3449235"
    },
    {
      "text": "Zhaoyan Zhang. 2021. Voice Feature Selection to Improve Performance of Machine Learning Models for Voice Production Inversion. Journal of Voice (2021).",
      "doi": ""
    }
  ]
}