{
  "doi": "10.1145/3491102.3501940",
  "title": "VibEmoji: Exploring User-authoring Multi-modal Emoticons in Social Communication",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "Emoticons are indispensable in online communications. With users’ growing needs for more customized and expressive emoticons, recent messaging applications begin to support (limited) multi-modal emoticons:, enhancing emoticons with animations or vibrotactile feedback. However, little empirical knowledge has been accumulated concerning how people create, share and experience multi-modal emoticons in everyday communication, and how to better support them through design. To tackle this, we developed VibEmoji, a user-authoring multi-modal emoticon interface for mobile messaging. Extending existing designs, VibEmoji grants users greater flexibility to combine various emoticons, vibrations, and animations on-the-fly, and offers non-aggressive recommendations based on these components’ emotional relevance. Using VibEmoji as a probe, we conducted a four-week field study with 20 participants, to gain new understandings from in-the-wild usage and experience, and extract implications for design. We thereby contribute to both a novel system and various insights for supporting users’ creation and communication of multi-modal emoticons.",
  "authors": [
    {
      "name": "Pengcheng An",
      "institution": "School of Computer Science, University of Waterloo, Canada and School of Design, Southern University of Science and Technology, China",
      "img": "/do/10.1145/contrib-99659187143/rel-imgonly/61486090_2320171334733260_113718647960109056_o.jpg",
      "acmid": "99659187143",
      "orcid": "missing"
    },
    {
      "name": "Ziqi Zhou",
      "institution": "School of Computer Science, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239190",
      "orcid": "0000-0002-0861-1805"
    },
    {
      "name": "Qing Liu",
      "institution": "School of Computer Science, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234691",
      "orcid": "missing"
    },
    {
      "name": "Yifei Yin",
      "institution": "Department of Computer and Mathematical Sciences, University of Toronto Scarborough, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240331",
      "orcid": "missing"
    },
    {
      "name": "Linghao Du",
      "institution": "Human Machine Interaction Lab, Huawei Canada, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234549",
      "orcid": "missing"
    },
    {
      "name": "Da-Yuan Huang",
      "institution": "Human Machine Interaction Lab, Huawei Canada, Canada",
      "img": "/do/10.1145/contrib-81551198756/rel-imgonly/81551198756.jpg",
      "acmid": "81551198756",
      "orcid": "missing"
    },
    {
      "name": "Jian Zhao",
      "institution": "School of Computer Science, University of Waterloo, Canada",
      "img": "/do/10.1145/contrib-99659468860/rel-imgonly/jian_zhao.jpg",
      "acmid": "99659468860",
      "orcid": "0000-0001-5008-4319"
    }
  ],
  "references": [
    {
      "text": "Jessalyn Alvina, Chengcheng Qu, Joanna McGrenere, and Wendy E. Mackay. 2019. MojiBoard: Generating Parametric Emojis with Gesture Keyboards. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312771",
      "doi": "10.1145/3290607.3312771"
    },
    {
      "text": "Apple. 2021. Use Memoji on your iPhone or iPad Pro. https://support.apple.com/en-ca/HT208986",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa arXiv:https://www.tandfonline.com/doi/pdf/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Scott Brave and Andrew Dahley. 1997. InTouch: A Medium for Haptic Interpersonal Communication. In CHI ’97 Extended Abstracts on Human Factors in Computing Systems (Atlanta, Georgia) (CHI EA ’97). Association for Computing Machinery, New York, NY, USA, 363–364. https://doi.org/10.1145/1120212.1120435",
      "doi": "10.1145/1120212.1120435"
    },
    {
      "text": "Brian. 2012. PLATO Emoticons, revisited. http://www.platohistory.org/blog/2012/09/plato-emoticons-revisited.html",
      "doi": ""
    },
    {
      "text": "Keith Broni. 2021. Emoji Use At All-Time High. https://blog.emojipedia.org/emoji-use-at-all-time-high/",
      "doi": ""
    },
    {
      "text": "Jeremy Burge. 2017. 5 Billion Emojis Sent Daily on Messenger. https://blog.emojipedia.org/5-billion-emojis-sent-daily-on-messenger/",
      "doi": ""
    },
    {
      "text": "Jessica R. Cauchard, Janette L. Cheng, Thomas Pietrzak, and James A. Landay. 2016. ActiVibe: Design and Evaluation of Vibrations for Progress Monitoring. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 3261–3271. https://doi.org/10.1145/2858036.2858046",
      "doi": "10.1145/2858036.2858046"
    },
    {
      "text": "Zekun Chang, Tung D. Ta, Koya Narumi, Heeju Kim, Fuminori Okuya, Dongchi Li, Kunihiro Kato, Jie Qi, Yoshinobu Miyamoto, Kazuya Saito, and Yoshihiro Kawahara. 2020. Kirigami Haptic Swatches: Design Methods for Cut-and-Fold Haptic Feedback Mechanisms. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376655",
      "doi": "10.1145/3313831.3376655"
    },
    {
      "text": "Zhenpeng Chen, Yanbin Cao, Huihan Yao, Xuan Lu, Xin Peng, Hong Mei, and Xuanzhe Liu. 2021. Emoji-Powered Sentiment and Emotion Detection from Software Developers’ Communication Data. ACM Trans. Softw. Eng. Methodol. 30, 2, Article 18 (Jan. 2021), 48 pages. https://doi.org/10.1145/3424308",
      "doi": "10.1145/3424308"
    },
    {
      "text": "Marcel Danesi. 2016. The semiotics of emoji: The rise of visual language in the age of the internet. Bloomsbury Publishing, London, UK.",
      "doi": "10.5555/3126077"
    },
    {
      "text": "Paul Ekman. 1992. Are there basic emotions?Psychological Review 3, 99 (1992), 550–553.",
      "doi": ""
    },
    {
      "text": "Abdallah El Ali, Torben Wallbaum, Merlin Wasmann, Wilko Heuten, and Susanne CJ Boll. 2017. Face2Emoji: Using Facial Emotional Expressions to Filter Emojis. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(Denver, Colorado, USA) (CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 1577–1584. https://doi.org/10.1145/3027063.3053086",
      "doi": "10.1145/3027063.3053086"
    },
    {
      "text": "Mario J Enriquez and Karon E MacLean. 2003. The hapticon editor: a tool in support of haptic communication research. In 11th Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 2003. HAPTICS 2003. Proceedings. IEEE, IEEE, 356–362.",
      "doi": ""
    },
    {
      "text": "Facebook. 2021. Messenger. https://www.messenger.com/",
      "doi": ""
    },
    {
      "text": "Scott Fahlman. Retrieved 2021. Smiley Lore :-). https://www.cs.cmu.edu/~sef/sefSmiley.htm",
      "doi": ""
    },
    {
      "text": "Yunhe Feng, Zheng Lu, Wenjun Zhou, Zhibo Wang, and Qing Cao. 2020. New Emoji Requests from Twitter Users: When, Where, Why, and What We Can Do About Them. Trans. Soc. Comput. 3, 2, Article 8 (apr 2020), 25 pages. https://doi.org/10.1145/3370750",
      "doi": "10.1145/3370750"
    },
    {
      "text": "Google. 2021. Gboard. https://blog.google/products/android/emoji-kitchen-new-mashups-mixing-experience/",
      "doi": ""
    },
    {
      "text": "Carla F Griggio, Joanna McGrenere, and Wendy E Mackay. 2019. Customizations and Expression Breakdowns in Ecosystems of Communication Apps. Proc. ACM Hum.-Comput. Interact. 3 (11 2019), 26 pages. Issue CSCW. https://doi.org/10.1145/3359128",
      "doi": "10.1145/3359128"
    },
    {
      "text": "Carla F. Griggio, Arissa J. Sato, Wendy E. Mackay, and Koji Yatani. 2021. Mediating Intimacy with DearBoard: A Co-Customizable Keyboard for Everyday Messaging. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 342, 16 pages. https://doi.org/10.1145/3411764.3445757",
      "doi": "10.1145/3411764.3445757"
    },
    {
      "text": "Loni Hagen, Mary Falling, Oleksandr Lisnichenko, AbdelRahim A. Elmadany, Pankti Mehta, Muhammad Abdul-Mageed, Justin Costakis, and Thomas E. Keller. 2019. Emoji Use in Twitter White Nationalism Communication. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing(Austin, TX, USA) (CSCW ’19). Association for Computing Machinery, New York, NY, USA, 201–205. https://doi.org/10.1145/3311957.3359495",
      "doi": ""
    },
    {
      "text": "Chris Harrison, Gary Hsieh, Karl D.D. Willis, Jodi Forlizzi, and Scott E. Hudson. 2011. Kineticons: Using Iconographic Motion in Graphical User Interface Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 1999–2008. https://doi.org/10.1145/1978942.1979232",
      "doi": "10.1145/1978942.1979232"
    },
    {
      "text": "Jiaxiong Hu, Qianyao Xu, Limin Paul Fu, and Yingqing Xu. 2019. Emojilization: An Automated Method For Speech to Emoji-Labeled Text. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3313071",
      "doi": "10.1145/3290607.3313071"
    },
    {
      "text": "Huawei. 2021. MeeTime. https://consumer.huawei.com/cn/mobileservices/meetime/",
      "doi": ""
    },
    {
      "text": "Ali Israr, Siyan Zhao, and Oliver Schneider. 2015. Exploring Embedded Haptics for Social Networking and Interactions. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI EA ’15). Association for Computing Machinery, New York, NY, USA, 1899–1904. https://doi.org/10.1145/2702613.2732814",
      "doi": "10.1145/2702613.2732814"
    },
    {
      "text": "Jialun ”Aaron” Jiang, Jed R. Brubaker, and Casey Fiesler. 2017. Understanding Diverse Interpretations of Animated GIFs. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 1726–1732. https://doi.org/10.1145/3027063.3053139",
      "doi": "10.1145/3027063.3053139"
    },
    {
      "text": "Ryan Kelly and Leon Watts. 2015. Characterising the inventive appropriation of emoji as relationally meaningful in mediated close personal relationships. Experiences of technology appropriation: Unanticipated users, usage, circumstances, and design 2(2015), 7 pages.",
      "doi": ""
    },
    {
      "text": "Sujay Khandekar, Joseph Higg, Yuanzhe Bian, Chae Won Ryu, Jerry O. Talton Iii, and Ranjitha Kumar. 2019. Opico: A Study of Emoji-First Communication in a Mobile Social App. In Companion Proceedings of The 2019 World Wide Web Conference (San Francisco, USA) (WWW ’19). Association for Computing Machinery, New York, NY, USA, 450–458. https://doi.org/10.1145/3308560.3316547",
      "doi": "10.1145/3308560.3316547"
    },
    {
      "text": "Erin Kim and Oliver Schneider. 2020. Defining Haptic Experience: Foundations for Understanding, Communicating, and Evaluating HX. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376280",
      "doi": ""
    },
    {
      "text": "Jihun Kim, Amitash ojha, Yongsik Jin, and Minho Lee. 2015. Pictogram Generator from Korean Sentences Using Emoticon and Saliency Map. In Proceedings of the 3rd International Conference on Human-Agent Interaction (Daegu, Kyungpook, Republic of Korea) (HAI ’15). Association for Computing Machinery, New York, NY, USA, 259–262. https://doi.org/10.1145/2814940.2814991",
      "doi": "10.1145/2814940.2814991"
    },
    {
      "text": "Philippe Kimura-Thollander and Neha Kumar. 2019. Examining the ”Global” Language of Emojis: Designing for Cultural Representation. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300725",
      "doi": ""
    },
    {
      "text": "Yehuda Koren and Robert Bell. 2015. Advances in collaborative filtering. Springer, New York, NY, USA, 77–118.",
      "doi": ""
    },
    {
      "text": "Miki Liu, Austin Wong, Ruhi Pudipeddi, Betty Hou, David Wang, and Gary Hsieh. 2018. ReactionBot: Exploring the Effects of Expression-Triggered Emoji in Text Messages. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 110 (Nov. 2018), 16 pages. https://doi.org/10.1145/3274379",
      "doi": "10.1145/3274379"
    },
    {
      "text": "Albert Mehrabian. 1980. Basic dimensions for a general psychological theory implications for personality, social, environmental, and developmental studies. Cambridge: Oelgeschlager, Gunn & Hain, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Paritosh Mittal, Kunal Aggarwal, Pragya Paramita Sahu, Vishal Vatsalya, Soumyajit Mitra, Vikrant Singh, Viswanath Veera, and Shankar M. Venkatesan. 2020. Photo-Realistic Emoticon Generation Using Multi-Modal Input. In Proceedings of the 25th International Conference on Intelligent User Interfaces (Cagliari, Italy) (IUI ’20). Association for Computing Machinery, New York, NY, USA, 254–258. https://doi.org/10.1145/3377325.3377533",
      "doi": "10.1145/3377325.3377533"
    },
    {
      "text": "Joe Mullenbach, Craig Shultz, J. Edward Colgate, and Anne Marie Piper. 2014. Exploring Affective Communication through Variable-Friction Surface Haptics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 3963–3972. https://doi.org/10.1145/2556288.2557343",
      "doi": "10.1145/2556288.2557343"
    },
    {
      "text": "Hideyuki Nakanishi, Kazuaki Tanaka, and Yuya Wada. 2014. Remote Handshaking: Touch Enhances Video-Mediated Social Telepresence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2143–2152. https://doi.org/10.1145/2556288.2557169",
      "doi": "10.1145/2556288.2557169"
    },
    {
      "text": "Young-Woo Park and Tek-Jin Nam. 2013. POKE: A New Way of Sharing Emotional Touches during Phone Conversations. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France) (CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 2859–2860. https://doi.org/10.1145/2468356.2479548",
      "doi": "10.1145/2468356.2479548"
    },
    {
      "text": "Anand Rajaraman and Jeffrey David Ullman. 2011. Data Mining. Cambridge University Press, Cambridge, UK, 1–17. https://doi.org/10.1017/CBO9781139058452.002",
      "doi": ""
    },
    {
      "text": "David Rodrigues, Marília Prada, Rui Gaspar, Margarida V Garrido, and Diniz Lopes. 2018. Lisbon Emoji and Emoticon Database (LEED): Norms for emoji and emoticons in seven evaluative dimensions. Behavior research methods 50, 1 (2018), 392–405.",
      "doi": ""
    },
    {
      "text": "James A Russell and Lisa Feldman Barrett. 1999. Core affect, prototypical emotional episodes, and other things called emotion: dissecting the elephant.Journal of personality and social psychology 76, 5(1999), 805.",
      "doi": ""
    },
    {
      "text": "Oliver S. Schneider, Hasti Seifi, Salma Kashani, Matthew Chun, and Karon E. MacLean. 2016. HapTurk: Crowdsourcing Affective Ratings of Vibrotactile Icons. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 3248–3260. https://doi.org/10.1145/2858036.2858279",
      "doi": "10.1145/2858036.2858279"
    },
    {
      "text": "Hasti Seifi, Mattew Chun, and Karon E. Maclean. 2018. Toward Affective Handles for Tuning Vibrations. ACM Trans. Appl. Percept. 15, 3, Article 22 (jul 2018), 23 pages. https://doi.org/10.1145/3230645",
      "doi": "10.1145/3230645"
    },
    {
      "text": "Hasti Seifi, Kailun Zhang, and Karon E. MacLean. 2015. VibViz: Organizing, visualizing and navigating vibration libraries. In 2015 IEEE World Haptics Conference (WHC). IEEE, New York, NY, USA, 254–259. https://doi.org/10.1109/WHC.2015.7177722",
      "doi": ""
    },
    {
      "text": "Andreas Sonderegger, Klaus Heyden, Alain Chavaillaz, and Juergen Sauer. 2016. AniSAM & AniAvatar: Animated Visualizations of Affective States. Association for Computing Machinery, New York, NY, USA, 4828–4837. https://doi.org/10.1145/2858036.2858365",
      "doi": ""
    },
    {
      "text": "Telegram. 2021. Telegram. https://telegram.org/",
      "doi": ""
    },
    {
      "text": "Tencent. 2021. WeChat. https://www.wechat.com/",
      "doi": ""
    },
    {
      "text": "Garreth W. Tigwell, Benjamin M. Gorman, and Rachel Menzies. 2020. Emoji Accessibility for Visually Impaired People. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376267",
      "doi": ""
    },
    {
      "text": "Maggie Tillman. 2021. What are Animoji? How to create and use Apple’s animated emoji. https://www.pocket-lint.com/apps/news/apple/142230-what-are-animoji-how-to-use-apple-s-animated-emoji",
      "doi": ""
    },
    {
      "text": "Yuki Urabe, Rafal Rzepka, and Kenji Araki. 2013. Emoticon Recommendation System for Effective Communication. In Proceedings of the 2013 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining(Niagara, Ontario, Canada) (ASONAM ’13). Association for Computing Machinery, New York, NY, USA, 1460–1461. https://doi.org/10.1145/2492517.2492594",
      "doi": "10.1145/2492517.2492594"
    },
    {
      "text": "Alessandro Vinciarelli, Maja Pantic, and Hervé Bourlard. 2009. Social signal processing: Survey of an emerging domain. Image and vision computing 27, 12 (2009), 1743–1759.",
      "doi": ""
    },
    {
      "text": "Rongrong Wang, Francis Quek, Deborah Tatar, Keng Soon Teh, and Adrian Cheok. 2012. Keep in Touch: Channel, Expectation and Experience. Association for Computing Machinery, New York, NY, USA, 139–148. https://doi.org/10.1145/2207676.2207697",
      "doi": ""
    },
    {
      "text": "Sarah Wiseman and Sandy J. J. Gould. 2018. Repurposing Emoji for Personalised Communication: Why images/emojipizza Means “I Love You”. Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3173574.3173726",
      "doi": ""
    },
    {
      "text": "Koji Yatani and Khai Nhut Truong. 2009. SemFeel: A User Interface with Semantic Tactile Feedback for Mobile Touch-Screen Devices. In Proceedings of the 22nd Annual ACM Symposium on User Interface Software and Technology (Victoria, BC, Canada) (UIST ’09). Association for Computing Machinery, New York, NY, USA, 111–120. https://doi.org/10.1145/1622176.1622198",
      "doi": "10.1145/1622176.1622198"
    },
    {
      "text": "Amy X. Zhang, Michele Igo, Marc Facciotti, and David Karger. 2017. Using Student Annotated Hashtags and Emojis to Collect Nuanced Affective States. In Proceedings of the Fourth (2017) ACM Conference on Learning @ Scale (Cambridge, Massachusetts, USA) (L@S ’17). Association for Computing Machinery, New York, NY, USA, 319–322. https://doi.org/10.1145/3051457.3054014",
      "doi": "10.1145/3051457.3054014"
    },
    {
      "text": "Mingrui Ray Zhang, Ruolin Wang, Xuhai Xu, Qisheng Li, Ather Sharif, and Jacob O. Wobbrock. 2021. Voicemoji: Emoji Entry Using Voice for Visually Impaired People. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 37, 18 pages. https://doi.org/10.1145/3411764.3445338",
      "doi": "10.1145/3411764.3445338"
    },
    {
      "text": "Zhuoming Zhang, Jessalyn Alvina, Robin Héron, Stéphane Safin, Françoise Détienne, and Eric Lecolinet. 2021. Touch without Touching: Overcoming Social Distancing in Semi-Intimate Relationships with SansTouch. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 651, 13 pages. https://doi.org/10.1145/3411764.3445612",
      "doi": "10.1145/3411764.3445612"
    },
    {
      "text": "Zhuoming Zhang, Robin Héron, Eric Lecolinet, Françoise Detienne, and Stéphane Safin. 2019. VisualTouch: Enhancing Affective Touch Communication with Multi-Modality Stimulation. In 2019 International Conference on Multimodal Interaction (Suzhou, China) (ICMI ’19). Association for Computing Machinery, New York, NY, USA, 114–123. https://doi.org/10.1145/3340555.3353733",
      "doi": ""
    },
    {
      "text": "Rui Zhou, Jasmine Hentschel, and Neha Kumar. 2017. Goodbye Text, Hello Emoji: Mobile Communication on WeChat in China. Association for Computing Machinery, New York, NY, USA, 748–759. https://doi.org/10.1145/3025453.3025800",
      "doi": ""
    }
  ]
}