{
  "doi": "10.1145/3491102.3517669",
  "title": "Personal Dream Informatics: A Self-Information Systems Model of Dream Engagement",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "We present the research area of personal dream informatics: studying the self-information systems that support dream engagement and communication between the dreaming self and the wakeful self. Through a survey study of 281 individuals primarily recruited from an online community dedicated to dreaming, we develop a dream-information systems view of dreaming and dream tracking as a type of self-information system. While dream-information systems are characterized by diverse tracking processes, motivations, and outcomes, they are universally constrained by the ephemeral dreamset—the short period of time between waking up and rapid memory loss of dream experiences. By developing a system dynamics model of dreaming we highlight feedback loops that serve as high leverage points for technology designers, and suggest a variety of design considerations for crafting technology that best supports dream recall, dream tracking, and dreamwork for nightmare relief and personal development.",
  "authors": [
    {
      "name": "Michael Jeffrey Daniel Hoefer",
      "institution": "Department of Computer Science, University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659773722",
      "orcid": "missing"
    },
    {
      "name": "Bryce E Schumacher",
      "institution": "Department of Computer Science, University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234390",
      "orcid": "missing"
    },
    {
      "name": "Stephen Voida",
      "institution": "Department of Information Science, University of Colorado Boulder, United States",
      "img": "/do/10.1145/contrib-81100147302/rel-imgonly/steve_-_interactions__cropped_close_.png",
      "acmid": "81100147302",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Denholm J. Aspy. 2016. Is dream recall underestimated by retrospective measures and enhanced by keeping a logbook? An empirical investigation. Consciousness and Cognition 42 (May 2016), 181–203. https://doi.org/10.1016/j.concog.2016.03.015",
      "doi": ""
    },
    {
      "text": "Denholm J. Aspy, Paul Delfabbro, and Michael Proeve. 2015. Is dream recall underestimated by retrospective measures and enhanced by keeping a logbook? A review. Consciousness and Cognition 33 (May 2015), 364–374. https://doi.org/10.1016/j.concog.2015.02.005",
      "doi": ""
    },
    {
      "text": "Amid Ayobi, Tobias Sonne, Paul Marshall, and Anna L. Cox. 2018. Flexible and Mindful Self-Tracking: Design Implications from Paper Bullet Journals. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173602",
      "doi": "10.1145/3173574.3173602"
    },
    {
      "text": "Alan Paul Bell and Calvin Springer Hall. 2011. The personality of a child molester: An analysis of dreams. Aldine-Atherton, Chicago.",
      "doi": ""
    },
    {
      "text": "Mark Blagrove, Julia Lockheart, Michelle Carr, Shanice Basra, Harriet Graham, Hannah Lewis, Emily Murphy, Ausrine Sakalauskaite, Caitlin Trotman, and Katja Valli. 2021. Dream sharing and the enhancement of empathy: Theoretical and applied implications. Dreaming 31, 2 (2021), 128–139. https://doi.org/10.1037/drm0000165",
      "doi": ""
    },
    {
      "text": "Margaret M. Bowater. 2003. Windows on your inner self: dreamwork with transactional analysis. Transactional Analysis Journal 33, 1 (Jan. 2003), 37–44. https://doi.org/10.1177/036215370303300106",
      "doi": ""
    },
    {
      "text": "Lucie Bréchet, Denis Brunet, Lampros Perogamvros, Giulio Tononi, and Christoph M. Michel. 2020. EEG microstates of dreams. Scientific Reports 10(2020), 9 pages. https://doi.org/10.1038/s41598-020-74075-z",
      "doi": ""
    },
    {
      "text": "Michelle Carr, Adam Haar, Judith Amores, Pedro Lopes, Guillermo Bernal, Tomás Vega, Oscar Rosello, Abhinandan Jain, and Pattie Maes. 2020. Dream engineering: Simulating worlds through sensory stimulation. Consciousness and Cognition 83 (Aug. 2020), 102955. https://doi.org/10.1016/j.concog.2020.102955",
      "doi": ""
    },
    {
      "text": "Michelle Carr, Adam Haar Horowitz, Judith Amores, and Pattie Maes. 2020. Towards engineering dreams. Consciousness and Cognition 85 (Oct. 2020), 103006. https://doi.org/10.1016/j.concog.2020.103006",
      "doi": ""
    },
    {
      "text": "Maria Casagrande and Paolo Cortini. 2008. Spoken and written dream communication: Differences and methodological aspects. Consciousness and Cognition 17, 1 (March 2008), 145–158. https://doi.org/10.1016/j.concog.2007.11.002",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Sunny Consolvo, Nathaniel F. Watson, and Julie A. Kientz. 2011. Opportunities for computing technologies to support healthy sleep behaviors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 3053–3062. https://doi.org/10.1145/1978942.1979395",
      "doi": "10.1145/1978942.1979395"
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding quantified-selfers’ practices in collecting and exploring personal data. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14. ACM Press, Toronto, Ontario, Canada, 1143–1152. https://doi.org/10.1145/2556288.2557372",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2014. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Sage Publications, Los Angeles.",
      "doi": ""
    },
    {
      "text": "Rachel E. Crook Lyon and Clara E. Hill. 2004. Client Reactions to Working With Dreams in Psychotherapy. Dreaming 14, 4 (2004), 207–219. https://doi.org/10.1037/1053-0797.14.4.207",
      "doi": ""
    },
    {
      "text": "Antonietta Curci and Bernard Rimé. 2008. Dreams, emotions, and social sharing of dreams. Cognition and Emotion 22, 1 (Jan. 2008), 155–167. https://doi.org/10.1080/02699930701274102",
      "doi": ""
    },
    {
      "text": "Tim Dalgleish, Lauren Navrady, Elinor Bird, Emma Hill, Barnaby D. Dunn, and Ann-Marie Golden. 2013. Method-of-Loci as a Mnemonic Device to Facilitate Access to Self-Affirming Personal Memories for Individuals With Depression. Clinical Psychological Science 1, 2 (April 2013), 156–162. https://doi.org/10.1177/2167702612468111",
      "doi": ""
    },
    {
      "text": "David F Dinges. 1990. Are you awake? Cognitive performance and reverie during the hypnopompic state.. In Sleep and Cognition, Richard Bootzin, John Kihlstrom, and Daniel Schacter (Eds.). American Psychological Association, Washington, DC, 159–175.",
      "doi": ""
    },
    {
      "text": "G. William Domhoff. 1996. Finding meaning in dreams: a quantitative approach. Plenum Press, New York.",
      "doi": ""
    },
    {
      "text": "G. William Domhoff. 2017. The invasion of the concept snatchers: The origins, distortions, and future of the continuity hypothesis. Dreaming 27, 1 (2017), 14–39. https://doi.org/10.1037/drm0000047",
      "doi": ""
    },
    {
      "text": "Leslie Ellis. 2019. A Clinician’s Guide to Dream Therapy: Implementing Simple and Effective Dreamwork. Taylor & Francis Group, Milton, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Abigail C. Durrant, David Chatting, and David S. Kirk. 2017. Designing Documentary Informatics. In Proceedings of the 2017 Conference on Designing Interactive Systems(DIS ’17). Association for Computing Machinery, New York, NY, USA, 649–661. https://doi.org/10.1145/3064663.3064714",
      "doi": "10.1145/3064663.3064714"
    },
    {
      "text": "Chris Elsden, Abigail C. Durrant, and David S. Kirk. 2016. It’s Just My History Isn’t It? Understanding Smart Journaling Practices. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2819–2831. https://doi.org/10.1145/2858036.2858103",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, Clara Caldeira, Mayara C. Figueiredo, Xi Lu, Lucas M. Silva, Lucretia Williams, Jong H. Lee, Qingyang Li, Simran Ahuja, Qiuer Chen, Payam Dowlatyari, Craig Hilby, Sazeda Sultana, Elizabeth V. Eikey, and Yunan Chen. 2020. Mapping and Taking Stock of the Personal Informatics Literature. Proceedings of ACM on interactive, mobile, wearable and ubiquitous technologies 4, 4 (2020), 1–38. https://doi.org/10.1145/3432231",
      "doi": "10.1145/3432231"
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A lived informatics model of personal informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp ’15. ACM Press, Osaka, Japan, 731–742. https://doi.org/10.1145/2750858.2804250",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Robert Epstein. 1996. Self help without the hype. Performance Management Publications, Tucker, GA.",
      "doi": ""
    },
    {
      "text": "Daniel Erlacher and Michael Schredl. 2010. Practicing a Motor Task in a Lucid Dream Enhances Subsequent Performance: A Pilot Study. Sport Psychologist 24, 2 (June 2010), 157–167. https://doi.org/10.1123/tsp.24.2.157",
      "doi": ""
    },
    {
      "text": "Sigmund Freud and A. J. Cronin. 2013. The Interpretation Of Dreams. Read Books Ltd, Redditch, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Josefin Gavie and Antti Revonsuo. 2010. The future of lucid dreaming treatment. International Journal of Dream Research 3, 1 (2010), 13–15. https://doi.org/10.11588/ijodr.2010.1.591",
      "doi": ""
    },
    {
      "text": "Annika Gieselmann, Malik Ait Aoudia, Michelle Carr, Anne Germain, Robert Gorzka, Brigitte Holzinger, Birgit Kleim, Barry Krakow, Anna E. Kunze, Jaap Lancee, Michael R. Nadorff, Tore Nielsen, Dieter Riemann, Hinuga Sandahl, Angelika A. Schlarb, Carolin Schmid, Michael Schredl, Victor I. Spoormaker, Regina Steil, Annette M. van Schagen, Lutz Wittmann, Maria Zschoche, and Reinhard Pietrowsky. 2019. Aetiology and treatment of nightmare disorder: State of the art and future perspectives. Journal of Sleep Research 28, 4 (2019). https://doi.org/10.1111/jsr.12820",
      "doi": ""
    },
    {
      "text": "Soudabeh Givrad. 2016. Dream Theory and Science: A Review. Psychoanalytic Inquiry 36, 3 (April 2016), 199–213. https://doi.org/10.1080/07351690.2016.1145967",
      "doi": ""
    },
    {
      "text": "Adam Haar Horowitz, Tony J. Cunningham, Pattie Maes, and Robert Stickgold. 2020. Dormio: A targeted dream incubation device. Consciousness and Cognition 83 (Aug. 2020), 102938. https://doi.org/10.1016/j.concog.2020.102938",
      "doi": ""
    },
    {
      "text": "Calvin S. Hall and Robert L Van de Castle. 1966. The content analysis of dreams. Appleton-Century-Crofts, New York.",
      "doi": ""
    },
    {
      "text": "Gordon Halliday. 1987. Direct psychological therapies for nightmares: A review. Clinical Psychology Review 7, 5 (1987), 501–523. https://doi.org/10.1016/0272-7358(87)90041-9",
      "doi": ""
    },
    {
      "text": "Hye Joo Han, Richard Schweickert, Zhuangzhuang Xi, and Charles Viau‐Quesnel. 2016. The Cognitive Social Network in Dreams: Transitivity, Assortativity, and Giant Component Proportion Are Monotonic. Cognitive Science 40, 3 (2016), 671–696. https://doi.org/10.1111/cogs.12244",
      "doi": ""
    },
    {
      "text": "Gerlinde C. Harb, Janeese A. Brownlow, and Richard J. Ross. 2016. Posttraumatic nightmares and imagery rehearsal: The possible role of lucid dreaming. Dreaming 26, 3 (Sept. 2016), 238–249. https://doi.org/10.1037/drm0000030",
      "doi": ""
    },
    {
      "text": "Kristin J. Heaton, Clara E. Hill, David A. Peterson, Aaron B. Rochlen, and Jason S. Zack. 1998. A comparison of therapist-facilitated and self-guided dream interpretation sessions. Journal of Counseling Psychology 45, 1 (Jan. 1998), 115–122. https://doi.org/10.1037/0022-0167.45.1.115",
      "doi": ""
    },
    {
      "text": "Clara E. Hill. 1996. Working with dreams in psychotherapy. Guilford Press, New York.",
      "doi": ""
    },
    {
      "text": "Clara E. Hill, Roberta A. Diemer, and Kristin J. Heaton. 1997. Dream interpretation sessions: Who volunteers, who benefits, and what volunteer clients view as most and least helpful. Journal of Counseling Psychology 44, 1 (Jan. 1997), 53–62. https://doi.org/10.1037/0022-0167.44.1.53",
      "doi": ""
    },
    {
      "text": "Clara E. Hill, Jingqing Liu, Patricia Spangler, Wonjin Sim, and Michele Schottenbauer. 2008. Working with dreams in psychotherapy: What do psychoanalytic therapists report that they do?Psychoanalytic Psychology 25, 4 (2008), 565–573. https://doi.org/10.1037/a0013539",
      "doi": ""
    },
    {
      "text": "Dize Hilviu and Amon Rapp. 2015. Narrating the quantified self. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers(UbiComp/ISWC’15 Adjunct). Association for Computing Machinery, New York, NY, USA, 1051–1056. https://doi.org/10.1145/2800835.2800959",
      "doi": ""
    },
    {
      "text": "J. Allan Hobson. 2009. REM sleep and dreaming: towards a theory of protoconsciousness. Nature Reviews Neuroscience 10, 11 (Nov. 2009), 803–813. https://doi.org/10.1038/nrn2716",
      "doi": ""
    },
    {
      "text": "Erik Hoel. 2021. The overfitted brain: Dreams evolved to assist generalization. Patterns 2, 5 (May 2021), 100244. https://doi.org/10.1016/j.patter.2021.100244",
      "doi": ""
    },
    {
      "text": "Karen Ijams and Larry D. Miller. 2000. Perceptions of dream‐disclosure: An exploratory study. Communication Studies 51, 2 (June 2000), 135–148. https://doi.org/10.1080/10510970009388514",
      "doi": ""
    },
    {
      "text": "Dreamboard Inc. 2021. Dreamboard. Apple App Store.",
      "doi": ""
    },
    {
      "text": "C. G. Jung and R. F. C. Hull. 1974. Dreams: (From Volumes 4, 8, 12, and 16 of the Collected Works of C. G. Jung) (reviseded.). Princeton University Press, Princeton, NJ. http://www.jstor.org/stable/j.ctt7rsm8",
      "doi": ""
    },
    {
      "text": "John W. Keller, Gina Brown, Katja Maier, Korinne Steinfurth, Shelly Hall, and Chris Piotrowski. 1995. Use of dreams in therapy: a survey of clinicians in private practice. Psychological Reports 76, 3 (June 1995), 1288–1290. https://doi.org/10.2466/pr0.1995.76.3c.1288",
      "doi": ""
    },
    {
      "text": "Bruce M. Knauft. 2020. Life is but a dream. In New Directions in the Anthropology of Dreaming (1 ed.), Jeannette Mageo and Robin E. Sheriff (Eds.). Routledge, London, 204–225. https://doi.org/10.4324/9781003037330-13",
      "doi": ""
    },
    {
      "text": "Ko Ping-Ru T., Kientz Julie A., Choe Eun Kyoung, Kay Matthew, Landis Carol A., and Watson Nathaniel F.2015. Consumer Sleep Technologies: A Review of the Landscape. Journal of Clinical Sleep Medicine 11, 12 (2015), 1455–1461. https://doi.org/10.5664/jcsm.5288",
      "doi": ""
    },
    {
      "text": "Karen Konkoly and Christopher T. Burke. 2019. Can learning to lucid dream promote personal growth?Dreaming 29, 2 (2019), 113–126. https://doi.org/10.1037/drm0000101",
      "doi": ""
    },
    {
      "text": "Karen R. Konkoly, Kristoffer Appel, Emma Chabani, Anastasia Mangiaruga, Jarrod Gott, Remington Mallett, Bruce Caughran, Sarah Witkowski, Nathan W. Whitmore, Christopher Y. Mazurek, Jonathan B. Berent, Frederik D. Weber, Başak Türker, Smaranda Leu-Semenescu, Jean-Baptiste Maranci, Gordon Pipa, Isabelle Arnulf, Delphine Oudiette, Martin Dresler, and Ken A. Paller. 2021. Real-time dialogue between experimenters and dreamers during REM sleep. Current Biology 31, 7 (April 2021), 1417–1427.e6. https://doi.org/10.1016/j.cub.2021.01.026",
      "doi": ""
    },
    {
      "text": "David Krackhardt. 1987. Cognitive social structures. Social networks 9, 2 (1987), 109–134.",
      "doi": ""
    },
    {
      "text": "Barry Krakow, Michael Hollifield, Ron Schrader, Mary Koss, Dan Tandberg, John Lauriello, Leslie McBride, Teddy D. Warner, Diana Cheng, Tonya Edmond, and Robert Kellner. 2000. A controlled study of imagery rehearsal for chronic nightmares in sexual assault survivors with PTSD: a preliminary report. Journal of Traumatic Stress 13, 4 (Oct. 2000), 589–609. https://doi.org/10.1023/A:1007854015481",
      "doi": ""
    },
    {
      "text": "Barry Krakow, Robert Kellner, Dorothy Pathak, and Lori Lambert. 1995. Imagery rehearsal treatment for chronic nightmares. Behaviour Research and Therapy 33, 7 (Sept. 1995), 837–843. https://doi.org/10.1016/0005-7967(95)00009-M",
      "doi": ""
    },
    {
      "text": "Stanley Krippner and April Thompson. 1996. A 10-facet model of dreaming applied to dream practices of sixteen Native American cultural groups. Dreaming 6, 2 (June 1996), 71–96. https://doi.org/10.1037/h0094448",
      "doi": ""
    },
    {
      "text": "Caroline Kussé, Vincenzo Muto, Laura Mascetti, Luca Matarazzo, Ariane Foret, Anahita Shaffii-Le Bourdiec, and Pierre Maquet. 2010. Neuroimaging Of Dreaming: State Of The Art And Limitations. In International Review of Neurobiology, Angela Clow and Patrick McNamara (Eds.). Vol. 92. Academic Press, Amsterdam, 87–99. https://doi.org/10.1016/S0074-7742(10)92005-9",
      "doi": ""
    },
    {
      "text": "Stephen LaBerge and Howard Rheingold. 1991. Exploring the world of lucid dreaming. Ballantine Books, New York.",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stage-based model of personal informatics systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ‘10). ACM Press, New York, 557 – 566. https://doi.org/10.1145/1753326.1753409",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Shirley Xin Li, Bin Zhang, Albert Martin Li, and Yun Kwok Wing. 2010. Prevalence and correlates of frequent nightmares: a community-based 2-phase study. Sleep 33, 6 (June 2010), 774–780. https://doi.org/10.1093/sleep/33.6.774",
      "doi": ""
    },
    {
      "text": "Anastasia Mangiaruga, Serena Scarpelli, Chiara Bartolacci, and Luigi De Gennaro. 2018. Spotlight on dream recall: the ages of dreams. Nature and Science of Sleep 10 (Jan. 2018), 1–12. https://doi.org/10.2147/NSS.S135762",
      "doi": ""
    },
    {
      "text": "David F. Mastin, Jeff Bryson, and Robert Corwyn. 2006. Assessment of Sleep Hygiene Using the Sleep Hygiene Index. Journal of Behavioral Medicine 29, 3 (June 2006), 223–227. https://doi.org/10.1007/s10865-006-9047-6",
      "doi": ""
    },
    {
      "text": "Raymond G. Miltenberger. 2008. Behavior modification: principles and procedures (4th ed ed.). Thomson Wadsworth, Belmont, CA.",
      "doi": ""
    },
    {
      "text": "David C. Mohr, Ken Cheung, Stephen M. Schueller, C. Hendricks Brown, and Naihua Duan. 2013. Continuous Evaluation of Evolving Behavioral Intervention Technologies. American Journal of Preventive Medicine 45, 4 (Oct. 2013), 517–523. https://doi.org/10.1016/j.amepre.2013.06.006",
      "doi": ""
    },
    {
      "text": "Sérgio A. Mota-Rolim, Achilleas Pavlou, George C. Nascimento, John Fontenele-Araujo, and Sidarta Ribeiro. 2019. Portable Devices to Induce Lucid Dreams—Are They Reliable?Frontiers in Neuroscience 13 (May 2019), 428. https://doi.org/10.3389/fnins.2019.00428",
      "doi": ""
    },
    {
      "text": "E.D. Mynatt, A.-S. Melenhorst, A.-D. Fisk, and W.A. Rogers. 2004. Aware technologies for aging in place: understanding user needs and attitudes. IEEE Pervasive Computing 3, 2 (April 2004), 36–41. https://doi.org/10.1109/MPRV.2004.1316816",
      "doi": "10.1109/MPRV.2004.1316816"
    },
    {
      "text": "Anh Nguyen, Raghda Alqurashi, Zohreh Raghebi, Farnoush Banaei-kashani, Ann C. Halbower, Thang Dinh, and Tam Vu. 2016. In-ear Biosignal Recording System: A Wearable For Automatic Whole-night Sleep Staging. In Proceedings of the 2016 Workshop on Wearable Systems and Applications - WearSys ’16. ACM Press, Singapore, Singapore, 19–24. https://doi.org/10.1145/2935643.2935649",
      "doi": "10.1145/2935643.2935649"
    },
    {
      "text": "Kyue Taek Oh, Jaemyung Shin, Jaejeung Kim, and Minsam Ko. 2020. Analysis of a Wake-Up Task-Based Mobile Alarm App. Applied Sciences 10, 11 (June 2020), 3993. https://doi.org/10.3390/app10113993",
      "doi": ""
    },
    {
      "text": "Michael Rohde Olsen, Michael Schredl, and Ingegerd Carlsson. 2013. Sharing dreams: Frequency, motivations, and relationship intimacy.Dreaming 23, 4 (2013), 245–255. https://doi.org/10.1037/a0033392",
      "doi": ""
    },
    {
      "text": "Michael Rohde Olsen, Michael Schredl, and Ingegerd Carlsson. 2020. Conscious use of dreams in waking life (nontherapy setting) for decision-making, problem-solving, attitude formation, and behavioral change. Dreaming 30, 3 (Sept. 2020), 257–266. https://doi.org/10.1037/drm0000138",
      "doi": ""
    },
    {
      "text": "Delphine Oudiette, Marie-José Dealberto, Ginevra Uguccioni, Jean-Louis Golmard, Milagros Merino-Andreu, Mehdi Tafti, Lucile Garma, Sophie Schwartz, and Isabelle Arnulf. 2012. Dreaming without REM sleep. Consciousness and Cognition 21, 3 (Sept. 2012), 1129–1140. https://doi.org/10.1016/j.concog.2012.04.010",
      "doi": ""
    },
    {
      "text": "Edward Pace-Schott. 2004. What is a Dream Generator?Sleep and Hypnosis 6, 2 (2004), 43–53. ISBN: 13021192.",
      "doi": ""
    },
    {
      "text": "Laura Palagini and Nicholas Rosenlicht. 2011. Sleep, dreaming, and mental health: A review of historical and neurobiological perspectives. Sleep Medicine Reviews 15, 3 (June 2011), 179–186. https://doi.org/10.1016/j.smrv.2010.07.003",
      "doi": ""
    },
    {
      "text": "Vishvajit Pandya. 2004. Forest smells and spider webs: Ritualized dream interpretation among Andaman Islanders. Dreaming 14, 2-3 (June 2004), 136–150. https://doi.org/10.1037/1053-0797.14.2-3.136",
      "doi": ""
    },
    {
      "text": "Eyal Peer, Joachim Vosgerau, and Alessandro Acquisti. 2014. Reputation as a sufficient condition for data quality on Amazon Mechanical Turk. Behavior research methods 46, 4 (2014), 1023–1031. https://doi.org/10.3758/s13428-013-0434-y",
      "doi": ""
    },
    {
      "text": "Anu-Katriina Pesonen, Jari Lipsanen, Risto Halonen, Marko Elovainio, Nils Sandman, Juha-Matti Mäkelä, Minea Antila, Deni Béchard, Hanna M. Ollila, and Liisa Kuula. 2020. Pandemic Dreams: Network Analysis of Dream Content During the COVID-19 Lockdown. Frontiers in Psychology 11 (2020), 2569. https://doi.org/10.3389/fpsyg.2020.573961",
      "doi": ""
    },
    {
      "text": "Melanie Rosen. 2013. What I make up when I wake up: anti-experience views and narrative fabrication of dreams. Frontiers in Psychology 4 (2013), 514. https://doi.org/10.3389/fpsyg.2013.00514",
      "doi": ""
    },
    {
      "text": "Serena Scarpelli, Aurora D’Atri, Anastasia Mangiaruga, Cristina Marzano, Maurizio Gorgoni, Cinzia Schiappa, Michele Ferrara, and Luigi De Gennaro. 2017. Predicting Dream Recall: EEG Activation During NREM Sleep or Shared Mechanisms with Wakefulness?Brain Topography 30, 5 (Sept. 2017), 629–638. https://doi.org/10.1007/s10548-017-0563-1",
      "doi": ""
    },
    {
      "text": "Anna Maria van Schagen. 2016. Prevalence, correlates and treatment of nightmares in secondary mental healthcare. Ph.D. Dissertation. Utrecht University, Utrecht.",
      "doi": ""
    },
    {
      "text": "Michael Schredl. 2002. Questionnaires and Diaries as Research Instruments in Dream Research: Methodological Issues. Dreaming 12, 1 (March 2002), 17–26. https://doi.org/10.1023/A:1013890421674",
      "doi": ""
    },
    {
      "text": "Michael Schredl. 2010. Nightmare frequency and nightmare topics in a representative German sample. European Archives of Psychiatry and Clinical Neuroscience 260, 8 (Dec. 2010), 565–570. https://doi.org/10.1007/s00406-010-0112-3",
      "doi": ""
    },
    {
      "text": "Michael Schredl. 2013. Nightmare frequency in a representative German sample. International Journal of Dream Research 6, 2 (2013), 119–122. https://doi.org/10.11588/ijodr.2013.2.11127",
      "doi": ""
    },
    {
      "text": "Michael Schredl, Sabrina Berres, Anna Klingauf, Sabine Schellhaas, and Anja S. Göritz. 2014. The Mannheim Dream questionnaire (MADRE): Retest reliability, age and gender effects. International Journal of Dream Research 7, 2 (Oct. 2014), 141–147. https://doi.org/10.11588/ijodr.2014.2.16675",
      "doi": ""
    },
    {
      "text": "Michael Schredl, Claudia Bohusch, Johanna Kahl, Andrea Mader, and Alexandra Somesan. 2000. The Use of Dreams in Psychotherapy. The Journal of Psychotherapy Practice and Research 9, 2 (2000), 81–87. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3330585/",
      "doi": ""
    },
    {
      "text": "Michael Schredl, Melissa Braband, Johanna Gödde, Sophie Kreicker, and Anja S. Göritz. 2019. Dream recall frequency and attitude toward dreams: Stability over a 5-year period.Dreaming 29, 4 (Dec. 2019), 303–309. https://doi.org/10.1037/drm0000116",
      "doi": ""
    },
    {
      "text": "Michael Schredl and Evelyn Doll. 2001. Dream recall, attitude towards dreams and mental health. Sleep and Hypnosis 3(2001), 135–143.",
      "doi": ""
    },
    {
      "text": "Michael Schredl, Janina Dreer, Anna Mösle, Maximiliane Rall, Lisa Rauch, Sophia Rose, and Svenja Seuffert. 2019. Voice-recorded vs. written dream reports: A research note. International Journal of Dream Research 12, 1 (April 2019), 138–140. https://doi.org/10.11588/ijodr.2019.1.58801",
      "doi": ""
    },
    {
      "text": "Michael Schredl and Anja Goritz. 2020. Dream journaling: Stability and relation to personality factors. Dreaming 30, 3 (2020), 278–286. https://doi.org/10.1037/drm0000137",
      "doi": ""
    },
    {
      "text": "Michael Schredl and Friedrich Hofmann. 2003. Continuity between waking activities and dream activities. Consciousness and Cognition 12, 2 (June 2003), 298–308. https://doi.org/10.1016/S1053-8100(02)00072-7",
      "doi": ""
    },
    {
      "text": "Itamar Shatz. 2017. Fast, Free, and Targeted: Reddit as a Source for Recruiting Participants Online. Social Science Computer Review 35, 4 (Aug. 2017), 537–549. https://doi.org/10.1177/0894439316650163",
      "doi": "10.1177/0894439316650163"
    },
    {
      "text": "Jerome M. Siegel. 2001. The REM Sleep-Memory Consolidation Hypothesis. Science 294, 5544 (Nov. 2001), 1058–1063. https://doi.org/10.1126/science.1063049",
      "doi": ""
    },
    {
      "text": "Standards of Practice Committee, R. Nisha Aurora, Rochelle S. Zak, Sanford H. Auerbach, Kenneth R. Casey, Susmita Chowdhuri, Anoop Karippot, Rama K. Maganti, Kannan Ramar, David A. Kristo, Sabin R. Bista, Carin I. Lamm, and Timothy I. Morgenthaler. 2010. Best Practice Guide for the Treatment of Nightmare Disorder in Adults. Journal of Clinical Sleep Medicine 06, 04 (Aug. 2010), 389–401. https://doi.org/10.5664/jcsm.27883",
      "doi": ""
    },
    {
      "text": "John Sterman. 2000. Business dynamics: Systems thinking and modeling for a complex world. McGraw-Hill, Inc., Boston.",
      "doi": ""
    },
    {
      "text": "John Sterman. 2002. System Dynamics: systems thinking and modeling for a complex world. Technical Report. Massachusetts Institute of Technology. Engineering Systems Division, Cambridge, MA. http://hdl.handle.net/1721.1/102741",
      "doi": ""
    },
    {
      "text": "Raphael Vallat, Tarek Lajnef, Jean-Baptiste Eichenlaub, Christian Berthomier, Karim Jerbi, Dominique Morlet, and Perrine M. Ruby. 2017. Increased Evoked Potentials to Arousing Auditory Stimuli during Sleep: Implication for the Understanding of Dream Recall. Frontiers in Human Neuroscience 11 (2017), 132. https://doi.org/10.3389/fnhum.2017.00132",
      "doi": ""
    },
    {
      "text": "Katja Valli and Antti Revonsuo. 2009. The threat simulation theory in light of recent empirical evidence: A review. The American Journal of Psychology 122, 1 (2009), 17–38. https://www.jstor.org/stable/27784372",
      "doi": ""
    },
    {
      "text": "Robert L Van de Castle. 1995. Our dreaming mind. Ballantine Books, New York.",
      "doi": ""
    },
    {
      "text": "Nancy Van House and Elizabeth F. Churchill. 2008. Technologies of memory: Key issues and critical perspectives. Memory Studies 1, 3 (Sept. 2008), 295–310. https://doi.org/10.1177/1750698008093795",
      "doi": ""
    },
    {
      "text": "Jennifer Windt. 2013. Reporting dream experience: Why (not) to be skeptical about dream reports. Frontiers in Human Neuroscience 7 (2013), 708. https://doi.org/10.3389/fnhum.2013.00708",
      "doi": ""
    },
    {
      "text": "Antonio Zadra and Don C. Donderi. 2000. Nightmares and bad dreams: Their prevalence and relationship to well-being. Journal of Abnormal Psychology 109, 2 (May 2000), 273–281. https://doi.org/10.1037/0021-843X.109.2.273",
      "doi": ""
    },
    {
      "text": "Antonio Zadra and Geneviève Robert. 2012. Dream recall frequency: Impact of prospective measures and motivational factors. Consciousness and Cognition 21, 4 (Dec. 2012), 1695–1702. https://doi.org/10.1016/j.concog.2012.08.011",
      "doi": ""
    },
    {
      "text": "Mariella Zunker, Hanna Katharina Althoff, Julia Apel, Hannah Sophie Lässig, Leonie Schueltke, and Michael Schredl. 2015. Comparing questionnaire and diary measures for eliciting nightmare frequency. International Journal of Dream Research 8, 2 (Oct. 2015), 129–134. https://doi.org/10.11588/IJODR.2015.2.23395",
      "doi": ""
    }
  ]
}