{
  "doi": "10.1145/3491102.3517722",
  "title": "Monitoring Screen Time or Redesigning It?: Two Approaches to Supporting Intentional Social Media Use",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2022,
  "badges": [],
  "abstract": "Existing designs helping people manage their social media use include: 1) external supports that monitor and limit use; 2) internal supports that change the interface itself. Here, we design and deploy Chirp, a mobile Twitter client, to independently examine how users experience external and internal supports. To develop Chirp, we identified 16 features that influence users’ sense of agency on Twitter through a survey of 129 participants and a design workshop. We then conducted a four-week within-subjects deployment with 31 participants. Our internal supports (including features to filter tweets and inform users when they have exhausted new content) significantly increased users’ sense of agency, while our external supports (a usage dashboard and nudges to close the app) did not. Participants valued our internal supports and said that our external supports were for “other people.” Our findings suggest that design patterns promoting agency may serve users better than screen time tools.",
  "authors": [
    {
      "name": "Mingrui Ray Zhang",
      "institution": "The Information School, University of Washington, United States",
      "img": "/do/10.1145/contrib-99659529048/rel-imgonly/f.png",
      "acmid": "99659529048",
      "orcid": "missing"
    },
    {
      "name": "Kai Lukoff",
      "institution": "Human Centered Design & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161231",
      "orcid": "0000-0001-5069-6817"
    },
    {
      "name": "Raveena Rao",
      "institution": "Information School, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240443",
      "orcid": "0000-0002-2545-5066"
    },
    {
      "name": "Amanda Baughan",
      "institution": "Paul G. Allen School of Computer Science and Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527940",
      "orcid": "0000-0003-2217-6974"
    },
    {
      "name": "Alexis Hiniker",
      "institution": "Information School, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82258949157",
      "orcid": "0000-0003-1607-0778"
    }
  ],
  "references": [
    {
      "text": "Eric P.S. Baumer, Phil Adams, Vera D. Khovanskaya, Tony C. Liao, Madeline E. Smith, Victoria Schwanda Sosik, and Kaiton Williams. 2013. Limiting, Leaving, and (Re)Lapsing: An Exploration of Facebook Non-Use Practices and Experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 3257–3266.",
      "doi": "10.1145/2470654.2466446"
    },
    {
      "text": "Eric PS Baumer, Shion Guha, Emily Quan, David Mimno, and Geri K Gay. 2015. Missing photos, suffering withdrawal, or finding freedom? How experiences of social media non-use influence the likelihood of reversion. Social Media+ Society 1, 2 (2015), 2056305115614851.",
      "doi": ""
    },
    {
      "text": "Kerstin Bongard-Blanchy, Arianna Rossi, Salvador Rivas, Sophie Doublet, Vincent Koenig, and Gabriele Lenzini. 2021. ”I Am Definitely Manipulated, Even When I Am Aware of It. It’s Ridiculous!” - Dark Patterns from the End-User Perspective. In Designing Interactive Systems Conference 2021. Association for Computing Machinery, New York, NY, USA, 763–776.",
      "doi": ""
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. sage, Thousand Oaks, CA, US.",
      "doi": ""
    },
    {
      "text": "J. Burgess and N.K. Baym. 2020. Twitter: A Biography. NYU Press, New York, NY, USA. https://books.google.ca/books?id=RRq5DwAAQBAJ",
      "doi": ""
    },
    {
      "text": "Moira Burke and Robert E Kraut. 2016. The relationship between Facebook use and well-being depends on communication type and tie strength. Journal of computer-mediated communication 21, 4 (2016), 265–281.",
      "doi": "10.1111/jcc4.12162"
    },
    {
      "text": "Marta E Cecchinato, John Rooksby, Alexis Hiniker, Sean Munson, Kai Lukoff, Luigina Ciolfi, Anja Thieme, and Daniel Harrison. 2019. Designing for Digital Wellbeing: A Research & Practice Agenda. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19, Paper W17). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3290607.3298998",
      "doi": "10.1145/3290607.3298998"
    },
    {
      "text": "Gina Masullo Chen. 2011. Tweet this: A uses and gratifications perspective on how active Twitter use gratifies a need to connect with others. Computers in human behavior 27, 2 (March 2011), 755–762.",
      "doi": ""
    },
    {
      "text": "Justin Cheng, Moira Burke, and Elena Goetz Davis. 2019. Understanding Perceptions of Problematic Facebook Use: When People Experience Negative Life Impact and a Lack of Control. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3290605.3300429"
    },
    {
      "text": "Emily I. M. Collins, Anna L. Cox, Jon Bird, and Daniel Harrison. 2014. Social Networking Use and RescueTime: The Issue of Engagement. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (Seattle, Washington) (UbiComp ’14 Adjunct). Association for Computing Machinery, New York, NY, USA, 687–690.",
      "doi": "10.1145/2638728.2641322"
    },
    {
      "text": "Constantinos Coursaris, Michigan State University, Wietske Van Osch, Jieun Sung, Younghwa Yun, Michigan State University, LG Telecom, and Michigan State University. 2013. Disentangling twitter’s adoption and use (dis)continuance: A theoretical and empirical amalgamation of uses and gratifications and diffusion of innovations. AIS transactions on human-computer interaction 5, 1 (March 2013), 57–83.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi and Reed Larson. 2014. Validity and reliability of the experience-sampling method. In Flow and the foundations of positive psychology. Springer, USA, 35–54.",
      "doi": ""
    },
    {
      "text": "Michelle Cyca. 2020. Twitter Marketing: The Complete Guide for Business. https://blog.hootsuite.com/twitter-marketing/",
      "doi": ""
    },
    {
      "text": "Nicole B Ellison, Jessica Vitak, Rebecca Gray, and Cliff Lampe. 2014. Cultivating social resources on social network sites: Facebook relationship maintenance behaviors and their role in social capital processes. Journal of Computer-Mediated Communication 19, 4 (2014), 855–870.",
      "doi": "10.1111/jcc4.12078"
    },
    {
      "text": "Christine Geeng, Savanna Yee, and Franziska Roesner. 2020. Fake News on Facebook and Twitter: Investigating How People (Don’t) Investigate. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376784"
    },
    {
      "text": "Denis Gerstorf, Christina Röcke, and Margie Lachman. 2010. Antecedent-Consequent Relations of Perceived Control to Health and Social Support: Longitudinal Evidence for Between-Domain Associations Across Adulthood. The journals of gerontology. Series B, Psychological sciences and social sciences 66 (11 2010), 61–71. https://doi.org/10.1093/geronb/gbq077",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Sharon S. Heung, Sungsoo (Ray) Hong, and Julie A. Kientz. 2018. Coco’s Videos: An Empirical Investigation of Video-Player Design Features and Children’s Media Use. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3173574.3173828"
    },
    {
      "text": "Alexis Hiniker, Sungsoo (Ray) Hong, Tadayoshi Kohno, and Julie A. Kientz. 2016. MyTime: Designing and Evaluating an Intervention for Smartphone Non-Use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 4746–4757.",
      "doi": "10.1145/2858036.2858403"
    },
    {
      "text": "Alexis Hiniker, Kiley Sobel, Hyewon Suh, Yi-Chen Sung, Charlotte P. Lee, and Julie A. Kientz. 2015. Texting While Parenting: How Adults Use Mobile Phones While Caring for Children at the Playground. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 727–736.",
      "doi": "10.1145/2702123.2702199"
    },
    {
      "text": "Alec R. Hosterman, Naomi R. Johnson, Ryan Stouffer, and Steven Herring. 2018. Twitter, Social Support Messages, and the #MeToo Movement. Social media and society 7 (2018), 69–91.",
      "doi": ""
    },
    {
      "text": "Kaori Ikematsu, Kunihiro Kato, and Yoshihiro Kawahara. 2021. LightTouch Gadgets: Extending Interactions on Capacitive Touchscreens by Converting Light Emission to Touch Inputs. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 509, 11 pages.",
      "doi": "10.1145/3411764.3445581"
    },
    {
      "text": "Philip R Johnson and S Yang. 2009. Uses and gratifications of Twitter: An examination of user motives and satisfaction of Twitter use. In Communication Technology Division of the annual convention of the Association for Education in Journalism and Mass Communication. researchgate.net, Boston, MA, USA, 1.",
      "doi": ""
    },
    {
      "text": "M Laeeq Khan. 2017. Social media engagement: What motivates user participation and consumption on YouTube?Computers in human behavior 66 (Jan. 2017), 236–247. https://doi.org/10.1016/j.chb.2016.09.024",
      "doi": ""
    },
    {
      "text": "Inyeop Kim, Hwarang Goh, Nematjon Narziev, Youngtae Noh, and Uichin Lee. 2020. Understanding User Contexts and Coping Strategies for Context-Aware Phone Distraction Management System Design. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 4 (2020), 1–33.",
      "doi": "10.1145/3415161"
    },
    {
      "text": "Inyeop Kim, Gyuwon Jung, Hayoung Jung, Minsam Ko, and Uichin Lee. 2017. Let’s FOCUS: mitigating mobile phone use in college classrooms. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 1–29.",
      "doi": "10.1145/3131893"
    },
    {
      "text": "Jaejeung Kim, Chiwoo Cho, and Uichin Lee. 2017. Technology supported behavior restriction for mitigating self-interruptions in multi-device environments. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 1–21.",
      "doi": "10.1145/3131893"
    },
    {
      "text": "Jaejeung Kim, Hayoung Jung, Minsam Ko, and Uichin Lee. 2019. Goalkeeper: Exploring interaction lockout mechanisms for regulating smartphone use. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 1 (2019), 1–29.",
      "doi": "10.1145/3314403"
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Eun Kyoung Choe, Bongshin Lee, KwonHyun Kim, and Jinwook Seo. 2016. TimeAware: Leveraging Framing Effects to Enhance Personal Productivity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 272–283.",
      "doi": "10.1145/2858036.2858428"
    },
    {
      "text": "Kagan Kircaburun. 2016. Effects of Gender and Personality Differences on Twitter Addiction among Turkish Undergraduates. Journal of Education and Practice 7, 24 (2016), 33–42.",
      "doi": ""
    },
    {
      "text": "Kagan Kircaburun and Mark D Griffiths. 2018. Instagram addiction and the Big Five of personality: The mediating role of self-liking. Journal of behavioral addictions 7, 1 (March 2018), 158–170. https://doi.org/10.1556/2006.7.2018.15",
      "doi": ""
    },
    {
      "text": "Minsam Ko, Seungwoo Choi, Subin Yang, Joonwon Lee, and Uichin Lee. 2015. FamiLync: Facilitating Participatory Parental Mediation of Adolescents’ Smartphone Use. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Osaka, Japan) (UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 867–878.",
      "doi": "10.1145/2750858.2804283"
    },
    {
      "text": "Minsam Ko, Seungwoo Choi, Koji Yatani, and Uichin Lee. 2016. Lock n’ LoL: Group-Based Limiting Assistance App to Mitigate Smartphone Distractions in Group Activities. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 998–1010.",
      "doi": "10.1145/2858036.2858568"
    },
    {
      "text": "Minsam Ko, Subin Yang, Joonwon Lee, Christian Heizmann, Jinyoung Jeong, Uichin Lee, Daehee Shin, Koji Yatani, Junehwa Song, and Kyong-Mee Chung. 2015. NUGU: A Group-Based Intervention App for Improving Self-Regulation of Limiting Smartphone Use. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 1235–1245.",
      "doi": "10.1145/2675133.2675244"
    },
    {
      "text": "Geza Kovacs, Zhengxuan Wu, and Michael S. Bernstein. 2018. Rotating Online Behavior Change Interventions Increases Effectiveness But Also Increases Attrition. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 95 (nov 2018), 25 pages.",
      "doi": "10.1145/3274364"
    },
    {
      "text": "Geza Kovacs, Zhengxuan Wu, and Michael S. Bernstein. 2021. Not Now, Ask Later: Users Weaken Their Behavior Change Regimen Over Time, But Expect To Re-Strengthen It Imminently. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 229, 14 pages.",
      "doi": "10.1145/3411764.3445695"
    },
    {
      "text": "M. Lachman and S. L. Weaver. 1998. The sense of control as a moderator of social class differences in health and well-being.Journal of personality and social psychology 74 3 (1998), 763–73.",
      "doi": ""
    },
    {
      "text": "J Richard Landis and Gary G Koch. 1977. The measurement of observer agreement for categorical data. biometrics 1, 1 (1977), 159–174.",
      "doi": ""
    },
    {
      "text": "Heyoung Lee, Heejune Ahn, Samwook Choi, and Wanbok Choi. 2014. The SAMS: Smartphone addiction management system and verification. Journal of medical systems 38, 1 (2014), 1–10.",
      "doi": "10.1007/s10916-013-0001-1"
    },
    {
      "text": "Markus Löchtefeld, Matthias Böhmer, and Lyubomir Ganev. 2013. AppDetox: Helping Users with Mobile App Addiction. In Proceedings of the 12th International Conference on Mobile and Ubiquitous Multimedia (Luleå, Sweden) (MUM ’13). Association for Computing Machinery, New York, NY, USA, Article 43, 2 pages.",
      "doi": "10.1145/2541831.2541870"
    },
    {
      "text": "Edwin A Locke. 2002. Setting goals for life and happiness. Handbook of positive psychology 522 (2002), 299–312.",
      "doi": ""
    },
    {
      "text": "Kai Lukoff, Ulrik Lyngs, Himanshu Zade, J. Vera Liao, James Choi, Kaiyue Fan, Sean A. Munson, and Alexis Hiniker. 2021. How the Design of YouTube Influences User Sense of Agency. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 368, 17 pages.",
      "doi": "10.1145/3411764.3445467"
    },
    {
      "text": "John R. Lund and Jason Wiese. 2021. Less is More: Exploring Support for Time Management Planning. In Designing Interactive Systems Conference 2021 (Virtual Event, USA) (DIS ’21). Association for Computing Machinery, New York, NY, USA, 392–405.",
      "doi": "10.1145/3461778.3462133"
    },
    {
      "text": "Yuhan Luo, Peiyi Liu, and Eun Kyoung Choe. 2019. Co-Designing Food Trackers with Dietitians: Identifying Design Opportunities for Food Tracker Customization. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3290605.3300822"
    },
    {
      "text": "Ulrik Lyngs, Kai Lukoff, Petr Slovak, Reuben Binns, Adam Slack, Michael Inzlicht, Max Van Kleek, and Nigel Shadbolt. 2019. Self-Control in Cyberspace: Applying Dual Systems Theory to a Review of Digital Self-Control Tools. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–18.",
      "doi": "10.1145/3290605.3300361"
    },
    {
      "text": "Ulrik Lyngs, Kai Lukoff, Petr Slovak, William Seymour, Helena Webb, Marina Jirotka, Jun Zhao, Max Van Kleek, and Nigel Shadbolt. 2020. ’I Just Want to Hack Myself to Not Get Distracted’: Evaluating Design Interventions for Self-Control on Facebook. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–15.",
      "doi": "10.1145/3313831.3376672"
    },
    {
      "text": "Janet Metcalfe and Matthew Jason Greene. 2007. Metacognition of agency.Journal of Experimental Psychology: General 136, 2 (2007), 184.",
      "doi": ""
    },
    {
      "text": "Ally Mintzer. 2020. Paying Attention: The Attention Economy. Berkeley Economics Review 1, 1 (Mar 2020), 1.",
      "doi": ""
    },
    {
      "text": "Alberto Monge Roffarello and Luigi De Russis. 2019. The Race Towards Digital Wellbeing: Issues and Opportunities. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3290605.3300616"
    },
    {
      "text": "James W. Moore. 2016. What Is the Sense of Agency and Why Does it Matter?Frontiers in Psychology 7 (2016), 1.",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris. 2014. Social Networking Site Use by Mothers of Young Children. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing(Baltimore, Maryland, USA) (CSCW ’14). Association for Computing Machinery, New York, NY, USA, 1272–1282.",
      "doi": "10.1145/2531602.2531603"
    },
    {
      "text": "Martha C. Nussbaum. 2013. Creating capabilities: the human development approach. Belknap Press of Harvard University Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Fabian Okeke, Michael Sobolev, Nicola Dell, and Deborah Estrin. 2018. Good Vibrations: Can a Digital Nudge Reduce Digital Overload?. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (Barcelona, Spain) (MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, Article 4, 12 pages.",
      "doi": "10.1145/3229434.3229463"
    },
    {
      "text": "Mark Peterson. 2021. How Much Time Do People Spend On Social Media In 2021?https://famemass.com/time-spent-on-social-media/. FameMass.",
      "doi": ""
    },
    {
      "text": "Laura Portwood-Stacer. 2013. Media refusal and conspicuous non-consumption: The performative and political dimensions of Facebook abstention. New Media & Society 15, 7 (2013), 1041–1057.",
      "doi": ""
    },
    {
      "text": "Anne Elizabeth Sanders and AJ Spencer. 2005. Why do poor adults rate their oral health poorly?Australian dental journal 50, 3 (2005), 161–167.",
      "doi": ""
    },
    {
      "text": "Sarita Yardi Schoenebeck. 2014. Giving up Twitter for Lent: How and Why We Take Breaks from Social Media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 773–782.",
      "doi": "10.1145/2556288.2556983"
    },
    {
      "text": "Stefan Stieglitz, Deborah Bunker, Milad Mirbabaie, and Christian Ehnis. 2018. Sense-making in social media during extreme events. Journal of Contingencies and Crisis Management 26, 1(2018), 4–15.",
      "doi": ""
    },
    {
      "text": "Adam Tapal, Ela Oren, Reuven Dar, and Baruch Eitam. 2017. The sense of agency scale: A measure of consciously perceived control over one’s mind, body, and the immediate environment. Frontiers in psychology 8 (2017), 1552.",
      "doi": ""
    },
    {
      "text": "Jonathan A. Tran, Katie S. Yang, Katie Davis, and Alexis Hiniker. 2019. Modeling the Engagement-Disengagement Cycle of Compulsive Phone Use. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3290605.3300542"
    },
    {
      "text": "Mariek M P Vanden Abeele. 2020. Digital Wellbeing as a Dynamic Construct. Communication Theory 31, 4 (10 2020), 932–955.",
      "doi": ""
    },
    {
      "text": "Kelly Widdicks. 2020. When the Good Turns Ugly: Speculating Next Steps for Digital Wellbeing Tools. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. Association for Computing Machinery, New York, NY, USA, Article 89, 6 pages.",
      "doi": "10.1145/3419249.3420117"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 143–146.",
      "doi": "10.1145/1978942.1978963"
    }
  ]
}