{
  "doi": "10.1145/3491102.3501938",
  "title": "Do You See What I Hear? — Peripheral Absolute and Relational Visualisation Techniques for Sound Zones",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2022,
  "badges": [],
  "abstract": "Sound zone technology allows multiple simultaneous sound experiences for multiple people in the same room without interference. However, given the inherent invisible and intangible nature of sound zones, it is unclear how to communicate the position and size of sound zones to users. This paper compares two visualisation techniques; absolute visualisation, relational visualisation, as well as a baseline condition without visualisations. In a within-subject experiment (N = 33), we evaluated these techniques for effectiveness and efficiency across four representative tasks. Our findings show that the absolute and relational visualisation techniques increase effectiveness in multi-user tasks but not in single-user tasks. The efficiency for all tasks was improved using visualisations. We discuss the potential of visualisations for sound zones and highlight future research opportunities for sound zone interaction.",
  "authors": [
    {
      "name": "Rune Møberg Jacobsen",
      "institution": "Department of Computer Science, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529071",
      "orcid": "0000-0002-1877-1845"
    },
    {
      "name": "Niels van Berkel",
      "institution": "Department of Computer Science, Aalborg University, Denmark",
      "img": "/do/10.1145/contrib-99658743711/rel-imgonly/niels_van_berkel_2022.jpg",
      "acmid": "99658743711",
      "orcid": "0000-0001-5106-7692"
    },
    {
      "name": "Mikael B. Skov",
      "institution": "Department of Computer Science, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502723616",
      "orcid": "0000-0003-4488-5683"
    },
    {
      "name": "Stine S Johansen",
      "institution": "Dept. of Computer Science, Aalborg University, Denmark",
      "img": "/do/10.1145/contrib-99660113817/rel-imgonly/stine_johansen_ciesj_design_lab_id_23082022_0-8_square.jpg",
      "acmid": "99660113817",
      "orcid": "0000-0002-8451-5444"
    },
    {
      "name": "Jesper Kjeldskov",
      "institution": "Department of Computer Science, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548020677",
      "orcid": "0000-0001-7990-4229"
    }
  ],
  "references": [
    {
      "text": "Thomas Augsten, Konstantin Kaefer, René Meusel, Caroline Fetzer, Dorian Kanitz, Thomas Stoff, Torsten Becker, Christian Holz, and Patrick Baudisch. 2010. Multitoe: High-Precision Interaction with Back-Projected Floors Based on High-Resolution Multi-Touch Input. Association for Computing Machinery, New York, NY, USA, 209–218. https://doi.org/10.1145/1866029.1866064",
      "doi": "10.1145/1866029.1866064"
    },
    {
      "text": "Douglas Bates, Martin Mächler, Ben Bolker, and Steve Walker. 2015. Fitting Linear Mixed-Effects Models Using lme4. Journal of Statistical Software 67, 1 (2015), 1–48. https://doi.org/10.18637/jss.v067.i01",
      "doi": ""
    },
    {
      "text": "Terence Betlehem, Wen Zhang, Mark A. Poletti, and Thushara D. Abhayapala. 2015. Personal sound zones: Delivering interface-free audio to multiple listeners. IEEE Signal Processing Magazine 32, 2 (2015), 81–91. https://doi.org/10.1109/MSP.2014.2360707",
      "doi": ""
    },
    {
      "text": "Gilbert Beyer, Vincent Binder, Nina Jäger, and Andreas Butz. 2014. The Puppeteer Display: Attracting and Actively Shaping the Audience with an Interactive Public Banner Display. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 935–944. https://doi.org/10.1145/2598510.2598575",
      "doi": "10.1145/2598510.2598575"
    },
    {
      "text": "Sara Bly. 1982. Presenting Information in Sound. In Proceedings of the 1982 Conference on Human Factors in Computing Systems (Gaithersburg, Maryland, USA) (CHI ’82). Association for Computing Machinery, New York, NY, USA, 371–375. https://doi.org/10.1145/800049.801814",
      "doi": "10.1145/800049.801814"
    },
    {
      "text": "Sara A. Bly, Steven P. Frysinger, David Lunney, Douglass L. Mansur, Joseph J. Mezrich, Robert C. Morrison, and William Buxton. 1985. Communicating with Sound (Panel Session. SIGCHI Bull. 16, 4 (April 1985), 115–119. https://doi.org/10.1145/1165385.317477",
      "doi": ""
    },
    {
      "text": "Stephen A. Brewster. 1998. Using Nonspeech Sounds to Provide Navigation Cues. ACM Trans. Comput.-Hum. Interact. 5, 3 (Sept. 1998), 224–259. https://doi.org/10.1145/292834.292839",
      "doi": "10.1145/292834.292839"
    },
    {
      "text": "Stephen A. Brewster, Peter C. Wright, Alan J. Dix, and Alistair D. N. Edwards. 1995. The Sonic Enhancement of Graphical Buttons. Springer US, Boston, MA, 43–48. https://doi.org/10.1007/978-1-5041-2896-4_7",
      "doi": ""
    },
    {
      "text": "Stephen A. Brewster, Peter C. Wright, and Alistair D. N. Edwards. 1993. An Evaluation of Earcons for Use in Auditory Human-Computer Interfaces. In Proceedings of the INTERACT ’93 and CHI ’93 Conference on Human Factors in Computing Systems(Amsterdam, The Netherlands) (CHI ’93). Association for Computing Machinery, New York, NY, USA, 222–227. https://doi.org/10.1145/169059.169179",
      "doi": ""
    },
    {
      "text": "Ji-Ho Chang, Chan-Hui Lee, Jin-Young Park, and Yang-Hann Kim. 2009. A realization of sound focused personal audio system using acoustic contrast control. The Journal of the Acoustical Society of America 125, 4 (2009), 2091–2097. https://doi.org/10.1121/1.3082114",
      "doi": ""
    },
    {
      "text": "Jordan Cheer and Stephen Elliott. 2013. Design and implementation of a personal audio system in a car cabin. Proceedings of Meetings on Acoustics 19, 2013 (2013), 055009. https://doi.org/10.1121/1.4798948",
      "doi": ""
    },
    {
      "text": "Joung-Woo Choi and Yang-Hann Kim. 2002. Generation of an acoustically bright zone with an illuminated region using multiple sources. The Journal of the Acoustical Society of America 111, 4 (2002), 1695–1700. https://doi.org/10.1121/1.1456926",
      "doi": ""
    },
    {
      "text": "Luke Dahl and Ge Wang. 2010. Sound Bounce : Physical Metaphors in Designing Mobile Music Performance. In Proceedings of the International Conference on New Interfaces for Musical Expression. NIME, Sydney, Australia, 178–181. https://doi.org/10.5281/zenodo.1177751",
      "doi": ""
    },
    {
      "text": "Peter Dalsgaard and Kim Halskov. 2010. Designing Urban Media FaçAdes: Cases and Challenges. Association for Computing Machinery, New York, NY, USA, 2277–2286. https://doi.org/10.1145/1753326.1753670",
      "doi": ""
    },
    {
      "text": "W.F. Druyvesteyn and J. Garas. 1997. Personal sound. Journal of the Audio Engineering Society 45, 9 (1997), 685–701.",
      "doi": ""
    },
    {
      "text": "Stephen J. Elliott, Jordan Cheer, Harry Murfet, and Keith R. Holland. 2010. Minimally radiating sources for personal audio.The Journal of the Acoustical Society of America 128, 4 (2010), 1721–1728. https://doi.org/10.1121/1.3479758",
      "doi": ""
    },
    {
      "text": "Jamie Ferguson and Stephen Brewster. 2019. Modulating Personal Audio to Convey Information. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312988",
      "doi": "10.1145/3290607.3312988"
    },
    {
      "text": "Ronald A Fisher and Frank Yates. 1938. Statistical tables: For biological, agricultural and medical research. Oliver and Boyd, New York.",
      "doi": ""
    },
    {
      "text": "International Organization for Standardization. 2010. Acoustics — Audiometric test methods — Part 1: Pure-tone air and bone conduction audiometry (ISO 8253-1:2010 ed.). International Organization for Standardization, Vernier, Geneva, Switzerland. https://www.iso.org/standard/43601.html",
      "doi": ""
    },
    {
      "text": "Karmen Franinović and Christopher Salter. 2013. The Experience of Sonic Interaction. In Sonic Interaction Design. The MIT Press, Cambridge, MA 02142, 39–76. https://doi.org/10.7551/mitpress/8555.003.0004 arXiv:https://direct.mit.edu/book/chapter-pdf/202715/9780262313308_cab.pdf",
      "doi": ""
    },
    {
      "text": "William W Gaver. 1986. Auditory icons: Using sound in computer interfaces. Human-computer interaction 2, 2 (1986), 167–177.",
      "doi": "10.1207/s15327051hci0202_3"
    },
    {
      "text": "Kazjon Grace, Rainer Wasinger, Christopher Ackad, Anthony Collins, Oliver Dawson, Richard Gluga, Judy Kay, and Martin Tomitsch. 2013. Conveying Interactivity at an Interactive Public Information Display. In Proceedings of the 2nd ACM International Symposium on Pervasive Displays (Mountain View, California) (PerDis ’13). Association for Computing Machinery, New York, NY, USA, 19–24. https://doi.org/10.1145/2491568.2491573",
      "doi": "10.1145/2491568.2491573"
    },
    {
      "text": "Gabriel Haas, Evgeny Stemasov, Michael Rietzler, and Enrico Rukzio. 2020. Interactive Auditory Mediated Reality: Towards User-Defined Personal Soundscapes. Association for Computing Machinery, New York, NY, USA, 2035–2050. https://doi.org/10.1145/3357236.3395493",
      "doi": "10.1145/3357236.3395493"
    },
    {
      "text": "Gabriel Haas, Evgeny Stemasov, and Enrico Rukzio. 2018. Can’t You Hear Me? Investigating Personal Soundscape Curation. In Proceedings of the 17th International Conference on Mobile and Ubiquitous Multimedia (Cairo, Egypt) (MUM 2018). Association for Computing Machinery, New York, NY, USA, 59–69. https://doi.org/10.1145/3282894.3282897",
      "doi": "10.1145/3282894.3282897"
    },
    {
      "text": "Joseph F Hair, William C Black, Barry J Babin, Rolph E Anderson, and RL Tatham. 2010. Multivariate Data Analysis. Pearson, Kennesaw State University.",
      "doi": ""
    },
    {
      "text": "Luke Hespanhol, Martin Tomitsch, Oliver Bown, and Miriama Young. 2014. Using Embodied Audio-Visual Interaction to Promote Social Encounters around Large Media FaçAdes. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 945–954. https://doi.org/10.1145/2598510.2598568",
      "doi": "10.1145/2598510.2598568"
    },
    {
      "text": "Franz M. Heuchel, Diego Caviedes Nozal, Finn T. Agerkvist, and Jonas Brunskog. 2018. Sound field control for reduction of noise from outdoor concerts. 145th Audio Engineering Society International Convention, AES 2018 1, 145(2018), –.",
      "doi": ""
    },
    {
      "text": "Finn Jacobsen, Martin Olsen, Martin Møller, and Finn T. Agerkvist. 2011. A comparison of two strategies for generating sound zones in a room.. In Proceedings of 18th International Congress on Sound and Vibration. International Institute of Acoustics and Vibration, Rio de Janeiro, Brazil, –.",
      "doi": ""
    },
    {
      "text": "Stine Schmieg Johansen and Peter Axel Nielsen. 2019. Personalised Soundscapes in Homes. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 813–822. https://doi.org/10.1145/3322276.3322364",
      "doi": "10.1145/3322276.3322364"
    },
    {
      "text": "Stine Schmieg Johansen, Peter Axel Nielsen, and Jesper Kjeldskov. 2019. Interaction Design for Domestic Sound Zones. In Proceedings of the 14th International Audio Mostly Conference: A Journey in Sound (Nottingham, United Kingdom) (AM’19). Association for Computing Machinery, New York, NY, USA, 248–251. https://doi.org/10.1145/3356590.3356630",
      "doi": "10.1145/3356590.3356630"
    },
    {
      "text": "Stine S. Johansen, Peter Axel Nielsen, Kashmiri Stec, and Jesper Kjeldskov. 2021. Experiences of Personal Sound Technologies. In Human-Computer Interaction – INTERACT 2021, Carmelo Ardito, Rosa Lanzilotti, Alessio Malizia, Helen Petrie, Antonio Piccinno, Giuseppe Desolda, and Kori Inkpen (Eds.). Springer International Publishing, Cham, 523–541.",
      "doi": "10.1007/978-3-030-85616-8_30"
    },
    {
      "text": "Sergi Jordà, Günter Geiger, Marcos Alonso, and Martin Kaltenbrunner. 2007. The ReacTable: Exploring the Synergy between Live Music Performance and Tabletop Tangible Interfaces. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction (Baton Rouge, Louisiana) (TEI ’07). Association for Computing Machinery, New York, NY, USA, 139–146. https://doi.org/10.1145/1226969.1226998",
      "doi": "10.1145/1226969.1226998"
    },
    {
      "text": "Taewoong Lee, Jesper Kjær Nielsen, and Mads Græsbøll Christensen. 2020. Signal-Adaptive and Perceptually Optimized Sound Zones With Variable Span Trade-Off Filters. IEEE/ACM Transactions on Audio, Speech, and Language Processing 28 (2020), 2412–2426. https://doi.org/10.1109/TASLP.2020.3013397",
      "doi": "10.1109/TASLP.2020.3013397"
    },
    {
      "text": "Stine S. Lundgaard, Peter Axel Nielsen, and Jesper Kjeldskov. 2020. Designing for domestic sound zone interaction. Personal and Ubiquitous Computing Personal and Ubiquitous Computing (2020), 2020 (2020), 0. https://doi.org/10.1007/s00779-020-01387-2",
      "doi": "10.1007/s00779-020-01387-2"
    },
    {
      "text": "Daniel Lüdecke. 2018. ggeffects: Tidy Data Frames of Marginal Effects from Regression Models.Journal of Open Source Software 3, 26 (2018), 772. https://doi.org/10.21105/joss.00772",
      "doi": ""
    },
    {
      "text": "Aadil Mamuji, Roel Vertegaal, Changuk Sohn, and Daniel Cheng. 2005. Attentive Headphones: Augmenting Conversational Attention with a Real World TiVo. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Portland, Oregon, USA, 2223–2226.",
      "doi": ""
    },
    {
      "text": "Marilyn McGee-Lennon, Maria Wolters, Ross McLachlan, Stephen Brewster, and Cordelia Hall. 2011. Name That Tune: Musicons as Reminders in the Home. Association for Computing Machinery, New York, NY, USA, 2803–2806. https://doi.org/10.1145/1978942.1979357",
      "doi": ""
    },
    {
      "text": "Mark McGill, Stephen Brewster, David McGookin, and Graham Wilson. 2020. Acoustic Transparency and the Changing Soundscape of Auditory Mixed Reality. Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376702",
      "doi": "10.1145/3313831.3376702"
    },
    {
      "text": "Microsoft Research Blog. 2007. Personal Audio Space: The Headphones Experience sans Headphones. https://www.microsoft.com/en-us/research/blog/personal-audio-space-headphones-experience-sans-headphones/",
      "doi": ""
    },
    {
      "text": "Jörg Müller, Matthias Geier, Christina Dicke, and Sascha Spors. 2014. The BoomRoom: Mid-Air Direct Interaction with Virtual Sound Sources. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 247–256. https://doi.org/10.1145/2556288.2557000",
      "doi": "10.1145/2556288.2557000"
    },
    {
      "text": "Jörg Müller, Matthias Geier, Christina Dicke, and Sascha Spors. 2014. The BoomRoom: Mid-Air Direct Interaction with Virtual Sound Sources. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 247–256. https://doi.org/10.1145/2556288.2557000",
      "doi": "10.1145/2556288.2557000"
    },
    {
      "text": "Martin Bo Møller and Martin Olsen. 2016. Sound Zones: On Performance Prediction of Contrast Control Methods. In Audio Engineering Society Conference: 2016 AES International Conference on Sound Field Control. AES, Guildford, UK, 0. http://www.aes.org/e-lib/browse.cfm?elib=18308",
      "doi": ""
    },
    {
      "text": "Martin Bo Møller and Jan Østergaard. 2020. A Moving Horizon Framework for Sound Zones. IEEE/ACM Transactions on Audio, Speech, and Language Processing 28 (2020), 256–265. https://doi.org/10.1109/TASLP.2019.2951995",
      "doi": "10.1109/TASLP.2019.2951995"
    },
    {
      "text": "Node.js Foundation. 2021. Express.js.",
      "doi": ""
    },
    {
      "text": "Peter Peltonen, Esko Kurvinen, Antti Salovaara, Giulio Jacucci, Tommi Ilmonen, John Evans, Antti Oulasvirta, and Petri Saarikko. 2008. It’s Mine, Don’t Touch! Interactions at a Large Multi-Touch Display in a City Centre. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 1285–1294. https://doi.org/10.1145/1357054.1357255",
      "doi": "10.1145/1357054.1357255"
    },
    {
      "text": "Pimoroni. 2021. Pimoroni HyperPixel. https://www.adafruit.com/product/3578",
      "doi": ""
    },
    {
      "text": "Raspberry Pi Foundation. 2021. Raspberry Pi 3b+. https://www.raspberrypi.org/products/raspberry-pi-3-model-b-plus/",
      "doi": ""
    },
    {
      "text": "React. 2019. React. https://reactjs.org/",
      "doi": ""
    },
    {
      "text": "S. Ribaric, G. Adrinek, and S. Segvic. 2004. Real-time active visual tracking system. In Proceedings of the 12th IEEE Mediterranean Electrotechnical Conference (IEEE Cat. No.04CH37521), Vol. 1. IEEE, Dubrovnik, Croatia, 231–234 Vol.1. https://doi.org/10.1109/MELCON.2004.1346816",
      "doi": ""
    },
    {
      "text": "Jussi Rämö, Søren Bech, and Søren Holdt Jensen. 2018. Validating a real-time perceptual model predicting distraction caused by audio-on-audio interference. The Journal of the Acoustical Society of America 144, 1 (2018), 153–163. https://doi.org/10.1121/1.5045321 arXiv:https://doi.org/10.1121/1.5045321",
      "doi": ""
    },
    {
      "text": "Zhanna Sarsenbayeva, Niels van Berkel, Chu Luo, Vassilis Kostakos, and Jorge Goncalves. 2017. Challenges of Situational Impairments during Interaction with Mobile Devices. In Proceedings of the 29th Australian Conference on Computer-Human Interaction(OZCHI ’17). Association for Computing Machinery, New York, NY, USA, 477–481. https://doi.org/10.1145/3152771.3156161",
      "doi": "10.1145/3152771.3156161"
    },
    {
      "text": "Constantin Schmidt, Jörg Müller, and Gilles Bailly. 2013. Screenfinity: Extending the Perception Area of Content on Very Large Public Displays. Association for Computing Machinery, New York, NY, USA, 1719–1728. https://doi.org/10.1145/2470654.2466227",
      "doi": "10.1145/2470654.2466227"
    },
    {
      "text": "Dominik Schmidt, Raf Ramakers, Esben W. Pedersen, Johannes Jasper, Sven Köhler, Aileen Pohl, Hannes Rantzsch, Andreas Rau, Patrick Schmidt, Christoph Sterz, Yanina Yurchenko, and Patrick Baudisch. 2014. Kickables: Tangibles for Feet. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 3143–3152. https://doi.org/10.1145/2556288.2557016",
      "doi": "10.1145/2556288.2557016"
    },
    {
      "text": "Socket.IO. 2021. Socket.IO. https://socket.io",
      "doi": ""
    },
    {
      "text": "Jo Vermeulen, Kris Luyten, Karin Coninx, Nicolai Marquardt, and Jon Bird. 2015. Proxemic Flow: Dynamic Peripheral Floor Visualizations for Revealing and Mediating Large Surface Interactions. In Human-Computer Interaction – INTERACT 2015, Julio Abascal, Simone Barbosa, Mirko Fetter, Tom Gross, Philippe Palanque, and Marco Winckler (Eds.). Springer International Publishing, Cham, 264–281.",
      "doi": ""
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2004. Interactive Public Ambient Displays: Transitioning from Implicit to Explicit, Public to Personal, Interaction with Multiple Users. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (Santa Fe, NM, USA) (UIST ’04). Association for Computing Machinery, New York, NY, USA, 137–146. https://doi.org/10.1145/1029632.1029656",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Jennifer Junnila Walker, Leanne M Cleveland, Jenny L Davis, and Jennifer S Seales. 2013. Audiometry screening and interpretation. American family physician 87, 1 (2013), 41–47.",
      "doi": ""
    },
    {
      "text": "Mark Weiser and John Seely Brown. 1996. Designing calm technology. PowerGrid Journal 1, 1 (1996), 75–85.",
      "doi": ""
    }
  ]
}