{
  "doi": "10.1145/3491102.3517656",
  "title": "Studying How Digital Luthiers Choose Their Tools",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "Digital lutherie is a sub-domain of digital craft focused on creating digital musical instruments: high-performance devices for musical expression. It represents a nuanced and challenging area of human-computer interaction that is well established and mature, offering the opportunity to observe designers’ work on highly demanding human-computer interfaces. This paper explores how and why digital luthiers choose their tools and how these tools relate to the challenges they face. Findings from 27 standardised open-ended interviews with prominent digital luthiers from commercial, research, independent and artistic backgrounds are analysed through reflexive thematic analysis. Our discussion explores their perspectives, finding that a process of pragmatic rationalisation and environmental influences play a significant role in tool selection. We also present how challenges faced by digital luthiers relate to social creativity and meta-design. These findings build upon the existing literature that examines the designer-tool relationship.",
  "tags": [
    "Thematic Analysis",
    "Digital Luthier",
    "Digital Musical Instruments",
    "Programming Languages",
    "Design Tools",
    "Design Practice",
    "Qualitative"
  ],
  "authors": [
    {
      "name": "Nathan Renney",
      "institution": "Computer Science Research Centre, University of West of England, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659337028",
      "orcid": "missing"
    },
    {
      "name": "Benedict Gaster",
      "institution": "Computer Science Research Centre, University of West of England, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384594258",
      "orcid": "missing"
    },
    {
      "name": "Tom Mitchell",
      "institution": "UWE Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361597992",
      "orcid": "missing"
    },
    {
      "name": "Harri Renney",
      "institution": "University of the West of England, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659443059",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jesús Muñoz Alcántara, Panos Markopoulos, and Mathias Funk. 2015. Social Media as ad hoc Design Collaboration Tools. In Proceedings of the European Conference on Cognitive Ergonomics 2015. ACM, Warsaw Poland, 1–8. https://doi.org/10.1145/2788412.2788420",
      "doi": ""
    },
    {
      "text": "Mats Alvesson, Cynthia Hardy, and Bill Harley. 2008. Reflecting on Reflexivity: Reflexive Textual Practices in Organization and Management Theory. Journal of Management Studies 45, 3 (May 2008), 480–501. https://doi.org/10.1111/j.1467-6486.2007.00765.x",
      "doi": ""
    },
    {
      "text": "Chris Argyris and Donald A. Schön. 1974. Theory in practice: increasing professional effectiveness (1st ed ed.). Jossey-Bass Publishers, San Francisco.",
      "doi": ""
    },
    {
      "text": "Jack Armitage and Andrew McPherson. 2019. Bricolage in a hybrid digital lutherie context: a workshop study. In Proceedings of the 14th International Audio Mostly Conference: A Journey in Sound. ACM, Nottingham United Kingdom, 82–89. https://doi.org/10.1145/3356590.3356604",
      "doi": "10.1145/3356590.3356604"
    },
    {
      "text": "Jack Armitage and Andrew P. McPherson. 2018. Crafting digital musical instruments: An exploratory workshop study. In Proceedings of the international conference on new interfaces for musical expression, Thomas Martin Luke Dahl, Douglas Bowman (Ed.). Virginia Tech, Blacksburg, Virginia, USA, 281–286. https://doi.org/10.5281/zenodo.1302583 ISSN: 2220-4806.",
      "doi": ""
    },
    {
      "text": "Jordan Beck and Erik Stolterman. 2016. Examining Practical, Everyday Theory Use in Design Research. She Ji: The Journal of Design, Economics, and Innovation 2, 2 (2016), 125–140. https://doi.org/10.1016/j.sheji.2016.01.010",
      "doi": ""
    },
    {
      "text": "Michael Berger. 2010. The GRIP MAESTRO : Idiomatic Mappings of Emotive Gestures for Control of Live Electroacoustic Music. In Proceedings of the International Conference on New Interfaces for Musical Expression. Sydney, Australia, 419–422. https://doi.org/10.5281/zenodo.1177719",
      "doi": ""
    },
    {
      "text": "Francisco Bernardo, Chris Kiefer, and Thor Magnusson. 2020. A Signal Engine for a Live Coding Language Ecosystem. Journal of the Audio Engineering Society 68, 10 (Dec. 2020), 756–766. https://doi.org/10.17743/jaes.2020.0016",
      "doi": ""
    },
    {
      "text": "Alan Blackwell and Nick Collins. 2005. The Programming Language as a Musical Instrument. PPIG (2005), 11.",
      "doi": ""
    },
    {
      "text": "Dan Braha and Oded Maimon. 2011. A mathematical theory of design: foundations, algorithms and applications. Number 17 in Applied optimization. Springer, Dordrecht.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4 (Aug. 2019), 589–597. https://doi.org/10.1080/2159676X.2019.1628806",
      "doi": "10.1080/2159676X.2019.1628806"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2020. One size fits all? What counts as quality practice in (reflexive) thematic analysis?Qualitative Research in Psychology (Aug. 2020), 1–25. https://doi.org/10.1080/14780887.2020.1769238",
      "doi": ""
    },
    {
      "text": "Dom Brown, Chris Nash, and Tom Mitchell. 2017. A user experience review of music interaction evaluations. In Proceedings of the international conference on new interfaces for musical expression. Aalborg University Copenhagen, Copenhagen, Denmark, 370–375. https://doi.org/10.5281/zenodo.1176286 ISSN: 2220-4806.",
      "doi": ""
    },
    {
      "text": "Dom Brown, Chris Nash, and Tom Mitchell. 2018. Simple mappings, expressive movement: a qualitative investigation into the end-user mapping design of experienced mid-air musicians. Digital Creativity 29, 2-3 (July 2018), 129–148. https://doi.org/10.1080/14626268.2018.1510841",
      "doi": ""
    },
    {
      "text": "Filipe Calegario, Marcelo Wanderley, João Tragtenberg, Eduardo Meneses, Johnty Wang, John Sullivan, Ivan Franco, Mathias S Kirkegaard, Mathias Bredholt, and Josh Rohs. 2020. Probatio 1.0: collaborative development of a toolkit for functional DMI prototypes. In Proceedings of the international conference on new interfaces for musical expression, Romain Michon and Franziska Schroeder (Eds.). Birmingham City University, Birmingham, UK, 285–290. https://doi.org/10.5281/zenodo.4813363 ISSN: 2220-4806 tex.presentation-video: https://youtu.be/jkFnZZUA3xs.",
      "doi": ""
    },
    {
      "text": "Amy Cheatle and Steven J. Jackson. 2015. Digital Entanglements: Craft, Computation and Collaboration in Fine Art Furniture Production. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, Vancouver BC Canada, 958–968. https://doi.org/10.1145/2675133.2675291",
      "doi": "10.1145/2675133.2675291"
    },
    {
      "text": "Anthony Chemero. 2003. An Outline of a Theory of Affordances. Ecological Psychology 15, 2 (April 2003), 181–195. https://doi.org/10.1207/S15326969ECO1502_5",
      "doi": ""
    },
    {
      "text": "Isis Chong and Robert W. Proctor. 2020. On the Evolution of a Radical Concept: Affordances According to Gibson and Their Subsequent Use and Development. Perspectives on Psychological Science 15, 1 (Jan. 2020), 117–132. https://doi.org/10.1177/1745691619868207",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, and Alan Dix. 2018. HARK No More: On the Preregistration of CHI Experiments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–12. https://doi.org/10.1145/3173574.3173715",
      "doi": "10.1145/3173574.3173715"
    },
    {
      "text": "Nick Collins, Alex McLEAN, Julian Rohrhuber, and Adrian Ward. 2003. Live coding in laptop performance. Organised Sound 8, 3 (Dec. 2003), 321–330. https://doi.org/10.1017/S135577180300030X",
      "doi": "10.1017/S135577180300030X"
    },
    {
      "text": "Perry R. Cook. 2001. Principles for designing computer music controllers. In Proceedings of the international conference on new interfaces for musical expression. Seattle, WA, 3–6. https://doi.org/10.5281/zenodo.1176358 ISSN: 2220-4806.",
      "doi": ""
    },
    {
      "text": "Matthew Dabin, Terumi Narushima, Stephen Beirne, Christian Ritz, and Kraig Grady. 2016. 3D modelling and printing of microtonal flutes. In Proceedings of the international conference on new interfaces for musical expression, Vol. 16. Queensland Conservatorium Griffith University, Brisbane, Australia, 286–290. https://doi.org/10.5281/zenodo.1176014 ISSN: 2220-4806 tex.track: Papers.",
      "doi": ""
    },
    {
      "text": "Tia DeNora and Theodor W. Adorno. 2003. After Adorno: rethinking music sociology. Cambridge University Press, Cambridge ; New York.",
      "doi": ""
    },
    {
      "text": "Rebecca Fiebrink and Perry R Cook. 2010. The Wekinator: a system for real-time, interactive machine learning in music. In Proceedings of the eleventh international society for music information retrieval conference (ISMIR 2010)(Utrecht), Vol. 3.",
      "doi": ""
    },
    {
      "text": "Gerhard Fischer. 2021. End-User Development: Empowering Stakeholders with Artificial Intelligence, Meta-Design, and Cultures of Participation. In End-User Development, Daniela Fogli, Daniel Tetteroo, Barbara Rita Barricelli, Simone Borsci, Panos Markopoulos, and George A. Papadopoulos (Eds.). Vol. 12724. Springer International Publishing, Cham, 3–16. https://doi.org/10.1007/978-3-030-79840-6_1 Series Title: Lecture Notes in Computer Science.",
      "doi": ""
    },
    {
      "text": "Gerhard Fischer, Elisa Giaccardi, Hal Eden, Masanori Sugimoto, and Yunwen Ye. 2005. Beyond binary choices: Integrating individual and social creativity. International Journal of Human-Computer Studies 63, 4-5 (Oct. 2005), 482–512. https://doi.org/10.1016/j.ijhcs.2005.04.014",
      "doi": "10.1016/j.ijhcs.2005.04.014"
    },
    {
      "text": "Gerhard Fischer and Eric Scharff. 2000. Meta-design: design for designers. In Proceedings of the conference on Designing interactive systems processes, practices, methods, and techniques - DIS ’00. ACM Press, New York City, New York, United States, 396–405. https://doi.org/10.1145/347642.347798",
      "doi": "10.1145/347642.347798"
    },
    {
      "text": "Raune Frankjær and Peter Dalsgaard. 2018. Understanding Craft-Based Inquiry in HCI. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM, Hong Kong China, 473–484. https://doi.org/10.1145/3196709.3196750",
      "doi": "10.1145/3196709.3196750"
    },
    {
      "text": "Jonas Frich, Lindsay MacDonald Vermeulen, Christian Remy, Michael Mose Biskjaer, and Peter Dalsgaard. 2019. Mapping the Landscape of Creativity Support Tools in HCI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–18. https://doi.org/10.1145/3290605.3300619",
      "doi": "10.1145/3290605.3300619"
    },
    {
      "text": "A. Cavan Fyans, Adnan Marquez-Borbon, Paul Stapleton, and Michael Gurevich. 2012. Ecological considerations for participatory design of DMIs. In Proceedings of the international conference on new interfaces for musical expression. University of Michigan, Ann Arbor, Michigan. https://doi.org/10.5281/zenodo.1178257 ISSN: 2220-4806.",
      "doi": ""
    },
    {
      "text": "James J. Gibson. 2014. The Ecological Approach to Visual Perception: Classic Edition (1 ed.). Psychology Press. https://doi.org/10.4324/9781315740218",
      "doi": ""
    },
    {
      "text": "Vinod Goel and Peter Pirolli. 1992. The structure of Design Problem Spaces. Cognitive Science 16, 3 (July 1992), 395–429. https://doi.org/10.1207/s15516709cog1603_3",
      "doi": ""
    },
    {
      "text": "Elizabeth Goodman, Erik Stolterman, and Ron Wakkary. 2011. Understanding interaction design practices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Vancouver BC Canada, 1061–1070. https://doi.org/10.1145/1978942.1979100",
      "doi": "10.1145/1978942.1979100"
    },
    {
      "text": "Brendan Gough and Anna Madill. 2012. Subjectivity in psychological science: From problem to prospect.Psychological Methods 17, 3 (Sept. 2012), 374–384. https://doi.org/10.1037/a0029313",
      "doi": ""
    },
    {
      "text": "Armand Hatchuel and Benoit Weil. 2003. A new approach of innovative Design: an introduction to CK theory.. In DS 31: Proceedings of ICED 03, the 14th international conference on engineering design, stockholm.",
      "doi": ""
    },
    {
      "text": "Lawrence A. Hirschfeld and Susan A. Gelman (Eds.). 1994. Mapping the mind: domain specificity in cognition and culture. Cambridge University Press, Cambridge ; New York.",
      "doi": ""
    },
    {
      "text": "Paul Hudak. 1997. Domain-specific languages. Handbook of programming languages 3, 39-60 (1997), 21.",
      "doi": ""
    },
    {
      "text": "Nanna Inie and Peter Dalsgaard. 2017. How interaction designers use tools to capture, manage, and collaborate on ideas. In Proceedings of the 2017 CHI conference extended abstracts on human factors in computing systems(CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 2668–2675. https://doi.org/10.1145/3027063.3053210 Number of pages: 8 Place: Denver, Colorado, USA.",
      "doi": "10.1145/3027063.3053210"
    },
    {
      "text": "Robert Jack, Jacob Harrison, and Andrew McPherson. 2020. Digital musical instruments as research products. In Proceedings of the international conference on new interfaces for musical expression, Romain Michon and Franziska Schroeder (Eds.). Birmingham City University, Birmingham, UK, 446–451. https://doi.org/10.5281/zenodo.4813465 ISSN: 2220-4806 tex.presentation-video: https://youtu.be/luJwlZBeBqY.",
      "doi": ""
    },
    {
      "text": "Robert Jack, Adib Mehrabi, Tony Stockman, and Andrew McPherson. 2018. Action-sound latency and the perceived quality of digital musical instruments: Comparing professional percussionists and amateur musicians. Music Perception: An Interdisciplinary Journal 36 (July 2018). https://doi.org/10.1525/MP.2018.36.1.109",
      "doi": ""
    },
    {
      "text": "Jennifer Jacobs, David Mellis, Amit Zoran, Cesar Torres, Joel Brandt, and Theresa Jean Tanenbaum. 2016. Digital Craftsmanship: HCI Takes on Technology as an Expressive Medium. In Proceedings of the 2016 ACM Conference Companion Publication on Designing Interactive Systems. ACM, Brisbane QLD Australia, 57–60. https://doi.org/10.1145/2908805.2913018",
      "doi": "10.1145/2908805.2913018"
    },
    {
      "text": "Sergi Jordà. 2004. Digital instruments and players part II: Diversity, freedom and control. In International computer music conference. files/publications/72cd01-ICMC2004-Jorda.pdf",
      "doi": ""
    },
    {
      "text": "Sergi Jordà. 2004. Instruments and Players: Some Thoughts on Digital Lutherie. Journal of New Music Research 33, 3 (Sept. 2004), 321–341. https://doi.org/10.1080/0929821042000317886",
      "doi": ""
    },
    {
      "text": "Sergi Jordà. 2005. Digital Lutherie Crafting musical computers for new musics’ performance and improvisation. Ph. D. Dissertation. Universitat Pompeu Fabra. https://doi.org/10803/575372",
      "doi": ""
    },
    {
      "text": "Young-Wook Jung, Youn-kyung Lim, and Myung-suk Kim. 2017. Possibilities and Limitations of Online Document Tools for Design Collaboration: The Case of Google Docs. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, Portland Oregon USA, 1096–1108. https://doi.org/10.1145/2998181.2998297",
      "doi": "10.1145/2998181.2998297"
    },
    {
      "text": "Antreas Kantaros and Olaf Diegel. 2018. 3D printing technology in musical instrument research: reviewing the potential. Rapid prototyping journal 24, 9 (2018), 1511–1523. ISBN: 1355-2546.",
      "doi": ""
    },
    {
      "text": "Janin Koch, Jennifer Pearson, Andrés Lucero, Miriam Sturdee, Wendy E. Mackay, Makayla Lewis, and Simon Robinson. 2020. Where Art Meets Technology: Integrating Tangible and Intelligent Tools in Creative Processes. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–7. https://doi.org/10.1145/3334480.3375172",
      "doi": ""
    },
    {
      "text": "Karol Król and Dariusz Zdonek. 2019. Peculiarity of the bit rot and link rot phenomena. Global Knowledge, Memory and Communication(2019). Publisher: Emerald Publishing Limited.",
      "doi": ""
    },
    {
      "text": "Tamarinde L. Haven and Dr. Leonie Van Grootel. 2019. Preregistering qualitative research. Accountability in Research 26, 3 (April 2019), 229–244. https://doi.org/10.1080/08989621.2019.1580147",
      "doi": ""
    },
    {
      "text": "Christopher Patrick Laguna and Rebecca Fiebrink. 2014. Improving data-driven design and exploration of digital musical instruments. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems. ACM, Toronto Ontario Canada, 2575–2580. https://doi.org/10.1145/2559206.2581327",
      "doi": ""
    },
    {
      "text": "Giacomo Lepri and Andrew McPherson. 2019. Making Up Instruments: Design Fiction for Value Discovery in Communities of Musical Practice. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, San Diego CA USA, 113–126. https://doi.org/10.1145/3322276.3322353",
      "doi": "10.1145/3322276.3322353"
    },
    {
      "text": "Rikard Lindell. 2014. Crafting interaction: The epistemology of modern programming. Personal and Ubiquitous Computing 18, 3 (March 2014), 613–624. https://doi.org/10.1007/s00779-013-0687-6",
      "doi": "10.1007/s00779-013-0687-6"
    },
    {
      "text": "Sebastian Madgwick and Thomas J. Mitchell. 2013. x-OSC: A versatile wireless I/O device for creative/music applications. tex.publicationstatus: Unpublished.",
      "doi": ""
    },
    {
      "text": "Thor Magnusson. 2006. Affordances and constraints in screen-based musical instruments. In Proceedings of the 4th Nordic conference on Human-computer interaction changing roles - NordiCHI ’06. ACM Press, Oslo, Norway, 441–444. https://doi.org/10.1145/1182475.1182532",
      "doi": "10.1145/1182475.1182532"
    },
    {
      "text": "Thor Magnusson. 2010. Designing Constraints: Composing and Performing with Digital Musical Systems. Computer Music Journal 34, 4 (Dec. 2010), 62–73. https://doi.org/10.1162/COMJ_a_00026",
      "doi": "10.1162/COMJ_a_00026"
    },
    {
      "text": "Thor Magnusson. 2010. ixi lang: a constraint system for live coding. http://sro.sussex.ac.uk/id/eprint/46870/ Pages: 198–200 Place: Berlin Publication title: Proceedings of the 16th international symposium on electronic art.",
      "doi": ""
    },
    {
      "text": "Thor Magnusson and Enrike H. Mendieta. 2007. The acoustic, the digital and the body : A survey on musical instruments. In Proceedings of the international conference on new interfaces for musical expression. New York City, NY, United States, 94–99. https://doi.org/10.5281/zenodo.1177171 ISSN: 2220-4806.",
      "doi": "10.1145/1279740.1279757"
    },
    {
      "text": "Adnan Marquez-Borbon and Juan Pablo Martinez-Avila. 2018. The problem of DMI adoption and longevity: Envisioning a NIME performance pedagogy. In Proceedings of the international conference on new interfaces for musical expression, Thomas Martin Luke Dahl, Douglas Bowman (Ed.). Virginia Tech, Blacksburg, Virginia, USA, 190–195. https://doi.org/10.5281/zenodo.1302541 ISSN: 2220-4806.",
      "doi": ""
    },
    {
      "text": "Adnan Marquez-Borbon and Paul Stapleton. 2015. Fourteen years of NIME: The value and meaning of ‘Community’ in interactive music research. In Proceedings of the international conference on new interfaces for musical expression, Edgar Berdahl and Jesse Allison (Eds.). Louisiana State University, Baton Rouge, Louisiana, USA, 307–312. https://doi.org/10.5281/zenodo.1179128 ISSN: 2220-4806.",
      "doi": "10.5555/2993778.2993854"
    },
    {
      "text": "Marlene Mathew, Jennifer Grossman, and Areti Andreopoulou. 2016. Women in Audio: Contributions and Challenges in Music Technology and Production. Audio Engineering Society. https://www.aes.org/e-lib/online/browse.cfm?elib=18477",
      "doi": ""
    },
    {
      "text": "James McCartney. 2002. Rethinking the Computer Music Language: SuperCollider. Computer Music Journal 26, 4 (Dec. 2002), 61–68. https://doi.org/10.1162/014892602320991383",
      "doi": "10.1162/014892602320991383"
    },
    {
      "text": "Alex McLean. 2014. Making programming languages to dance to: live coding with tidal. In Proceedings of the 2nd ACM SIGPLAN international workshop on Functional art, music, modeling & design - FARM ’14. ACM Press, Gothenburg, Sweden, 63–70. https://doi.org/10.1145/2633638.2633647",
      "doi": "10.1145/2633638.2633647"
    },
    {
      "text": "Andrew McPherson, Robert Jack, and Giulio Moro. 2016. Action-sound latency: Are our tools fast enough?. In Proceedings of the international conference on new interfaces for musical expression, Vol. 16. Queensland Conservatorium Griffith University, Brisbane, Australia, 20–25. https://doi.org/10.5281/zenodo.3964611 ISSN: 2220-4806 tex.track: Papers.",
      "doi": ""
    },
    {
      "text": "Andrew McPherson and Giacomo Lepri. 2020. Beholden to our tools: negotiating with technology while sketching digital instruments. In Proceedings of the International Conference on New Interfaces for Musical Expression, Romain Michon and Franziska Schroeder (Eds.). Birmingham City University, Birmingham, UK, 434–439. https://www.nime.org/proceedings/2020/nime2020_paper84.pdf ISSN: 2220-4806.",
      "doi": ""
    },
    {
      "text": "Andrew McPherson, Fabio Morreale, and Jacob Harrison. 2019. Musical Instruments for Novices: Comparing NIME, HCI and Crowdfunding Approaches. In New Directions in Music and Human-Computer Interaction, Simon Holland, Tom Mudd, Katie Wilkie-McKenna, Andrew McPherson, and Marcelo M. Wanderley (Eds.). Springer International Publishing, Cham, 179–212. https://doi.org/10.1007/978-3-319-92069-6_12 Series Title: Springer Series on Cultural Computing.",
      "doi": ""
    },
    {
      "text": "Andrew McPherson and Koray Tahıroğlu. 2020. Idiomatic Patterns and Aesthetic Influence in Computer Music Languages. Organised Sound 25, 1 (April 2020), 53–63. https://doi.org/10.1017/S1355771819000463",
      "doi": ""
    },
    {
      "text": "Andrew P. McPherson and Youngmoo E. Kim. 2013. Piano Technique as a Case Study in Expressive Gestural Interaction. In Music and Human-Computer Interaction, Simon Holland, Katie Wilkie, Paul Mulholland, and Allan Seago (Eds.). Springer London, London, 123–138. https://doi.org/10.1007/978-1-4471-2990-5_7 Series Title: Springer Series on Cultural Computing.",
      "doi": ""
    },
    {
      "text": "Giulio Moro, Astrid Bin, Robert H Jack, Christian Heinrichs, Andrew P McPherson, and others. 2016. Making high-performance embedded instruments with Bela and Pure Data. In International conference on live interfaces. University of Sussex.",
      "doi": ""
    },
    {
      "text": "Giulio Moro and Andrew P. McPherson. 2021. Performer Experience on a Continuous Keyboard Instrument. Computer Music Journal 44, 2-3 (July 2021), 69–91. https://doi.org/10.1162/comj_a_00565",
      "doi": ""
    },
    {
      "text": "Fabio Morreale, S. M. Astrid Bin, Andrew McPherson, Paul Stapleton, and Marcelo Wanderley. 2020. A NIME Of The Times: Developing an Outward-Looking Political Agenda For This Community. In Proceedings of the International Conference on New Interfaces for Musical Expression, Romain Michon and Franziska Schroeder (Eds.). Birmingham City University, Birmingham, UK, 160–165. https://doi.org/10.5281/zenodo.4813294",
      "doi": ""
    },
    {
      "text": "Fabio Morreale and Andrew McPherson. 2017. Design for longevity: Ongoing use of instruments from NIME 2010-14. In Proceedings of the international conference on new interfaces for musical expression. Aalborg University Copenhagen, Copenhagen, Denmark, 192–197. https://doi.org/10.5281/zenodo.1176218 ISSN: 2220-4806.",
      "doi": ""
    },
    {
      "text": "Fabio Morreale, Andrew P. McPherson, and Marcelo Wanderley. 2018. NIME identity from the performer’s perspective. In Proceedings of the international conference on new interfaces for musical expression, Thomas Martin Luke Dahl, Douglas Bowman (Ed.). Virginia Tech, Blacksburg, Virginia, USA, 168–173. https://doi.org/10.5281/zenodo.1302533 ISSN: 2220-4806.",
      "doi": ""
    },
    {
      "text": "Fabio Morreale, Giulio Moro, Alan Chamberlain, Steve Benford, and Andrew P. McPherson. 2017. Building a Maker Community Around an Open Hardware Platform. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 6948–6959. https://doi.org/10.1145/3025453.3026056",
      "doi": "10.1145/3025453.3026056"
    },
    {
      "text": "Chris Nash and Alan F Blackwell. 2011. Tracking virtuosity and flow in computer music. In Proceedings of International Computer Music Conference.",
      "doi": ""
    },
    {
      "text": "Irene Posch and Geraldine Fitzpatrick. 2021. The Matter of Tools: Designing, Using and Reflecting on New Tools for Emerging eTextile Craft Practices. ACM Transactions on Computer-Human Interaction 28, 1 (Feb. 2021), 1–38. https://doi.org/10.1145/3426776",
      "doi": "10.1145/3426776"
    },
    {
      "text": "Miller Puckette. 2002. Max at Seventeen. Computer Music Journal 26, 4 (2002), 31–43. http://www.jstor.org/stable/3681767",
      "doi": "10.1162/014892602320991356"
    },
    {
      "text": "Nathan Renney, Benedict R Gaster, Thomas J Mitchell, and Harri Renney. 2021. Data and methodology : Exploring how digital luthiers choose their tools. https://doi.org/10.5281/zenodo.5062836 tex.version: 1.0.0.",
      "doi": ""
    },
    {
      "text": "Beat Rossmy and Alexander Wiethoff. 2019. The modular backward evolution — Why to use outdated technologies. In Proceedings of the international conference on new interfaces for musical expression, Marcelo Queiroz and Anna Xambó Sedó (Eds.). UFRGS, Porto Alegre, Brazil, 343–348. https://doi.org/10.5281/zenodo.3672988 ISSN: 2220-4806.",
      "doi": ""
    },
    {
      "text": "Christopher Small. 1998. Musicking: the meanings of performing and listening. University Press of New England, Hanover.",
      "doi": ""
    },
    {
      "text": "Erik Stolterman and James Pierce. 2012. Design tools in practice: studying the designer-tool relationship in interaction design. In Proceedings of the Designing Interactive Systems Conference on - DIS ’12. ACM Press, Newcastle Upon Tyne, United Kingdom, 25. https://doi.org/10.1145/2317956.2317961",
      "doi": "10.1145/2317956.2317961"
    },
    {
      "text": "Nam P. Suh. 1998. Axiomatic Design Theory for Systems. Research in Engineering Design 10, 4 (Dec. 1998), 189–209. https://doi.org/10.1007/s001639870001",
      "doi": ""
    },
    {
      "text": "Nam P. Suh. 2001. Axiomatic design: advances and applications. Oxford University Press, New York.",
      "doi": ""
    },
    {
      "text": "Koray Tahiroglu, Michael Gurevich, and R. Benjamin Knapp. 2018. Contextualising Idiomatic Gestures in Musical Interactions with NIMEs. In Proceedings of the International Conference on New Interfaces for Musical Expression, Thomas Martin Luke Dahl, Douglas Bowman (Ed.). Virginia Tech, Blacksburg, Virginia, USA, 126–131. https://doi.org/10.5281/zenodo.1302701",
      "doi": ""
    },
    {
      "text": "Atau Tanaka. 2010. Mapping out instruments, affordances, and mobiles. In Proceedings of the international conference on new interfaces for musical expression. Sydney, Australia, 88–93. https://doi.org/10.5281/zenodo.1177903 ISSN: 2220-4806.",
      "doi": ""
    },
    {
      "text": "Theresa Jean Tanenbaum, Amanda M. Williams, Audrey Desjardins, and Karen Tanenbaum. 2013. Democratizing technology: pleasure, utility and expressiveness in DIY and maker practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Paris France, 2603–2612. https://doi.org/10.1145/2470654.2481360",
      "doi": "10.1145/2470654.2481360"
    },
    {
      "text": "Paul Théberge. 1997. Any sound you can imagine: making music/consuming technology. Wesleyan University Press : University Press of New England, Hanover, NH.",
      "doi": "10.5555/523339"
    },
    {
      "text": "Tod, Machover and Chung, J. 1989. Hyperinstruments: Musically Intelligent and Interactive Performance and Creativity Systems. International Computer Music Conference Proceedings 1989 (1989). http://hdl.handle.net/2027/spo.bbp2372.1989.046",
      "doi": ""
    },
    {
      "text": "Luca Turchet and Carlo Fischione. 2021. Elk Audio OS: An Open Source Operating System for the Internet of Musical Things. ACM Transactions on Internet of Things 2, 2 (May 2021), 1–18. https://doi.org/10.1145/3446393",
      "doi": "10.1145/3446393"
    },
    {
      "text": "University of Technology Sydney and Eindhoven University of Technology and Kees Dorst. 2016. Design practice and design research: finally together?https://doi.org/10.21606/drs.2016.212",
      "doi": ""
    },
    {
      "text": "Ge Wang, Perry R. Cook, and Spencer Salazar. 2015. ChucK: A Strongly Timed Computer Music Language. Computer Music Journal 39, 4 (Dec. 2015), 10–29. https://doi.org/10.1162/COMJ_a_00324",
      "doi": "10.1162/COMJ_a_00324"
    },
    {
      "text": "David Wessel and Matthew Wright. 2002. Problems and prospects for intimate musical control of computers. Computer music journal 26, 3 (2002), 11–22. Publisher: MIT Press.",
      "doi": "10.1162/014892602320582945"
    },
    {
      "text": "Joan C. Williams. 2014. Double jeopardy? An empirical study with implications for the debates over implicit bias and intersectionality,. Harvard Journal of Law & Gender.",
      "doi": ""
    },
    {
      "text": "Anna Xambó. 2018. Who are the women authors in NIME?–Improving gender balance in NIME research. In Proceedings of the international conference on new interfaces for musical expression, Thomas Martin Luke Dahl, Douglas Bowman (Ed.). Virginia Tech, Blacksburg, Virginia, USA, 174–177. https://doi.org/10.5281/zenodo.1302535 ISSN: 2220-4806.",
      "doi": ""
    },
    {
      "text": "Amit Zoran. 2011. The 3D Printed Flute: Digital Fabrication and Design of Musical Instruments. Journal of New Music Research 40, 4 (Dec. 2011), 379–387. https://doi.org/10.1080/09298215.2011.621541",
      "doi": ""
    }
  ]
}