{
  "doi": "10.1145/3491102.3501933",
  "title": "”I don’t want to feel like I’m working in a 1960s factory”: The Practitioner Perspective on Creativity Support Tool Adoption",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "With the rapid development of creativity support tools, creative practitioners (e.g., designers, artists, architects) have to constantly explore and adopt new tools into their practice. While HCI research has focused on developing novel creativity support tools, little is known about creative practitioner’s values when exploring and adopting these tools. We collect and analyze 23 videos, 13 interviews, and 105 survey responses of creative practitioners reflecting on their values to derive a value framework. We find that practitioners value the tools’ functionality, integration into their current workflow, performance, user interface and experience, learning support, costs and emotional connection, in that order. They largely discover tools through personal recommendations. To help unify and encourage reflection from the wider community of CST stakeholders (e.g., systems creators, researchers, marketers, educators), we situate the framework within existing research on systems, creativity support tools and technology adoption.",
  "authors": [
    {
      "name": "Srishti Palani",
      "institution": "Autodesk Research, Canada and Design Lab, University of California, United States",
      "img": "/do/10.1145/contrib-99659569986/rel-imgonly/screen_shot_2021-10-08_at_9.48.11_am.jpeg",
      "acmid": "99659569986",
      "orcid": "0000-0003-1805-7307"
    },
    {
      "name": "David Ledo",
      "institution": "Autodesk Research, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490690490",
      "orcid": "0000-0002-0455-7936"
    },
    {
      "name": "George Fitzmaurice",
      "institution": "Autodesk Research, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502661254",
      "orcid": "0000-0002-2834-7757"
    },
    {
      "name": "Fraser Anderson",
      "institution": "Autodesk Research, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456623584",
      "orcid": "0000-0003-3486-8943"
    }
  ],
  "references": [
    {
      "text": "[1] [n.d.]. https://helpx.adobe.com/photoshop/using/tools.html",
      "doi": ""
    },
    {
      "text": "2021. AutoCAD Commands & Shortcuts for Beginners. https://all3dp.com/2/autocad-commands-shortcuts/",
      "doi": ""
    },
    {
      "text": "Paul S Adler and Terry Winograd. 1992. The Usability Challenge.",
      "doi": ""
    },
    {
      "text": "Icek Ajzen. 2011. The theory of planned behaviour: Reactions and reflections.",
      "doi": ""
    },
    {
      "text": "Sriram Karthik Badam and Niklas Elmqvist. 2014. Polychrome: A cross-device framework for collaborative web visualization. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces. 109–118.",
      "doi": "10.1145/2669485.2669518"
    },
    {
      "text": "Lisa Feldman Barrett. 2004. Feelings or words? Understanding the content in self-report ratings of experienced emotion.Journal of personality and social psychology 87, 2(2004), 266.",
      "doi": ""
    },
    {
      "text": "Pernille Bjørn and Nina Boulus-Rødje. 2015. The multiple intersecting sites of design in CSCW research. Computer Supported Cooperative Work (CSCW) 24, 4 (2015), 319–351.",
      "doi": "10.1007/s10606-015-9227-4"
    },
    {
      "text": "Alan F Blackwell, Carol Britton, A Cox, Thomas RG Green, Corin Gurr, Gada Kadoda, MS Kutar, Martin Loomes, Chrystopher L Nehaniv, Marian Petre, 2001. Cognitive dimensions of notations: Design tools for cognitive technology. In International Conference on Cognitive Technology. Springer, 325–341.",
      "doi": ""
    },
    {
      "text": "Ann Blandford, Dominic Furniss, and Stephann Makri. 2016. Qualitative HCI research: Going behind the scenes. Synthesis lectures on human-centered informatics 9, 1(2016), 1–115.",
      "doi": ""
    },
    {
      "text": "Susanne Bødker and Clemens Nylandsted Klokmose. 2011. The human–artifact model: An activity theoretical approach to artifact ecologies. Human–Computer Interaction 26, 4 (2011), 315–371.",
      "doi": ""
    },
    {
      "text": "Joel Brandt, Mira Dontcheva, Marcos Weskamp, and Scott R Klemmer. 2010. Example-centric programming: integrating web search into the development environment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 513–522.",
      "doi": "10.1145/1753326.1753402"
    },
    {
      "text": "Frederik Brudy, Christian Holz, Roman Rädle, Chi-Jui Wu, Steven Houben, Clemens Nylandsted Klokmose, and Nicolai Marquardt. 2019. Cross-device taxonomy: Survey, opportunities and challenges of interactions spanning across multiple devices. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–28.",
      "doi": "10.1145/3290605.3300792"
    },
    {
      "text": "Frederik Brudy, David Ledo, Michel Pahud, Nathalie Henry Riche, Christian Holz, Anand Waghmare, Hemant Bhaskar Surale, Marcus Peinado, Xiaokuan Zhang, Shannon Joyner, 2020. SurfaceFleet: Exploring Distributed Interactions Unbounded from Device, Application, User, and Time. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 7–21.",
      "doi": "10.1145/3379337.3415874"
    },
    {
      "text": "Erin A Carroll and Celine Latulipe. 2009. The creativity support index. In CHI’09 Extended Abstracts on Human Factors in Computing Systems. 4009–4014.",
      "doi": ""
    },
    {
      "text": "Erin A Carroll and Celine Latulipe. 2012. Triangulating the personal creative experience: self-report, external judgments, and physiology. In Proceedings of Graphics Interface 2012. 53–60.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory. sage.",
      "doi": ""
    },
    {
      "text": "Erin Cherry and Celine Latulipe. 2014. Quantifying the creativity support of digital tools through the creativity support index. ACM Transactions on Computer-Human Interaction (TOCHI) 21, 4(2014), 1–25.",
      "doi": "10.1145/2617588"
    },
    {
      "text": "Hilary Collins. 2018. Creative research: the theory and practice of research for the creative industries. (2018).",
      "doi": ""
    },
    {
      "text": "Nigel Cross. 2004. Expertise in design: an overview. Design studies 25, 5 (2004), 427–441.",
      "doi": ""
    },
    {
      "text": "Ruta Desai, Fraser Anderson, Justin Matejka, Stelian Coros, James McCann, George Fitzmaurice, and Tovi Grossman. 2019. Geppetto: Enabling semantic design of expressive robot behaviors. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300599"
    },
    {
      "text": "Andrew Dillon and Michael G Morris. 1996. User acceptance of information technology: Theories and models. Annual Review of Information Science and Technology (ARIST) 31 (1996), 3–32.",
      "doi": ""
    },
    {
      "text": "Graham Dove and Sara Jones. 2013. Evaluating creativity support in co-design workshops. (2013).",
      "doi": ""
    },
    {
      "text": "Donald P Ely. 1999. Conditions that facilitate the implementation of educational technology innovations. Educational technology 39, 6 (1999), 23–27.",
      "doi": ""
    },
    {
      "text": "James Fogarty. 2017. Code and Contribution in Interactive Systems Research. In Workshop HCITools: Strategies and Best Practices for Designing, Evaluating and Sharing Technical HCI Toolkits at CHI.",
      "doi": ""
    },
    {
      "text": "C Ailie Fraser, Tricia J Ngoon, Mira Dontcheva, and Scott Klemmer. 2019. RePlay: contextually presenting learning videos across software applications. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300527"
    },
    {
      "text": "C Ailie Fraser, Tricia J Ngoon, Ariel S Weingarten, Mira Dontcheva, and Scott Klemmer. 2017. CritiqueKit: A mixed-initiative, real-time interface for improving feedback. In Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology. 7–9.",
      "doi": "10.1145/3131785.3131791"
    },
    {
      "text": "Jonas Frich, Lindsay MacDonald Vermeulen, Christian Remy, Michael Mose Biskjaer, and Peter Dalsgaard. 2019. Mapping the landscape of creativity support tools in HCI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3290605.3300619"
    },
    {
      "text": "Jonas Frich, Midas Nouwens, Kim Halskov, and Peter Dalsgaard. 2021. How Digital Tools Impact Convergent and Divergent Thinking in Design Ideation. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3411764.3445062"
    },
    {
      "text": "David M Gray, Steven D’Alessandro, Lester W Johnson, and Leanne Carter. 2017. Inertia in services: causes and consequences for switching. Journal of Services Marketing(2017).",
      "doi": ""
    },
    {
      "text": "Thomas RG Green. 1989. Cognitive dimensions of notations. People and computers V(1989), 443–460.",
      "doi": ""
    },
    {
      "text": "Saul Greenberg. 2007. Toolkits and interface creativity. Multimedia Tools and Applications 32, 2 (2007), 139–159.",
      "doi": "10.1007/s11042-006-0062-y"
    },
    {
      "text": "Saul Greenberg and Bill Buxton. 2008. Usability evaluation considered harmful (some of the time). In Proceedings of the SIGCHI conference on Human factors in computing systems. 111–120.",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "Philip J Guo. 2015. Codeopticon: Real-time, one-to-many human tutoring for computer programming. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. 599–608.",
      "doi": "10.1145/2807442.2807469"
    },
    {
      "text": "Dawn Michele Jacobsen. 1998. Adoption patterns and characteristics of faculty who intergrate computer technology for teaching and learning in higher education. (1998).",
      "doi": ""
    },
    {
      "text": "Joseph’Jofish’ Kaye. 2007. Evaluating experience-focused HCI. In CHI’07 extended abstracts on Human factors in computing systems. 1661–1664.",
      "doi": ""
    },
    {
      "text": "John F Kihlstrom, Eric Eich, Deborah Sandbrand, and Betsy A Tobias. 1999. Emotion and memory: Implications for self-report. In The science of self-report. Psychology Press, 93–112.",
      "doi": ""
    },
    {
      "text": "Joy Kim, Mira Dontcheva, Wilmot Li, Michael S Bernstein, and Daniela Steinsapir. 2015. Motif: Supporting novice creativity through expert patterns. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1211–1220.",
      "doi": "10.1145/2702123.2702507"
    },
    {
      "text": "David Ledo, Steven Houben, Jo Vermeulen, Nicolai Marquardt, Lora Oehlberg, and Saul Greenberg. 2018. Evaluation strategies for HCI toolkit research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3173574.3173610"
    },
    {
      "text": "David Ledo, Jo Vermeulen, Sheelagh Carpendale, Saul Greenberg, Lora Oehlberg, and Sebastian Boring. 2019. Astral: Prototyping Mobile and Smart Object Interactive Behaviours Using Familiar Applications. In Proceedings of the 2019 on Designing Interactive Systems Conference. 711–724.",
      "doi": "10.1145/3322276.3322329"
    },
    {
      "text": "Younghwa Lee, Kenneth A Kozar, and Kai RT Larsen. 2003. The technology acceptance model: Past, present, and future. Communications of the Association for information systems 12, 1(2003), 50.",
      "doi": ""
    },
    {
      "text": "Yan Li and James R Lindner. 2007. Faculty adoption behaviour about web-based distance education: a case study from China Agricultural University. British Journal of Educational Technology 38, 1 (2007), 83–94.",
      "doi": ""
    },
    {
      "text": "Long-Chuan Lu, Wen-Pin Chang, and Hsiu-Hua Chang. 2014. Consumer attitudes toward blogger’s sponsored recommendations and purchase intention: The effect of sponsorship type, product type, and brand awareness. Computers in Human Behavior 34 (2014), 258–266.",
      "doi": ""
    },
    {
      "text": "Nic Lupfer, Andruid Kerne, Andrew M Webb, and Rhema Linder. 2016. Patterns of free-form curation: Visual thinking with web content. In Proceedings of the 24th ACM international conference on Multimedia. 12–21.",
      "doi": "10.1145/2964284.2964303"
    },
    {
      "text": "Brooke N Macnamara and Megha Maitra. 2019. The role of deliberate practice in expert performance: revisiting Ericsson, Krampe & Tesch-Römer (1993). Royal Society open science 6, 8 (2019), 190327.",
      "doi": ""
    },
    {
      "text": "Justin Matejka, Wei Li, Tovi Grossman, and George Fitzmaurice. 2009. CommunityCommands: command recommendations for software applications. In Proceedings of the 22nd annual ACM symposium on User interface software and technology. 193–202.",
      "doi": "10.1145/1622176.1622214"
    },
    {
      "text": "Brad Myers, Scott E Hudson, and Randy Pausch. 2000. Past, present, and future of user interface software tools. ACM Transactions on Computer-Human Interaction (TOCHI) 7, 1(2000), 3–28.",
      "doi": "10.1145/344949.344959"
    },
    {
      "text": "Donald A Norman. 2004. Beauty, goodness, and usability. Human-Computer Interaction 19, 4 (2004), 311–318.",
      "doi": "10.1207/s15327051hci1904_1"
    },
    {
      "text": "Donald A Norman. 2004. Emotional design: Why we love (or hate) everyday things. Basic Civitas Books.",
      "doi": ""
    },
    {
      "text": "Midas Nouwens and Clemens Nylandsted Klokmose. 2018. The application and its consequences for non-standard knowledge work. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173973"
    },
    {
      "text": "Sangeun Oh, Hyuck Yoo, Dae R Jeong, Duc Hoang Bui, and Insik Shin. 2017. Mobile plus: Multi-device mobile platform for cross-device functionality sharing. In Proceedings of the 15th Annual International Conference on Mobile Systems, Applications, and Services. 332–344.",
      "doi": "10.1145/3081333.3081348"
    },
    {
      "text": "Dan R Olsen Jr. 2007. Evaluating user interface systems research. In Proceedings of the 20th annual ACM symposium on User interface software and technology. 251–258.",
      "doi": "10.1145/1294211.1294256"
    },
    {
      "text": "Antti Oulasvirta and Kasper Hornbæk. 2016. Hci research as problem-solving. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 4956–4967.",
      "doi": "10.1145/2858036.2858283"
    },
    {
      "text": "Ozgu Ozkan and Fehmi Dogan. 2013. Cognitive strategies of analogical reasoning in design: Differences between expert and novice designers. Design Studies 34, 2 (2013), 161–192.",
      "doi": ""
    },
    {
      "text": "Srishti Palani, Zijian Ding, Austin Nguyen, Andrew Chuang, Stephen MacNeil, and Steven P Dow. 2021. CoNotate: Suggesting Queries Based on Notes Promotes Knowledge Discovery. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445618"
    },
    {
      "text": "Ingrid Pettersson, Florian Lachner, Anna-Katharina Frison, Andreas Riener, and Andreas Butz. 2018. A Bermuda triangle? A Review of method application and triangulation in user experience evaluation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3173574.3174035"
    },
    {
      "text": "Christian Remy, Oliver Bates, Alan Dix, Vanessa Thomas, Mike Hazas, Adrian Friday, and Elaine M Huang. 2018. Evaluation beyond usability: Validating sustainable HCI research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3173574.3173790"
    },
    {
      "text": "Christian Remy, Lindsay MacDonald Vermeulen, Jonas Frich, Michael Mose Biskjaer, and Peter Dalsgaard. 2020. Evaluating Creativity Support Tools in HCI Research. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 457–476.",
      "doi": "10.1145/3357236.3395474"
    },
    {
      "text": "Karen Renaud and Judy Van Biljon. 2008. Predicting technology acceptance and adoption by the elderly: a qualitative study. In Proceedings of the 2008 annual research conference of the South African Institute of Computer Scientists and Information Technologists on IT research in developing countries: riding the wave of technology. 210–219.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, Brad Myers, Kumiyo Nakakoji, Ben Shneiderman, Randy Pausch, Ted Selker, and Mike Eisenberg. 2005. Design principles for tools to support creative thinking. (2005).",
      "doi": ""
    },
    {
      "text": "Everett M Rogers. 2010. Diffusion of innovations. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Simon Roodhouse. 2006. The creative industries: definitions, quantification and practice. Cultural Industries: The British Experience in International Perspective. Online, Berlin: Humboldt University Berlin, Edoc-Server (2006), 13–32.",
      "doi": ""
    },
    {
      "text": "Frank E Saal, Ronald G Downey, and Mary A Lahey. 1980. Rating the ratings: Assessing the psychometric quality of rating data.Psychological bulletin 88, 2 (1980), 413.",
      "doi": ""
    },
    {
      "text": "Antti Salovaara, Antti Oulasvirta, and Giulio Jacucci. 2017. Evaluation of prototypes and the problem of possible futures. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 2064–2077.",
      "doi": "10.1145/3025453.3025658"
    },
    {
      "text": "Vernon T Sarver. 1983. Ajzen and Fishbein’s” theory of reasoned action”: A critical assessment.(1983).",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Bongshin Lee, Donghao Ren, Jeffrey Heer, John Stasko, John Thompson, Matthew Brehmer, and Zhicheng Liu. 2019. Critical reflections on visualization authoring systems. IEEE transactions on visualization and computer graphics 26, 1(2019), 461–471.",
      "doi": ""
    },
    {
      "text": "Peter Shea, Alexandra Pickett, and Chun Sau Li. 2005. Increasing access to higher education: A study of the diffusion of online teaching among 913 college faculty. International Review of Research in Open and Distributed Learning 6, 2(2005), 1–27.",
      "doi": ""
    },
    {
      "text": "Renata M Sheppard, Mahsa Kamali, Raoul Rivas, Morihiko Tamai, Zhenyu Yang, Wanmin Wu, and Klara Nahrstedt. 2008. Advancing interactive collaborative mediums through tele-immersive dance (TED) a symbiotic creativity and design environment for art and computer science. In Proceedings of the 16th ACM international conference on Multimedia. 579–588.",
      "doi": "10.1145/1459359.1459437"
    },
    {
      "text": "Lorraine Sherry. 1998. An integrated technology adoption and diffusion model. International Journal of Educational Telecommunications 4, 2(1998), 113–145.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 1999. User interfaces for creativity support tools. In Proceedings of the 3rd conference on Creativity & cognition. 15–22.",
      "doi": "10.1145/317561.317565"
    },
    {
      "text": "Ben Shneiderman. 2007. Creativity support tools: Accelerating discovery and innovation. Commun. ACM 50, 12 (2007), 20–32.",
      "doi": "10.1145/1323688.1323689"
    },
    {
      "text": "Ben Shneiderman. 2009. Creativity support tools: A grand challenge for HCI researchers. In Engineering the user interface. Springer, 1–9.",
      "doi": ""
    },
    {
      "text": "Pao Siangliulue, Joel Chan, Steven P Dow, and Krzysztof Z Gajos. 2016. IdeaHound: improving large-scale collaborative ideation with crowd-powered real-time semantic modeling. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 609–624.",
      "doi": "10.1145/2984511.2984578"
    },
    {
      "text": "Stacey H Stockdill and Diane L Morehouse. 1992. Critical factors in the successful adoption of technology: A checklist based on TDC findings. Educational Technology 32, 1 (1992), 57–58.",
      "doi": ""
    },
    {
      "text": "Daniel W Surry and John D Farquhar. 1997. Diffusion theory and instructional technology. Journal of Instructional Science and technology 2, 1 (1997), 24–36.",
      "doi": ""
    },
    {
      "text": "UX Tools. [n.d.]. 2020 Tools Survey Results. https://uxtools.co/survey-2020/",
      "doi": ""
    },
    {
      "text": "Klaus K Urban. 1991. Recent trends in creativity research and theory in Western Europe. European Journal of High Ability 1, 1 (1991), 99–113.",
      "doi": ""
    },
    {
      "text": "Viswanath Venkatesh, James YL Thong, and Xin Xu. 2016. Unified theory of acceptance and use of technology: A synthesis and the road ahead. Journal of the association for Information Systems 17, 5 (2016), 328–376.",
      "doi": ""
    },
    {
      "text": "James R Wallace, Saba Oji, and Craig Anslow. 2017. Technologies, methods, and values: changes in empirical research at CSCW 1990-2015. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–18.",
      "doi": "10.1145/3134741"
    },
    {
      "text": "Andy Warr and Eamonn O’Neill. 2005. Understanding design as a social creative process. In Proceedings of the 5th Conference on Creativity & Cognition. 118–127.",
      "doi": "10.1145/1056224.1056242"
    },
    {
      "text": "Mark Weiser. 1991. The Computer for the 21 st Century. Scientific american 265, 3 (1991), 94–105.",
      "doi": ""
    },
    {
      "text": "Andrzej P Wierzbicki and Yoshiteru Nakamori. 2007. Creative environments: Issues of creativity support for the knowledge civilization age. Vol. 59. Springer.",
      "doi": ""
    },
    {
      "text": "Brent Wilson, Lorraine Sherry, Jackie Dobrovolny, Mike Batty, and Martin Ryder. 2000. Adoption of learning technologies in schools and universities. Handbook on information technologies for education & training. New York: Springer-Verlag (2000).",
      "doi": ""
    },
    {
      "text": "Brent Wilson, Lorraine Sherry, Jackie Dobrovolny, Mike Batty, and Martin Ryder. 2002. Adoption factors and processes. Handbook on information technologies for education and training (2002), 293–307.",
      "doi": ""
    }
  ]
}