{
  "doi": "10.1145/3491102.3502031",
  "title": "Family as a Third Space for AI Literacies: How do children and parents learn about AI together?",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "Many families engage daily with artificial intelligence (AI) applications, from conversations with a voice assistant to mobile navigation searches. While there are known ways for youth to learn about AI, we do not yet understand how to engage parents in this process. To explore parents’ roles in helping their children develop AI literacies, we designed 11 learning activities organized into four topics: image classification, object recognition, interaction with voice assistants, and unplugged AI co-design. We conducted a 5-week online in-home study with 18 children (5 to 11 years old) and 16 parents. We identify parents’ most common roles in supporting their children and consider the benefits of parent-child partnerships when learning AI literacies. Finally, we discuss how our different activities supported parents’ roles and present design recommendations for future family-centered AI literacies resources.",
  "authors": [
    {
      "name": "Stefania Druga",
      "institution": "Information School, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658656840",
      "orcid": "missing"
    },
    {
      "name": "Fee Lia Christoph",
      "institution": "University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659747692",
      "orcid": "missing"
    },
    {
      "name": "Amy J Ko",
      "institution": "The Information School, University of Washington, United States",
      "img": "/do/10.1145/contrib-81100500360/rel-imgonly/2021-02.jpg",
      "acmid": "81100500360",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. Age appropriate design: a code of practice for online services | ICO. https://ico.org.uk/for-organisations/guide-to-data-protection/ico-codes-of-practice/age-appropriate-design-a-code-of-practice-for-online-services/. (Accessed on 08/28/2021).",
      "doi": ""
    },
    {
      "text": "[n.d.]. Echo Kids Privacy – Echo Dot Kids Edition Privacy Concerns and COPPA Violations Site. https://www.echokidsprivacy.com/. (Accessed on 08/31/2021).",
      "doi": ""
    },
    {
      "text": "Ehsan Abbasnejad, Damien Teney, Amin Parvaneh, Javen Shi, and Anton van den Hengel. 2020. Counterfactual vision and language learning. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 10044–10054.",
      "doi": ""
    },
    {
      "text": "Dor Abrahamson and Arthur Bakker. 2016. Making sense of movement in embodied design for mathematics learning. Cognitive research: principles and implications 1, 1(2016), 1–13.",
      "doi": ""
    },
    {
      "text": "Edith Ackermann. 1991. The agency model of transactions: Toward an understanding of children’s theory of control. Psychologie genetique et sciences cognitives. Geneve: Fondation Archives Jean Piaget (1991).",
      "doi": ""
    },
    {
      "text": "Otávio de P Albuquerque, Marcelo Fantinato, Marcelo M Eler, Sarajane M Peres, and Patrick CK Hung. 2020. A study of parental control requirements for smart toys. In 2020 IEEE International Conference on Systems, Man, and Cybernetics (SMC). IEEE, 2215–2220.",
      "doi": "10.1109/SMC42975.2020.9282959"
    },
    {
      "text": "Jose M Alonso. 2019. Explainable Artificial Intelligence for Kids. In 2019 Conference of the International Fuzzy Systems Association and the European Society for Fuzzy Logic and Technology (EUSFLAT 2019). Atlantis Press.",
      "doi": ""
    },
    {
      "text": "Morgan G Ames. 2015. Charismatic technology. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives. Aarhus University Press, 109–120.",
      "doi": "10.7146/aahcc.v1i1.21199"
    },
    {
      "text": "Tawfiq Ammari, Jofish Kaye, Janice Y Tsai, and Frank Bentley. 2019. Music, Search, and IoT: How People (Really) Use Voice Assistants.ACM Trans. Comput. Hum. Interact. 26, 3 (2019), 17–1.",
      "doi": "10.1145/3311956"
    },
    {
      "text": "Julia Angwin, Jeff Larson, Surya Mattu, and Lauren Kirchner. 2016. Machine bias. ProPublica, May 23(2016), 2016.",
      "doi": ""
    },
    {
      "text": "A Antle. 2007. Tangibles: five properties to consider for children. In Workshop on Tangibles at Conference on Human Factors in Computing Systems (CHI 2007). 1–10.",
      "doi": ""
    },
    {
      "text": "Alexander Bacalja. 2021. “There’s More Going On”: Critical Digital Game Literacies and the Imperative of Praxis. In Critical Digital Literacies: Boundary-Crossing Practices. Brill, 185–204.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 2005. The evolution of social cognitive theory. 9–35.",
      "doi": ""
    },
    {
      "text": "Gagan Bansal, Besmira Nushi, Ece Kamar, Daniel S Weld, Walter S Lasecki, and Eric Horvitz. 2019. Updates in human-ai teams: Understanding and addressing the performance/compatibility tradeoff. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 33. 2429–2437.",
      "doi": "10.1609/aaai.v33i01.33012429"
    },
    {
      "text": "Rachel Barr. 2019. Growing up in the digital age: early learning and family media ecology. Current directions in psychological science 28, 4 (2019), 341–346.",
      "doi": ""
    },
    {
      "text": "Brigid Barron, Caitlin Kennedy Martin, Lori Takeuchi, and Rachel Fithian. 2009. Parents as Learning Partners in the Development of Technological Fluency. International Journal of Learning and Media 1, 2 (May 2009), 55–77. https://doi.org/10.1162/ijlm.2009.0021",
      "doi": ""
    },
    {
      "text": "Mark Bauerlein. 2011. The Digital Divide: Arguments for and Against Facebook, Google, Texting, and the Age of Social Netwo rking. Penguin.",
      "doi": ""
    },
    {
      "text": "Erin Beneteau, Ashley Boone, Yuxing Wu, Julie A Kientz, Jason Yip, and Alexis Hiniker. [n.d.]. Parenting with Alexa: Exploring the Introduction of Smart Speakers on Family Dynamics. ([n. d.]).",
      "doi": ""
    },
    {
      "text": "Erin Beneteau, Yini Guan, Olivia K. Richards, Mingrui Ray Zhang, Julie A. Kientz, Jason Yip, and Alexis Hiniker. [n.d.]. Assumptions Checked: How Families Learn About and Use the Echo Dot. ([n. d.]).",
      "doi": ""
    },
    {
      "text": "Erin Beneteau, Olivia K. Richards, Mingrui Zhang, Julie A. Kientz, Jason Yip, and Alexis Hiniker. 2019. Communication Breakdowns Between Families and Alexa. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–13. https://doi.org/10.1145/3290605.3300473",
      "doi": "10.1145/3290605.3300473"
    },
    {
      "text": "Erin Beneteau, Olivia K Richards, Mingrui Zhang, Julie A Kientz, Jason Yip, and Alexis Hiniker. 2019. Communication breakdowns between families and Alexa. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 243.",
      "doi": "10.1145/3290605.3300473"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Rita Brito, Patrícia Dias, and Gabriela Oliveira. 2018. Young children, digital media and smart toys: How perceptions shape adoption and domestication. British Journal of Educational Technology 49, 5 (2018), 807–820.",
      "doi": ""
    },
    {
      "text": "Rita Brito, Rita Francisco, Patrícia Dias, and Stephane Chaudron. 2017. Family dynamics in digital homes: the role played by parental mediation in young children’s digital practices around 14 European countries. Contemporary Family Therapy 39, 4 (2017), 271–280.",
      "doi": ""
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender shades: Intersectional accuracy disparities in commercial gender classification. In Conference on fairness, accountability and transparency. 77–91.",
      "doi": ""
    },
    {
      "text": "Courtney Cazden, Bill Cope, Norman Fairclough, Jim Gee, Mary Kalantzis, Gunther Kress, Allan Luke, Carmen Luke, Sarah Michaels, and Martin Nakata. 1996. A pedagogy of multiliteracies: Designing social futures. Harvard educational review 66, 1 (1996), 60–92.",
      "doi": ""
    },
    {
      "text": "Luigi Ceccaroni, James Bibby, Erin Roger, Paul Flemons, Katina Michael, Laura Fagan, and Jessica L Oliver. 2019. Opportunities and risks for citizen science in the age of artificial intelligence. Citizen Science: Theory and Practice 4, 1 (2019).",
      "doi": ""
    },
    {
      "text": "Drew Cingel and Anne Marie Piper. 2017. How parents engage children in tablet-based reading experiences: An exploration of haptic feedback. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 505–510.",
      "doi": "10.1145/2998181.2998240"
    },
    {
      "text": "Derek Cormier, Gem Newman, Masayuki Nakane, James E Young, and Stephane Durocher. 2013. Would you do as a robot commands? an obedience study for human-robot interaction. In International Conference on Human-Agent Interaction.",
      "doi": ""
    },
    {
      "text": "Teresa Correa. 2014. Bottom-Up Technology Transmission Within Families: Exploring How Youths Influence Their Parents’ Digital Media Use With Dyadic Data. Journal of communication 64, 1 (2014), 103–124.",
      "doi": ""
    },
    {
      "text": "Roberto Santiago de Roock. 2021. On the material consequences of (digital) literacy: Digital writing with, for, and against racial capitalism. Theory Into Practice 60, 2 (2021), 183–193.",
      "doi": ""
    },
    {
      "text": "Patrícia Dias, Rita Brito, Wannes Ribbens, Linda Daniela, Zanda Rubene, Michael Dreier, Monica Gemo, Rosanna Di Gioia, and Stéphane Chaudron. 2016. The role of parents in the engagement of young children with digital technologies: Exploring tensions between rights of access and protection, from ‘Gatekeepers’ to ‘Scaffolders’. Global Studies of Childhood 6, 4 (2016), 414–427.",
      "doi": ""
    },
    {
      "text": "Betsy DiSalvo, Cecili Reid, and Parisa Khanipour Roshan. 2014. They can’t find us: the search for informal CS education. In Proceedings of the 45th ACM technical symposium on Computer science education. 487–492.",
      "doi": "10.1145/2538862.2538933"
    },
    {
      "text": "Paul Dourish. 2004. Where the action is: the foundations of embodied interaction. MIT press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Stefania Druga and Amy J Ko. 2021. How do children’s perceptions of machine intelligence change when training and coding smart programs?. In Interaction Design and Children. ACM, Athens Greece, 49–61. https://doi.org/10.1145/3459990.3460712",
      "doi": ""
    },
    {
      "text": "Stefania Druga and Rebecca Michelson. 2020. Research Toolkit for Family Speculative Play with Future Toys. Special Issue on Designing the future of technology with and for children (2020), 39.",
      "doi": ""
    },
    {
      "text": "Stefania Druga, Sarah T Vu, Eesh Likhith, and Tammy Qiu. 2019. Inclusive AI literacy for kids around the world. In Proceedings of FabLearn 2019. ACM, 104–111.",
      "doi": "10.1145/3311890.3311904"
    },
    {
      "text": "Stefania Druga, Randi Williams, Cynthia Breazeal, and Mitchel Resnick. 2017. Hey Google is it OK if I eat you?: Initial Explorations in Child-Agent Interaction. In Proceedings of the 2017 Conference on Interaction Design and Children. ACM, 595–600.",
      "doi": "10.1145/3078072.3084330"
    },
    {
      "text": "Stefania Druga, Randi Williams, Hae Won Park, and Cynthia Breazeal. 2018. How Smart Are the Smart Toys?: Children and Parents’ Agent Interaction and Intelligence Attribution. In Proceedings of the 17th ACM Conference on Interaction Design and Children (Trondheim, Norway) (IDC ’18). ACM, New York, NY, USA, 231–240. https://doi.org/10.1145/3202185.3202741",
      "doi": "10.1145/3202185.3202741"
    },
    {
      "text": "Stefania Druga, Jason Yip, Michael Preston, and Devin Dillon. 2021. The 4As: Ask, Adapt, Author, Analyze-AI Literacy Framework for Families. In Algorithmic Rights and Protections for Children. PubPub.",
      "doi": ""
    },
    {
      "text": "Catherine D’Ignazio and Rahul Bhargava. 2015. Approaches to building big data literacy. In Proceedings of the Bloomberg data for good exchange conference.",
      "doi": ""
    },
    {
      "text": "Yrjö Engeström. 2015. Learning by expanding. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Noel Enyedy, Joshua A Danish, Girlie Delacruz, and Melissa Kumar. 2012. Learning physics through play in an augmented reality environment. International journal of computer-supported collaborative learning 7, 3(2012), 347–378.",
      "doi": ""
    },
    {
      "text": "Thomas Erickson. 1997. Designing agents as if people mattered. Software agents (1997), 79–96.",
      "doi": ""
    },
    {
      "text": "Carrie A. Ewin, Andrea E. Reupert, Louise A. McLean, and Christopher J. Ewin. 2021. The impact of joint media engagement on parent–child interactions: A systematic review. Human Behavior and Emerging Technologies 3, 2 (April 2021), 230–254. https://doi.org/10.1002/hbe2.203",
      "doi": ""
    },
    {
      "text": "Brian J Fogg. 2002. Persuasive technology: using computers to change what we think and do. Ubiquity 2002, December (2002), 5.",
      "doi": "10.1145/764008.763957"
    },
    {
      "text": "Sean Follmer, Hayes Raffle, Janet Go, Rafael Ballagas, and Hiroshi Ishii. 2010. Video play: playful interactions in videoconferencing for long-distance families with young children. In Proceedings of the 9th International Conference onInteraction Design and Children (2010). ACM, 49–58.",
      "doi": "10.1145/1810543.1810550"
    },
    {
      "text": "Paulo Freire. 1968. Pedagogy of the Oppressed.",
      "doi": ""
    },
    {
      "text": "Laura Beth Fulton, Ja Young Lee, Qian Wang, Zhendong Yuan, Jessica Hammer, and Adam Perer. 2020. Getting playful with explainable ai: Games with a purpose to improve human understanding of ai. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3334480.3382831"
    },
    {
      "text": "Timnit Gebru. 2019. Oxford Handbook on AI Ethics Book Chapter on Race and Gender. (Aug. 2019). arxiv:1908.06165 [cs.CY]",
      "doi": ""
    },
    {
      "text": "Joshua Grossman, Zhiyuan Lin, Hao Sheng, Johnny T-Z Wei, Joseph J Williams, and Sharad Goel. 2019. MathBot: Transforming Online Resources for Learning Math into Conversational Interactions. (2019).",
      "doi": ""
    },
    {
      "text": "Kris Gutierrez, Betsy Rymes, and Joanne Larson. 1995. Script, counterscript, and underlife in the classroom: James Brown versus Brown v. Board of Education. Harvard educational review 65, 3 (1995), 445–472.",
      "doi": ""
    },
    {
      "text": "Kris D Gutiérrez. 2008. Developing a sociocritical literacy in the third space. Reading research quarterly 43, 2 (2008), 148–164.",
      "doi": ""
    },
    {
      "text": "Kris D Gutiérrez, P Zitlali Morales, and Danny C Martinez. 2009. Re-mediating literacy: Culture, difference, and learning for students from nondominant communities. Review of research in education 33, 1 (2009), 212–245.",
      "doi": ""
    },
    {
      "text": "Kris D Gutiérrez and Barbara Rogoff. 2003. Cultural ways of learning: Individual traits or repertoires of practice. Educational researcher 32, 5 (2003), 19–25.",
      "doi": ""
    },
    {
      "text": "Michael S Horn, R Jordan Crouser, and Marina U Bers. 2012. Tangible interaction and learning: the case for a hybrid approach. Personal and Ubiquitous Computing 16, 4 (2012), 379–389.",
      "doi": "10.1007/s00779-011-0404-2"
    },
    {
      "text": "Seth E Hunter, Pattie Maes, Anthony Tang, Kori M Inkpen, and Susan M Hessey. 2014. WaaZam! Supporting creative play at a distance in customized video environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1197–1206.",
      "doi": "10.1145/2556288.2557382"
    },
    {
      "text": "Tejinder K Judge and Carman Neustaedter. 2010. Sharing conversation and sharing life: video conferencing in the home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 655–658.",
      "doi": "10.1145/1753326.1753422"
    },
    {
      "text": "Yasmin Kafai, Chris Proctor, and Debora Lui. 2020. From theory bias to theory dialogue: embracing cognitive, situated, and critical framings of computational thinking in K-12 CS education. ACM Inroads 11, 1 (2020), 44–53.",
      "doi": "10.1145/3381887"
    },
    {
      "text": "K Kahn and N Winters. 2020. Constructionism and AI: A history and possible futures. Constructionism.",
      "doi": ""
    },
    {
      "text": "K Megasari Kahn, Rani Megasari, Erna Piantari, and Enjun Junaeti. 2018. AI programming by children using snap! block programming in a developing country. (2018).",
      "doi": ""
    },
    {
      "text": "Jerome Kirk, Marc L Miller, and Marc L Miller. 1986. Reliability and validity in qualitative research. Vol. 1. Sage.",
      "doi": ""
    },
    {
      "text": "Jill Klefstad. 2015. Focus on Family: Environments That Foster Inquiry and Critical Thinking in Young Children: Supporting Children’s Natural Curiosity. Childhood Education 91, 2 (2015), 147–149. https://doi.org/10.1080/00094056.2015.1018795",
      "doi": ""
    },
    {
      "text": "Amy J Ko, Alannah Oleson, Neil Ryan, Yim Register, Benjamin Xie, Mina Tari, Matthew Davidson, Stefania Druga, and Dastyni Loksa. 2020. It is time for more critical CS education. Commun. ACM 63, 11 (Oct. 2020), 31–33.",
      "doi": "10.1145/3424000"
    },
    {
      "text": "Todd Kulesza, Simone Stumpf, Margaret Burnett, and Irwin Kwan. 2012. Tell me more? The effects of mental model soundness on personalizing an intelligent agent. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1–10.",
      "doi": "10.1145/2207676.2207678"
    },
    {
      "text": "Jong-Eun Lee, Jeanne D Day, Naomi M Meara, and Scott Maxwell. 2002. Discrimination of social knowledge and its flexible application from creativity: a multitrait–multimethod approach. Pers. Individ. Dif. 32, 5 (April 2002), 913–928.",
      "doi": ""
    },
    {
      "text": "Michael J Lee, Faezeh Bahmani, Irwin Kwan, Jilian LaFerte, Polina Charters, Amber Horvath, Fanny Luor, Jill Cao, Catherine Law, Michael Beswetherick, 2014. Principles of a debugging-first puzzle game for computing education. In 2014 IEEE symposium on visual languages and human-centric computing (VL/HCC). IEEE, 57–64.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Scott Davidoff, John Zimmerman, and Anind Dey. 2006. Smart homes, families, and control. (2006).",
      "doi": ""
    },
    {
      "text": "Sharona T Levy and David Mioduser. 2008. Does it ”want” or ”was it programmed to...”? Kindergarten children’s explanations of an autonomous robot’s adaptive functioning. International Journal of Technology and Design Education 18, 4(2008), 337–359.",
      "doi": ""
    },
    {
      "text": "Thomas R Lindlof and Bryan C Taylor. 2017. Qualitative communication research methods. Sage publications.",
      "doi": ""
    },
    {
      "text": "Annabel Lindner, Stefan Seegerer, and Ralf Romeike. 2019. Unplugged Activities in the Context of AI. In International Conference on Informatics in Schools: Situation, Evolution, and Perspectives. Springer, 123–135.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone, Leslie Haddon, Anke Görzig, and Kjartan Ólafsson. 2011. Risks and safety on the internet: the perspective of European children: full findings and policy implications from the EU Kids Online survey of 9-16 year olds and their parents in 25 countries. (2011).",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone, Mariya Stoilova, and Rishita Nandagiri. 2018. Children’s data and privacy online. Technology 58, 2 (2018), 157–165.",
      "doi": ""
    },
    {
      "text": "Duri Long, Takeria Blunt, and Brian Magerko. 2021. Co-Designing AI Literacy Exhibits for Informal Learning Spaces. CSCW ’21: ACM Conference on Computer Supported Cooperative Work and Social Computing (23 10 2021).",
      "doi": ""
    },
    {
      "text": "Duri Long and Brian Magerko. 2020. What is AI Literacy? Competencies and Design Considerations. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3313831.3376727"
    },
    {
      "text": "Mary Madden, Michele Gilman, Karen Levy, and Alice Marwick. 2017. Privacy, Poverty, and Big Data: A Matrix of Vulnerabilities for Poor Americans. Washington University Law Review 95, 1 (2017), 053–125.",
      "doi": ""
    },
    {
      "text": "Radu Mariescu-Istodor and Ilkka Jormanainen. 2019. Machine learning for high school students. In Proceedings of the 19th Koli Calling International Conference on Computing Education Research. 1–9.",
      "doi": "10.1145/3364510.3364520"
    },
    {
      "text": "Paul Marshall. 2007. Do tangible interfaces enhance learning?. In Proceedings of the 1st international conference on Tangible and embedded interaction. 163–170.",
      "doi": "10.1145/1226969.1227004"
    },
    {
      "text": "Camillia Matuk, Susan Yoon, Joseph Polman, Anna Amato, Jacob Barton, Nicole Marie Bulalacao, Francesco Cafaro, Lina Chopra Haldar, Amanda Cottone, Krista Cortes, 2020. Data Literacy for Social Justice. (2020).",
      "doi": ""
    },
    {
      "text": "Emily McReynolds, Sarah Hubbard, Timothy Lau, Aditya Saraf, Maya Cakmak, and Franziska Roesner. 2017. Toys that Listen: A Study of Parents, Children, and Internet-Connected Toys. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (2017). ACM, 5197–5207.",
      "doi": "10.1145/3025453.3025735"
    },
    {
      "text": "Pekka Mertala. 2021. The pedagogy of multiliteracies as a code breaker: A suggestion for a transversal approach to computing education in basic education. British Journal of Educational Technology(2021).",
      "doi": ""
    },
    {
      "text": "Rebecca Michelson, Akeiylah Dewitt, Ria Nagar, Alexis Hiniker, Jason Yip, Sean Munson, and Julie Kientz. 2021. Parenting in a Pandemic: Juggling Multiple Roles and Managing Technology Use in Family Life During Covid-19 in the United States. Article 5 (10 2021). https://doi.org/10.1145/3479546",
      "doi": ""
    },
    {
      "text": "Matthew B Miles and A Michael Huberman. 1984. Drawing valid meaning from qualitative data: Toward a shared craft. Educational researcher 13, 5 (1984), 20–30.",
      "doi": ""
    },
    {
      "text": "David Mioduser and Sharona T Levy. 2010. Making sense by building sense: Kindergarten children’s construction and understanding of adaptive robot behaviors. International Journal of Computers for Mathematical Learning 15, 2(2010), 99–127.",
      "doi": ""
    },
    {
      "text": "Luis C Moll and James B Greenberg. 1990. Creating zones of possibilities: Combining social contexts for instruction. Vygotsky and education: Instructional implications and applications of sociohistorical psychology(1990), 319–348.",
      "doi": ""
    },
    {
      "text": "Michelle M. Neumann. 2018. Parent scaffolding of young children’s use of touch screen tablets. Early Child Development and Care 188, 12 (Dec. 2018), 1654–1664. https://doi.org/10.1080/03004430.2016.1278215",
      "doi": ""
    },
    {
      "text": "Peter Nikken and Jeroen Jansz. 2006. Parental mediation of children’s videogame playing: A comparison of the reports by parents and children. Learning, media and technology 31, 2 (2006), 181–202.",
      "doi": ""
    },
    {
      "text": "Philip Oltermann. 2017. German parents told to destroy doll that can spy on children. The Guardian (2017).",
      "doi": ""
    },
    {
      "text": "Kate Pahl and Sally Kelly. 2005. Family literacy as a third space between home and school: Some case studies of practice. Literacy 39, 2 (2005), 91–96.",
      "doi": ""
    },
    {
      "text": "Seymour Papert. 1993. The children’s machine: Rethinking school in the age of the computer.ERIC.",
      "doi": ""
    },
    {
      "text": "Michael Quinn Patton. 1990. Qualitative evaluation and research methods. SAGE Publications, inc.",
      "doi": ""
    },
    {
      "text": "Blakeley H Payne. 2019. An ethics of artificial intelligence curriculum for middle school students. MIT Media Lab Personal Robots Group. Retrieved Oct 10 (2019), 2019.",
      "doi": ""
    },
    {
      "text": "William Christopher Payne, Yoav Bergner, Mary Etta West, Carlie Charp, R Benjamin Benjamin Shapiro, Danielle Albers Szafir, Edd V Taylor, and Kayla DesPortes. 2021. danceON: Culturally Responsive Creative Computing. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21, Article 96). Association for Computing Machinery, New York, NY, USA, 1–16.",
      "doi": "10.1145/3411764.3445149"
    },
    {
      "text": "Martin Porcheron, Joel E Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice interfaces in everyday life. In proceedings of the 2018 CHI conference on human factors in computing systems. ACM, 640.",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "Tom Pringle and Eden Zoller. 2018. How to achieve AI maturity and why it matters. Ovum, June (2018), Available on Internet: https://www.amdocs.com (22/02/2019) (2018).",
      "doi": ""
    },
    {
      "text": "Hayes Raffle, Rafael Ballagas, Glenda Revelle, Hiroshi Horii, Sean Follmer, Janet Go, Emily Reardon, Koichi Mori, Joseph Kaye, and Mirjana Spasojevic. 2010. Family story play: reading with young children (and elmo) over a distance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1583–1592.",
      "doi": "10.1145/1753326.1753563"
    },
    {
      "text": "Mitchel Resnick, Robbie Berg, and Michael Eisenberg. 2000. Beyond black boxes: Bringing transparency and aesthetics back to scientific investigation. The Journal of the Learning Sciences 9, 1 (2000), 7–30.",
      "doi": ""
    },
    {
      "text": "Barbara Rogoff, Behnosh Najafi, and Rebeca Mejía-Arauz. 2014. Constellations of cultural practices across generations: Indigenous American heritage and learning by observing and pitching in. Human Development 57, 2-3 (2014), 82–95.",
      "doi": ""
    },
    {
      "text": "Ricarose Roque, Karina Lin, and Richard Liuzzi. 2016. “I’m Not Just a Mom”: Parents Developing Multiple Roles in Creative Computing. Singapore: International Society of the Learning Sciences.",
      "doi": ""
    },
    {
      "text": "Sherry Ruan, Jiayu He, Rui Ying, Jonathan Burkle, Dunia Hakim, Anna Wang, Yufeng Yin, Lily Zhou, Qianyao Xu, Abdallah Abu Hashem, Griffin Dietz, Elizabeth L Murnane, Emma Brunskill, and James A Landay. 2020. Supporting children’s math learning with feedback-augmented narrative technology. In Proceedings of the Interaction Design and Children Conference (London, United Kingdom) (IDC ’20). Association for Computing Machinery, New York, NY, USA, 567–580.",
      "doi": "10.1145/3392063.3394400"
    },
    {
      "text": "Sherry Ruan, Liwei Jiang, Justin Xu, Bryce Joe-Kun Tham, Zhengneng Qiu, Yeshuang Zhu, Elizabeth L Murnane, Emma Brunskill, and James A Landay. 2019. QuizBot: A Dialogue-based Adaptive Learning System for Factual Knowledge. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19, Paper 357). Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3290605.3300587"
    },
    {
      "text": "Heleen Rutjes, Martijn Willemsen, and Wijnand IJsselsteijn. 2019. Considerations on explainable aI and users’ mental models. (2019).",
      "doi": ""
    },
    {
      "text": "Herman Saksono, Ashwini Ranade, Geeta Kamarthi, Carmen Castaneda-Sceppa, Jessica A Hoffman, Cathy Wirth, and Andrea G Parker. 2015. Spaceship Launch: Designing a collaborative exergame for families. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 1776–1787.",
      "doi": "10.1145/2675133.2675159"
    },
    {
      "text": "Fiona Louise Scott. 2021. Family mediation of preschool children’s digital media practices at home. Learning, Media and Technology (July 2021), 1–16. https://doi.org/10.1080/17439884.2021.1960859",
      "doi": ""
    },
    {
      "text": "Bryan A Sisk, Alison L Antes, Sara Burrous, and James M DuBois. 2020. Parental Attitudes toward Artificial Intelligence-Driven Precision Medicine Technologies in Pediatric Healthcare. Children 7, 9 (2020), 145.",
      "doi": ""
    },
    {
      "text": "Sinem Siyahhan, Sasha A Barab, and Michael P Downton. 2010. Using activity theory to understand intergenerational play: The case of Family Quest. International Journal of Computer-Supported Collaborative Learning 5, 4(2010), 415–432.",
      "doi": ""
    },
    {
      "text": "Allison Skerrett. 2010. Lolita, Facebook, and the third space of literacy teacher education. Educational Studies 46, 1 (2010), 67–84.",
      "doi": ""
    },
    {
      "text": "Anna Smith. 2021. From Mimeographs to New Learning Ecologies. In Critical Digital Literacies: Boundary-Crossing Practices. Brill, 224–230.",
      "doi": ""
    },
    {
      "text": "Statista. 2019. Digital assistant and voice assistant adoption 2019. (2019).",
      "doi": ""
    },
    {
      "text": "Reed Stevens and L. Takeuchi. 2011. The New Coviewing: Designing for Learning through Joint Media Engagement. The Joan Ganz Cooney Center.",
      "doi": ""
    },
    {
      "text": "Elisabeth Sulmont, Elizabeth Patitsas, and Jeremy R Cooperstock. 2019. Can You Teach Me To Machine Learn?. In Proceedings of the 50th ACM Technical Symposium on Computer Science Education. 948–954.",
      "doi": "10.1145/3287324.3287392"
    },
    {
      "text": "Lihui Sun, Linlin Hu, and Danhua Zhou. 2021. Improving 7th-Graders’ Computational Thinking Skills Through Unplugged Programming Activities: A Study on the Influence of Multiple Factors. Thinking Skills and Creativity(2021), 100926.",
      "doi": ""
    },
    {
      "text": "Yingze Sun, Matthew Aylett, and Yolanda Vazquez-Alvarez. 2016. e-Seesaw: A Tangible, Ludic, Parent-child,Awareness System. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems- CHI EA ’16 (2016). 1821–1827. https://doi.org/10.1145/2851581.2892349",
      "doi": "10.1145/2851581.2892349"
    },
    {
      "text": "Emmeline Taylor and Katina Michael. 2016. Smart Toys that are the Stuff of Nightmares. IEEE Technology and Society Magazine 35, 1 (2016), 8–10.",
      "doi": ""
    },
    {
      "text": "RC Teepe, Inge Molenaar, and Ludo Verhoeven. 2017. Technology-enhanced storytelling stimulating parent–child interaction and preschool children’s vocabulary knowledge. Journal of Computer Assisted Learning 33, 2 (2017), 123–136.",
      "doi": "10.1111/jcal.12169"
    },
    {
      "text": "J Christopher D Terry, Helen E Roy, and Tom A August. 2020. Thinking like a naturalist: Enhancing computer vision of citizen science images by harnessing contextual data. Methods in Ecology and Evolution 11, 2 (2020), 303–315.",
      "doi": ""
    },
    {
      "text": "David Touretzky, Christina Gardner-McCune, Fred Martin, and Deborah Seehorn. 2019. Envisioning AI for k-12: What should every child know about AI?. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 33. 9795–9799.",
      "doi": "10.1609/aaai.v33i01.33019795"
    },
    {
      "text": "Junia Valente and Alvaro A Cardenas. 2017. Security & privacy in smart toys. In Proceedings of the 2017 Workshop on Internet of Things Security and Privacy. 19–24.",
      "doi": "10.1145/3139937.3139947"
    },
    {
      "text": "Mike van Duuren and Michael Scaife. 1995. How do children represent intelligent technology?European Journal of Psychology of Education 10, 3 (1995), 289–301.",
      "doi": ""
    },
    {
      "text": "Henriikka Vartiainen, Matti Tedre, and Teemu Valtonen. 2020. Learning machine learning with very young children: Who is teaching whom?International journal of child-computer interaction 25 (Sept. 2020), 100182.",
      "doi": ""
    },
    {
      "text": "Sara Vogel, Christopher Hoadley, Ana Rebeca Castillo, and Laura Ascenzi-Moreno. 2020. Languages, literacies and literate programming: can we use the latest theories on how bilingual people learn to help us teach computational literacies?Computer Science Education 30, 4 (2020), 420–443.",
      "doi": ""
    },
    {
      "text": "Anna-Lisa Vollmer, Robin Read, Dries Trippas, and Tony Belpaeme. 2018. Children conform, adults resist: A robot group induced peer pressure on normative social conformity. Science Robotics 3, 21 (2018), eaat7111.",
      "doi": ""
    },
    {
      "text": "Shirin Vossoughi, Paula K Hooper, and Meg Escudé. 2016. Making through the lens of culture and power: Toward transformative visions for educational equity. Harvard Educational Review 86, 2 (2016), 206–232.",
      "doi": ""
    },
    {
      "text": "Lev Vygotsky. 1978. Interaction between learning and development. Readings on the development of children 23, 3 (1978), 34–41.",
      "doi": ""
    },
    {
      "text": "Sandra Wachter, Brent Mittelstadt, and Chris Russell. 2017. Counterfactual explanations without opening the black box: Automated decisions and the GDPR. Harv. JL & Tech. 31(2017), 841.",
      "doi": ""
    },
    {
      "text": "Lawrence J Walker, Karl H Hennig, and Tobias Krettenauer. 2000. Parent and peer contexts for children’s moral reasoning development. Child development 71, 4 (2000), 1033–1048.",
      "doi": ""
    },
    {
      "text": "Danding Wang, Qian Yang, Ashraf Abdul, and Brian Y Lim. 2019. Designing theory-driven user-centric explainable AI. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–15.",
      "doi": "10.1145/3290605.3300831"
    },
    {
      "text": "Jon M Wargo and Jasmine Alvarado. 2020. Making as worlding: young children composing change through speculative design. Literacy 54, 2 (2020), 13–21.",
      "doi": ""
    },
    {
      "text": "Mark Warschauer and Morgan Ames. 2010. Can One Laptop per Child save the world’s poor?Journal of international affairs(2010), 33–51.",
      "doi": ""
    },
    {
      "text": "Eileen Wood, Marjan Petkovski, Domenica De Pasquale, Alexandra Gottardo, Mary Ann Evans, and Robert S. Savage. 2016. Parent Scaffolding of Young Children When Engaged with Mobile Technology. Frontiers in Psychology 7 (May 2016). https://doi.org/10.3389/fpsyg.2016.00690",
      "doi": ""
    },
    {
      "text": "Lu Xiao and Jennifer Martin. 2012. Supporting parent-young child activities with interactive tabletops: a conceptual analysis. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work Companion. 301–310.",
      "doi": "10.1145/2141512.2141606"
    },
    {
      "text": "Kun Xu and Matthew Lombard. 2017. Persuasive computing: Feeling peer pressure from multiple computer agents. Computers in Human Behavior 74 (2017), 152–162.",
      "doi": ""
    },
    {
      "text": "Svetlana Yarosh. 2008. Supporting long-distance parent-child interaction in divorced families. In CHI’08 Extended Abstracts on Human Factors in Computing Systems. 3795–3800.",
      "doi": ""
    },
    {
      "text": "Nicola Yelland and Jennifer Masters. 2007. Rethinking scaffolding in the information age. Computers & Education 48, 3 (April 2007), 362–382. https://doi.org/10.1016/j.compedu.2005.01.010",
      "doi": "10.1016/j.compedu.2005.01.010"
    },
    {
      "text": "Junnan Yu, Chenke Bai, and Ricarose Roque. 2020. Considering Parents in Coding Kit Design: Understanding Parents’ Perspectives and Roles. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–14. https://doi.org/10.1145/3313831.3376130",
      "doi": "10.1145/3313831.3376130"
    },
    {
      "text": "J Yu, C Bai, and R Roque. 2020. Considering Parents in Coding Kit Design: Understanding Parents’ Perspectives and Roles. Proceedings of the 2020 CHI Conference on(2020).",
      "doi": "10.1145/3313831.3376130"
    },
    {
      "text": "Abigail Zimmermann-Niefield, Makenna Turner, Bridget Murphy, Shaun K Kane, and R Benjamin Shapiro. 2019. Youth learning machine learning through building models of athletic moves. In Proceedings of the 18th ACM International Conference on Interaction Design and Children. 121–132.",
      "doi": "10.1145/3311927.3323139"
    }
  ]
}