{
  "doi": "10.1145/3491102.3517612",
  "title": "OneLabeler: A Flexible System for Building Data Labeling Tools",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-22",
  "year": 2022,
  "badges": [],
  "abstract": "Labeled datasets are essential for supervised machine learning. Various data labeling tools have been built to collect labels in different usage scenarios. However, developing labeling tools is time-consuming, costly, and expertise-demanding on software development. In this paper, we propose a conceptual framework for data labeling and OneLabeler based on the conceptual framework to support easy building of labeling tools for diverse usage scenarios. The framework consists of common modules and states in labeling tools summarized through coding of existing tools. OneLabeler supports configuration and composition of common software modules through visual programming to build data labeling tools. A module can be a human, machine, or mixed computation procedure in data labeling. We demonstrate the expressiveness and utility of the system through ten example labeling tools built with OneLabeler. A user study with developers provides evidence that OneLabeler supports efficient building of diverse data labeling tools.",
  "tags": [
    "framework",
    "visual programming",
    "interactive machine learning",
    "toolkit",
    "data labeling"
  ],
  "authors": [
    {
      "name": "Yu Zhang",
      "institution": "Department of Computer Science, University of Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240782",
      "orcid": "missing"
    },
    {
      "name": "Yun Wang",
      "institution": "Microsoft Research Asia, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702104",
      "orcid": "0000-0003-0468-4043"
    },
    {
      "name": "Haidong Zhang",
      "institution": "Microsoft Research Asia, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490687878",
      "orcid": "0000-0001-7411-8042"
    },
    {
      "name": "Bin Zhu",
      "institution": "Microsoft Research Asia, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100414076",
      "orcid": "missing"
    },
    {
      "name": "Siming Chen",
      "institution": "School of Data Science, Fudan University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658661068",
      "orcid": "0000-0002-2690-3588"
    },
    {
      "name": "Dongmei Zhang",
      "institution": "Microsoft Research Asia, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490660344",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amazon. 2005. Amazon Mechanical Turk. https://www.mturk.com/",
      "doi": ""
    },
    {
      "text": "Mykhaylo Andriluka, Jasper R. R. Uijlings, and Vittorio Ferrari. 2018. Fluid Annotation: A Human-Machine Collaboration Interface for Full Image Annotation. In Proceedings of the ACM International Conference on Multimedia. ACM, 1957–1966.",
      "doi": "10.1145/3240508.3241916"
    },
    {
      "text": "Nathaniel Ayewah, William Pugh, David Hovemeyer, J. David Morgenthaler, and John Penix. 2008. Using Static Analysis to Find Bugs. IEEE Software 25, 5 (sep 2008), 22–29.",
      "doi": "10.1109/MS.2008.130"
    },
    {
      "text": "A. Bäuerle, H. Neumann, and T. Ropinski. 2020. Classifier-Guided Visual Correction of Noisy Labels for Image Classification Tasks. Computer Graphics Forum 39, 3 (jun 2020), 195–205.",
      "doi": ""
    },
    {
      "text": "Jürgen Bernard, Marco Hutter, Matthias Zeppelzauer, Dieter Fellner, and Michael Sedlmair. 2018. Comparing Visual-Interactive Labeling with Active Learning: An Experimental Study. IEEE Transactions on Visualization and Computer Graphics 24, 1 (Jan. 2018), 298–308.",
      "doi": ""
    },
    {
      "text": "Jürgen Bernard, Matthias Zeppelzauer, Michael Sedlmair, and Wolfgang Aigner. 2018. VIAL: a unified process for visual interactive labeling. The Visual Computer 34, 9 (2018), 1189–1207.",
      "doi": "10.1007/s00371-018-1500-3"
    },
    {
      "text": "Michael Bloodgood and K. Vijay-Shanker. 2009. A Method for Stopping Active Learning Based on Stabilizing Predictions and the Need for User-Adjustable Stopping. In Proceedings of the Conference on Computational Natural Language Learning. Association for Computational Linguistics, 39–47.",
      "doi": ""
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3: Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Nov 2011), 2301–2309.",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Yuri Boykov, Olga Veksler, and Ramin Zabih. 2001. Fast Approximate Energy Minimization via Graph Cuts. IEEE Transactions on Pattern Analysis and Machine Intelligence 23, 11(2001), 1222–1239.",
      "doi": "10.1109/34.969114"
    },
    {
      "text": "Steve Branson, Catherine Wah, Florian Schroff, Boris Babenko, Peter Welinder, Pietro Perona, and Serge Belongie. 2010. Visual Recognition with Humans in the Loop. In Proceedings of the European Conference on Computer Vision. Springer Berlin Heidelberg, 438–451.",
      "doi": ""
    },
    {
      "text": "Klaus Brinker. 2003. Incorporating Diversity in Active Learning with Support Vector Machines. In Proceedings of the International Conference on Machine Learning. AAAI Press, 59–66.",
      "doi": ""
    },
    {
      "text": "Carla E. Brodley and Mark A. Friedl. 1999. Identifying Mislabeled Training Data. Journal of Artificial Intelligence Research 11, 1 (July 1999), 131–167.",
      "doi": ""
    },
    {
      "text": "Nicholas J. Bryan, Gautham J. Mysore, and Ge Wang. 2014. ISSE: An Interactive Source Separation Editor. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 257–266.",
      "doi": "10.1145/2556288.2557253"
    },
    {
      "text": "Maya Cakmak and Andrea L. Thomaz. 2011. Mixed-Initiative Active Learning. In Proceedings of ICML Workshop on Combining Learning Strategies to Reduce Label Cost. 5 pages.",
      "doi": ""
    },
    {
      "text": "Chengliang Chai, Guoliang Li, Ju Fan, and Yuyu Luo. 2020. Crowdsourcing-based Data Extraction from Visualization Charts. In Proceedings of the IEEE International Conference on Data Engineering. IEEE, 1814–1817.",
      "doi": ""
    },
    {
      "text": "Joseph Chee Chang, Saleema Amershi, and Ece Kamar. 2017. Revolt: Collaborative Crowdsourcing for Labeling Machine Learning Datasets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2334–2346.",
      "doi": "10.1145/3025453.3026044"
    },
    {
      "text": "Justin Cheng and Michael S. Bernstein. 2015. Flock: Hybrid Crowd-Machine Learning Classifiers. In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 600–611.",
      "doi": "10.1145/2675133.2675214"
    },
    {
      "text": "Minsuk Choi, Cheonbok Park, Soyoung Yang, Yonggyu Kim, Jaegul Choo, and Sungsoo Ray Hong. 2019. AILA: Attentive Interactive Labeling Assistant for Document Classification through Attention-Based Deep Neural Networks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1–12.",
      "doi": "10.1145/3290605.3300460"
    },
    {
      "text": "Jingyu Cui, Fang Wen, Rong Xiao, Yuandong Tian, and Xiaoou Tang. 2007. EasyAlbum: An Interactive Photo Annotation System Based on Face Clustering and Re-ranking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 367–376.",
      "doi": "10.1145/1240624.1240684"
    },
    {
      "text": "Weiwei Cui, Xiaoyu Zhang, Yun Wang, He Huang, Bei Chen, Lei Fang, Haidong Zhang, Jian-Guan Lou, and Dongmei Zhang. 2020. Text-to-Viz: Automatic Generation of Infographics from Proportion-Related Natural Language Statements. IEEE Transactions on Visualization and Computer Graphics 26, 1 (jan 2020), 906–916.",
      "doi": ""
    },
    {
      "text": "Ork de Rooij, Jarke J. van Wijk, and Marcel Worring. 2010. MediaTable: Interactive Categorization of Multimedia Collections. IEEE Computer Graphics and Applications 30, 5 (sep 2010), 42–51.",
      "doi": "10.1109/MCG.2010.66"
    },
    {
      "text": "Jia Deng, Olga Russakovsky, Jonathan Krause, Michael Bernstein, Alex Berg, and Li Fei-Fei. 2014. Scalable Multi-Label Annotation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3099–3102.",
      "doi": "10.1145/2556288.2557011"
    },
    {
      "text": "Dheeru Dua and Casey Graff. 2017. UCI Machine Learning Repository. http://archive.ics.uci.edu/ml",
      "doi": ""
    },
    {
      "text": "Abhishek Dutta and Andrew Zisserman. 2019. The VIA Annotation Software for Images, Audio and Video. In Proceedings of the ACM International Conference on Multimedia. ACM, 2276–2279.",
      "doi": "10.1145/3343031.3350535"
    },
    {
      "text": "Sara Evensen, Chang Ge, and Cagatay Demiralp. 2020. Ruler: Data Programming by Demonstration for Document Labeling. In Findings of the Association for Computational Linguistics: EMNLP 2020. Association for Computational Linguistics, 1996–2005.",
      "doi": ""
    },
    {
      "text": "Explosion. 2017. Prodigy. https://prodi.gy/",
      "doi": ""
    },
    {
      "text": "Jerry Alan Fails and Dan R. Olsen. 2003. Interactive Machine Learning. In Proceedings of the International Conference on Intelligent User Interfaces. ACM, 39–45.",
      "doi": "10.1145/604045.604056"
    },
    {
      "text": "Cristian Felix, Aritra Dasgupta, and Enrico Bertini. 2018. The Exploratory Labeling Assistant: Mixed-Initiative Label Curation with Large Document Collections. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, 153–164.",
      "doi": "10.1145/3242587.3242596"
    },
    {
      "text": "Humberto S. Garcia Caballero, Michel A. Westenberg, Binyam Gebre, and Jarke J. van Wijk. 2019. V-Awake: A Visual Analytics Approach for Correcting Sleep Predictions from Deep Learning Models. Computer Graphics Forum 38, 3 (2019), 1–12.",
      "doi": ""
    },
    {
      "text": "Gaudenz Halter, Rafael Ballester-Ripoll, Barbara Flueckiger, and Renato Pajarola. 2019. VIAN: A Visual Annotation Tool for Film Analysis. Computer Graphics Forum 38, 3 (2019), 119–129.",
      "doi": ""
    },
    {
      "text": "Benjamin Höferlin, Rudolf Netzel, Markus Höferlin, Daniel Weiskopf, and Gunther Heidemann. 2012. Inter-Active Learning of Ad-Hoc Classifiers for Video Visual Analytics. In Proceedings of the IEEE Conference on Visual Analytics Science and Technology. IEEE, 23–32.",
      "doi": "10.1109/VAST.2012.6400492"
    },
    {
      "text": "Steven C.H. Hoi and Michael R. Lyu. 2005. A Semi-Supervised Active Learning Framework for Image Retrieval. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, Vol. 2. IEEE, 302–309.",
      "doi": ""
    },
    {
      "text": "Xian-Sheng Hua and Guo-Jun Qi. 2008. Online Multi-Label Active Annotation: Towards Large-Scale Content-Based Video Search. In Proceedings of the ACM International Conference on Multimedia. ACM, 141–150.",
      "doi": "10.1145/1459359.1459379"
    },
    {
      "text": "Richard M. Karp. 1960. A Note on the Application of Graph Theory to Digital Computer Programming. Information and Control 3, 2 (jun 1960), 179–190.",
      "doi": ""
    },
    {
      "text": "Caitlin Kelleher and Randy Pausch. 2005. Lowering the Barriers to Programming: A Taxonomy of Programming Environments and Languages for Novice Programmers. Comput. Surveys 37, 2 (jun 2005), 83–137.",
      "doi": "10.1145/1089733.1089734"
    },
    {
      "text": "Kostiantyn Kucher, Carita Paradis, Magnus Sahlgren, and Andreas Kerren. 2017. Active Learning and Visual Analytics for Stance Classification with ALVA. ACM Transactions on Interactive Intelligent Systems 7, 3, Article 14 (Oct. 2017), 31 pages.",
      "doi": "10.1145/3132169"
    },
    {
      "text": "Todd Kulesza, Saleema Amershi, Rich Caruana, Danyel Fisher, and Denis Charles. 2014. Structured Labeling for Facilitating Concept Evolution in Machine Learning. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3075–3084.",
      "doi": "10.1145/2556288.2557238"
    },
    {
      "text": "Labelbox, Inc.2018. Labelbox. https://labelbox.com/",
      "doi": ""
    },
    {
      "text": "David Ledo, Steven Houben, Jo Vermeulen, Nicolai Marquardt, Lora Oehlberg, and Saul Greenberg. 2018. Evaluation Strategies for HCI Toolkit Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1–17.",
      "doi": "10.1145/3173574.3173610"
    },
    {
      "text": "Fritz Lekschas, Brant Peterson, Daniel Haehn, Eric Ma, Nils Gehlenborg, and Hanspeter Pfister. 2020. Peax: Interactive Visual Pattern Search in Sequential Data Using Unsupervised Deep Representation Learning. Computer Graphics Forum 39, 3 (jun 2020), 167–179.",
      "doi": ""
    },
    {
      "text": "David D. Lewis and Jason Catlett. 1994. Heterogeneous Uncertainty Sampling for Supervised Learning. In Proceedings of the International Conference on Machine Learning. Morgan Kaufmann Publishers Inc., 148–156.",
      "doi": ""
    },
    {
      "text": "Guoliang Li, Jiannan Wang, Yudian Zheng, and Michael J. Franklin. 2016. Crowdsourced Data Management: A Survey. IEEE Transactions on Knowledge and Data Engineering 28, 9 (sep 2016), 2296–2319.",
      "doi": "10.1109/TKDE.2016.2535242"
    },
    {
      "text": "Hongsen Liao, Li Chen, Yibo Song, and Hao Ming. 2016. Visualization-Based Active Learning for Video Annotation. IEEE Transactions on Multimedia 18, 11 (Nov. 2016), 2196–2205.",
      "doi": "10.1109/TMM.2016.2614227"
    },
    {
      "text": "Tzuta Lin. 2015. LabelImg. https://github.com/tzutalin/labelImg",
      "doi": ""
    },
    {
      "text": "Dong Liu, Meng Wang, Xian-Sheng Hua, and Hong-Jiang Zhang. 2009. Smart Batch Tagging of Photo Albums. In Proceedings of the ACM International Conference on Multimedia. ACM, 809–812.",
      "doi": "10.1145/1631272.1631420"
    },
    {
      "text": "Shixia Liu, Changjian Chen, Yafeng Lu, Fangxin Ouyang, and Bin Wang. 2019. An Interactive Method to Improve Crowdsourced Annotations. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan. 2019), 235–245.",
      "doi": "10.1109/TVCG.2018.2865018"
    },
    {
      "text": "Andrew L. Maas, Raymond E. Daly, Peter T. Pham, Dan Huang, Andrew Y. Ng, and Christopher Potts. 2011. Learning Word Vectors for Sentiment Analysis. In Proceedings of the Annual Meeting of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, 142–150.",
      "doi": ""
    },
    {
      "text": "Gonzalo Gabriel Méndez, Miguel A. Nacenta, and Sebastien Vandenheste. 2016. iVoLVER: Interactive Visual Language for Visualization Extraction and Reconstruction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 4073–4085.",
      "doi": "10.1145/2858036.2858435"
    },
    {
      "text": "Microsoft. 2017. VoTT: Visual Object Tagging Tool. https://github.com/microsoft/VoTT",
      "doi": ""
    },
    {
      "text": "Hiroki Nakayama, Takahiro Kubo, Junya Kamura, Yasufumi Taniguchi, and Xu Liang. 2018. doccano: Text Annotation Tool for Human. https://github.com/doccano/doccano",
      "doi": ""
    },
    {
      "text": "Curtis Northcutt, Lu Jiang, and Isaac Chuang. 2021. Confident Learning: Estimating Uncertainty in Dataset Labels. Journal of Artificial Intelligence Research 70 (may 2021), 1373–1411.",
      "doi": ""
    },
    {
      "text": "Allard Oelen, Markus Stocker, and Sören Auer. 2021. Crowdsourcing Scholarly Discourse Annotations. In Proceedings of the International Conference on Intelligent User Interfaces. ACM, 464–474.",
      "doi": "10.1145/3397481.3450685"
    },
    {
      "text": "Jose Gustavo S. Paiva, William Robson Schwartz, Helio Pedrini, and Rosane Minghim. 2015. An Approach to Supporting Incremental Visual Data Classification. IEEE Transactions on Visualization and Computer Graphics 21, 1 (Jan. 2015), 4–17.",
      "doi": ""
    },
    {
      "text": "Vassil Panayotov, Guoguo Chen, Daniel Povey, and Sanjeev Khudanpur. 2015. Librispeech: An ASR corpus based on public domain audio books. In Proceedings of the IEEE International Conference on Acoustics, Speech and Signal Processing. IEEE, 5206–5210.",
      "doi": ""
    },
    {
      "text": "Alexander Ratner, Stephen H. Bach, Henry Ehrenberg, Jason Fries, Sen Wu, and Christopher Ré. 2017. Snorkel: Rapid Training Data Creation with Weak Supervision. Proceedings of the VLDB Endowment 11, 3 (Nov. 2017), 269–282.",
      "doi": "10.14778/3157794.3157797"
    },
    {
      "text": "Donghao Ren, Tobias Hollerer, and Xiaoru Yuan. 2014. iVisDesigner: Expressive Interactive Design of Information Visualizations. IEEE Transactions on Visualization and Computer Graphics 20, 12 (Dec. 2014), 2092–2101.",
      "doi": ""
    },
    {
      "text": "Tim Rietz and Alexander Maedche. 2021. Cody: An AI-Based System to Semi-Automate Coding for Qualitative Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Article 394, 14 pages.",
      "doi": "10.1145/3411764.3445591"
    },
    {
      "text": "Olga Russakovsky, Li-Jia Li, and Li Fei-Fei. 2015. Best of both worlds: Human-machine collaboration for object annotation. In Proceedings of IEEE Conference on Computer Vision and Pattern Recognition. IEEE, 2121–2131.",
      "doi": ""
    },
    {
      "text": "Bryan C. Russell, Antonio Torralba, Kevin P. Murphy, and William T. Freeman. 2008. LabelMe: A Database and Web-Based Tool for Image Annotation. International Journal of Computer Vision 77, 1-3 (2008), 157–173.",
      "doi": "10.1007/s11263-007-0090-8"
    },
    {
      "text": "Christian Schüldt, Ivan Laptev, and Barbara Caputo. 2004. Recognizing Human Actions: A Local SVM Approach. In Proceedings of the International Conference on Pattern Recognition, Vol. 3. IEEE, 32–36.",
      "doi": ""
    },
    {
      "text": "Burr Settles. 2009. Active Learning Literature Survey. Technical Report. University of Wisconsin–Madison.",
      "doi": ""
    },
    {
      "text": "Burr Settles. 2011. Closing the Loop: Fast, Interactive Semi-supervised Annotation with Queries on Features and Instances. In Proceedings of the Conference on Empirical Methods in Natural Language Processing. Association for Computational Linguistics, 1467–1478.",
      "doi": ""
    },
    {
      "text": "Xindi Shang, Donglin Di, Junbin Xiao, Yu Cao, Xun Yang, and Tat-Seng Chua. 2019. Annotating Objects and Relations in User-Generated Videos. In Proceedings of the International Conference on Multimedia Retrieval. ACM, 279–287.",
      "doi": "10.1145/3323873.3325056"
    },
    {
      "text": "Bongwon Suh and Benjamin B. Bederson. 2007. Semi-Automatic Photo Annotation Strategies Using Event Based Clustering and Clothing Based Person Recognition. Interacting with Computers 19, 4 (July 2007), 524–544.",
      "doi": "10.1016/j.intcom.2007.02.002"
    },
    {
      "text": "Jinhui Tang, Qiang Chen, Meng Wang, Shuicheng Yan, Tat-Seng Chua, and Ramesh Jain. 2013. Towards Optimizing Human Labeling for Interactive Image Tagging. ACM Transactions on Multimedia Computing, Communications, and Applications 9, 4, Article 29 (Aug. 2013), 18 pages.",
      "doi": "10.1145/2501643.2501651"
    },
    {
      "text": "Yuandong Tian, Wei Liu, Rong Xiao, Fang Wen, and Xiaoou Tang. 2007. A Face Annotation Framework with Partial Clustering and Interactive Labeling. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. IEEE, 1–8.",
      "doi": ""
    },
    {
      "text": "Maxim Tkachenko, Mikhail Malyuk, Nikita Shevchenko, Andrey Holmanyuk, and Nikolai Liubimov. 2020. Label Studio: Data labeling software. https://github.com/heartexlabs/label-studio",
      "doi": ""
    },
    {
      "text": "Luis von Ahn and Laura Dabbish. 2004. Labeling Images with a Computer Game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 319–326.",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "Luis von Ahn and Laura Dabbish. 2008. Designing Games with a Purpose. Commun. ACM 51, 8 (Aug. 2008), 58–67.",
      "doi": "10.1145/1378704.1378719"
    },
    {
      "text": "Luis von Ahn, Ruoran Liu, and Manuel Blum. 2006. Peekaboom: A Game for Locating Objects in Images. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 55–64.",
      "doi": "10.1145/1124772.1124782"
    },
    {
      "text": "Luis von Ahn, Benjamin Maurer, Colin McMillen, David Abraham, and Manuel Blum. 2008. reCAPTCHA: Human-Based Character Recognition via Web Security Measures. Science 321, 5895 (aug 2008), 1465–1468.",
      "doi": ""
    },
    {
      "text": "Guotai Wang, Maria A. Zuluaga, Wenqi Li, Rosalind Pratt, Premal A. Patel, Michael Aertsen, Tom Doel, Anna L. David, Jan Deprest, Sébastien Ourselin, and Tom Vercauteren. 2019. DeepIGeoS: A Deep Interactive Geodesic Framework for Medical Image Segmentation. IEEE Transactions on Pattern Analysis and Machine Intelligence 41, 7 (jul 2019), 1559–1572.",
      "doi": ""
    },
    {
      "text": "Meng Wang and Xian-Sheng Hua. 2011. Active Learning in Multimedia Annotation and Retrieval: A Survey. ACM Transactions on Intelligent Systems and Technology 2, 2, Article 10 (Feb. 2011), 21 pages.",
      "doi": "10.1145/1899412.1899414"
    },
    {
      "text": "Zhirong Wu, Shuran Song, Aditya Khosla, Fisher Yu, Linguang Zhang, Xiaoou Tang, and Jianxiong Xiao. 2015. 3D ShapeNets: A Deep Representation for Volumetric Shapes. In IEEE Conference on Computer Vision and Pattern Recognition. IEEE, 1912–1920.",
      "doi": ""
    },
    {
      "text": "Shouxing Xiang, Xi Ye, Jiazhi Xia, Jing Wu, Yang Chen, and Shixia Liu. 2019. Interactive Correction of Mislabeled Training Data. In Proceedings of the IEEE Conference on Visual Analytics Science and Technology. IEEE, 57–68.",
      "doi": ""
    },
    {
      "text": "Zuobing Xu, Ram Akella, and Yi Zhang. 2007. Incorporating Diversity and Density in Active Learning for Relevance Feedback. In Proceedings of the European Conference on IR Research. Springer-Verlag, 246–257.",
      "doi": ""
    },
    {
      "text": "Yang Yang, Bin B. Zhu, Rui Guo, Linjun Yang, Shipeng Li, and Nenghai Yu. 2008. A Comprehensive Human Computation Framework: With Application to Image Labeling. In Proceedings of the ACM International Conference on Multimedia. ACM, 479–488.",
      "doi": "10.1145/1459359.1459423"
    },
    {
      "text": "Hao Ye, Weiyuan Shao, Hong Wang, Jianqi Ma, Li Wang, Yingbin Zheng, and Xiangyang Xue. 2016. Face Recognition via Active Annotation and Learning. In Proceedings of the ACM International Conference on Multimedia. ACM, 1058–1062.",
      "doi": "10.1145/2964284.2984059"
    },
    {
      "text": "Bowen Yu and Claudio T. Silva. 2017. VisFlow - Web-based Visualization Framework for Tabular Data with a Subset Flow Model. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan. 2017), 251–260.",
      "doi": "10.1109/TVCG.2016.2598497"
    },
    {
      "text": "Jan Zahálka and Marcel Worring. 2014. Towards Interactive, Intelligent, and Integrated Multimedia Analytics. In Proceedings of the IEEE Conference on Visual Analytics Science and Technology. IEEE, 3–12.",
      "doi": ""
    },
    {
      "text": "Jan Zahálka, Marcel Worring, and Jarke J. van Wijk. 2020. II-20: Intelligent and pragmatic analytic categorization of image collections. IEEE Transactions on Visualization and Computer Graphics 27, 2(2020), 422–431.",
      "doi": ""
    },
    {
      "text": "Lishi Zhang, Chenghan Fu, and Jia Li. 2018. Collaborative Annotation of Semantic Objects in Images with Multi-Granularity Supervisions. In Proceedings of the ACM International Conference on Multimedia. ACM, 474–482.",
      "doi": "10.1145/3240508.3240540"
    },
    {
      "text": "Tianye Zhang, Haozhe Feng, Wei Chen, Zexian Chen, Wenting Zheng, Xiao-Nan Luo, Wenqi Huang, and Anthony K. H. Tung. 2021. ChartNavigator: An Interactive Pattern Identification and Annotation Framework for Charts. IEEE Transactions on Knowledge and Data Engineering (2021), 1–1.",
      "doi": ""
    },
    {
      "text": "Yexun Zhang, Wenbin Cai, Wenquan Wang, and Ya Zhang. 2017. Stopping Criterion for Active Learning with Model Stability. ACM Transactions on Intelligent Systems and Technology 9, 2, Article 19 (Oct. 2017), 26 pages.",
      "doi": ""
    },
    {
      "text": "Yu Zhang, Bob Coecke, and Min Chen. 2021. MI3: Machine-Initiated Intelligent Interaction for Interactive Classification and Data Reconstruction. ACM Transactions on Interactive Intelligent Systems 11, 3–4, Article 18 (Aug. 2021), 34 pages.",
      "doi": "10.1145/3412848"
    },
    {
      "text": "Yu Zhang, Martijn Tennekes, Tim de Jong, Lyana Curier, Bob Coecke, and Min Chen. 2021. Using Simulation to Aid the Design and Optimization of Intelligent User Interfaces for Quality Assurance Processes in Machine Learning. arXiv:2104.01129 [cs.HC]",
      "doi": ""
    },
    {
      "text": "Jingbo Zhu, Huizhen Wang, Eduard Hovy, and Matthew Ma. 2010. Confidence-Based Stopping Criteria for Active Learning for Data Annotation. ACM Transactions on Speech and Language Processing 6, 3, Article 3 (April 2010), 24 pages.",
      "doi": "10.1145/1753783.1753784"
    },
    {
      "text": "Xingquan Zhu, Xindong Wu, and Qijun Chen. 2003. Eliminating Class Noise in Large Datasets. In Proceedings of the International Conference on Machine Learning. AAAI Press, 920–927.",
      "doi": ""
    }
  ]
}