{
  "doi": "10.1145/3491102.3502072",
  "title": "3D Printed Street Crossings: Supporting Orientation and Mobility Training with People who are Blind or have Low Vision",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "The ability to cross the street at intersections is an essential skill, often taught to people who are blind or have low vision (BLV) with the aid of tactile maps and kits or toys. However, each of the existing mapping tools has shortcomings. We investigated whether co-designed 3D printed components can offer benefits. Guided by consultation with 11 Orientation and Mobility (O&M) professionals, we co-designed a series of 3D printed kits that they then used in their practice with BLV children who showed high levels of engagement and learning. The 3D materials were found to demonstrate the key concepts for street crossings in a portable, engaging and professional manner. They will be released for free download, enabling O&M professionals to access or modify the materials as required. We hope that use of our co-designed 3D printed tools will contribute to the safety, independence and inclusion of BLV people.",
  "authors": [
    {
      "name": "Leona Holloway",
      "institution": "Department of Human-Centred Computing, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260925",
      "orcid": "0000-0001-9200-5164"
    },
    {
      "name": "Matthew Butler",
      "institution": "Department of Human-Centred Computing, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508687882",
      "orcid": "0000-0002-7950-5495"
    },
    {
      "name": "Kim Marriott",
      "institution": "Human-Centred Computing, Faculty of IT, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320492504",
      "orcid": "0000-0002-9813-0377"
    }
  ],
  "references": [
    {
      "text": "Daniel H. Ashmead, David Guth, Robert S. Wall, Richard G. Long, and Paul E Ponchillia. 2005. Street Crossing by Sighted and Blind Pedestrians at a Modern Roundabout. Journal of Transportation Engineering 131, 11 (2005), 812–821.",
      "doi": ""
    },
    {
      "text": "T. R. Austin and R. B. Sleight. 1952. Factors related to speed and accuracy of tactual discrimination. Journal of Experimental Psychology 44, 4 (1952), 283–287. https://doi.org/10.1037/h0057357",
      "doi": ""
    },
    {
      "text": "Australian Division of National Mapping (ADON). 1986. Symbols for Tactual and Low Vision Town Maps. Technical Report. Canberra, ACT, Australia.",
      "doi": ""
    },
    {
      "text": "Aaron Bangor, Philip T. Kortum, and James T. Miller. 2008. An empirical evaluation of the System Usability Scale. International Journal of Human-Computer Interaction 24, 6(2008), 574–594. https://doi.org/10.1080/10447310802205776",
      "doi": ""
    },
    {
      "text": "Aaron Bangor, Philip T. Kortum, and James T. Miller. 2009. Determining What Individual SUS Scores Mean: Adding an Adjective Rating Scale. Journal of Usability Studies 4, 3 (2009), 114–123.",
      "doi": "10.5555/2835587"
    },
    {
      "text": "Nikola Banovic, Rachel L. Franz, Khai N. Truong, Jennifer Mankoff, and Anind K. Dey. 2013. Uncovering information needs for independent spatial learning for users who are visually impaired. In ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’13). ACM, New York, NY, USA, 1–8.",
      "doi": "10.1145/2513383.2513445"
    },
    {
      "text": "Janet M. Barlow, Billie Louise Bentzen, and Tamara Bond. 2005. Blind Pedestrians and the Changing Technology and Geometry of Signalized Intersections: Safety, Orientation, and Independence. Journal of Visual Impairment & Blindness 99, 10 (2005), 587–598. https://doi.org/10.1177/0145482X0509901003",
      "doi": ""
    },
    {
      "text": "Janet M. Barlow, Billie Louise Bentzen, D. Sauerburger, and L. Franck. 2010. Teaching travel at complex intersections. Vol. 2. AFB Press, New York, NY, USA, Chapter 12, 352–419.",
      "doi": ""
    },
    {
      "text": "John L. Barth. 1988. The Tactile Graphics Guidebook. American Printing House for the Blind, Louisville, Kentucky, USA. http://www.archive.org/details/tactilegraphicsg00john",
      "doi": ""
    },
    {
      "text": "Billie Louise Bentzen and James R. Marston. 2010. Orientation aids for students with vision loss. Vol. 1. AFB Press, New York, NY, USA, 296–323.",
      "doi": ""
    },
    {
      "text": "V. M. Berger, G. Nussbaum, C. Emmiger, and Z. Major. 2018. 3D printing of personalised assistive technology. In ICCHP Computers Helping People with Special Needs (Linz, Austria), Vol. Part II. SpringerLink, Switzerland, 135–142. https://doi.org/10.1007/978-3-319-94274-2_19",
      "doi": ""
    },
    {
      "text": "B. B. Blasch and K. A. Stuckey. 1995. Accessibility and Mobility of Persons Who Are Visually Impaired: A Historical Analysis. Journal of Visual Impairment & Blindness 89, 5 (1995), 417–422. https://doi.org/10.1177/0145482X9508900506",
      "doi": ""
    },
    {
      "text": "John Brooke. 1986. SUS: a ”quick and dirty” usability scale. Taylor and Francis, London, England, 189–194. https://doi.org/10.1201/9781498710411-35",
      "doi": ""
    },
    {
      "text": "Emeline Brulé and Gilles Bailly. 2021. ”Beyond 3D printers”: Understanding Long-Term Digital Fabrication Practices for the Education of Visually Impaired or Blind Youth. In CHI. ACM, New York, NY, USA. https://doi.org/10.1145/3411764.3445403",
      "doi": ""
    },
    {
      "text": "Erin Buehler, Niara Comrie, Megan Hofmann, Samantha McDonald, and Amy Hurst. 2016. Investigating the Implications of 3D Printing in Special Education. ACM Transactions on Accessible Computing (TACCESS) 8, 3 (2016), 1–28. https://doi.org/10.1145/2870640",
      "doi": "10.1145/2870640"
    },
    {
      "text": "Gabriela Celani and Luis Fernando Milan. 2007. Tactile scale models: three-dimensional info-graphics for space orientation of the blind and visually impaired. Taylor & Francis Group, London, 801–805.",
      "doi": ""
    },
    {
      "text": "Yu-Chen Chen, Chun-Hsien Chiang, and Huan-Chieng Chiu. 2010. The recognition of 3D basic patterns and tactile icons for the blind. Research Bulletin 29(2010), 23–31. https://pdfs.semanticscholar.org/6552/ef88410c2418ab79d879d7274bcd15e0ee69.pdf",
      "doi": ""
    },
    {
      "text": "Ann Cunningham and Charlie Gyder. 2021. Sensational Blackboard. Sensational Books! Retrieved April 2021 from http://www.sensationalbooks.com/products.html#blackboard",
      "doi": ""
    },
    {
      "text": "Gabriel B. Dadi, Paul M. Goodrum, Timothy R. B. Taylor, and C. Melody Carswell. 2014. Cognitive Workload Demands using 2D and 3D Spatial Engineering Information Formats. Journal of Construction Engineering Management 140, 5(2014), 04014001–1–8. https://doi.org/10.1061/(ASCE)CO.1943-7862.0000827",
      "doi": ""
    },
    {
      "text": "Lil Deverell, S. Taylor, and J. Prentice. 2009. Orientation and mobility methods: Techniques for independent travel. Guide Dogs Victoria, Melbourne, Australia.",
      "doi": ""
    },
    {
      "text": "Polly K. Edman. 1992. Tactile Graphics. AFB Press, Arlington, VA, USA.",
      "doi": ""
    },
    {
      "text": "Diane L. Fazzi and Janet M. Barlow. 2017. Orientation and Mobility Techniques: A Guide for the Practitioner. AFB Press, American Foundation for the Blind, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Lighthouse for the Blind and Visually Impaired. 2021. Tactile Intersection Diagrams. Retrieved April 2021 from https://adaptations.org/products/bm444-1",
      "doi": ""
    },
    {
      "text": "American Printing House for the Blind (APH). 2021. Draftsman Tactile Drawing Board. Retrieved April 2021 from https://www.aph.org/product/draftsman-tactile-drawing-board/",
      "doi": ""
    },
    {
      "text": "American Printing House for the Blind (APH). 2021. Tactile Town: 3-D O&M Kit. Retrieved April 2021 from https://www.aph.org/product/tactile-town-3-d-om-kit/",
      "doi": ""
    },
    {
      "text": "Batya Friedman, P. H. Kahn, and Alan Borning. 2006. Value Sensitive Design and Information Systems. Sharpe, Armonk, N.Y, 348–372.",
      "doi": ""
    },
    {
      "text": "James J. Gibson. 1962. Observations on active touch. Psychological Review 69, 6 (1962), 477–491.",
      "doi": ""
    },
    {
      "text": "Stéphanie Giraud, Anke M Brock, Marc J-M Macé, and Christophe Jouffrais. 2017. Map Learning with a 3D Printed Interactive Small-Scale Model: Improvement of Space and Text Memorization in Visually Impaired Students. Frontiers in Psychology 8, 930 (2017), 1–10. https://doi.org/10.3389/fpsyg.2017.00930",
      "doi": ""
    },
    {
      "text": "Stéphanie Giraud and Christophe Jouffrais. 2016. Empowering Low-Vision Rehabilitation Professionals with “Do-It-Yourself” Methods. In ICCHP: International Conference on Computers Helping People with Special Needs, Klaus Miesenberger, Christian Bühler, and Petr Penaz (Eds.). Vol. Part II. Springer International, Switzerland, 61–68. https://doi.org/10.1007/978-3-319-41267-2_9",
      "doi": ""
    },
    {
      "text": "Jaume Gual, Marina Puyuelo, and Joaquim Lloveras. 2011. Universal Design & Visual Impairment: Tactile Products for Heritage Access. In International Conference on Engineering Design (ICED11), Vol. 5. The Design Society, Scotland, 155–164.",
      "doi": ""
    },
    {
      "text": "Jaume Gual, Marina Puyuelo, and Joaquim Lloveras. 2014. Three-dimensional tactile symbols produced by 3D Printing: Improving the process of memorizing a tactile map key. British Journal of Visual Impairment 32, 3 (2014), 263–278.",
      "doi": ""
    },
    {
      "text": "Timo Götzelmann. 2016. LucentMaps: 3D Printed Audiovisual Tactile Maps for Blind and Visually Impaired People. In ACM SIGACCESS Conference on Computers and Accessibility (ASSETS’16). ACM, New York, NY, USA, 81–90. https://doi.org/10.1145/2982142.2982163",
      "doi": "10.1145/2982142.2982163"
    },
    {
      "text": "Timo Götzelmann and Alexsander Pavkovic. 2014. Towards Automatically Generated Tactile Detail Maps by 3D Printers for Blind Persons. In ICCHP: International Conference on Computers Helping People with Special Needs, Klaus Miesenberger, Deborah Fels, Dominique Archambault, Petr Peňáz, and Wolfgang L. Zagler (Eds.). Vol. Part II. Springer International, Switzerland, 1–8.",
      "doi": ""
    },
    {
      "text": "Nicolai Brodersen Hansen, Christian Dindler, Kim Halskov, Ole Sejer Iversen, Claus Bossen, Ditte Amund Basballe, and Ben Schouten. 2019. How Participatory Design Works: Mechanisms and Effects. In OZCHI’19: Proceedings of the 31st Australian Conference on Human-Computer-Interaction. ACM, New York, NY, USA, 30–41. https://doi.org/10.1145/3369457.3369460",
      "doi": ""
    },
    {
      "text": "Eric Hasper, Rogier Windhorst, Terri Hedgpeth, Leanne Van Tuyl, Ashleigh Gonzales, Britta Martinez, Hongyu Yu, Zolton Farkas, and Debra P. Baluch. 2015. Methods for Creating and Evaluating 3D Tactile Images to Teach STEM Courses to the Visually Impaired. Journal of College Science Teaching 44, 6 (2015), 92–99. https://doi.org/10.2505/4/jcst15_044_06_92",
      "doi": ""
    },
    {
      "text": "Morton A. Heller. 2002. Tactile picture perception in sighted and blind people. Behavioural Brain Research 135, 1-2 (2002), 65–68.",
      "doi": ""
    },
    {
      "text": "Megan Hofmann, Devva Kasnitz, Jennifer Mankoff, and Cynthia Bennett. 2020. Living Disability Theory: Reflections on Access, Research, and Design. In ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’20). ACM, New York, NY, USA, 13 pages.",
      "doi": "10.1145/3373625.3416996"
    },
    {
      "text": "Leona Holloway, Kim Marriott, and Matthew Butler. 2018. Accessible maps for the blind: Comparing 3D printed models with tactile graphics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, Vol. 198. ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173772",
      "doi": "10.1145/3173574.3173772"
    },
    {
      "text": "Karen Koehler. 2017. Examining the Conceptual Understandings of Geoscience Concepts of Students with Visual Impairments: Implications of 3-D Printing. Thesis. The Ohio State University.",
      "doi": ""
    },
    {
      "text": "Michael A. Kolitsky. 2016. 3D printing makes virtual world more real for blind learners. e-mentor 1, 63 (2016), 65–70. https://doi.org/10.15219/em63.1222",
      "doi": ""
    },
    {
      "text": "D. R. Major. 1898. Cutaneous Perception of Form. American Journal of Psychology 10, 1 (1898), 143–147. https://www.jstor.org/stable/1412680",
      "doi": ""
    },
    {
      "text": "Don McCallum, Simon Ungar, and Sandra Jehoel. 2006. An evaluation of tactile directional symbols. British Journal of Visual Impairment 24, 2 (2006), 83–92. https://doi.org/10.1177/0264619606063406",
      "doi": ""
    },
    {
      "text": "Michael J. Muller and Sarah Kuhn. 1993. Participatory Design. Publications of the ACM June (1993), 24–28. https://doi.org/10.1145/153571.255960",
      "doi": ""
    },
    {
      "text": "Braille Authority of North America (BANA). 2010. Guidelines and Standards for Tactile Graphics. The Braille Authority of North America, USA. http://www.brailleauthority.org/tg/",
      "doi": ""
    },
    {
      "text": "S. L. Recchia. 1997. Play and Concept Development in Infants and Young Children with Severe Visual Impairments: A Constructionist View. Journal of Visual Impairment & Blindness 91, 4 (1997), 401–406. https://doi.org/10.1177/0145482X9709100408",
      "doi": ""
    },
    {
      "text": "Audrey C. Rule. 2011. Tactile Earth and Space Science Materials for Students with Visual Impairments: Contours, Craters, Asteroids, and Features of Mars.Journal of Geoscience Education 59, 4 (2011), 205–218. https://doi.org/10.5408/1.3651404",
      "doi": ""
    },
    {
      "text": "Wendy Sapp. 2017. Concept Development. AFB Press, American Foundation for the Blind, New York, NY, USA, Book section 2.",
      "doi": ""
    },
    {
      "text": "Douglas Schuler and Aki Namioka (Eds.). 1993. Participatory Design: Principles and Practices. Lawrence Erlbaum Associates, Hillsdale, New Jersey.",
      "doi": "10.5555/563076"
    },
    {
      "text": "Mathieu Simmonet, Serge Morvan, Dominique Marques, Olivier Ducruix, Arnaud Grancher, and Sylvie Kerouedan. 2018. Maritime Buoyage on 3D-Printed Tactile Maps. In SIGACCESS Conference on Computers and Accessibility. ACM, New York, NY, USA, 450–452. https://doi.org/10.1145/3234695.3241007",
      "doi": "10.1145/3234695.3241007"
    },
    {
      "text": "Tactilise. 2015. Citybox by Tactilise. Retrieved August 2020 from https://www.youtube.com/watch?v=_RA5skGp8Gc",
      "doi": ""
    },
    {
      "text": "Brandon Taylor, Anind K. Dey, Dan Siewiorek, and Asim Smailagic. 2016. Customizable 3D Printed Tactile Maps as Interactive Overlays. In ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’16). ACM, New York, NY, USA, 71–79. https://doi.org/10.1145/2982142.2982167",
      "doi": "10.1145/2982142.2982167"
    },
    {
      "text": "Catherine Thinus-Blanc and Florence Gaunet. 1997. Representation of Space in Blind Persons: Vision as a Spatial Sense?Psychological Bulletin 12, 1 (1997), 20–42.",
      "doi": ""
    },
    {
      "text": "Guillaume Touya, Sidonie Christophe, Jean-Marie Favreau, and Amine Ben Rhaiem. 2018. Automatic derivation of on-demand tactile maps for visually impaired people: first experiments and research agenda. International Journal of Cartography 5, 1 (2018), 67–91. https://doi.org/10.1080/23729333.2018.1486784",
      "doi": ""
    },
    {
      "text": "Bettina Törpel. 2005. Participatory design: a multi-voiced effort. In CC ’05: The 4th Decennial Conference on Critical Computing: Between Sense and Sensibility. ACM, New York, NY, USA, 177–181. https://doi.org/10.1145/1094562.1094593",
      "doi": "10.1145/1094562.1094593"
    },
    {
      "text": "Raša Urbas, Matej Pivar, and Urška Stankovic Elesini. 2016. Development of tactile floor plan for the blind and the visually impaired by 3D printing technique. Journal of Graphic Engineering and Design 7, 1 (2016), 19–26. https://doi.org/10.24867/JGED-2016-1-019",
      "doi": ""
    },
    {
      "text": "William R. Wiener, Richard L. Welsh, and Bruce Blasch (Eds.). 2010. Foundations of Orientation and Mobility Volume 1: History and Theory (Third Edition). American Printing House for the Blind, Louisville, Kentucky, USA.",
      "doi": ""
    },
    {
      "text": "Greg J. Williams, Ting Zhang, Alexander Lo, Ashleigh Gonzales, Debra Page Baluch, and Bradley S. Duerstock. 2014. 3D printing tactile graphics for the blind: Application to histology. In Annual Rehabilitation Engineering Society of North America Conference 2014 (RESNA). RESNA, Arlington, VA, USA, 4 pages.",
      "doi": ""
    },
    {
      "text": "Suzette Wright. 2008. Guide to Designing Tactual Illustrations for Children’s Books. Louisville, Kentucky.",
      "doi": ""
    },
    {
      "text": "Michael J. Zigler and Rebecca Barrett. 1927. A further contribution to the Tactual Perception of Form. Journal of Experimental Pscyhology 10, 2 (1927), 184–192. https://doi.org/10.1037/h0074982",
      "doi": ""
    },
    {
      "text": "I. Zweibelson and C. Fisher Barg. 1967. Concept development of blind children. Journal of Visual Impairment & Blindness 61, 7 (1967), 218–222. https://doi.org/10.1177/0145482X6706100703",
      "doi": ""
    }
  ]
}