{
  "doi": "10.1145/3491102.3517480",
  "title": "I Don't Usually Listen, I Read: How Different Learner Groups Process Game Feedback",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Andrea Gauthier",
      "institution": "UCL Knowledge Lab, Dept. Culture, Communication and Media, Institute of Education, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658756827",
      "orcid": "missing"
    },
    {
      "name": "Laura Benton",
      "institution": "UCL Knowledge Lab, University College London, United Kingdom",
      "img": "/do/10.1145/contrib-81484651103/rel-imgonly/profilepic_small.jpg",
      "acmid": "81484651103",
      "orcid": "missing"
    },
    {
      "name": "Leona Bunting",
      "institution": "Department of Applied IT, University of Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366446",
      "orcid": "missing"
    },
    {
      "name": "Elisabeth Herbert",
      "institution": "Psychology and Human Development, UCL, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237121",
      "orcid": "missing"
    },
    {
      "name": "Emma Sumner",
      "institution": "Psychology and Human Development, UCL, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235736",
      "orcid": "missing"
    },
    {
      "name": "Manolis Mavrikis",
      "institution": "UCL Knowledge Lab, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350578301",
      "orcid": "missing"
    },
    {
      "name": "Andrea Revesz",
      "institution": "University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366890",
      "orcid": "missing"
    },
    {
      "name": "Asimina Vasalou",
      "institution": "UCL Knowledge Lab, University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311485195",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "[1] Aleven, V. 2016. Developing a Teacher Dashboard For Use with Intelligent Tutoring Systems. Proceedings of the 4th International Workshop on Teaching Analytics (Lyon, France, 2016), 44–50.",
      "doi": ""
    },
    {
      "text": "[2] Attali, Y. and van der Kleij, F. 2017. Effects of feedback elaboration and feedback timing during computer-based practice in mathematics problem solving. Computers and Education. 110, (2017), 154–169. DOI:https://doi.org/10.1016/j.compedu.2017.03.012.",
      "doi": ""
    },
    {
      "text": "[3] Baek, Y.K. 2008. What hinders teachers in using computer and video games in the classroom? Exploring factors inhibiting the uptake of computer and video games. Cyberpsychology and Behavior. 11, 6 (2008), 665–671. DOI:https://doi.org/10.1089/cpb.2008.0127.",
      "doi": ""
    },
    {
      "text": "[4] Bangert-Drowns, R.L. 1991. The Instructional Effect of Feedback in Test-Like Events. Review of Educational Research. 61, 2 (1991), 213–238. DOI:https://doi.org/10.3102/00346543061002213.",
      "doi": ""
    },
    {
      "text": "[5] Bares, C.B. 2011. Emerging Metacognitive Processes During Childhood: Implications for Intervention Development with Children. Child and Adolescent Social Work Journal. 28, 4 (2011), 291–299. DOI:https://doi.org/10.1007/s10560-011-0233-1.",
      "doi": ""
    },
    {
      "text": "[6] Beasley, T.M. and Schumacker, R.E. 1995. Multiple Regression Approach to Analyzing Contingency Tables: Post Hoc and Planned Comparison Procedures. Journal of Experimental Education. 64, August (1995), 79–93. DOI:https://doi.org/10.1080/00220973.1995.9943797.",
      "doi": ""
    },
    {
      "text": "[7] Benton, L. 2018. A critical examination of feedback in early reading games. CHI Conference on Human Factors in Computing Systems - Proceedings. 2018-April, (2018). DOI:https://doi.org/10.1145/3173574.3173947.",
      "doi": "10.1145/3173574.3173947"
    },
    {
      "text": "[8] Benton, L. 2021. Designing for “challenge” in a large-scale adaptive literacy game for primary school children. British Journal of Educational Technology. 52, 5 (2021), 1862–1880. DOI:https://doi.org/10.1111/bjet.13146.",
      "doi": ""
    },
    {
      "text": "[9] Benton, L. 2019. What's Missing: The Role of Instructional Design in Children's Games-Based Learning. CHI Conference on Human Factors in Computing Systems Proceedings (CHI 2019) (Glasgow, Scotland, May 2019), 11-undefined.",
      "doi": "10.1145/3290605.3300812"
    },
    {
      "text": "[10] Bias, R. 2012. Usability/User-Centered Design in the iSchools: Justifying a Teaching Philosophy. Journal of Education for Library and Information Science. 53, 4 (2012), 274–289.",
      "doi": ""
    },
    {
      "text": "[11] Billingsky, P.A. 1993. Reflections on ISO 9241: Software usability may be more than the sum of its parts. StandardView. 1, 1 (1993), 22–25.",
      "doi": "10.1145/174683.174686"
    },
    {
      "text": "[12] Boden, C. and Giaschi, D. 2007. M-stream deficits and reading-related visual processes in developmental dyslexia. Psychological Bulletin. 133, 2 (2007), 346–366. DOI:https://doi.org/10.1037/0033-2909.133.2.346.",
      "doi": ""
    },
    {
      "text": "[13] Bosse, M.L. and Valdois, S. 2009. Influence of the visual attention span on child reading performance: A cross-sectional study. Journal of Research in Reading. 32, 2 (2009), 230–253. DOI:https://doi.org/10.1111/j.1467-9817.2008.01387.x.",
      "doi": ""
    },
    {
      "text": "[14] Butler, D.L. and Winne, P.H. 1995. Feedback and Self-Regulated Learning: A Theoretical Synthesis. Review of Educational Research. 65, 3 (1995), 245–281. DOI:https://doi.org/10.3102/00346543065003245.",
      "doi": ""
    },
    {
      "text": "[15] Callaghan, M.N. and Reich, S.M. 2021. Mobile app features that scaffold pre-school learning: Verbal feedback and leveling designs. British Journal of Educational Technology. 52, 2 (2021), 785–806. DOI:https://doi.org/10.1111/bjet.13055.",
      "doi": ""
    },
    {
      "text": "[16] Carroll, S.E. 1995. The irrelevance of verbal feedback to language learning. The Current State of Interlanguage: Studies in Honor of William E. Rutherford. L. Eubank , eds. John Benjamins Publishings. 73–88.",
      "doi": ""
    },
    {
      "text": "[17] Carvalho, M.B. 2015. An activity theory-based model for serious games analysis and conceptual design. Computers and Education. 87, (2015), 166–181. DOI:https://doi.org/10.1016/j.compedu.2015.03.023.",
      "doi": "10.1016/j.compedu.2015.03.023"
    },
    {
      "text": "[18] Chabani, E. and Hommel, B. 2014. Effectiveness of visual and verbal prompts in training visuospatial processing skills in school age children. Instructional Science. 42, 6 (2014), 995–1012. DOI:https://doi.org/10.1007/s11251-014-9316-7.",
      "doi": ""
    },
    {
      "text": "[19] Chun, M.M. 2011. A Taxonomy of external and internal attention. Annual Review of Psychology. 62, (2011), 73–101. DOI:https://doi.org/10.1146/annurev.psych.093008.100427.",
      "doi": ""
    },
    {
      "text": "[20] Clark, D.B. 2016. Digital Games, Design, and Learning: A Systematic Review and Meta-Analysis. Review of Educational Research. 86, 1 (2016), 79–122. DOI:https://doi.org/10.3102/0034654315582065.",
      "doi": ""
    },
    {
      "text": "[21] Cohen, J. 1988. Statistical power analysis for the behavioral sciences. Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "[22] Department for Education and Department for Health 2015. Special educational needs and disability code of practice: 0 to 25 years.",
      "doi": ""
    },
    {
      "text": "[23] Dunwell, I. 2011. Four-dimensional consideration of feedback in serious games. Digital Games and Learning. (2011), 42–62. DOI:https://doi.org/978-1-4411-9870-9.",
      "doi": ""
    },
    {
      "text": "[24] Dye, M.W.G. and Bavelier, D. 2010. Differential development of visual attention skills in school-age children. Vision Research. 50, 4 (2010), 452–459. DOI:https://doi.org/10.1016/j.visres.2009.10.010.",
      "doi": ""
    },
    {
      "text": "[25] Edele, A. and Stanat, P. 2016. The Role of First-Language Listening Comprehension in Second-Language Reading Comprehension. Journal of Educational Psychology. 108, 2 (2016), 163–180.",
      "doi": ""
    },
    {
      "text": "[26] Egi, T. 2010. Uptake, modified output, and learner perceptions of recasts: Learner responses as language awareness. Modern Language Journal. 94, 1 (2010), 1–21. DOI:https://doi.org/10.1111/j.1540-4781.2009.00980.x.",
      "doi": ""
    },
    {
      "text": "[27] van Es, E.A. and Sherin, M.G. 2002. Learning to Notice: Scaffolding New Teachers ’ Interpretations of Classroom Interactions. Journal of technology and teacher education. 10, April 2014 (2002), 571–596.",
      "doi": ""
    },
    {
      "text": "[28] Facoetti, A. 2006. The relationship between visuo-spatial attention and nonword reading in developmental dyslexia. Cognitive Neuropsychology. 23, 6 (2006), 841–855. DOI:https://doi.org/10.1080/02643290500483090.",
      "doi": ""
    },
    {
      "text": "[29] Falloon, G. 2013. Young students using iPads: App design and content influences on their learning pathways. Computers and Education. 68, (2013), 505–521. DOI:https://doi.org/10.1016/j.compedu.2013.06.006.",
      "doi": ""
    },
    {
      "text": "[30] Fan, J.E. and Turk-Browne, N.B. 2016. Incidental biasing of attention from visual long-term memory. Journal of Experimental Psychology: Learning Memory and Cognition. 42, 6 (2016), 970–977. DOI:https://doi.org/10.1037/xlm0000209.",
      "doi": ""
    },
    {
      "text": "[31] Field, J. 2013. Cognitive validity. Examining Listening: Research and Practice in Assessing Second Language Listening. A. Geranpaye and L. Taylor, eds. Cambridge University Press. 77–151.",
      "doi": ""
    },
    {
      "text": "[32] García-Pérez, M.A. and Núñez-Antón, V.V. 2003. Cellwise Residual Analysis in Two-Way Contingency Tables. Educational and Psychological Measurement. 63, 5 (2003), 825–839. DOI:https://doi.org/10.1177/0013164403251280.",
      "doi": ""
    },
    {
      "text": "[33] Gass, S.M. 2017. Salience in second language acquisition and related fields. Salience in second language acquisition. S.M. Gass , eds. Routledge. 1–18.",
      "doi": ""
    },
    {
      "text": "[34] Gauthier, A. 2022. Adoption and usage challenges of a Learning Analytics Dashboard for game-based learning: design and implementation implications. Companion Proceedings 12th International Conference on Learning Analytics & Knowledge (LAK22) (2022), 1–4.",
      "doi": ""
    },
    {
      "text": "[35] Gauthier, A. 2022. Manipulating interface design features affects children’ s stop-and-think behaviours in a counterintuitive-problem game. Transactions on Computer-Human Interaction. 29, 2 (2022), in press. DOI:https://doi.org/http://dx.doi.org/10.1145/3485168.",
      "doi": "10.1145/3485168"
    },
    {
      "text": "[36] Gauthier, A. and Jenkinson, J. 2018. Designing productively negative experiences with serious game mechanics: Qualitative analysis of game-play and game design in a randomized trial. Computers & Education. 127, 2018 (2018), 66–89. DOI:https://doi.org/10.1016/j.compedu.2018.08.017.",
      "doi": ""
    },
    {
      "text": "[37] Gombert, J.E. 1992. Metalinguistic development. Harvester-Wheatsheaf.",
      "doi": ""
    },
    {
      "text": "[38] Grawemeyer, B. 2015. Light-Bulb Moment? Towards Adaptive Presentation of Feedback based on Students’ Affective State. Proceedings of the 20th International Conference on Intelligent User Interfaces (Atlanta, GA, 2015), 400–404.",
      "doi": "10.1145/2678025.2701377"
    },
    {
      "text": "[39] Hattie, J. and Gan, M. 2015. Instruction Based on Feedback. Handbook of Research on Learning and Instruction. 11237 (2015). DOI:https://doi.org/10.4324/9780203839089.ch13.",
      "doi": ""
    },
    {
      "text": "[40] Hattie, J. and Timperley, H. 2007. The power of feedback. Review of Educational Research. 77, 1 (2007), 81–112. DOI:https://doi.org/10.3102/003465430298487.",
      "doi": ""
    },
    {
      "text": "[41] Hayes, A.F. and Krippendorff, K. 2007. Answering the call for a standard reliability measure for coding data. Communication Methods and Measures. 1, (2007), 77–89.",
      "doi": ""
    },
    {
      "text": "[42] Hitch, G.J. 1989. Visual and phonological components of working memory in children. Memory & Cognition. 17, 2 (1989), 175–185. DOI:https://doi.org/10.3758/BF03197067.",
      "doi": ""
    },
    {
      "text": "[43] Holmes, W. 2011. Using game-based learning to support struggling readers at home. Learning, Media and Technology. 36, 1 (2011), 5–19. DOI:https://doi.org/10.1080/17439884.2010.531023.",
      "doi": ""
    },
    {
      "text": "[44] Iacovides, I. 2014. Player strategies: Achieving breakthroughs and progressing in single-player and cooperative games. CHI PLAY 2014 - Proceedings of the 2014 Annual Symposium on Computer-Human Interaction in Play. (2014), 131–140. DOI:https://doi.org/10.1145/2658537.2658697.",
      "doi": "10.1145/2658537.2658697"
    },
    {
      "text": "[45] IBM Corporation 2016. SPSS Statistics. IBM Corporation.",
      "doi": ""
    },
    {
      "text": "[46] Johnson, C.I. 2017. Designing Effective Feedback Messages in Serious Games and Simulations: A Research Review. Instructional Techniques to Facilitate Learning and Motivation of Serious Games. P. Wouters and H. van Oostendorp, eds. Springer International Publishing Switzerland.",
      "doi": ""
    },
    {
      "text": "[47] Johnson, C.I. 2017. Designing Effective Feedback Messages in Serious Games and Simulations: A Research Review. Instructional Techniques to Facilitate Learning and Motivation of Serious Games. P. Wouters and H. van Oostendorp, eds. Springer. 119–140.",
      "doi": ""
    },
    {
      "text": "[48] Ke, F. 2016. Designing and integrating purposeful learning in game play: a systematic review. Educational Technology Research and Development. 64, 2 (2016), 219–244. DOI:https://doi.org/10.1007/s11423-015-9418-1.",
      "doi": ""
    },
    {
      "text": "[49] Ke, F. 2019. Interdisciplinary Design of Game-based Learning Platforms. Springer.",
      "doi": ""
    },
    {
      "text": "[50] Van Kesteren, U.E.H. 2003. Assessing usability evaluation methods on their effectiveness to elicit verbal comments from children subjects. Proceedings of the 2003 Conference on Interaction Design and Children, IDC 2003. January (2003), 41–49. DOI:https://doi.org/10.1145/953536.953544.",
      "doi": "10.1145/953536.953544"
    },
    {
      "text": "[51] Van Der Kleij, F.M. 2012. Effects of feedback in a computer-based assessment for learning. Computers and Education. 58, 1 (2012), 263–272. DOI:https://doi.org/10.1016/j.compedu.2011.07.020.",
      "doi": "10.1016/j.compedu.2011.07.020"
    },
    {
      "text": "[52] Kulhavy, R.W. 1985. Feedback complexity and corrective efficiency. Contemporary Educational Psychology. 10, 3 (1985), 285–291. DOI:https://doi.org/10.1016/0361-476X(85)90025-6.",
      "doi": ""
    },
    {
      "text": "[53] Lee, M. and Révész, A. 2020. Promoting grammatical development through captions and textual enhancement in multimodal input-based tasks. Studies in Second Language Acquisition. 42, 3 (2020), 625–651. DOI:https://doi.org/10.1017/S0272263120000108.",
      "doi": ""
    },
    {
      "text": "[54] Long, D.R. 1990. What you don't know can't help you: An exploratory study of background knowledge ad second language listening comprehension. Studies in Second Language Acquisition. 12, 1 (1990), 65–80.",
      "doi": ""
    },
    {
      "text": "[55] Mavrikis, M. 2019. Intelligent analysis and data visualisation for teacher assistance tools: The case of exploratory learning. British Journal of Educational Technology. 50, 6 (2019), 2920–2942. DOI:https://doi.org/10.1111/bjet.12876.",
      "doi": ""
    },
    {
      "text": "[56] Mayer, R.E. and Moreno, R. 2003. Nine ways to reduce cognitive load in multimedia learning. Educational Psychologist. 38, 1 (2003), 43–52. DOI:https://doi.org/10.1207/S15326985EP3801_6.",
      "doi": ""
    },
    {
      "text": "[57] Mayer, R.E. and Pilegard, C. 2014. Principles for Managing Essential Processing in Multimedia Learning: Segmenting, Pre-training, and Modality Principles. The Cambridge Handbook of Multimedia Learning. R.E. Mayer, ed. Cambridge University Press. 316–344.",
      "doi": ""
    },
    {
      "text": "[58] McLaren, B.M. and Nguyen, H. 2021. AIED Digital Learning Games: Where We Are and How We Might Make a Bigger Impact. Handbook of Artificial Intelligence in Education. B. Boulay , eds.",
      "doi": ""
    },
    {
      "text": "[59] Narciss, S. 2014. Exploring feedback and student characteristics relevant for personalizing feedback strategies. Computers and Education. 71, (2014), 56–76. DOI:https://doi.org/10.1016/j.compedu.2013.09.011.",
      "doi": "10.1016/j.compedu.2013.09.011"
    },
    {
      "text": "[60] Nelson, H.G. and Stolterman, E. 2003. The Design Way: Intentional Change in an Unpredictable World. Educational Technology Publications.",
      "doi": ""
    },
    {
      "text": "[61] Nikolayev, M. 2021. Review of feedback in edutainment games for preschoolers in the USA. Journal of Children and Media. 15, 3 (2021), 358–375. DOI:https://doi.org/10.1080/17482798.2020.1815227.",
      "doi": ""
    },
    {
      "text": "[62] Papleontiou-Louca, E. 2003. The concept and instruction of metacognition. Teacher Development. 7, 1 (2003), 9–30. DOI:https://doi.org/10.1080/13664530300200184.",
      "doi": ""
    },
    {
      "text": "[63] Phye, G.D. and Bender, T. 1989. Feedback complexity and practice: Response pattern analysis in retention and transfer. Contemporary Educational Psychology. 14, 2 (1989), 97–110. DOI:https://doi.org/10.1016/0361-476X(89)90028-3.",
      "doi": ""
    },
    {
      "text": "[64] Plass, J.L. 2003. Cognitive load in reading a foreign language text with multimedia aids and the influence of verbal and spatial abilities. Computers in Human Behavior. 19, 2 (2003), 221–243. DOI:https://doi.org/10.1016/S0747-5632(02)00015-8.",
      "doi": ""
    },
    {
      "text": "[65] Proulx, J.-N. 2017. Learning Mechanics and Game Mechanics Under the Perspective of Self-Determination Theory to Foster Motivation in Digital Game Based Learning. Simulation & Gaming. 48, 1 (2017), 81–97. DOI:https://doi.org/10.1177/1046878116674399.",
      "doi": "10.1177/1046878116674399"
    },
    {
      "text": "[66] Quigley, A. 2018. Metacognition and Self-regulated Learning: Guidance Report.",
      "doi": ""
    },
    {
      "text": "[67] Révész, A. 2022. Using eye-tracking as a tool to develop L2 lexical knowledge. Language Learning and Technology. (2022), 1–47.",
      "doi": ""
    },
    {
      "text": "[68] Ringbom, H. and Jarvis, S. 2009. The Importance of Cross-Linguistic Similarity in Foreign Language Learning. The Handbook of Language Teaching. M.H. Long and C.J. Doughty, eds. Wiley-Blackwell. 106–118.",
      "doi": ""
    },
    {
      "text": "[69] Rose, J. 2009. Identifying and Teaching Children and Young People with Dyslexia and Literacy Difficulties.",
      "doi": ""
    },
    {
      "text": "[70] Roy, P. 2019. Stop and Think: Learning Counterintuitive Concepts.",
      "doi": ""
    },
    {
      "text": "[71] Schmidt 2001. Attention. Cognition and second language instruction. P. Robinson, ed. Cambridge University Press. 3–32.",
      "doi": ""
    },
    {
      "text": "[72] Schmidt, R. 2010. Attention, Awareness, and Individual Differences in Language Learning. Proceedings of CLaSIC 2010. 4, (2010), 721–737.",
      "doi": ""
    },
    {
      "text": "[73] Schmidt, R. 1994. Deconstructing consciousness in search of useful definitions for applied linguistics. Consciousness in second language learning. J.H. Hulstijn and R. Schmidt, eds. 11–26.",
      "doi": ""
    },
    {
      "text": "[74] Schneider, E. and Crombie, M. 2003. Dyslexia and foreign language learning. David Fulton Publishers.",
      "doi": ""
    },
    {
      "text": "[75] Shute, V.J. 2008. Focus on formative feedback. Review of Educational Research. 78, 1 (2008), 153–189. DOI:https://doi.org/10.3102/0034654307313795.",
      "doi": ""
    },
    {
      "text": "[76] Snowling, M.J. 2020. Defining and understanding dyslexia: past, present and future. Oxford Review of Education. 46, 4 (2020), 501–513. DOI:https://doi.org/10.1080/03054985.2020.1765756.",
      "doi": ""
    },
    {
      "text": "[77] Takita, T. 2017. Reading Aloud Training Game for Children with Auto Evaluation of Oral Reading Fluency. Proceedings of International Conference on Entertainment Computing (Tsukuba City, Japan, 2017), 404–408.",
      "doi": "10.1007/978-3-319-66715-7_50"
    },
    {
      "text": "[78] Vasalou, A. 2017. Digital games-based learning for children with dyslexia: A social constructivist perspective on engagement and learning during group game-play. Computers and Education. 114, December (2017), 175–192. DOI:https://doi.org/10.1016/j.compedu.2017.06.009.",
      "doi": "10.1016/j.compedu.2017.06.009"
    },
    {
      "text": "[79] Vasalou, A. 2021. Do children with reading difficulties benefit from instructional game supports? Exploring children's attention and understanding of feedback. British Journal of Educational Technology. June (2021), 1–15. DOI:https://doi.org/10.1111/bjet.13145.",
      "doi": ""
    },
    {
      "text": "[80] Wang, F. and Hannafin, M.J. 2005. Design-Based Research and Technology-Enhanced Learning Environments. Educational Technology Research and Development. 53, 4 (2005), 5–23.",
      "doi": ""
    },
    {
      "text": "[81] Wilkinson, H.R. 2019. Domain-Specific Inhibitory Control Training to Improve Children's Learning of Counterintuitive Concepts in Mathematics and Science. Journal of Cognitive Enhancement. 4, (2019), 296–314. DOI:https://doi.org/https://doi.org/10.1007/s41465-019-00161-4.",
      "doi": ""
    }
  ]
}