{
  "doi": "10.1145/3491102.3502028",
  "title": "OtherTube: Facilitating Content Discovery and Reflection by Exchanging YouTube Recommendations with Strangers",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "To promote engagement, recommendation algorithms on platforms like YouTube increasingly personalize users’ feeds, limiting users’ exposure to diverse content and depriving them of opportunities to reflect on their interests compared to others’. In this work, we investigate how exchanging recommendations with strangers can help users discover new content and reflect. We tested this idea by developing OtherTube—a browser extension for YouTube that displays strangers’ personalized YouTube recommendations. OtherTube allows users to (i) create an anonymized profile for social comparison, (ii) share their recommended videos with others, and (iii) browse strangers’ YouTube recommendations. We conducted a 10-day-long user study (n = 41) followed by a post-study interview (n = 11). Our results reveal that users discovered and developed new interests from seeing OtherTube recommendations. We identified user and content characteristics that affect interaction and engagement with exchanged recommendations; for example, younger users interacted more with OtherTube, while the perceived irrelevance of some content discouraged users from watching certain videos. Users reflected on their interests as well as others’, recognizing similarities and differences. Our work shows promise for designs leveraging the exchange of personalized recommendations with strangers.",
  "tags": [
    "Content Discovery",
    "Social Comparison",
    "YouTube",
    "Recommender System",
    "Self-Reflection",
    "Filter Bubble",
    "Persona"
  ],
  "authors": [
    {
      "name": "Md Momen Bhuiyan",
      "institution": "Virginia Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659321079",
      "orcid": "0000-0003-3408-9122"
    },
    {
      "name": "Carlos Augusto Bautista Isaza",
      "institution": "Virginia Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235954",
      "orcid": "missing"
    },
    {
      "name": "Tanushree Mitra",
      "institution": "University of Washington, United States",
      "img": "/do/10.1145/contrib-81553902156/rel-imgonly/tanu_sm.jpg",
      "acmid": "81553902156",
      "orcid": "0000-0002-9507-6192"
    },
    {
      "name": "Sang Won Lee",
      "institution": "Virginia Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659579861",
      "orcid": "0000-0002-1026-315X"
    }
  ],
  "references": [
    {
      "text": "Gediminas Adomavicius and YoungOk Kwon. 2009. Toward more diverse recommendations: Item re-ranking methods for recommender systems. In Workshop on Information Technologies and Systems. Citeseer.",
      "doi": ""
    },
    {
      "text": "Shahmir H Ali, Joshua Foreman, Ariadna Capasso, Abbey M Jones, Yesim Tozan, and Ralph J DiClemente. 2020. Social media as a recruitment platform for a nationwide online survey of COVID-19 knowledge, beliefs, and practices in the United States: methodology and feasibility analysis. BMC medical research methodology 20 (2020), 1–11.",
      "doi": ""
    },
    {
      "text": "Paul André, M. C. Schraefel, Alan Dix, and Ryen W. White. 2011. Expressing Well-Being Online: Towards Self-Reflection and Social Awareness. In Proceedings of the 2011 IConference (Seattle, Washington, USA) (iConference ’11). Association for Computing Machinery, New York, NY, USA, 114–121. https://doi.org/10.1145/1940761.1940777",
      "doi": "10.1145/1940761.1940777"
    },
    {
      "text": "Mitja D Back, Juliane M Stopfer, Simine Vazire, Sam Gaddis, Stefan C Schmukle, Boris Egloff, and Samuel D Gosling. 2010. Facebook profiles reflect actual personality, not self-idealization. Psychological science 21, 3 (2010), 372–374.",
      "doi": ""
    },
    {
      "text": "Jae-eul Bae, Youn-kyung Lim, Jin-bae Bang, and Myung-suk Kim. 2014. Ripening Room: Designing Social Media for Self-Reflection in Self-Expression. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 103–112. https://doi.org/10.1145/2598510.2598567",
      "doi": ""
    },
    {
      "text": "Elizabeth Bales and William Griswold. 2011. Interpersonal Informatics: Making Social Influence Visible. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI EA ’11). Association for Computing Machinery, New York, NY, USA, 2227–2232. https://doi.org/10.1145/1979742.1979924",
      "doi": "10.1145/1979742.1979924"
    },
    {
      "text": "Eric P S Baumer. 2015. Reflective informatics: conceptual dimensions for designing technologies of reflection. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Association for Computing Machinery, New York, NY, USA, 585–594.",
      "doi": "10.1145/2702123.2702234"
    },
    {
      "text": "Alessandro Bessi, Fabiana Zollo, Michela Del Vicario, Michelangelo Puliga, Antonio Scala, Guido Caldarelli, Brian Uzzi, and Walter Quattrociocchi. 2016. Users polarization on Facebook and Youtube. PloS one 11, 8 (2016), e0159641.",
      "doi": ""
    },
    {
      "text": "Md Momen Bhuiyan, Michael Horning, Sang Won Lee, and Tanushree Mitra. 2021. NudgeCred: Supporting News Credibility Assessment on Social Media Through Nudges. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–30.",
      "doi": "10.1145/3479571"
    },
    {
      "text": "Md Momen Bhuiyan, Kexin Zhang, Kelsey Vick, Michael A Horning, and Tanushree Mitra. 2018. FeedReflect: A Tool for Nudging Users to Assess News Credibility on Twitter. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. 205–208.",
      "doi": "10.1145/3272973.3274056"
    },
    {
      "text": "Taylor C Boas, Dino P Christenson, and David M Glick. 2020. Recruiting large online samples in the United States and India: Facebook, mechanical turk, and qualtrics. Political Science Research and Methods 8, 2 (2020), 232–250.",
      "doi": ""
    },
    {
      "text": "Lauren Valentino Bryant. 2020. The YouTube algorithm and the Alt-Right filter bubble. Open Information Science 4, 1 (2020), 85–90.",
      "doi": ""
    },
    {
      "text": "Laura Burbach, Patrick Halbach, Martina Ziefle, and André CaleroÂ Valdez. 2019. Bubble Trouble: Strategies Against Filter Bubbles in Online Social Networks. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 11582 LNCS (2019), 441–456. https://doi.org/10.1007/978-3-030-22219-2_33",
      "doi": ""
    },
    {
      "text": "Pablo Castells, Neil J. Hurley, and Saul Vargas. 2015. Novelty and Diversity in Recommender Systems. Springer US, Boston, MA, 881–918. https://doi.org/10.1007/978-1-4899-7637-6_26",
      "doi": ""
    },
    {
      "text": "Ying Chen, Yilu Zhou, Sencun Zhu, and Heng Xu. 2012. Detecting Offensive Language in Social Media to Protect Adolescent Online Safety. In 2012 International Conference on Privacy, Security, Risk and Trust and 2012 International Conference on Social Computing. IEEE, 71–80. https://doi.org/10.1109/SocialCom-PASSAT.2012.55",
      "doi": "10.1109/SocialCom-PASSAT.2012.55"
    },
    {
      "text": "Sheldon Ed Cohen and SI Syme. 1985. Social support and health.Academic Press.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, Katherine Everitt, Ian Smith, and James A Landay. 2006. Design requirements for technologies that encourage physical activity. In Proceedings of the SIGCHI conference on Human Factors in computing systems. Association for Computing Machinery, New York, NY, USA, 457–466.",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, and James A. Landay. 2009. Theory-Driven Design Strategies for Technologies That Support Behavior Change in Everyday Life. Association for Computing Machinery, New York, NY, USA, 405–414. https://doi.org/10.1145/1518701.1518766",
      "doi": ""
    },
    {
      "text": "Paul Covington, Jay Adams, and Emre Sargin. 2016. Deep Neural Networks for YouTube Recommendations. In Proceedings of the 10th ACM Conference on Recommender Systems (Boston, Massachusetts, USA) (RecSys ’16). Association for Computing Machinery, New York, NY, USA, 191–198. https://doi.org/10.1145/2959100.2959190",
      "doi": "10.1145/2959100.2959190"
    },
    {
      "text": "James Davidson, Benjamin Liebald, Junning Liu, Palash Nandy, and Taylor Van Vleet. 2010. The YouTube video recommendation system. RecSys’10 - Proceedings of the 4th ACM Conference on Recommender Systems (2010), 293–296. https://doi.org/10.1145/1864708.1864770",
      "doi": "10.1145/1864708.1864770"
    },
    {
      "text": "Munmun De Choudhury, Michael Gamon, Aaron Hoff, and Asta Roseway. 2013. “Moon Phrases”: A social media faciliated tool for emotional reflection and wellness. In 2013 7th International Conference on Pervasive Computing Technologies for Healthcare and Workshops. IEEE, European Alliance for Innovation, 41–44.",
      "doi": "10.4108/icst.pervasivehealth.2013.252106"
    },
    {
      "text": "Alan Dix. 1994. Computer supported cooperative work: a framework. In Design issues in CSCW. Springer, 9–26.",
      "doi": ""
    },
    {
      "text": "Abraham Doris-Down, Husayn Versee, and Eric Gilbert. 2013. Political blend: an application designed to bring people together based on political differences. In Proceedings of the 6th International Conference on Communities and Technologies. Association for Computing Machinery, New York, NY, USA, 120–130.",
      "doi": "10.1145/2482991.2483002"
    },
    {
      "text": "Daniel A Epstein, An Ping, James Fogarty, and Sean A Munson. 2015. A lived informatics model of personal informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. Association for Computing Machinery, New York, NY, USA, 731–742.",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Motahhare Eslami, Amirhossein Aleyasen, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015. Feedvis: A path for exploring news feed curation algorithms. In Proceedings of the 18th acm conference companion on computer supported cooperative work & social computing. Association for Computing Machinery, New York, NY, USA, 65–68.",
      "doi": "10.1145/2685553.2702690"
    },
    {
      "text": "Motahhare Eslami, Aimee Rickman, Kristen Vaccaro, Amirhossein Aleyasen, Andy Vuong, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015. ” I always assumed that I wasn’t really that close to [her]” Reasoning about Invisible Algorithms in News Feeds. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 153–162.",
      "doi": ""
    },
    {
      "text": "Haiyan Fan and Marshall Scott Poole. 2006. What is personalization? Perspectives on the design and implementation of personalization in information systems. Journal of Organizational Computing and Electronic Commerce 16, 3-4(2006), 179–202.",
      "doi": ""
    },
    {
      "text": "Leon Festinger. 1954. A theory of social comparison processes. Human relations 7, 2 (1954), 117–140.",
      "doi": ""
    },
    {
      "text": "Clayton Feustel, Shyamak Aggarwal, Bongshin Lee, and Lauren Wilcox. 2018. People like me: Designing for reflection on aggregate cohort data in personal informatics systems. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 3 (2018), 1–21.",
      "doi": "10.1145/3264917"
    },
    {
      "text": "Feng Gao. 2012. Design for reflection on health behavior change. In Proceedings of the 2012 ACM international conference on Intelligent User Interfaces. Association for Computing Machinery, New York, NY, USA, 379–382.",
      "doi": "10.1145/2166966.2167053"
    },
    {
      "text": "Andrew Garbett, David Chatting, Gerard Wilkinson, Clement Lee, and Ahmed Kharrufa. 2018. ThinkActive: Designing for Pseudonymous Activity Tracking in the Classroom. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173581",
      "doi": ""
    },
    {
      "text": "Brittany Gentile, Jean M Twenge, Elise C Freeman, and W Keith Campbell. 2012. The effect of social networking websites on positive self-views: An experimental investigation. Computers in human behavior 28, 5 (2012), 1929–1933.",
      "doi": ""
    },
    {
      "text": "Dave Gershgorn. 2019. How Spotify’s Algorithm Knows Exactly What You Want to Listen To | by Dave Gershgorn | OneZero. https://onezero.medium.com/how-spotifys-algorithm-knows-exactly-what-you-want-to-listen-to-4b6991462c5c. (Accessed on 09/09/2021).",
      "doi": ""
    },
    {
      "text": "Nabeel Gillani, Ann Yuan, Martin Saveski, Soroush Vosoughi, and Deb Roy. 2018. Me, my echo chamber, and i: Introspection on social media polarization. The Web Conference 2018 - Proceedings of the World Wide Web Conference, WWW 2018 (2018), 823–831. https://doi.org/10.1145/3178876.3186130 arxiv:1803.01731",
      "doi": "10.1145/3178876.3186130"
    },
    {
      "text": "Google. [n.d.]. Trending on YouTube - YouTube Help. https://support.google.com/youtube/answer/7239739?hl=en. (Accessed on 09/09/2021).",
      "doi": ""
    },
    {
      "text": "Sten Govaerts, Katrien Verbert, Erik Duval, and Abelardo Pardo. 2012. The student activity meter for awareness and self-reflection. In CHI’12 Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 869–884.",
      "doi": ""
    },
    {
      "text": "Anthony M. Grant, John Franklin, and Peter Langford. 2002. The self-reflection and insight scale: A new measure of private self-consciousness. Social Behavior and Personality 30, 8 (2002), 821–836. https://doi.org/10.2224/sbp.2002.30.8.821",
      "doi": ""
    },
    {
      "text": "Catherine Grevet and Eric Gilbert. 2015. Piggyback prototyping: Using existing, large-scale social computing systems to prototype new ones. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 4047–4056.",
      "doi": "10.1145/2702123.2702395"
    },
    {
      "text": "Andrea Grimes, Brian M Landry, and Rebecca E Grinter. 2010. Characteristics of shared health reflections in a local community. In Proceedings of the 2010 ACM conference on Computer supported cooperative work. Association for Computing Machinery, New York, NY, USA, 435–444.",
      "doi": "10.1145/1718918.1718992"
    },
    {
      "text": "Asela Gunawardana and Guy Shani. 2015. Evaluating Recommender Systems. Springer US, Boston, MA, 265–308. https://doi.org/10.1007/978-1-4899-7637-6_8",
      "doi": ""
    },
    {
      "text": "Kirsi Halttu and Harri Oinas-kukkonen. 2017. Human – Computer Interaction Persuading to Reflect : Role of Reflection and Insight in Persuasive Systems Design for Physical Health Persuading to Reflect : Role of Reflection and Insight in Persuasive Systems Design for Physical Health. Human–Computer Interaction 32, 5-6 (2017), 381–412. https://doi.org/10.1080/07370024.2017.1283227",
      "doi": ""
    },
    {
      "text": "Donald Hedeker, Stephen HC du Toit, Hakan Demirtas, and Robert D Gibbons. 2018. A note on marginalization of regression parameters from mixed models of binary outcomes. Biometrics 74, 1 (2018), 354–361.",
      "doi": ""
    },
    {
      "text": "Natali Helberger, Kari Karppinen, and Lucia D’acunto. 2018. Exposure diversity as a design principle for recommender systems. Information, Communication & Society 21, 2 (2018), 191–207.",
      "doi": ""
    },
    {
      "text": "Yoshinori Hijikata, Takuya Shimizu, and Shogo Nishida. 2009. Discovery-oriented collaborative filtering for improving user satisfaction. In Proceedings of the 14th international conference on Intelligent user interfaces. Association for Computing Machinery, New York, NY, USA, 67–76.",
      "doi": "10.1145/1502650.1502663"
    },
    {
      "text": "Travonia B Hughes, Vijay R Varma, Corinne Pettigrew, and Marilyn S Albert. 2017. African Americans and clinical research: evidence concerning barriers and facilitators to participation and recruitment recommendations. The Gerontologist 57, 2 (2017), 348–358.",
      "doi": ""
    },
    {
      "text": "Andrew Johnston, Shigeki Amitani, and Ernest Edmonds. 2005. Amplifying reflective thinking in musical performance. In Proceedings of the 5th conference on Creativity & cognition. Association for Computing Machinery, New York, NY, USA, 166–175.",
      "doi": "10.1145/1056224.1056248"
    },
    {
      "text": "Keen. 2021. Keen | Expand your interests. https://staykeen.com/about. (Accessed on 09/07/2021).",
      "doi": ""
    },
    {
      "text": "Joel Kiskola, Thomas Olsson, Heli Väätäjä, Aleksi H. Syrjämäki, Anna Rantasila, Poika Isokoski, Mirja Ilves, and Veikko Surakka. 2021. Applying Critical Voice in Design of User Interfaces for Supporting Self-Reflection and Emotion Regulation in Online News Commenting. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445783",
      "doi": ""
    },
    {
      "text": "Kalliopi Kontiza, Olga Loboda, Louis Deladiennee, Sylvain Castagnos, and Yannick Naudet. 2018. A museum app to trigger users’ reflection. In International Workshop on Mobile Access to Cultural Heritage (MobileCH2018). Barcelona, Spain.",
      "doi": ""
    },
    {
      "text": "Malcolm Koo and Harvey Skinner. 2005. Challenges of internet recruitment: a case study with disappointing results. Journal of Medical Internet Research 7, 1 (2005), e6.",
      "doi": ""
    },
    {
      "text": "Elizabeth V Korinek, Sayali S Phatak, Cesar A Martin, Mohammad T Freigoun, Daniel E Rivera, Marc A Adams, Pedja Klasnja, Matthew P Buman, and Eric B Hekler. 2018. Adaptive step goals and rewards: a longitudinal growth model of daily steps for a smartphone-based walking intervention. Journal of behavioral medicine 41, 1 (2018), 74–86.",
      "doi": ""
    },
    {
      "text": "MIT Media Lab. 2017. Overview ‹ FlipFeed — MIT Media Lab. https://www.media.mit.edu/projects/flipfeed/overview/. (Accessed on 08/31/2021).",
      "doi": ""
    },
    {
      "text": "KK Lamberty and Janet L Kolodner. 2005. Camera talk: Making the camera a partial participant. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 839–848.",
      "doi": "10.1145/1054972.1055090"
    },
    {
      "text": "Neal Lathia, Stephen Hailes, Licia Capra, and Xavier Amatriain. 2010. Temporal diversity in recommender systems. In Proceedings of the 33rd international ACM SIGIR conference on Research and development in information retrieval. Association for Computing Machinery, New York, NY, USA, 210–217.",
      "doi": "10.1145/1835449.1835486"
    },
    {
      "text": "Matthew L Lee and Anind K Dey. 2011. Reflecting on pills and phone use: supporting awareness of functional abilities for older adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2095–2104.",
      "doi": "10.1145/1978942.1979247"
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2009. Grafitter: leveraging social media for self reflection. XRDS: Crossroads, The ACM Magazine for Students 16, 2 (2009), 12–13.",
      "doi": "10.1145/1665997.1666001"
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stage-based model of personal informatics systems. In Proceedings of the SIGCHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 557–566.",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Ian Li, Anind K Dey, and Jodi Forlizzi. 2011. Understanding my data, myself: supporting self-reflection with ubicomp technologies. In Proceedings of the 13th international conference on Ubiquitous computing. Association for Computing Machinery, New York, NY, USA, 405–414.",
      "doi": "10.1145/2030112.2030166"
    },
    {
      "text": "James J Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B Strub. 2006. Fish’n’Steps: Encouraging physical activity with an interactive computer game. In International conference on ubiquitous computing. Springer, Springer Berlin Heidelberg, Berlin, Heidelberg, 261–278.",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Sylvain Malacria, Joey Scarr, Andy Cockburn, Carl Gutwin, and Tovi Grossman. 2013. Skillometers: Reflective widgets that motivate and help users to improve performance. In Proceedings of the 26th annual ACM symposium on User interface software and technology. Association for Computing Machinery, New York, NY, USA, 321–330.",
      "doi": "10.1145/2501988.2501996"
    },
    {
      "text": "Sean M McNee, John Riedl, and Joseph A Konstan. 2006. Being accurate is not enough: how accuracy metrics have hurt recommender systems. In CHI’06 extended abstracts on Human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 1097–1101.",
      "doi": ""
    },
    {
      "text": "Ania Medrek. 2018. NEWS BY ASSOCIATION: Designing a way out of the echo chamber. April (2018).",
      "doi": ""
    },
    {
      "text": "Susan Michie, Michelle Richardson, Marie Johnston, Charles Abraham, Jill Francis, Wendy Hardeman, Martin P Eccles, James Cane, and Caroline E Wood. 2013. The behavior change technique taxonomy (v1) of 93 hierarchically clustered techniques: building an international consensus for the reporting of behavior change interventions. Annals of behavioral medicine 46, 1 (2013), 81–95.",
      "doi": ""
    },
    {
      "text": "Ine Mols, Elise van den Hoven, and Berry Eggen. 2016. Informing Design for Reflection: An Overview of Current Everyday Practices. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (Gothenburg, Sweden) (NordiCHI ’16). Association for Computing Machinery, New York, NY, USA, Article 21, 10 pages. https://doi.org/10.1145/2971485.2971494",
      "doi": "10.1145/2971485.2971494"
    },
    {
      "text": "Sean Munson, Stephanie Lee, and Paul Resnick. 2013. Encouraging reading of diverse political viewpoints with a browser widget. In Proceedings of The International AAAI Conference on Web and Social Media, Vol. 7.",
      "doi": ""
    },
    {
      "text": "Sean A Munson, Hasan Cavusoglu, Larry Frisch, and Sidney Fels. 2013. Sociotechnical challenges and progress in using social media for health. Journal of medical Internet research 15, 10 (2013), e226.",
      "doi": ""
    },
    {
      "text": "Philip M Napoli. 2011. Exposure diversity reconsidered. Journal of information policy 1 (2011), 246–259.",
      "doi": ""
    },
    {
      "text": "Tien T Nguyen, Pik-Mai Hui, F Maxwell Harper, Loren Terveen, and Joseph A Konstan. 2014. Exploring the filter bubble: the effect of using recommender systems on content diversity. In Proceedings of the 23rd international conference on World wide web. 677–686.",
      "doi": "10.1145/2566486.2568012"
    },
    {
      "text": "Jeffrey Nichols and Jeon-Hyung Kang. 2012. Asking questions of targeted strangers on social networks. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. Association for Computing Machinery, New York, NY, USA, 999–1002.",
      "doi": "10.1145/2145204.2145352"
    },
    {
      "text": "Jasmin Niess and Paweł W Woźniak. 2018. Supporting meaningful personal fitness: The tracker goal evolution model. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": "10.1145/3173574.3173745"
    },
    {
      "text": "Alexander Nussbaumer, Milos Kravcik, and Dietrich Albert. 2012. Supporting self-reflection in personal learning environments through user feedback.. In UMAP Workshops.",
      "doi": ""
    },
    {
      "text": "Adewale Obadimu, Esther Mead, Muhammad Nihal Hussain, and Nitin Agarwal. 2019. Identifying toxicity within youtube video comment. In International Conference on Social Computing, Behavioral-Cultural Modeling and Prediction and Behavior Representation in Modeling and Simulation. Springer, 214–223.",
      "doi": ""
    },
    {
      "text": "Ruchi Ookalkar, Kolli Vishal Reddy, and Eric Gilbert. 2019. Pop: Bursting news filter bubbles on twiter through diverse exposure. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW (2019), 18–21. https://doi.org/10.1145/3311957.3359513",
      "doi": "10.1145/3311957.3359513"
    },
    {
      "text": "Ruchi Ookalkar, Kolli Vishal Reddy, and Eric Gilbert. 2019. Pop: Bursting News Filter Bubbles on Twitter Through Diverse Exposure. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing. 18–22.",
      "doi": ""
    },
    {
      "text": "Eli Pariser. 2011. The filter bubble: How the new personalized web is changing what we read and how we think. Penguin.",
      "doi": "10.5555/2361740"
    },
    {
      "text": "Bernd Ploderer, Wolfgang Reitberger, Harri Oinas-Kukkonen, and Julia van Gemert-Pijnen. 2014. Social interaction and reflection for behaviour change.",
      "doi": ""
    },
    {
      "text": "Danielle E Ramo and Judith J Prochaska. 2012. Broad reach and targeted recruitment using Facebook for an online survey of young adult substance use. Journal of medical Internet research 14, 1 (2012), e28.",
      "doi": ""
    },
    {
      "text": "Paul Resnick, R Kelly Garrett, Travis Kriplean, Sean A Munson, and Natalie Jomini Stroud. 2013. Bursting your (filter) bubble: strategies for promoting diverse exposure. In Proceedings of the 2013 conference on Computer supported cooperative work companion. Association for Computing Machinery, New York, NY, USA, 95–100.",
      "doi": "10.1145/2441955.2441981"
    },
    {
      "text": "Dimitris Rizopoulos. 2019. GLMMadaptive: generalized linear mixed models using adaptive Gaussian quadrature. R package version 0.5–1(2019).",
      "doi": ""
    },
    {
      "text": "Corina Sas and Alan Dix. 2011. Designing for reflection on personal experience. International Journal of Human-Computer Studies 69, 5 (2011), 281–282.",
      "doi": "10.1016/j.ijhcs.2011.02.006"
    },
    {
      "text": "Jorrit Schaap. 2020. Bubble Trouble – Venture Out of Your Filter Bubbles. (2020), 1–14.",
      "doi": ""
    },
    {
      "text": "Gwendolyn Seidman. 2013. Self-presentation and belonging on Facebook: How personality influences social media use and motivations. Personality and individual differences 54, 3 (2013), 402–407.",
      "doi": ""
    },
    {
      "text": "Swapneel Kalpesh Sheth, Jonathan Schaffer Bell, Nipun Arora, and Gail E Kaiser. 2011. Towards diversity in recommendations using social networks. (2011).",
      "doi": ""
    },
    {
      "text": "Dominik A Stecula and Mark Pickup. 2021. Social media, cognitive reflection, and conspiracy beliefs. Frontiers in Political Science 3 (2021), 62.",
      "doi": ""
    },
    {
      "text": "Anja Thieme, Jayne Wallace, Paula Johnson, John McCarthy, Siân Lindley, Peter Wright, Patrick Olivier, and Thomas D Meyer. 2013. Design to promote mindfulness practice and sense of self for vulnerable women in secure hospital services. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2647–2656.",
      "doi": "10.1145/2470654.2481366"
    },
    {
      "text": "Tiffany Tseng and Coram Bryant. 2013. Design, reflect, explore: encouraging children’s reflections with mechanix. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 619–624.",
      "doi": ""
    },
    {
      "text": "Nina Valkanova, Sergi Jorda, Martin Tomitsch, and Andrew Vande Moere. 2013. Reveal-it! the impact of a social visualization projection on public awareness and discourse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 3461–3470.",
      "doi": ""
    },
    {
      "text": "Anthony J Viera, Joanne M Garrett, 2005. Understanding interobserver agreement: the kappa statistic. Fam med 37, 5 (2005), 360–363.",
      "doi": ""
    },
    {
      "text": "Yixue Wang and Siyu Yao. 2020. STUDY ON INTENTION-AWARE RECOMMENDATION OF YOUTUBE VIDEOS. (2020).",
      "doi": ""
    },
    {
      "text": "Mark Wilhelm, Ajith Ramanathan, Alexander Bonomo, Sagar Jain, Ed H. Chi, and Jennifer Gillenwater. 2018. Practical Diversified Recommendations on YouTube with Determinantal Point Processes. In Proceedings of the 27th ACM International Conference on Information and Knowledge Management (Torino, Italy) (CIKM ’18). Association for Computing Machinery, New York, NY, USA, 2165–2173. https://doi.org/10.1145/3269206.3272018",
      "doi": "10.1145/3269206.3272018"
    },
    {
      "text": "Yan Xu, Erika Shehan Poole, Andrew D Miller, Elsa Eiriksdottir, Dan Kestranek, Richard Catrambone, and Elizabeth D Mynatt. 2012. This is not a one-horse race: understanding player types in multiplayer pervasive health games for youth. In Proceedings of the ACM 2012 conference on computer supported cooperative work. Association for Computing Machinery, New York, NY, USA, 843–852.",
      "doi": ""
    },
    {
      "text": "Mi Zhang and Neil Hurley. 2008. Avoiding monotony: improving the diversity of recommendation lists. In Proceedings of the 2008 ACM conference on Recommender systems. 123–130.",
      "doi": "10.1145/1454008.1454030"
    },
    {
      "text": "Shanyang Zhao, Sherri Grasmuck, and Jason Martin. 2008. Identity construction on Facebook: Digital empowerment in anchored relationships. Computers in human behavior 24, 5 (2008), 1816–1836.",
      "doi": ""
    },
    {
      "text": "Tao Zhou, Zoltán Kuscsik, Jian-Guo Liu, Matúš Medo, Joseph Rushton Wakeling, and Yi-Cheng Zhang. 2010. Solving the apparent diversity-accuracy dilemma of recommender systems. Proceedings of the National Academy of Sciences 107, 10(2010), 4511–4515.",
      "doi": ""
    }
  ]
}