{
  "doi": "10.1145/3491102.3502097",
  "title": "Exploring Bystanders’ Privacy Concerns with Smart Homes in Jordan",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-24",
  "year": 2022,
  "badges": [],
  "abstract": "Smart homes continue to raise concerns about privacy and encroachment of businesses into intimate spaces. Prior research has focused on families and device owners in western contexts (Europe and North America), and has identified the importance of bystanders: individuals who are subjected to smart device use of others. Given the cultural and contextual aspects of accommodating bystanders, we identify a gap where bystanders in non-western societies have been insufficiently researched. To address this we conduct 20 interviews with domestic workers and household employers in Jordan, exploring privacy attitudes and practices. Our analysis uncovers a complex interplay between religious and social norms; legal and regulatory perspectives on privacy; and tensions between households and their domestic workers. We explore issues arising from smart homes coexisting as a residence and workplace, and highlight how workplace protections are ill-suited. We structure our findings to help inform public awareness, policy makers, manufacturers, and future research.",
  "authors": [
    {
      "name": "Wael S Albayaydh",
      "institution": "Department of Computer Science, Universoty of Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233629",
      "orcid": "missing"
    },
    {
      "name": "Ivan Flechais",
      "institution": "Department of Computer Science, University of Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100280391",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "[n. d.]. Big Data, Sport, and the Digital Divide: Theorizing How Athletes Might Respond to Big Data Monitoring - Andrew Baerg, 2017. https://journals.sagepub.com/doi/abs/10.1177/0193723516673409",
      "doi": ""
    },
    {
      "text": "[n. d.]. Britannica (Viewed:21-March-2021). https://www.britannica.com/place/Jordan",
      "doi": ""
    },
    {
      "text": "[n. d.]. Cyber Crimes in Jordan: A Legal Assessment on the Effectiveness of Information System Crimes Law No (30) of 2010 (Viewed: 11-March-2021. ([n. d.]). https://www.cybercrimejournal.com/Faqir2013janijcc.pdf",
      "doi": ""
    },
    {
      "text": "[n. d.]. Discovery of Grounded Theory: Strategies for Qualitative Research - Barney G Glaser, Anselm L Strauss - Google Books. https://books.google.jo/books?hl=en&lr=&id=GTMrDwAAQBAJ&oi=fnd&pg=PP1&dq=strauss+discovery+of+grounded+theory&ots=JtXbFCsrc_&sig=OIfOOscY08khAhUNPSnliQYlRJM&redir_esc=y#v=onepage&q=strauss%20discovery%20of%20grounded%20theory&f=false",
      "doi": ""
    },
    {
      "text": "[n. d.]. Exploring Consumers’ Attitudes of Smart TV Related Privacy Risks(Lecture Notes in Computer Science). Cham. https://link.springer.com/chapter/10.1007/978-3-319-58460-7_45",
      "doi": ""
    },
    {
      "text": "[n. d.]. Grounded Theory in Practice - Anselm Strauss, Juliet M. Corbin - Google Books. https://books.google.jo/books?hl=en&lr=&id=TtRMolAapBYC&oi=fnd&pg=PP9&dq=Anselm+Strauss+and+Juliet+M.+Corbin.+Grounded+Theory+in+Practice.+SAGE+Publications,+Thousand+Oaks,+California,+1997.&ots=DBbi8voIZg&sig=MadlTZXNHMjw23EGi3gvVRqWV2U&redir_esc=y#v=onepage&q=Anselm%20Strauss%20and%20Juliet%20M.%20Corbin.%20Grounded%20Theory%20in%20Practice.%20SAGE%20Publications%2C%20Thousand%20Oaks%2C%20California%2C%201997.&f=false",
      "doi": ""
    },
    {
      "text": "[n. d.]. Helen Nissenbaum, Privacy in Context: Technology, Policy, and the Integrity of Social Life | SpringerLink. https://link.springer.com/article/10.1007%2Fs10790-010-9251-z",
      "doi": ""
    },
    {
      "text": "[n. d.]. Home (Viewed:15-March-2021). https://microdata.epi.org/",
      "doi": ""
    },
    {
      "text": "[n. d.]. Jordan (viewed: 11-March-2021). https://www.coe.int/en/web/octopus/country-wiki-ap/-/asset_publisher/CmDb7M4RGb4Z/content/jordan/pop_up?_101_INSTANCE_CmDb7M4RGb4Z_languageId=en_GB&_101_INSTANCE_CmDb7M4RGb4Z_viewMode=print",
      "doi": ""
    },
    {
      "text": "[n. d.]. Jordan’s New Labour Law Amendments Impact the Employment Relationship - Ogletree Deakins (viewed: 09-March-2021). https://ogletree.com/international-employment-update/articles/",
      "doi": ""
    },
    {
      "text": "[n. d.]. Opinion | The Devastating Consequences of Being Poor in the Digital Age - The New York Times. https://www.nytimes.com/2019/04/25/opinion/privacy-poverty.html",
      "doi": ""
    },
    {
      "text": "[n. d.]. (PDF) ”What Can’t Data Be Used For?”: Privacy Expectations about Smart TVs in the U.S.. In ResearchGate. https://doi.org/10.14722/eurousec.2018.23016",
      "doi": ""
    },
    {
      "text": "[n. d.]. PRIVACY | Definition of PRIVACY by Oxford Dictionary on Lexico.com also meaning of PRIVACY. https://www.lexico.com/definition/privacy",
      "doi": ""
    },
    {
      "text": "[n. d.]. Privacy as Contextual Integrity Symposium - Technology, Values, and the Justice System 79 Washington Law Review 2004. https://heinonline.org/HOL/LandingPage?handle=hein.journals/washlr79&div=16&id=&page=",
      "doi": ""
    },
    {
      "text": "[n. d.]. Privacy behaviors of lifeloggers using wearable cameras | Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing. https://dl.acm.org/doi/abs/10.1145/2632048.2632079",
      "doi": ""
    },
    {
      "text": "Sabine Trepte and Leonard Reinecke (Eds.). [n. d.]. Privacy Online (Berlin, Heidelberg, 2011). Springer Berlin Heidelberg. https://doi.org/10.1007/978-3-642-21521-6",
      "doi": ""
    },
    {
      "text": "[n. d.]. Shop Online for Home Automation | Vera Smart Controllers (Viewed: 5-March-2021. http://getvera.com/",
      "doi": ""
    },
    {
      "text": "[n. d.]. SMART HOME | Definition of SMART HOME by Oxford Dictionary on Lexico.com also meaning of SMART HOME. https://www.lexico.com/definition/smart_home",
      "doi": ""
    },
    {
      "text": "[n. d.]. State of Privacy Jordan | Privacy International. https://privacyinternational.org/state-privacy/1004/state-privacy-jordan",
      "doi": ""
    },
    {
      "text": "[n. d.]. What is a Smart Home?https://smarthomeenergy.co.uk/what-smart-home/",
      "doi": ""
    },
    {
      "text": "[n. d.]. Wink | Buy and View Smart Home Products(Viewed:21-March-2021). https://www.wink.com/products/",
      "doi": ""
    },
    {
      "text": "[22] 2018. http://www.robotshop.com/community/forum/community/forum/t/saint-louis-university-is-placing/-2-300-echo-dots-in-student-living/-spaces-https-www-theverge-com-2018/-8-15-17693174-saint-louis-/university-echo-dots-amazon-student/-living-spaces/61322",
      "doi": ""
    },
    {
      "text": "2018. Cyber and Physical Security Vulnerability Assessment for IoT-Based Smart Homes. 36 (2018). http://www.mdpi.com/1424-8220/18/3/817",
      "doi": ""
    },
    {
      "text": "Noura Abdi, Kopo M. Ramokapane, and Jose M. Such. 2019. More than Smart Speakers: Security and Privacy Perceptions of Smart Home Personal Assistants. 451–466. https://www.usenix.org/conference/soups2019/presentation/abdi",
      "doi": ""
    },
    {
      "text": "Imtiaz Ahmad, Rosta Farzan, Apu Kapadia, and Adam J. Lee. [n. d.]. Tangible Privacy: Towards User-Centric Sensor Designs for Bystander Privacy. 4 ([n. d.]), 1–28. Issue CSCW2. https://doi.org/10.1145/3415187",
      "doi": ""
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md. Romael Haque, Jay Chen, and Nicola Dell. [n. d.]. Digital Privacy Challenges with Shared Mobile Phone Use in Bangladesh. 1 ([n. d.]), 1–20. Issue CSCW. https://doi.org/10.1145/3134652",
      "doi": ""
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md. Romael Haque, Shion Guha, Md. Rashidujjaman Rifat, and Nicola Dell. [n. d.]. Privacy, Security, and Surveillance in the Global South: A Study of Biometric Mobile SIM Registration in Bangladesh. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver Colorado USA, 2017-05-02). ACM, 906–918. https://doi.org/10.1145/3025453.3025961",
      "doi": ""
    },
    {
      "text": "Tousif Ahmed, Roberto Hoyle, Patrick Shaffer, Kay Connelly, David Crandall, and Apu Kapadia. 2017. Understanding Physical Safety, Security, and Privacy Concerns of People with Visual Impairments. IEEE Internet Computing(2017), 1–1. https://doi.org/10.1109/MIC.2017.265103316 Conference Name: IEEE Internet Computing.",
      "doi": ""
    },
    {
      "text": "Ebtisam Alabdulqader, Norah Abokhodair, and Shaimaa Lazem. [n. d.]. Human-Computer Interaction Across the Arab World. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (Denver Colorado USA, 2017-05-06). ACM, 1356–1359. https://doi.org/10.1145/3027063.3049280",
      "doi": ""
    },
    {
      "text": "Noah Apthorpe, Yan Shvartzshnaider, Arunesh Mathur, Dillon Reisman, and Nick Feamster. 2018. Discovering Smart Home Internet of Things Privacy Norms Using Contextual Integrity. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 2 (July 2018), 59:1–59:23. https://doi.org/10.1145/3214262",
      "doi": "10.1145/3214262"
    },
    {
      "text": "Gianmarco Baldini, Maarten Botterman, Ricardo Neisse, and Mariachiara Tallacchini. 2018. Ethical Design in the Internet of Things. Science and Engineering Ethics 24, 3 (June 2018), 905–925. https://doi.org/10.1007/s11948-016-9754-5",
      "doi": ""
    },
    {
      "text": "A. Barth, A. Datta, J.C. Mitchell, and H. Nissenbaum. 2006. Privacy and contextual integrity: framework and applications. In 2006 IEEE Symposium on Security and Privacy (S P’06). 15 pp.–198. http://doi.org/10.1109/SP.2006.32 ISSN: 2375-1207.",
      "doi": "10.1109/SP.2006.32"
    },
    {
      "text": "Julia Bernd, Ruba Abu-Salma, and Alisa Frik. 2020. Bystanders’ Privacy: The Perspectives of Nannies on Smart Home Surveillance. https://www.usenix.org/conference/foci20/presentation/bernd",
      "doi": ""
    },
    {
      "text": "Julia Bernd, Alisa Frik, Maritza Johnson, and Nathan Malkin. 2019. Smart Home Bystanders: Further Complexifying a Complex Context. (2019), 6. https://privaci.info/symposium2/papers_and_slides/Sub_Bernd_et_al_Bystanders_CI_2019.pdf",
      "doi": ""
    },
    {
      "text": "Nellie Bowles. 2018. Thermostats, Locks and Lights: Digital Tools of Domestic Abuse. The New York Times (June 2018). https://www.nytimes.com/2018/06/23/technology/smart-home-devices-domestic-abuse.html",
      "doi": ""
    },
    {
      "text": "Denys Brand, Florence D. DiGennaro Reed, Mariah D. Morley, Tyler G. Erath, and Matthew D. Novak. 2020. A Survey Assessing Privacy Concerns of Smart-Home Services Provided to Individuals with Disabilities. Behavior Analysis in Practice 13, 1 (March 2020), 11–21. https://doi.org/10.1007/s40617-018-00329-y",
      "doi": ""
    },
    {
      "text": "A.J. Bernheim Brush, Bongshin Lee, Ratul Mahajan, Sharad Agarwal, Stefan Saroiu, and Colin Dixon. 2011. Home automation in the wild: challenges and opportunities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2115–2124. https://doi.org/10.1145/1978942.1979249",
      "doi": "10.1145/1978942.1979249"
    },
    {
      "text": "Alison Burrows, David Coyle, and Rachael Gooberman-Hill. 2018. Privacy, boundaries and smart homes for health: An ethnographic study. Health & Place 50 (March 2018), 112–118. https://doi.org/10.1016/j.healthplace.2018.01.006",
      "doi": ""
    },
    {
      "text": "George Chalhoub and Ivan Flechais. [n. d.]. “Alexa, Are You Spying on Me?”: Exploring the Effect of User Experience on the Security and Privacy of Smart Speaker Users. In HCI for Cybersecurity, Privacy and Trust, Abbas Moallem (Ed.). Vol. 12210. Springer International Publishing, 305–325. https://doi.org/10.1007/978-3-030-50309-3_21 Series Title: Lecture Notes in Computer Science.",
      "doi": ""
    },
    {
      "text": "George Chalhoub, Ivan Flechais, Norbert Nthala, and Ruba Abu-Salma. 2020. Innovation Inaction or In Action? The Role of User Experience in the Security and Privacy Design of Smart Home Cameras. 185–204. https://www.usenix.org/conference/soups2020/presentation/chalhoub",
      "doi": ""
    },
    {
      "text": "George Chalhoub, Ivan Flechais, Norbert Nthala, Ruba Abu-Salma, and Elie Tom. 2020. Factoring User Experience into the Security and Privacy Design of Smart Home Devices: A Case Study. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3334480.3382850",
      "doi": "10.1145/3334480.3382850"
    },
    {
      "text": "Chola Chhetri and Vivian Genaro Motti. 2019. Eliciting Privacy Concerns for Smart Home Devices from a User Centered Perspective. In Information in Contemporary Society. Springer, Cham, 91–101. https://doi.org/10.1007/978-3-030-15742-5_8",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Sunny Consolvo, Jaeyeon Jung, Beverly Harrison, Shwetak N. Patel, and Julie A. Kientz. 2012. Investigating receptiveness to sensing and inference in the home using sensor proxies. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing(UbiComp ’12). Association for Computing Machinery, New York, NY, USA, 61–70. https://doi.org/10.1145/2370216.2370226",
      "doi": "10.1145/2370216.2370226"
    },
    {
      "text": "Andy Crabtree, Peter Tolmie, and Will Knight. [n. d.]. Repacking ‘Privacy’ for a Networked World. 26, 4([n. d.]), 453–488. https://doi.org/10.1007/s10606-017-9276-y",
      "doi": ""
    },
    {
      "text": "Jaybie A. De Guzman, Kanchana Thilakarathna, and Aruna Seneviratne. 2019. Security and Privacy Approaches in Mixed Reality: A Literature Survey. Comput. Surveys 52, 6 (Oct. 2019), 110:1–110:37. https://doi.org/10.1145/3359626",
      "doi": ""
    },
    {
      "text": "Tamara Denning, Zakariya Dehlawi, and Tadayoshi Kohno. 2014. In situ with bystanders of augmented reality glasses: perspectives on recording and privacy-mediating technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 2377–2386. https://doi.org/10.1145/2556288.2557352",
      "doi": "10.1145/2556288.2557352"
    },
    {
      "text": "David Eckhoff and Isabel Wagner. 2018. Privacy in the Smart City—Applications, Technologies, Challenges, and Solutions. IEEE Communications Surveys Tutorials 20, 1 (2018), 489–516. http://doi.org/10.1109/COMST.2017.2748998 Conference Name: IEEE Communications Surveys Tutorials.",
      "doi": ""
    },
    {
      "text": "Alisa Frik, Leysan Nurgalieva, Julia Bernd, Joyce Lee, Florian Schaub, and Serge Egelman. 2019. Privacy and Security Threat Models and Mitigation Strategies of Older Adults. 21–40. https://www.usenix.org/conference/soups2019/presentation/frik",
      "doi": ""
    },
    {
      "text": "Radhika Garg and Christopher Moreno. 2019. Understanding Motivators, Constraints, and Practices of Sharing Internet of Things. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 2 (June 2019), 44:1–44:21. https://doi.org/10.1145/3328915",
      "doi": "10.1145/3328915"
    },
    {
      "text": "Vaibhav Garg, L. Jean Camp, Lesa Lorenzen-Huber, Kalpana Shankar, and Kay Connelly. 2014. Privacy concerns in assisted living technologies. annals of telecommunications - annales des télécommunications 69, 1 (Feb. 2014), 75–88. https://doi.org/10.1007/s12243-013-0397-0",
      "doi": ""
    },
    {
      "text": "Jun Ge. 2016. Observers’ Privacy Concerns about Wearable Cameras. (March 2016). https://etda.libraries.psu.edu/catalog/28890",
      "doi": ""
    },
    {
      "text": "Christine Geeng and Franziska Roesner. 2019. Who’s In Control? Interactions In Multi-User Smart Homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300498",
      "doi": ""
    },
    {
      "text": "Nina Gerber, Benjamin Reinheimer, and Melanie Volkamer. [n. d.]. Home Sweet Home? Investigating Users’ Awareness of Smart Home Privacy Threats. ([n. d.]), 4. https://spice.luddy.indiana.edu/files/2018/07/wssp2018-paper2.pdf",
      "doi": ""
    },
    {
      "text": "Loni Hagen. 2017. Overcoming the Privacy Challenges of Wearable Devices: A Study on the Role of Digital Literacy. In Proceedings of the 18th Annual International Conference on Digital Government Research(dg.o ’17). Association for Computing Machinery, New York, NY, USA, 598–599. https://doi.org/10.1145/3085228.3085254",
      "doi": "10.1145/3085228.3085254"
    },
    {
      "text": "Muhammad Aslam Hayat1. 2007. Privacy and Islam: From the Quran to data protection in Pakistan. Information & Communications Technology Law 16, 2 (June 2007), 137–148. https://doi.org/10.1080/13600830701532043 Publisher: Routledge.",
      "doi": ""
    },
    {
      "text": "Chris Jay Hoofnagle, Bart van der Sloot, and Frederik Zuiderveen Borgesius. 2019. The European Union general data protection regulation: what it is and what it means. Information & Communications Technology Law 28, 1 (Jan. 2019), 65–98. https://doi.org/10.1080/13600834.2019.1573501 Publisher: Routledge _eprint: https://doi.org/10.1080/13600834.2019.1573501.",
      "doi": ""
    },
    {
      "text": "Fukiko IKEHATA. 2017. <Special Feature ”Toward New Studies on Islamic Moderate Trends”>Aspiring to be a Leader of Moderation: A Study on Jordan’s Islamic Policy. https://doi.org/10.14989/225232",
      "doi": ""
    },
    {
      "text": "Timo Jakobi, Corinna Ogonowski, Nico Castelli, Gunnar Stevens, and Volker Wulf. 2017. The Catch(es) with Smart Home: Experiences of a Living Lab field Study. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1620–1633. https://doi.org/10.1145/3025453.3025799",
      "doi": "10.1145/3025453.3025799"
    },
    {
      "text": "Maritza Johnson, Serge Egelman, and Steven M. Bellovin. 2012. Facebook and privacy: it’s complicated. In Proceedings of the Eighth Symposium on Usable Privacy and Security(SOUPS ’12). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/2335356.2335369",
      "doi": "10.1145/2335356.2335369"
    },
    {
      "text": "Marion Koelle, Matthias Kranz, and Andreas Möller. 2015. Don’t look at me that way! Understanding User Attitudes Towards Data Glasses Usage. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’15). Association for Computing Machinery, New York, NY, USA, 362–372. https://doi.org/10.1145/2785830.2785842",
      "doi": "10.1145/2785830.2785842"
    },
    {
      "text": "Spyros Kokolakis. 2017. Privacy attitudes and privacy behaviour: A review of current research on the privacy paradox phenomenon. Computers & Security 64 (Jan. 2017), 122–134. https://doi.org/10.1016/j.cose.2015.07.002",
      "doi": "10.1016/j.cose.2015.07.002"
    },
    {
      "text": "Katharina Krombholz, Adrian Dabrowski, Matthew Smith, and Edgar Weippl. 2017. Exploring Design Directions for Wearable Privacy. https://publications.cispa.saarland/2808/",
      "doi": ""
    },
    {
      "text": "Martin Krämer. [n. d.]. Disentangling Privacy in Smart Homes. ([n. d.]), 11. https://www.martin-kraemer.net/presentations/2018-10-cdt-showcase.pdf",
      "doi": ""
    },
    {
      "text": "Josephine Lau, Benjamin Zimmerman, and Florian Schaub. 2018. Alexa, Are You Listening?Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 102:1–102:31. https://doi.org/10.1145/3274371",
      "doi": ""
    },
    {
      "text": "Hosub Lee and Alfred Kobsa. 2016. Understanding user privacy in Internet of Things environments. In 2016 IEEE 3rd World Forum on Internet of Things (WF-IoT). 407–412. http://doi.org/10.1109/WF-IoT.2016.7845392",
      "doi": ""
    },
    {
      "text": "Linda Lee, JoongHwa Lee, Serge Egelman, and David Wagner. 2016. Information Disclosure Concerns in The Age of Wearable Computing. In Proceedings 2016 Workshop on Usable Security. Internet Society, San Diego, CA. https://doi.org/10.14722/usec.2016.23006",
      "doi": ""
    },
    {
      "text": "Roxanne Leitão. 2018. Digital Technologies and their Role in Intimate Partner Violence. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems(CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3170427.3180305",
      "doi": "10.1145/3170427.3180305"
    },
    {
      "text": "Deborah Lupton. 2014. Self-tracking cultures: towards a sociology of personal informatics. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design(OzCHI ’14). Association for Computing Machinery, New York, NY, USA, 77–86. https://doi.org/10.1145/2686612.2686623",
      "doi": "10.1145/2686612.2686623"
    },
    {
      "text": "Michelle Madejski, Maritza Johnson, and Steven M. Bellovin. 2012. A study of privacy settings errors in an online social network. In 2012 IEEE International Conference on Pervasive Computing and Communications Workshops. 340–345. http://doi.org/10.1109/PerComW.2012.6197507",
      "doi": ""
    },
    {
      "text": "Shrirang Mare, Franziska Roesner, and Tadayoshi Kohno. 2020. Smart Devices in Airbnbs: Considering Privacy and Security for both Guests and Hosts. Proceedings on Privacy Enhancing Technologies 2020, 2 (April 2020), 436–458. https://doi.org/10.2478/popets-2020-0035",
      "doi": ""
    },
    {
      "text": "Karola Marky, Sarah Prange, Florian Krell, Max Mühlhäuser, and Florian Alt. [n. d.]. “You just can’t know about everything”: Privacy Perceptions of Smart Home Visitors. In 19th International Conference on Mobile and Ubiquitous Multimedia (Essen Germany, 2020-11-22). ACM, 83–95. https://doi.org/10.1145/3428361.3428464",
      "doi": ""
    },
    {
      "text": "Karola Marky, Alexandra Voit, Alina Stöver, Kai Kunze, Svenja Schröder, and Max Mühlhäuser. 2020. ”I don’t know how to protect myself”: Understanding Privacy Perceptions Resulting from the Presence of Bystanders in Smart Environments. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society(NordiCHI ’20). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3419249.3420164",
      "doi": "10.1145/3419249.3420164"
    },
    {
      "text": "Aleecia M. McDonald and Lorrie Faith Cranor. 2008. The Cost of Reading Privacy Policies. I/S: A Journal of Law and Policy for the Information Society 4 (2008), 543. https://heinonline.org/HOL/Page?handle=hein.journals/isjlpsoc4&id=563&div=&collection=",
      "doi": ""
    },
    {
      "text": "Oriana McDonough. 2019. A Bystander’s Dilemma: Participatory Design Study of Privacy Expectations for Smart Home Devices. Syracuse University Honors Program Capstone Projects (May 2019). https://surface.syr.edu/honors_capstone/1085",
      "doi": ""
    },
    {
      "text": "Sarah Mennicken, David Kim, and Elaine May Huang. 2016. Integrating the Smart Home into the Digital Calendar. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 5958–5969. https://doi.org/10.1145/2858036.2858168",
      "doi": "10.1145/2858036.2858168"
    },
    {
      "text": "M. Mikusz, S. Houben, N. Davies, K. Moessner, and M. Langheinrich. 2018. Raising Awareness of IoT Sensor Deployments. (Jan. 2018), 9 (8 pp.)–9 (8 pp.). https://doi.org/10.1049/cp.2018.0009 Publisher: IET Digital Library.",
      "doi": ""
    },
    {
      "text": "Alessandro Montanari, Afra Mashhadi, Akhil Mathur, and Fahim Kawsar. 2016. Understanding the Privacy Design Space for Personal Connected Objects. (July 2016). https://doi.org/10.14236/ewic/HCI2016.18 Publisher: BCS Learning & Development.",
      "doi": ""
    },
    {
      "text": "James W. Moore. 2016. What Is the Sense of Agency and Why Does it Matter?Frontiers in Psychology 7 (Aug. 2016). https://doi.org/10.3389/fpsyg.2016.01272",
      "doi": ""
    },
    {
      "text": "Maryam Mustafa, Shaimaa Lazem, Ebtisam Alabdulqader, Kentaro Toyama, Sharifa Sultana, Samia Ibtasam, Richard Anderson, and Syed Ishtiaque Ahmed. [n. d.]. IslamicHCI: Designing with and within Muslim Populations. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu HI USA, 2020-04-25). ACM, 1–8. https://doi.org/10.1145/3334480.3375151",
      "doi": ""
    },
    {
      "text": "Pardis Emami Naeini, Sruti Bhagavatula, Hana Habib, Martin Degeling, Lujo Bauer, Lorrie Faith Cranor, and Norman Sadeh. 2017. Privacy Expectations and Preferences in an IoT World. 399–412. https://www.usenix.org/conference/soups2017/technical-sessions/presentation/naeini",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2011. A Contextual Approach to Privacy Online. Daedalus 140, 4 (Oct. 2011), 32–48. https://doi.org/10.1162/DAED_a_00113",
      "doi": ""
    },
    {
      "text": "Norita Md Norwawi, Roesnita Ismail, Fauziah Wahid, Nader M. Alkaenay, and Najwa Hayaati Mohd Alwi. 2014. Promoting Islamic Ethics on Privacy in Digital Social Network for User Data Protection and Trust. Islamic Science 197, 1979 (Dec. 2014), 1–23. https://doi.org/10.12816/0012632 Publisher: Islamic Science University of Malaysia.",
      "doi": ""
    },
    {
      "text": "Leysia Palen and Paul Dourish. [n. d.]. Unpacking “Privacy” for a Networked World. ([n. d.]), 8.",
      "doi": ""
    },
    {
      "text": "Scott R. Peppet. 2014. Regulating the Internet of Things: first Steps toward Managing Discrimination, Privacy, Security and Consent. Texas Law Review 93(2014), 85. https://heinonline.org/HOL/Page?handle=hein.journals/tlr93&id=95&div=&collection=",
      "doi": ""
    },
    {
      "text": "James Pierce, Richmond Y. Wong, and Nick Merrill. 2020. Sensor Illumination: Exploring Design Qualities and Ethical Implications of Smart Cameras and Image/Video Analytics. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–19. https://doi.org/10.1145/3313831.3376347",
      "doi": "10.1145/3313831.3376347"
    },
    {
      "text": "Blaine A. Price, Avelie Stuart, Gul Calikli, Ciaran Mccormick, Vikram Mehta, Luke Hutton, Arosha K. Bandara, Mark Levine, and Bashar Nuseibeh. 2017. Logging you, Logging me: A Replicable Study of Privacy and Sharing Behaviour in Groups of Visual Lifeloggers. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 2 (June 2017), 22:1–22:18. https://doi.org/10.1145/3090087",
      "doi": "10.1145/3090087"
    },
    {
      "text": "Gilles Privat. 2000. A system-architecture viewpoint on smart networked devices. Microelectronic Engineering 54, 1 (Dec. 2000), 193–197. https://doi.org/10.1016/S0167-9317(00)80070-2",
      "doi": "10.1016/S0167-9317%2800%2980070-2"
    },
    {
      "text": "Halley Profita, Reem Albaghli, Leah findlater, Paul Jaeger, and Shaun K. Kane. 2016. The AT Effect: How Disability Affects the Perceived Social Acceptability of Head-Mounted Display Use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 4884–4895. https://doi.org/10.1145/2858036.2858130",
      "doi": "10.1145/2858036.2858130"
    },
    {
      "text": "Yasmeen Rashidi, Tousif Ahmed, Felicia Patel, Emily Fath, Apu Kapadia, Christena Nippert-Eng, and Norman Makoto Su. 2018. ”You don’t want to be the next meme”: College Students’ Workarounds to Manage Privacy in the Era of Pervasive Photography. 143–157. https://www.usenix.org/conference/soups2018/presentation/rashidi",
      "doi": ""
    },
    {
      "text": "Tom A. Rodden, Joel E. fischer, Nadia Pantidi, Khaled Bachour, and Stuart Moran. 2013. At home with agents: exploring attitudes towards future smart energy infrastructures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1173–1182. https://doi.org/10.1145/2470654.2466152",
      "doi": "10.1145/2470654.2466152"
    },
    {
      "text": "Franziska Roesner, Tamara Denning, Bryce Clayton Newell, Tadayoshi Kohno, and Ryan Calo. 2014. Augmented reality: hard problems of law and policy. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication(UbiComp ’14 Adjunct). Association for Computing Machinery, New York, NY, USA, 1283–1288. https://doi.org/10.1145/2638728.2641709",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Garen Checkley, Amna Batool, Nova Ahmed, David Nemer, Laura Sanely Gaytán-Lugo, Tara Matthews, Sunny Consolvo, and Elizabeth Churchill. [n. d.]. “Privacy is not for me, it’s for those rich women”: Performative Privacy Practices on Mobile Phones by Women in South Asia. ([n. d.]), 17.",
      "doi": ""
    },
    {
      "text": "J. SathishKumar and Dhiren R. Patel. 2014. A Survey on Internet of Things: Security and Privacy Issues. International Journal of Computer Applications 90, 11 (March 2014), 20–26. https://doi.org/10.5120/15764-4454",
      "doi": ""
    },
    {
      "text": "Manuel Silverio-Fernández, Suresh Renukappa, and Subashini Suresh. 2018. What is a smart device? - a conceptualisation within the paradigm of the internet of things. Visualization in Engineering 6, 1 (May 2018), 3. https://doi.org/10.1186/s40327-018-0063-8",
      "doi": ""
    },
    {
      "text": "Samarth Singhal, Carman Neustaedter, Thecla Schiphorst, Anthony Tang, Abhisekh Patra, and Rui Pan. 2016. You are Being Watched: Bystanders’ Perspective on the Use of Camera Devices in Public Spaces. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 3197–3203. https://doi.org/10.1145/2851581.2892522",
      "doi": "10.1145/2851581.2892522"
    },
    {
      "text": "Manya Sleeper, Sebastian Schnorf, Brian Kemler, and Sunny Consolvo. 2015. Attitudes toward vehicle-based sensing and recording. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 1017–1028. https://doi.org/10.1145/2750858.2806064",
      "doi": "10.1145/2750858.2806064"
    },
    {
      "text": "Daniel J Solove. [n. d.]. A Brief History of Information Privacy Law. ([n. d.]), 47. https://scholarship.law.gwu.edu/cgi/viewcontent.cgi?article=2076&context=faculty_publications",
      "doi": ""
    },
    {
      "text": "Madiha Tabassum, Tomasz Kosinski, and Heather Richter Lipford. 2019. ”I don’t own the data”: End User Perceptions of Smart Home Device Data Practices and Risks. 435–450. https://www.usenix.org/conference/soups2019/presentation/tabassum",
      "doi": ""
    },
    {
      "text": "Blase Ur, Jaeyeon Jung, and Stuart Schechter. 2014. Intruders versus intrusiveness: teens’ and parents’ perspectives on home-entryway surveillance. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’14). Association for Computing Machinery, New York, NY, USA, 129–139. https://doi.org/10.1145/2632048.2632107",
      "doi": "10.1145/2632048.2632107"
    },
    {
      "text": "John Vines, Stephen Lindsay, Gary W. Pritchard, Mabel Lie, David Greathead, Patrick Olivier, and Katie Brittain. 2013. Making family care work: dependence, privacy and remote home monitoring telecare systems. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing(UbiComp ’13). Association for Computing Machinery, New York, NY, USA, 607–616. https://doi.org/10.1145/2493432.2493469",
      "doi": "10.1145/2493432.2493469"
    },
    {
      "text": "Samuel Warren and Louis Brandeis. 1989. The Right to Privacy. Columbia University Press. https://www.degruyter.com/document/doi/10.7312/gold91730-002/html Pages: 1-21 Publication Title: Killing the Messenger Section: Killing the Messenger.",
      "doi": ""
    },
    {
      "text": "Alan F. Westin. 1966. Science, Privacy, and Freedom: Issues and Proposals for the 1970’s. Part I–The Current Impact of Surveillance on Privacy. Columbia Law Review 66, 6 (1966), 1003–1050. https://doi.org/10.2307/1120997 Publisher: Columbia Law Review Association, Inc..",
      "doi": ""
    },
    {
      "text": "Jenifer Sunrise Winter. 2015. Citizen Perspectives on the Customization/Privacy Paradox Related to Smart Meter Implementation:. International Journal of Technoethics 6, 1 (Jan. 2015), 45–59. https://doi.org/10.4018/ijt.2015010104",
      "doi": "10.4018/ijt.2015010104"
    },
    {
      "text": "Peter Worthy, Ben Matthews, and Stephen Viller. 2016. Trust Me: Doubts and Concerns Living with the Internet of Things. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems(DIS ’16). Association for Computing Machinery, New York, NY, USA, 427–434. https://doi.org/10.1145/2901790.2901890",
      "doi": "10.1145/2901790.2901890"
    },
    {
      "text": "Brad Wuetherick. 2010. Review: ”Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory 3e” (Corbin and Strauss). 36 (Dec. 2010). https://doi.org/10.21225/D5G01T",
      "doi": ""
    },
    {
      "text": "Yaxing Yao, Justin Reed Basdeo, Smirity Kaushik, and Yang Wang. 2019. Defending My Castle: A Co-Design Study of Privacy Mechanisms for Smart Homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300428",
      "doi": "10.1145/3290605.3300428"
    },
    {
      "text": "Yaxing Yao, Justin Reed Basdeo, Oriana Rosata Mcdonough, and Yang Wang. 2019. Privacy Perceptions and Designs of Bystanders in Smart Homes. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 59:1–59:24. https://doi.org/10.1145/3359161",
      "doi": "10.1145/3359161"
    },
    {
      "text": "Yaxing Yao, Huichuan Xia, Yun Huang, and Yang Wang. 2017. Privacy Mechanisms for Drones: Perceptions of Drone Controllers and Bystanders. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 6777–6788. https://doi.org/10.1145/3025453.3025907",
      "doi": "10.1145/3025453.3025907"
    },
    {
      "text": "Eric Zeng, Shrirang Mare, and Franziska Roesner. 2017. End User Security and Privacy Concerns with Smart Homes. 65–80. https://www.usenix.org/conference/soups2017/technical-sessions/presentation/zeng",
      "doi": ""
    },
    {
      "text": "Eric Zeng and Franziska Roesner. 2019. Understanding and Improving Security and Privacy in Multi-User Smart Homes: A Design Exploration and In-Home User Study. 159–176. https://www.usenix.org/conference/usenixsecurity19/presentation/zeng",
      "doi": ""
    },
    {
      "text": "Yu Zhai, Yan Liu, Minghao Yang, Feiyuan Long, and Johanna Virkki. 2014. A Survey Study of the Usefulness and Concerns about Smart Home Applications from the Human Perspective. Open Journal of Social Sciences 02, 11 (2014), 119. https://doi.org/10.4236/jss.2014.211017 Number: 11 Publisher: Scientific Research Publishing.",
      "doi": ""
    },
    {
      "text": "Serena Zheng, Noah Apthorpe, Marshini Chetty, and Nick Feamster. 2018. User Perceptions of Smart Home IoT Privacy. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (Nov. 2018), 200:1–200:20. https://doi.org/10.1145/3274469",
      "doi": "10.1145/3274469"
    }
  ]
}