{
  "doi": "10.1145/3491102.3501952",
  "title": "Put a Label On It! Approaches for Constructing and Contextualizing Bar Chart Physicalizations",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "Physicalizations represent data through their tangible and material properties. In contrast to screen-based visualizations, there is currently very limited understanding of how to label or annotate physicalizations to support people in interpreting the data encoded by the physicalization. Because of its spatiality, contextualization through labeling or annotation is crucial to communicate data across different orientations. In this paper, we study labeling approaches as part of the overall construction process of bar chart physicalizations. We designed a toolkit of physical tokens and paper data labels and asked 16 participants to construct and contextualize their own data physicalizations. We found that (i) the construction and contextualization of physicalizations is a highly intertwined process, (ii) data labels are integrated with physical constructs in the final design, and (iii) these are both influenced by orientation changes. We contribute with an understanding of the role of data labeling in the creation and contextualization of physicalizations.",
  "authors": [
    {
      "name": "Kim Sauvé",
      "institution": "Lancaster University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659179555",
      "orcid": "missing"
    },
    {
      "name": "Argenis Ramirez Gomez",
      "institution": "University of Portsmouth, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365287",
      "orcid": "missing"
    },
    {
      "name": "Steven Houben",
      "institution": "Eindhoven University of Technology, Netherlands",
      "img": "/do/10.1145/contrib-81502746220/rel-imgonly/steven.jpg",
      "acmid": "81502746220",
      "orcid": "0000-0002-9009-5706"
    }
  ],
  "references": [
    {
      "text": "Pankaj K Agarwal, Marc Van Kreveld, and Subhash Suri. 1998. Label placement by maximum independent set in rectangles. Computational Geometry 11, 3-4 (1998), 209–218.",
      "doi": "10.1016/S0925-7721%2898%2900028-5"
    },
    {
      "text": "Kamran Ali, Knut Hartmann, and Thomas Strothotte. 2005. Label layout for interactive 3D illustrations. (2005).",
      "doi": ""
    },
    {
      "text": "Jacques Bertin. 1983. Semiology of graphics; diagrams networks maps. Technical Report.",
      "doi": ""
    },
    {
      "text": "Rahul Bhargava and Catherine D’Ignazio. 2017. Data sculptures as a playful and low-tech introduction to working with data. (2017).",
      "doi": ""
    },
    {
      "text": "Richard Brath. 2014. 3D InfoVis is here to stay: Deal with it. In 2014 IEEE VIS International Workshop on 3DVis (3DVis). IEEE, 25–31. https://doi.org/10.1109/3DVis.2014.7160096",
      "doi": ""
    },
    {
      "text": "Grigore Burdea and Philippe Coiffet. 2003. Virtual reality technology.",
      "doi": ""
    },
    {
      "text": "Chaomei Chen. 2013. Information visualisation and virtual environments. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Ed Huai-hsin Chi. 2000. A taxonomy of visualization techniques using the data state reference model. In IEEE Symposium on Information Visualization 2000. INFOVIS 2000. Proceedings. IEEE, 69–75.",
      "doi": ""
    },
    {
      "text": "Jon Christensen, Joe Marks, and Stuart Shieber. 1995. An empirical study of algorithms for point-feature label placement. ACM Transactions on Graphics (TOG) 14, 3 (1995), 203–232.",
      "doi": "10.1145/212332.212334"
    },
    {
      "text": "Kurtis Danyluk, Teoman Tomo Ulusoy, Wei Wei, and Wesley Willett. 2020. Touch and Beyond: Comparing Physical and Virtual Reality Visualizations. IEEE Transactions on Visualization and Computer Graphics (2020). https://doi.org/10.1109/TVCG.2020.3023336",
      "doi": ""
    },
    {
      "text": "A De Boer. 2007. Label placement in 3D georeferenced and oriented digital photographs using GIS technology. (2007).",
      "doi": ""
    },
    {
      "text": "Hessam Djavaherpour, Faramarz Samavati, Ali Mahdavi-Amiri, Fatemeh Yazdanbakhsh, Samuel Huron, Richard Levy, Yvonne Jansen, and Lora Oehlberg. 2021. Data to Physicalization: A Survey of the Physical Rendering Process. Computer Graphics Forum(2021). https://arxiv.org/abs/2102.11175",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic and Yvonne Jansen. 2012. List of Physical Visualizations. www.dataphys.org/list.",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic, Yvonne Jansen, and Andrew Vande Moere. 2021. Data Physicalization. In Springer Handbook of Human Computer Interaction, Jean Vanderdonckt (Ed.). Springer. https://hal.inria.fr/hal-02113248",
      "doi": ""
    },
    {
      "text": "Shawn Edmondson, Jon Christensen, Joe Marks, and Stuart Shieber. 1996. A general cartographic labelling algorithm. Cartographica: The International Journal for Geographic Information and Geovisualization 33, 4 (1996), 13–24.",
      "doi": ""
    },
    {
      "text": "Aluna Everitt, Faisal Taher, and Jason Alexander. 2016. ShapeCanvas: An Exploration of Shape-Changing Content Generation by Members of the Public. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 2778–2782. https://doi.org/10.1145/2858036.2858316",
      "doi": "10.1145/2858036.2858316"
    },
    {
      "text": "Danyang Fan, Alexa Fay Siu, Sile O’Modhrain, and Sean Follmer. 2020. Constructive Visualization to Inform the Design and Exploration of Tactile Data Representations. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, Greece) (ASSETS ’20). ACM, New York, NY, USA, Article 60, 4 pages. https://doi.org/10.1145/3373625.3418027",
      "doi": "10.1145/3373625.3418027"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. InFORM: Dynamic Physical Affordances and Constraints through Shape and Object Actuation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). ACM, New York, NY, USA, 417–426. https://doi.org/10.1145/2501988.2502032",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Office for National Statistics (ONS). 2021. Chart Titles and Text. https://style.ons.gov.uk/category/data-visualisation/titles-and-text/.",
      "doi": ""
    },
    {
      "text": "Helen Gibson, Joe Faith, and Paul Vickers. 2013. A survey of two-dimensional graph layout techniques for information visualisation. Information visualization 12, 3-4 (2013), 324–357.",
      "doi": ""
    },
    {
      "text": "Silke M Göbel. 2015. Up or down? Reading direction influences vertical counting direction in the horizontal plane–a cross-cultural comparison. Frontiers in psychology 6 (2015), 228.",
      "doi": ""
    },
    {
      "text": "Pauline Gourlet and Thierry Dassé. 2017. Cairn: A Tangible Apparatus for Situated Data Collection, Visualization and Analysis. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). ACM, New York, NY, USA, 247–258. https://doi.org/10.1145/3064663.3064794",
      "doi": "10.1145/3064663.3064794"
    },
    {
      "text": "US Government. 2021. Data Visualisation Standards. https://xdgov.github.io/data-design-standards/components/labels.",
      "doi": ""
    },
    {
      "text": "Tovi Grossman, Daniel Wigdor, and Ravin Balakrishnan. 2007. Exploring and Reducing the Effects of Orientation on Text Readability in Volumetric Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 483–492. https://doi.org/10.1145/1240624.1240702",
      "doi": "10.1145/1240624.1240702"
    },
    {
      "text": "Steven Houben, Connie Golsteijn, Sarah Gallacher, Rose Johnson, Saskia Bakker, Nicolai Marquardt, Licia Capra, and Yvonne Rogers. 2016. Physikit: Data Engagement Through Physical Ambient Visualizations in the Home. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1608–1619. https://doi.org/10.1145/2858036.2858059",
      "doi": "10.1145/2858036.2858059"
    },
    {
      "text": "Samuel Huron, Sheelagh Carpendale, Alice Thudt, Anthony Tang, and Michael Mauerer. 2014. Constructive Visualization. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). ACM, New York, NY, USA, 433–442. https://doi.org/10.1145/2598510.2598566",
      "doi": "10.1145/2598510.2598566"
    },
    {
      "text": "Samuel Huron, Yvonne Jansen, and Sheelagh Carpendale. 2014. Constructing Visual Representations: Investigating the Use of Tangible Tokens. IEEE Transactions on Visualization and Computer Graphics 20, 12(2014), 2102–2111. https://doi.org/10.1109/TVCG.2014.2346292",
      "doi": ""
    },
    {
      "text": "Yvonne Jansen and Pierre Dragicevic. 2013. An Interaction Model for Visualizations Beyond The Desktop. IEEE Transactions on Visualization and Computer Graphics 19, 12(2013), 2396–2405. https://doi.org/10.1109/TVCG.2013.134",
      "doi": "10.1109/TVCG.2013.134"
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, and Jean-Daniel Fekete. 2013. Evaluating the Efficiency of Physical Visualizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). ACM, New York, NY, USA, 2593–2602. https://doi.org/10.1145/2470654.2481359",
      "doi": "10.1145/2470654.2481359"
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, Petra Isenberg, Jason Alexander, Abhijit Karnik, Johan Kildal, Sriram Subramanian, and Kasper Hornbæk. 2015. Opportunities and Challenges for Data Physicalization. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 3227–3236. https://doi.org/10.1145/2702123.2702180",
      "doi": "10.1145/2702123.2702180"
    },
    {
      "text": "Jia Li, Catherine Plaisant, and Ben Shneiderman. 1998. Data object and label placement for information abundant visualizations. In Proceedings of the 1998 workshop on New paradigms in information visualization and manipulation. 41–48.",
      "doi": "10.1145/324332.324341"
    },
    {
      "text": "Simon Lok and Steven Feiner. 2001. A survey of automated layout techniques for information presentations. Proceedings of SmartGraphics 2001 (2001), 61–68.",
      "doi": ""
    },
    {
      "text": "Daphne Menheere, Evianne van Hartingsveldt, Mads Birkebæk, Steven Vos, and Carine Lallemand. 2021. Laina: Dynamic Data Physicalization for Slow Exercising Feedback. In Designing Interactive Systems Conference 2021 (Virtual Event, USA) (DIS ’21). Association for Computing Machinery, New York, NY, USA, 1015–1030. https://doi.org/10.1145/3461778.3462041",
      "doi": "10.1145/3461778.3462041"
    },
    {
      "text": "Andrew Vande Moere and Stephanie Patel. 2009. The physical visualization of information: designing data sculptures in an educational context. In Visual information communication. Springer, 1–23.",
      "doi": ""
    },
    {
      "text": "Tamara Munzner. 2014. Visualization Analysis and Design. CRC Press, Boca Raton, FL, USA.",
      "doi": ""
    },
    {
      "text": "Kayleigh Porter and Gemma Arblaster. 2020. How Does Vertical Reading Affect Reading Speed?The British and Irish orthoptic journal 16, 1 (2020), 38.",
      "doi": ""
    },
    {
      "text": "He Ren and Eva Hornecker. 2021. Comparing Understanding and Memorization in Physicalization and VR Visualization. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction (Salzburg, Austria) (TEI ’21). ACM, New York, NY, USA, Article 41, 7 pages. https://doi.org/10.1145/3430524.3442446",
      "doi": "10.1145/3430524.3442446"
    },
    {
      "text": "Kim Sauvé, Saskia Bakker, and Steven Houben. 2020. Econundrum: Visualizing the Climate Impact of Dietary Choice through a Shared Data Sculpture. In Proceedings of the 2020 Conference on Designing Interactive Systems (Eindhoven, Netherlands) (DIS ’20). ACM, New York, NY, USA, 1287–1300. https://doi.org/10.1145/3357236.3395509",
      "doi": "10.1145/3357236.3395509"
    },
    {
      "text": "Kim Sauvé, Saskia Bakker, Nicolai Marquardt, and Steven Houben. 2020. LOOP: Exploring Physicalization of Activity Tracking Data. In Proceedings of the 2020 Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society(NordiCHI ’20). ACM, New York, NY, USA, Article 52, 12 pages. https://doi.org/10.1145/3419249.3420109",
      "doi": "10.1145/3419249.3420109"
    },
    {
      "text": "Kim Sauvé, Dominic Potts, Jason Alexander, and Steven Houben. 2020. A Change of Perspective: How User Orientation Influences the Perception of Physicalizations. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376312",
      "doi": "10.1145/3313831.3376312"
    },
    {
      "text": "Kim Sauvé, David Verweij, Jason Alexander, and Steven Houben. 2021. Reconfiguration Strategies with Composite Data Physicalizations. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Article 471, 18 pages. https://doi.org/10.1145/3411764.3445746",
      "doi": "10.1145/3411764.3445746"
    },
    {
      "text": "William R Sherman and Alan B Craig. 2003. Understanding virtual reality. San Francisco, CA: Morgan Kauffman(2003).",
      "doi": "10.5555/2821567"
    },
    {
      "text": "Simon Stusak, Jeannette Schwarz, and Andreas Butz. 2015. Evaluating the Memorability of Physical Visualizations. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3247–3250. https://doi.org/10.1145/2702123.2702248",
      "doi": "10.1145/2702123.2702248"
    },
    {
      "text": "Simon Stusak, Aurélien Tabard, Franziska Sauka, Rohit Ashok Khot, and Andreas Butz. 2014. Activity Sculptures: Exploring the Impact of Physical Visualizations on Running Activity. IEEE Transactions on Visualization and Computer Graphics 20, 12(2014), 2201–2210. https://doi.org/10.1109/TVCG.2014.2352953",
      "doi": ""
    },
    {
      "text": "Faisal Taher, Yvonne Jansen, Jonathan Woodruff, John Hardy, Kasper Hornbæk, and Jason Alexander. 2017. Investigating the Use of a Dynamic Physical Bar Chart for Data Exploration and Presentation. IEEE Transactions on Visualization and Computer Graphics 23, 1(2017), 451–460. https://doi.org/10.1109/TVCG.2016.2598498",
      "doi": "10.1109/TVCG.2016.2598498"
    },
    {
      "text": "Teoman Ulusoy, Kurtis Thorvald Danyluk, and Wesley J Willett. 2018. Beyond the Physical: Examining Scale and Annotation in Virtual Reality Visualizations. Technical Report. Department of Computer Science, University of Calgary.",
      "doi": ""
    },
    {
      "text": "Annemiek Veldhuis, Rong-Hao Liang, and Tilde Bekker. 2020. CoDa: Collaborative Data Interpretation Through an Interactive Tangible Scatterplot. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction (Sydney NSW, Australia) (TEI ’20). ACM, New York, NY, USA, 323–336. https://doi.org/10.1145/3374920.3374934",
      "doi": "10.1145/3374920.3374934"
    },
    {
      "text": "Eliane Zambon Victorelli, Julio Cesar Dos Reis, Heiko Hornung, and Alysson Bolognesi Prado. 2020. Understanding human-data interaction: Literature review and recommendations for design. International Journal of Human-Computer Studies 134 (2020), 13–32.",
      "doi": ""
    },
    {
      "text": "Frank Wagner, Alexander Wolff, Vikas Kapoor, and Tycho Strijk. 2001. Three rules suffice for good label placement. Algorithmica 30, 2 (2001), 334–349.",
      "doi": "10.1007/s00453-001-0009-7"
    },
    {
      "text": "Colin Ware. 2019. Information Visualization: Perception for Design. Morgan Kaufmann, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Daniel Wigdor and Ravin Balakrishnan. 2005. Empirical Investigation into the Effect of Orientation on Text Readability in Tabletop Displays. In ECSCW 2005, Hans Gellersen, Kjeld Schmidt, Michel Beaudouin-Lafon, and Wendy Mackay (Eds.). Springer, 205–224.",
      "doi": "10.5555/1242029.1242040"
    },
    {
      "text": "Tiffany Wun, Jennifer Payne, Samuel Huron, and Sheelagh Carpendale. 2016. Comparing Bar Chart Authoring with Microsoft Excel and Tangible Tiles. Computer Graphics Forum 35, 3 (2016), 111–120. https://doi.org/10.1111/cgf.12887 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/cgf.12887",
      "doi": ""
    },
    {
      "text": "Deyue Yu, Heejung Park, David Gerold, and Gordon E Legge. 2010. Comparing reading speed for horizontal and vertical English text. Journal of vision 10, 2 (2010), 21–21.",
      "doi": ""
    },
    {
      "text": "Jack Zhao and Andrew Vande Moere. 2008. Embodiment in Data Sculpture: A Model of the Physical Visualization of Information. In Proceedings of the 3rd International Conference on Digital Interactive Media in Entertainment and Arts (Athens, Greece) (DIMEA ’08). ACM, New York, NY, USA, 343–350. https://doi.org/10.1145/1413634.1413696",
      "doi": "10.1145/1413634.1413696"
    }
  ]
}