{
  "doi": "10.1145/3491102.3502053",
  "title": "Putting scientific results in perspective: Improving the communication of standardized effect sizes",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "How do people form impressions of effect size when reading scientific results? We present a series of studies on how people perceive treatment effectiveness when scientific results are summarized in various ways. We first show that a prevalent form of summarizing results—presenting mean differences between conditions—can lead to significant overestimation of treatment effectiveness, and that including confidence intervals can exacerbate the problem. We attempt to remedy potential misperceptions by displaying information about variability in individual outcomes in different formats: statements about variance, a quantitative measure of standardized effect size, and analogies that compare the treatment with more familiar effects (e.g., height differences by age). We find that all of these formats substantially reduce potential misperceptions and that analogies can be as helpful as more precise quantitative statements of standardized effect size. These findings can be applied by scientists in HCI and beyond to improve the communication of results to laypeople.",
  "tags": [
    "perception",
    "visualization",
    "effect size",
    "statistics"
  ],
  "authors": [
    {
      "name": "Yea-Seul Kim",
      "institution": "Computer Sciences, University of Wisconsin-Madison, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240335",
      "orcid": "0000-0003-1854-1537"
    },
    {
      "name": "Jake M Hofman",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436601976",
      "orcid": "missing"
    },
    {
      "name": "Daniel G Goldstein",
      "institution": "Microsoft Research, United States",
      "img": "/do/10.1145/contrib-81485649647/rel-imgonly/dangoldstein_badge1.jpg",
      "acmid": "81485649647",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. Transparent Statistics in HCI. https://transparentstatistics.org. Accessed: 2020-09-14.",
      "doi": ""
    },
    {
      "text": "American Psychological Association 1996. Task force on statistical inference initial report. Washington, DC: American Psychological Association PsycNET (1996).",
      "doi": ""
    },
    {
      "text": "American Psychological Association 2010. Publication manual of the American psychological association Washington. DC: American Psychological Association(2010).",
      "doi": ""
    },
    {
      "text": "Thom Baguley. 2009. Standardized or simple effect size: What should be reported?British journal of psychology 100, 3 (2009), 603–617.",
      "doi": ""
    },
    {
      "text": "Thomas Baguley. 2012. Serious stats: A guide to advanced statistics for the behavioral sciences. Macmillan International Higher Education.",
      "doi": ""
    },
    {
      "text": "Mohan V Bala, Josephine A Mauskopf, and Lisa L Wood. 1999. Willingness to pay as a measure of health benefits. Pharmacoeconomics 15, 1 (1999), 9–18.",
      "doi": ""
    },
    {
      "text": "Pablo J Barrio, Daniel G Goldstein, and Jake M Hofman. 2016. Improving comprehension of numbers in the news. In Proceedings of the 2016 chi conference on human factors in computing systems. ACM, 2729–2739.",
      "doi": "10.1145/2858036.2858510"
    },
    {
      "text": "Melanie L Bell, Mallorie H Fiero, Haryana M Dhillon, Victoria J Bray, and Janette L Vardy. 2017. Statistical controversies in cancer research: using standardized effect size graphs to enhance interpretability of cancer-related clinical trials with patient-reported outcomes. Annals of Oncology 28, 8 (2017), 1730–1733.",
      "doi": ""
    },
    {
      "text": "Joseph Berkson. 1938. Some difficulties of interpretation encountered in the application of the chi-square test. J. Amer. Statist. Assoc. 33, 203 (1938), 526–536.",
      "doi": ""
    },
    {
      "text": "Lonni Besançon and Pierre Dragicevic. 2019. The continued prevalence of dichotomous inferences at CHI. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3290607.3310432"
    },
    {
      "text": "Google BigQuery. 2019. Global Surface Summary of the Day Weather Data. https://console.cloud.google.com/bigquery?project=api-project-821773148614&folder&organizationId&p=bigquery-public-data&d=noaa_gsod&page=dataset",
      "doi": ""
    },
    {
      "text": "Frank A Bosco, Herman Aguinis, Kulraj Singh, James G Field, and Charles A Pierce. 2015. Correlational effect size benchmarks.Journal of Applied Psychology 100, 2 (2015), 431.",
      "doi": ""
    },
    {
      "text": "Margaret E Brooks, Dev K Dalal, and Kevin P Nolan. 2014. Are common language effect sizes easier to understand than traditional effect sizes?Journal of Applied Psychology 99, 2 (2014), 332.",
      "doi": ""
    },
    {
      "text": "Katherine S Button, John PA Ioannidis, Claire Mokrysz, Brian A Nosek, Jonathan Flint, Emma SJ Robinson, and Marcus R Munafò. 2013. Power failure: why small sample size undermines the reliability of neuroscience. Nature Reviews Neuroscience 14, 5 (2013), 365.",
      "doi": ""
    },
    {
      "text": "Paul Cairns. 2007. HCI... not as it should be: inferential statistics in HCI research. In Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI... but not as we know it-Volume 1. British Computer Society, 195–201.",
      "doi": ""
    },
    {
      "text": "Colin F Camerer, Anna Dreber, Felix Holzmeister, Teck-Hua Ho, Jürgen Huber, Magnus Johannesson, Michael Kirchler, Gideon Nave, Brian A Nosek, Thomas Pfeiffer, 2018. Evaluating the replicability of social science experiments in Nature and Science between 2010 and 2015. Nature Human Behaviour 2, 9 (2018), 637.",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, and Alan Dix. 2018. Hark no more: on the preregistration of chi experiments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 141.",
      "doi": "10.1145/3173574.3173715"
    },
    {
      "text": "Robert Coe. 2002. It’s the effect size, stupid: What effect size is and why it is important. (2002).",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1988. Statistical power analysis for the social sciences. (1988).",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1992. A power primer.Psychological bulletin 112, 1 (1992), 155.",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 2013. Statistical power analysis for the behavioral sciences. Routledge.",
      "doi": ""
    },
    {
      "text": "Open Science Collaboration 2015. Estimating the reproducibility of psychological science. Science 349, 6251 (2015), aac4716.",
      "doi": ""
    },
    {
      "text": "Geoff Cumming, Fiona Fidler, Martine Leonard, Pavel Kalinowski, Ashton Christiansen, Anita Kleinig, Jessica Lo, Natalie McMenamin, and Sarah Wilson. 2007. Statistical reform in psychology: Is anything changing?Psychological science 18, 3 (2007), 230–232.",
      "doi": ""
    },
    {
      "text": "Jasmine M DeJesus, Maureen A Callanan, Graciela Solis, and Susan A Gelman. 2019. Generic language in scientific communication. Proceedings of the National Academy of Sciences 116, 37(2019), 18370–18377.",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic. 2016. Fair statistical communication in HCI. In Modern Statistical Methods for HCI. Springer, 291–330.",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic. 2018. Can we call mean differences “effect sizes”?https://transparentstatistics.org/2018/07/05/meanings-effect-size/",
      "doi": ""
    },
    {
      "text": "William P Dunlap. 1994. Generalizing the common language effect size indicator to bivariate normal correlations.Psychological Bulletin 116, 3 (1994), 509.",
      "doi": ""
    },
    {
      "text": "Mark D Dunlop and Mark Baillie. 2009. Paper rejected (p> 0.05): an introduction to the debate on appropriateness of null-hypothesis testing. International Journal of Mobile Human Computer Interaction (IJMHCI) 1, 3(2009), 86–93.",
      "doi": ""
    },
    {
      "text": "Alexander Eiselmayer, Chat Wacharamanotham, Michel Beaudouin-Lafon, and Wendy E Mackay. 2019. Touchstone2: An Interactive Environment for Exploring Trade-offs in HCI Experiment Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 217.",
      "doi": "10.1145/3290605.3300447"
    },
    {
      "text": "Paul D Ellis. 2010. The essential guide to effect sizes: Statistical power, meta-analysis, and the interpretation of research results. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "National Center for Health Statistics. 2016. Anthropometric Reference Data for Children and Adults: United States, 2011 to 2014. https://www.cdc.gov/nchs/data/series/sr_03/sr03_039.pdf",
      "doi": ""
    },
    {
      "text": "David C Funder and Daniel J Ozer. 2019. Evaluating effect size in psychological research: Sense and nonsense. Advances in Methods and Practices in Psychological Science 2, 2(2019), 156–168.",
      "doi": ""
    },
    {
      "text": "Louise Hartley, Nadine Flowers, Jennifer Holmes, Aileen Clarke, Saverio Stranges, Lee Hooper, and Karen Rees. 2013. Green and black tea for the primary prevention of cardiovascular disease. Cochrane Database of Systematic Reviews6 (2013).",
      "doi": ""
    },
    {
      "text": "Ulrich Hoffrage and Gerd Gigerenzer. 1998. Using natural frequencies to improve diagnostic inferences. Academic medicine 73, 5 (1998), 538–540.",
      "doi": ""
    },
    {
      "text": "Jake M Hofman, Daniel G Goldstein, and Jessica Hullman. 2020. How visualizing inferential uncertainty can mislead readers about treatment effects in scientific results. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376454"
    },
    {
      "text": "Jessica Hullman, Yea-Seul Kim, Francis Nguyen, Lauren Speers, and Maneesh Agrawala. 2018. Improving Comprehension of Measurements Using Concrete Re-Expression Strategies. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 34.",
      "doi": "10.1145/3173574.3173608"
    },
    {
      "text": "John E Hunter and Frank L Schmidt. 2004. Methods of meta-analysis: Correcting error and bias in research findings. Sage.",
      "doi": ""
    },
    {
      "text": "Transparent Statistics in Human-Computer Interaction Working Group. 2019. Transparent Statistics Guidelines. https://doi.org/10.5281/zenodo.2226616",
      "doi": ""
    },
    {
      "text": "Bob Ives. 2003. Effect size use in studies of learning disabilities. Journal of Learning Disabilities 36, 6 (2003), 490–504.",
      "doi": ""
    },
    {
      "text": "Eunice Jun, Maureen Daum, Jared Roesch, Sarah E Chasins, Emery D Berger, Rene Just, and Katharina Reinecke. 2019. Tea: A High-level Language and Runtime System for Automating Statistical Analysis. arXiv preprint arXiv:1904.05387(2019).",
      "doi": ""
    },
    {
      "text": "Maurits Kaptein and Judy Robertson. 2012. Rethinking statistical analysis methods for CHI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1105–1114.",
      "doi": "10.1145/2207676.2208557"
    },
    {
      "text": "Matthew Kay, Steve Haroz, Shion Guha, Pierre Dragicevic, and Chat Wacharamanotham. 2017. Moving transparent statistics forward at CHI. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 534–541.",
      "doi": "10.1145/3027063.3027084"
    },
    {
      "text": "Matthew Kay, Gregory L Nelson, and Eric B Hekler. 2016. Researcher-centered design of statistics: Why Bayesian statistics better fit the culture and incentives of HCI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 4521–4532.",
      "doi": "10.1145/2858036.2858465"
    },
    {
      "text": "Ken Kelley and Kristopher J Preacher. 2012. On effect size.Psychological methods 17, 2 (2012), 137.",
      "doi": ""
    },
    {
      "text": "Yea-Seul Kim, Jessica Hullman, and Maneesh Agrawala. 2016. Generating personalized spatial analogies for distances and areas. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 38–48.",
      "doi": "10.1145/2858036.2858440"
    },
    {
      "text": "Roger E Kirk. 1996. Practical significance: A concept whose time has come. Educational and psychological measurement 56, 5 (1996), 746–759.",
      "doi": ""
    },
    {
      "text": "Geoffrey R Loftus. 1996. Psychology will be a much better science when we change the way we analyze data. Current directions in psychological science 5, 6 (1996), 161–171.",
      "doi": ""
    },
    {
      "text": "David T Lykken. 1968. Statistical significance in psychological research.Psychological bulletin 70, 3p1 (1968), 151.",
      "doi": ""
    },
    {
      "text": "Wendy E Mackay, Caroline Appert, Michel Beaudouin-Lafon, Olivier Chapuis, Yangzhou Du, Jean-Daniel Fekete, and Yves Guiard. 2007. Touchstone: exploratory design of experiments. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 1425–1434.",
      "doi": "10.1145/1240624.1240840"
    },
    {
      "text": "Jean-Bernard Martens. 2019. Insights in Experimental Data through Intuitive and Interactive Statistics. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, C09.",
      "doi": "10.1145/3290607.3298808"
    },
    {
      "text": "Kenneth O McGraw and SP Wong. 1992. A common language effect size statistic.Psychological bulletin 111, 2 (1992), 361.",
      "doi": ""
    },
    {
      "text": "Paul E Meehl. 1992. Theoretical risks and tabular asterisks: Sir Karl, Sir Ronald, and the slow progress of soft psychology.(1992).",
      "doi": ""
    },
    {
      "text": "Ted A Paterson, PD Harms, Piers Steel, and Marcus Credé. 2016. An assessment of the magnitude of effect sizes: Evidence from 30 years of meta-analysis in management. Journal of Leadership & Organizational Studies 23, 1 (2016), 66–81.",
      "doi": ""
    },
    {
      "text": "Jolynn Pek and David B Flora. 2018. Reporting effect sizes in original psychological research: A discussion and tutorial.Psychological methods 23, 2 (2018), 208.",
      "doi": ""
    },
    {
      "text": "Christopher Riederer, Jake M Hofman, and Daniel G Goldstein. 2018. To put that in perspective: Generating analogies that make numbers easier to understand. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 548.",
      "doi": "10.1145/3173574.3174122"
    },
    {
      "text": "Judy Robertson and Maurits Kaptein. 2016. Modern statistical methods for HCI. Springer.",
      "doi": "10.5555/2927492"
    },
    {
      "text": "Robert Rosenthal and Donald B Rubin. 1982. A simple, general purpose display of magnitude of experimental effect.Journal of educational psychology 74, 2 (1982), 166.",
      "doi": ""
    },
    {
      "text": "Patricia Snyder and Stephen Lawson. 1993. Evaluating results using corrected and uncorrected effect size estimates. The Journal of Experimental Education 61, 4 (1993), 334–349.",
      "doi": ""
    },
    {
      "text": "Gail M Sullivan and Richard Feinn. 2012. Using effect size or why the P value is not enough. Journal of graduate medical education 4, 3 (2012), 279–282.",
      "doi": ""
    },
    {
      "text": "Radu-Daniel Vatavu and Jacob O Wobbrock. 2015. Formalizing agreement analysis for elicitation studies: New measures, significance test, and toolkit. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1325–1334.",
      "doi": "10.1145/2702123.2702223"
    },
    {
      "text": "Chat Wacharamanotham, Krishna Subramanian, Sarah Theres Völkel, and Jan Borchers. 2015. Statsplorer: Guiding novices in statistical analysis. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2693–2702.",
      "doi": "10.1145/2702123.2702347"
    }
  ]
}