{
  "doi": "10.1145/3491102.3501848",
  "title": "Audio Matters Too: How Audial Avatar Customization Enhances Visual Avatar Customization",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-27",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Avatar customization is known to positively affect crucial outcomes in numerous domains. However, it is unknown whether audial customization can confer the same benefits as visual customization. We conducted a preregistered 2 x 2 (visual choice vs. visual assignment x audial choice vs. audial assignment) study in a Java programming game. Participants with visual choice experienced higher avatar identification and autonomy. Participants with audial choice experienced higher avatar identification and autonomy, but only within the group of participants who had visual choice available. Visual choice led to an increase in time spent, and indirectly led to increases in intrinsic motivation, immersion, time spent, future play motivation, and likelihood of game recommendation. Audial choice moderated the majority of these effects. Our results suggest that audial customization plays an important enhancing role vis-à-vis visual customization. However, audial customization appears to have a weaker effect compared to visual customization. We discuss the implications for avatar customization more generally across digital applications.",
  "tags": [
    "Games",
    "Identification",
    "Customization",
    "Voice",
    "Player Experience",
    "Audio",
    "Avatar"
  ],
  "authors": [
    {
      "name": "Dominic Kao",
      "institution": "Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658749101",
      "orcid": "missing"
    },
    {
      "name": "Rabindra Ratan",
      "institution": "Michigan State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87259618557",
      "orcid": "missing"
    },
    {
      "name": "Christos Mousas",
      "institution": "Purdue University, United States",
      "img": "/do/10.1145/contrib-99659580285/rel-imgonly/christosmjt.jpg",
      "acmid": "99659580285",
      "orcid": "missing"
    },
    {
      "name": "Amogh Joshi",
      "institution": "Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659901773",
      "orcid": "missing"
    },
    {
      "name": "Edward F. Melcer",
      "institution": "UC Santa Cruz, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558236056",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2021. UMA 2 - Unity Multipurpose Avatar: 3D Characters: Unity asset store. https://assetstore.unity.com/packages/3d/characters/uma-2-unity-multipurpose-avatar-35611",
      "doi": ""
    },
    {
      "text": "Vero Vanden Abeele, Katta Spiel, Lennart Nacke, Daniel Johnson, and Kathrin Gerling. 2020. Development and validation of the player experience inventory: A scale to measure player experiences at the level of functional and psychosocial consequences. International Journal of Human Computer Studies 135, January 2019(2020), 102370. https://doi.org/10.1016/j.ijhcs.2019.102370",
      "doi": "10.1016/j.ijhcs.2019.102370"
    },
    {
      "text": "Alexandra Adkins, Kristopher Kohm, Rui Zhang, and Nicholas Gustafson. 2020. Lost in Spaze: An Audio Maze Game for the Visually Impaired. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–6. https://doi.org/10.1145/3334480.3381660",
      "doi": ""
    },
    {
      "text": "Lena Fanya Aeschbach, Sebastian Andrea Caesar Perrig, Lorena Weder, Klaus Opwis, and Florian Brühlmann. 2021. A Systematic Literature Review of Transparency in Measurement Reporting at CHI PLAY. (2021).",
      "doi": ""
    },
    {
      "text": "June Ahn, Mega Subramaniam, Elizabeth Bonsignore, Anthony Pellicone, Amanda Waugh, and Jason Yip. 2014. I Want to be a game designer or scientist: Connected learning and developing identities with urban, African-American youth. Boulder, CO: International Society of the Learning Sciences.",
      "doi": ""
    },
    {
      "text": "Johnie J. Allen and Craig A. Anderson. 2021. Does avatar identification make unjustified video game violence more morally consequential?Media Psychology 24, 2 (2021), 236–258. https://doi.org/10.1080/15213269.2019.1683030",
      "doi": ""
    },
    {
      "text": "Fraser Allison, Marcus Carter, and Martin Gibbs. 2020. Word Play: A History of Voice Interaction in Digital Games. Games and Culture 15, 2 (March 2020), 91–113. https://doi.org/10.1177/1555412017746305",
      "doi": ""
    },
    {
      "text": "Fraser Allison, Marcus Carter, Martin Gibbs, and Wally Smith. 2018. Design Patterns for Voice Interaction in Games. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play. ACM, Melbourne VIC Australia, 5–17. https://doi.org/10.1145/3242671.3242712",
      "doi": "10.1145/3242671.3242712"
    },
    {
      "text": "Aishat Aloba, Gianne Flores, Jaida Langham, Zari McFadden, John Bell, Nikita Dagar, Shaghayegh Esmaeili, and Lisa Anthony. 2020. Toward Exploratory Design with Stakeholders for Understanding Exergame Design. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": ""
    },
    {
      "text": "Amazon. 2020. Alexa. https://developer.amazon.com/en-US/alexa",
      "doi": ""
    },
    {
      "text": "Autodesk.com. 2021. Welcome to Autodesk® character generator. https://charactergenerator.autodesk.com/",
      "doi": ""
    },
    {
      "text": "Laura Aymerich-Franch, Cody Karutz, and Jeremy N Bailenson. 2012. Effects of Facial and Voice Similarity on Presence in a Public Speaking Virtual Environment. In Proceedings of the International Society for Presence Research Annual Conference. 24–26.",
      "doi": ""
    },
    {
      "text": "Laura Aymerich-Franch, René F Kizilcec, and Jeremy N Bailenson. 2014. The relationship between virtual self similarity and social anxiety. Frontiers in human neuroscience 8 (2014), 944.",
      "doi": ""
    },
    {
      "text": "Rachel Bailey, Kevin Wise, and Paul Bolls. 2009. How Avatar Customizability Affects Children’s Arousal and Subjective Presence During Junk Food–Sponsored Online Video Games. CyberPsychology & Behavior 12, 3 (June 2009), 277–283. https://doi.org/10.1089/cpb.2008.0292",
      "doi": ""
    },
    {
      "text": "Jaime Banks and Nicholas David Bowman. 2016. Avatars are (sometimes) people too: Linguistic indicators of parasocial and social ties in player–avatar relationships. New Media & Society 18, 7 (2016), 1257–1276.",
      "doi": ""
    },
    {
      "text": "Erin Beneteau, Ashley Boone, Yuxing Wu, Julie A Kientz, Jason Yip, and Alexis Hiniker. 2020. Parenting with Alexa: exploring the introduction of smart speakers on family dynamics. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3313831.3376344"
    },
    {
      "text": "Erin Beneteau, Olivia K Richards, Mingrui Zhang, Julie A Kientz, Jason Yip, and Alexis Hiniker. 2019. Communication breakdowns between families and Alexa. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300473"
    },
    {
      "text": "Adam J Berinsky, Gregory A Huber, and Gabriel S Lenz. 2012. Evaluating online labor markets for experimental research: Amazon. com’s Mechanical Turk. Political Analysis 20, 3 (2012), 351–368.",
      "doi": ""
    },
    {
      "text": "Axel Berndt. 2011. Diegetic Music: New Interactive Experiences. In Game Sound Technology and Player Interaction: Concepts and Developments. IGI Global, 60–77.",
      "doi": ""
    },
    {
      "text": "Axel Berndt and Knut Hartmann. 2008. The functions of music in interactive media. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 5334 LNCS (2008), 126–131. https://doi.org/10.1007/978-3-540-89454-4_19",
      "doi": "10.1007/978-3-540-89454-4_19"
    },
    {
      "text": "William D Berry. 1993. Understanding regression assumptions. Vol. 92. Sage.",
      "doi": ""
    },
    {
      "text": "K Bessière, AF Seay, and S Kiesler. 2007. The ideal elf: Identity exploration in World of Warcraft. CyberPsychology & Behavior(2007). http://online.liebertpub.com/doi/abs/10.1089/cpb.2007.9994",
      "doi": ""
    },
    {
      "text": "Bethesda Game Studios. 2011. The Elder Scrolls V: Skyrim. Game [Multiple Platforms]. Bethesda Softworks, Maryland, USA.",
      "doi": ""
    },
    {
      "text": "Bethesda Game Studios. 2015. Fallout 4. Game [Multiple Platforms]. Bethesda Softworks, Maryland, USA.",
      "doi": ""
    },
    {
      "text": "Max V. Birk, Cheralyn Atkins, Jason T. Bowey, and Regan L. Mandryk. 2016. Fostering Intrinsic Motivation through Avatar Identification in Digital Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 2982–2995. https://doi.org/10.1145/2858036.2858062",
      "doi": "10.1145/2858036.2858062"
    },
    {
      "text": "Max V. Birk and Regan L. Mandryk. 2018. Combating Attrition in Digital Self-Improvement Programs Using Avatar Customization. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC Canada, 1–15. https://doi.org/10.1145/3173574.3174234",
      "doi": "10.1145/3173574.3174234"
    },
    {
      "text": "Max V. Birk, Regan L. Mandryk, Matthew K. Miller, and Kathrin M. Gerling. 2015. How self-esteem shapes our interactions with play technologies. In CHI PLAY 2015 - Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play. https://doi.org/10.1145/2793107.2793111",
      "doi": "10.1145/2793107.2793111"
    },
    {
      "text": "María J. Blanca, Rafael Alarcón, Jaume Arnau, Roser Bono, and Rebecca Bendayan. 2017. Non-normal data: Is ANOVA still a valid option?Psicothema (2017). https://doi.org/10.7334/psicothema2016.383",
      "doi": ""
    },
    {
      "text": "Elizabeth Bonsignore, Derek Hansen, Anthony Pellicone, June Ahn, Kari Kraus, Steven Shumway, Kathryn Kaczmarek, Jeff Parkin, Jared Cardon, Jeff Sheets, 2016. Traversing transmedia together: Co-designing an educational alternate reality game for teens, with teens. In Proceedings of the The 15th International Conference on Interaction Design and Children. 11–24.",
      "doi": "10.1145/2930674.2930712"
    },
    {
      "text": "Barbara Borkowska and Boguslaw Pawlowski. 2011. Female voice frequency in the context of dominance and attractiveness perception. Animal Behaviour 82, 1 (2011), 55–59. https://doi.org/10.1016/j.anbehav.2011.03.024",
      "doi": ""
    },
    {
      "text": "Florian Brühlmann and Elisa D Mekler. 2018. Surveys in games user research. Games User Research (2018), 141–162.",
      "doi": ""
    },
    {
      "text": "Amanda Buddemeyer, Leshell Hatley, Angela Stewart, Jaemarie Solyst, Amy Ogan, and Erin Walker. 2021. Agentic Engagement with a Programmable Dialog System. In Proceedings of the 17th ACM Conference on International Computing Education Research. 423–424.",
      "doi": "10.1145/3446871.3469782"
    },
    {
      "text": "Michael Buhrmester, Tracy Kwang, and Samuel D Gosling. 2011. Amazon’s Mechanical Turk: A new source of inexpensive, yet high-quality, data?Perspectives on psychological science 6, 1 (2011), 3–5.",
      "doi": ""
    },
    {
      "text": "Stéphanie Buisine, Jérôme Guegan, Jessy Barré, Frédéric Segonds, and Améziane Aoussat. 2016. Using Avatars to Tailor Ideation Process to Innovation Strategy. Cognition, Technology & Work 18, 3 (Aug. 2016), 583–594. https://doi.org/10.1007/s10111-016-0378-y",
      "doi": "10.1007/s10111-016-0378-y"
    },
    {
      "text": "Su Cai, Xu Wang, and Feng-Kuang Chiang. 2014. A case study of Augmented Reality simulation system application in a chemistry course. Computers in human behavior 37 (2014), 31–40.",
      "doi": ""
    },
    {
      "text": "Capcom. 2018. Monster Hunter: World. Game [Multiple Platforms].",
      "doi": ""
    },
    {
      "text": "Marcus Carter, Fraser Allison, John Downs, and Martin Gibbs. 2015. Player Identity Dissonance and Voice Interaction in Games. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play. ACM, London United Kingdom, 265–269. https://doi.org/10.1145/2793107.2793144",
      "doi": "10.1145/2793107.2793144"
    },
    {
      "text": "CD Projekt Red. 2020. Cyberpunk 2077. Game [Multiple Platforms]. CD Projekt, Höfen, Austria.",
      "doi": ""
    },
    {
      "text": "Jesse Chandler and Danielle Shapiro. 2016. Conducting clinical research using crowdsourced convenience samples. Annual Review of Clinical Psychology 12 (2016).",
      "doi": ""
    },
    {
      "text": "Minsuk Chang, Anh Truong, Oliver Wang, Maneesh Agrawala, and Juho Kim. 2019. How to design voice based navigation for how-to videos. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3290605.3300931"
    },
    {
      "text": "Xinyue Chen, Si Chen, Xu Wang, and Yun Huang. 2021. ” I was afraid, but now I enjoy being a streamer!” Understanding the Challenges and Prospects of Using Live Streaming for Online Education. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–32.",
      "doi": ""
    },
    {
      "text": "Min Chi, Pamela Jordan, and Kurt VanLehn. 2014. When is tutorial dialogue more effective than step-based tutoring?. In International Conference on Intelligent Tutoring Systems. Springer, 210–219.",
      "doi": "10.1007/978-3-319-07221-0_25"
    },
    {
      "text": "Terry L Childers and Michael J Houston. 1984. Conditions for a picture-superiority effect on consumer memory. Journal of consumer research 11, 2 (1984), 643–654.",
      "doi": ""
    },
    {
      "text": "Klimmt Christoph, Hefner Dorothée, and Vorderer Peter. 2009. The Video Game Experience as “True” Identification: A Theory of Enjoyable Alterations of Players’ Self-Perception. Communication Theory 19, 4 (Nov. 2009), 351–373. https://doi.org/10.1111/j.1468-2885.2009.01347.x",
      "doi": ""
    },
    {
      "text": "Robert B. Cialdini, Wilhelmina Wosinska, Daniel W. Barrett, Jonathan Butner, and Malgorzata Gornik-Durose. 1999. Compliance with a request in two cultures: The differential influence of social proof and commitment/consistency on collectivists and individualists. Personality and Social Psychology Bulletin 25, 10 (1999), 1242–1253. https://doi.org/10.1177/0146167299258006",
      "doi": ""
    },
    {
      "text": "Jonathan Cohen. 2001. Defining Identification: A Theoretical Look at the Identification of Audiences With Media Characters. Mass Communication and Society 4, 3 (Aug. 2001), 245–264. https://doi.org/10.1207/S15327825MCS0403_01",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 2013. Statistical power analysis for the behavioral sciences. Routledge.",
      "doi": ""
    },
    {
      "text": "Michael A Cohen, Todd S Horowitz, and Jeremy M Wolfe. 2009. Auditory recognition memory is inferior to visual recognition memory. Proceedings of the National Academy of Sciences 106, 14(2009), 6008–6010.",
      "doi": ""
    },
    {
      "text": "Karen Collins. 2008. Game sound: an introduction to the history, theory, and practice of video game music and sound design. Mit Press.",
      "doi": ""
    },
    {
      "text": "Luca Colombo, Monica Landoni, and Elisa Rubegni. 2014. Design guidelines for more engaging electronic books: insights from a cooperative inquiry study. In Proceedings of the 2014 conference on Interaction design and children. 281–284.",
      "doi": "10.1145/2593968.2610472"
    },
    {
      "text": "Mia Consalvo. 2003. It’s a Queer World after All: Studying The Sims and Sexuality. Glaad.",
      "doi": ""
    },
    {
      "text": "Francisco Cribari-Neto. 2004. Asymptotic inference under heteroskedasticity of unknown form. Computational Statistics and Data Analysis 45, 2 (2004), 215–233. https://doi.org/10.1016/S0167-9473(02)00366-3",
      "doi": ""
    },
    {
      "text": "Crystal Dynamics. 2004. World of Warcraft. Game [Multiple Platforms]. Blizzard Entertainment, California, USA.",
      "doi": ""
    },
    {
      "text": "Crystal Dynamics. 2013. Tomb Raider. Game [Multiple Platforms]. Eidos Interactive (Square Enix), Tokyo, Japan.",
      "doi": ""
    },
    {
      "text": "James J. Cummings and Jeremy N. Bailenson. 2016. How Immersive Is Enough? A Meta-Analysis of the Effect of Immersive Technology on User Presence. Media Psychology 19, 2 (2016), 272–309. https://doi.org/10.1080/15213269.2015.1015740",
      "doi": ""
    },
    {
      "text": "Alwin de Rooij, Sarah van der Land, and Shelly van Erp. 2017. The Creative Proteus Effect: How Self-Similarity, Embodiment, and Priming of Creative Stereotypes with Avatars Influences Creative Ideation. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition. ACM, Singapore Singapore, 232–236. https://doi.org/10.1145/3059454.3078856",
      "doi": ""
    },
    {
      "text": "Martin J Dechant, Max V Birk, Youssef Shiban, Knut Schnell, and Regan L Mandryk. 2021. How Avatar Customization Affects Fear in a Game-based Digital Exposure Task for Social Anxiety. CHI PLAY ’21 (2021).",
      "doi": ""
    },
    {
      "text": "Mats Deutschmann, Anders Steinvall, and Anna Lagerström. 2011. Gender-Bending in Virtual Space: Using Voice-Morphing in Second Life to Raise Sociolinguistic Gender Awareness. In V-Lang International Conference, Warsaw, 17th November 2011. Warsaw Academy of Computer Science, Management and Administration, 54–61.",
      "doi": ""
    },
    {
      "text": "Igor Dolgov, William J Graves, Matthew R Nearents, Jeremy D Schwark, and C Brooks Volkman. 2014. Effects of cooperative gaming and avatar customization on subsequent spontaneous helping behavior. Computers in human behavior 33 (2014), 49–55.",
      "doi": ""
    },
    {
      "text": "Sebastian Domsch. 2017. Dialogue in video games. In Dialogue across Media. John Benjamins, 251–270.",
      "doi": ""
    },
    {
      "text": "Edward Downs, Nicholas D. Bowman, and Jaime Banks. 2019. A Polythetic Model of Player-Avatar Identification: Synthesizing Multiple Mechanisms.Psychology of Popular Media Culture 8, 3 (July 2019), 269–279. https://doi.org/10.1037/ppm0000170",
      "doi": ""
    },
    {
      "text": "Nicolas Ducheneaut, Ming-Hui Wen, Nicholas Yee, and Greg Wadley. 2009. Body and Mind: A Study of Avatar Personalization in Three Virtual Worlds. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Boston MA USA, 1151–1160. https://doi.org/10.1145/1518701.1518877",
      "doi": "10.1145/1518701.1518877"
    },
    {
      "text": "Nicolas Ducheneaut, Nicholas Yee, Eric Nickell, and Robert J. Moore. 2006. ”Alone Together?”: Exploring the Social Dynamics of Massively Multiplayer Online Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Montréal Québec Canada, 407–416. https://doi.org/10.1145/1124772.1124834",
      "doi": "10.1145/1124772.1124834"
    },
    {
      "text": "EA Black Box. 2007. Need for Speed: ProStreet. Game [Multiple Platforms]. Electronic Arts, California, USA.",
      "doi": ""
    },
    {
      "text": "EA Canada. 2013. FIFA 14. Game [Multiple Platforms]. EA Sports, California, USA.",
      "doi": ""
    },
    {
      "text": "Inger Ekman. 2008. Psychologically Motivated Techniques for Emotional Sound in Computer Games. Proc. AudioMostly 2008January 2008 (2008), 20–26. https://meaningfulnoise.wordpress.com/psychologically-motivated-techniques-for-emotional-sound-in-computer-games/",
      "doi": ""
    },
    {
      "text": "Inger Ekman. 2013. On the desire to not kill your players: Rethinking sound in pervasive and mixed reality games.FDG (2013), 142–149.",
      "doi": ""
    },
    {
      "text": "Electronic Arts. 2014. The Sims 4. Game [Multiple Platforms].",
      "doi": ""
    },
    {
      "text": "Andrew J. Elliot, Vincent Payen, Jeanick Brisswalter, Francois Cury, and Julian F. Thayer. 2011. A subtle threat cue, heart rate variability, and cognitive performance. Psychophysiology (2011). https://doi.org/10.1111/j.1469-8986.2011.01216.x",
      "doi": ""
    },
    {
      "text": "ESA. 2021. 2021 Essential Facts About the Video Game Industry. ESA Report 2021 (2021). https://www.theesa.com/resource/2021-essential-facts-about-the-video-game-industry/",
      "doi": ""
    },
    {
      "text": "European Broadcasting Union. 2011. Loudness normalisation and permitted maximum level of audio signals. (2011).",
      "doi": ""
    },
    {
      "text": "Min Fan, Uddipana Baishya, Elgin-Skye Mclaren, Alissa N Antle, Shubhra Sarker, and Amal Vincent. 2018. Block talks: a tangible and augmented reality toolkit for children to learn sentence construction. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3170427.3188576"
    },
    {
      "text": "Mary Flanagan. 1999. Mobile Identities, Digital Stars, and Post-Cinematic Selves. Wide Angle 21, 1 (1999), 77–93. https://doi.org/10.1353/wan.1999.0002",
      "doi": ""
    },
    {
      "text": "Guo Freeman and Divine Maloney. 2021. Body, avatar, and me: The presentation and perception of self in social virtual reality. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–27.",
      "doi": "10.1145/3432938"
    },
    {
      "text": "Johnny Friberg and Dan Gärdenfors. 2004. Audio Games: New Perspectives on Game Audio. In Proceedings of the 2004 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology - ACE ’04. ACM Press, Singapore, 148–154. https://doi.org/10.1145/1067343.1067361",
      "doi": "10.1145/1067343.1067361"
    },
    {
      "text": "FromSoftware. 2015. Bloodborne. [PlayStation 4]. Electronic Arts, California, USA.",
      "doi": ""
    },
    {
      "text": "Dilrukshi Gamage, Shantha Fernando, and Indika Perera. 2015. Quality of MOOCs: A review of literature on effectiveness and quality aspects. In 2015 8th International Conference on Ubi-Media Computing (UMEDIA). IEEE, 224–229.",
      "doi": ""
    },
    {
      "text": "Franco Eusébio Garcia and Vânia Paula de Almeida Neris. 2013. Design Guidelines for Audio Games. In Human-Computer Interaction. Applications and Services, David Hutchison, Takeo Kanade, Josef Kittler, Jon M. Kleinberg, Friedemann Mattern, John C. Mitchell, Moni Naor, Oscar Nierstrasz, C. Pandu Rangan, Bernhard Steffen, Madhu Sudan, Demetri Terzopoulos, Doug Tygar, Moshe Y. Vardi, Gerhard Weikum, and Masaaki Kurosu (Eds.). Vol. 8005. Springer Berlin Heidelberg, Berlin, Heidelberg, 229–238. https://doi.org/10.1007/978-3-642-39262-7_26",
      "doi": ""
    },
    {
      "text": "Radhika Garg, Hua Cui, and Yash Kapadia. 2021. “Learn, Use, and (Intermittently) Abandon”: Exploring the Practices of Early Smart Speaker Adopters in Urban India. (2021).",
      "doi": ""
    },
    {
      "text": "Radhika Garg and Subhasree Sengupta. 2020. Conversational Technologies for In-home Learning: Using Co-Design to Understand Children’s and Parents’ Perspectives. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3313831.3376631"
    },
    {
      "text": "Radhika Garg and Subhasree Sengupta. 2020. He is just like me: a study of the long-term use of smart speakers by parents and children. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 1 (2020), 1–24.",
      "doi": "10.1145/3381002"
    },
    {
      "text": "Marylou Pausewang Gelfer. 1988. Perceptual attributes of voice: Development and use of rating scales. Journal of Voice 2, 4 (1988), 320–326. https://doi.org/10.1016/S0892-1997(88)80024-9",
      "doi": ""
    },
    {
      "text": "Giovanni Ribeiro, Katja Rogers, Maximilian Altmeyer, Thomas Terkildsen, and Lennart E. Nacke. 2020. Game Atmosphere Effects of Audiovisual Thematic Cohesion on Player Experience and Psychophysiology. (2020). https://doi.org/10.1145/3410404.3414245",
      "doi": ""
    },
    {
      "text": "Timo Gnambs, Markus Appel, and Bernad Batinic. 2010. Color red in web-based knowledge testing. Computers in Human Behavior 26, 6 (2010), 1625–1631. https://doi.org/10.1016/j.chb.2010.06.010",
      "doi": "10.1016/j.chb.2010.06.010"
    },
    {
      "text": "Mark Grimshaw. 2007. Sound and Immersion in the First-Person Shooter. (2007).",
      "doi": ""
    },
    {
      "text": "Mark Grimshaw, Craig Lindley, and Lennart Nacke. 2008. Sound and immersion in the first-person shooter: Mixed measurement of the player’s sonic experience. In Audio Mostly-a conference on interaction with sound. www. audiomostly. com.",
      "doi": ""
    },
    {
      "text": "Jérôme Guegan, Stéphanie Buisine, Fabrice Mantelet, Nicolas Maranzana, and Frédéric Segonds. 2016. Avatar-Mediated Creativity: When Embodying Inventors Makes Engineers More Creative. Computers in Human Behavior 61 (Aug. 2016), 165–175. https://doi.org/10.1016/j.chb.2016.03.024",
      "doi": ""
    },
    {
      "text": "Perttu Hämäläinen, Teemu Mäki-Patola, Ville Pulkki, and Matti Airas. 2004. Musical Computer Games Played by Singing. In Proc. 7th Int. Conf. on Digital Audio Effects (DAFx’04), Naples.",
      "doi": ""
    },
    {
      "text": "Andrew F Hayes. 2017. Introduction to mediation, moderation, and conditional process analysis: A regression-based approach. Guilford publications.",
      "doi": ""
    },
    {
      "text": "Sylvie Hébert, Renée Béland, Odrée Dionne-Fournelle, Martine Crête, and Sonia J. Lupien. 2005. Physiological stress response to video-game playing: The contribution of built-in music. Life Sciences 76, 20 (2005), 2371–2380. https://doi.org/10.1016/j.lfs.2004.11.011",
      "doi": ""
    },
    {
      "text": "Dorothée Hefner, Christoph Klimmt, and Peter Vorderer. 2007. Identification with the Player Character as Determinant of Video Game Enjoyment. In Entertainment Computing - ICEC 2007. 39–48. https://doi.org/10.1007/978-3-540-74873-1_6",
      "doi": ""
    },
    {
      "text": "E Tory Higgins. 1987. Self-discrepancy: a theory relating self and affect.Psychological review 94, 3 (1987), 319.",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Amelia Wang, Jonathan Tran, Mingrui Ray Zhang, Jenny Radesky, Kiley Sobel, and Sungsoo Ray Hong. 2021. Can Conversational Agents Change the Way Children Talk to People?(2021).",
      "doi": ""
    },
    {
      "text": "David C. Hoaglin and Boris Iglewicz. 1987. Fine-Tuning Some Resistant Rules for Outlier Labeling. J. Amer. Statist. Assoc. 82, 400 (1987), 1147–1149. https://doi.org/10.1080/01621459.1987.10478551",
      "doi": ""
    },
    {
      "text": "Thomas Holmes. 2021. Defining Voice Design in Video Games. (2021).",
      "doi": ""
    },
    {
      "text": "John J Horton, David G Rand, and Richard J Zeckhauser. 2011. The online laboratory: Conducting experiments in a real labor market. Experimental Economics 14, 3 (2011), 399–425.",
      "doi": ""
    },
    {
      "text": "Rex Hsieh and Hisashi Sato. 2021. Evaluation of Avatar and Voice Transform in Programming E-Learning Lectures. Journal on Multimodal User Interfaces 15, 2 (June 2021), 121–129. https://doi.org/10.1007/s12193-020-00349-5",
      "doi": ""
    },
    {
      "text": "Bart Hulshof. 2013. The influence of colour and scent on people’s mood and cognitive performance in meeting rooms. Master ThesisMay(2013), 1–97.",
      "doi": ""
    },
    {
      "text": "Takeo Igarashi and John F Hughes. 2001. Voice as sound: using non-verbal voice input for interactive control. In Proceedings of the 14th annual ACM symposium on User interface software and technology. 155–156.",
      "doi": "10.1145/502348.502372"
    },
    {
      "text": "Katherine Isbister. 2006. Better game characters by design: A psychological approach. Elsevier/Morgan Kaufmann.",
      "doi": "10.5555/1207289"
    },
    {
      "text": "Jamie Banks, Nicholas David Bowman, and Joseph Wasserman. 2017. A Bard in the Hand: The Role of Materiality in Player-Character Relationships. Imagination, Cognition and Personality(2017). https://doi.org/10.1177/0276236617748130",
      "doi": ""
    },
    {
      "text": "Josh Jarrett. 2021. Gaming the Gift: The Affective Economy of League of Legends ‘Fair’ Free-to-Play Model. Journal of Consumer Culture 21, 1 (Feb. 2021), 102–119. https://doi.org/10.1177/1469540521993932",
      "doi": ""
    },
    {
      "text": "Colby Johanson and Regan L. Mandryk. 2016. Scaffolding Player Location Awareness through Audio Cues in First-Person Shooters. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16 (2016), 3450–3461. https://doi.org/10.1145/2858036.2858172",
      "doi": "10.1145/2858036.2858172"
    },
    {
      "text": "Daniel Johnson, M John Gardner, and Ryan Perry. 2018. Validation of two game experience scales: the Player Experience of Need Satisfaction (PENS) and Game Experience Questionnaire (GEQ). International Journal of Human - Computer Studies (2018). https://doi.org/10.1016/j.ijhcs.2018.05.003",
      "doi": ""
    },
    {
      "text": "Yasmin B. Kafai, Deborah A. Fields, and Melissa S. Cook. 2010. Your Second Selves: Player-Designed Avatars. Games and Culture 5, 1 (Jan. 2010), 23–42. https://doi.org/10.1177/1555412009351260",
      "doi": ""
    },
    {
      "text": "Yasmin B Kafai, Gabriela T Richard, and Brendesha M Tynes. 2017. Diversifying Barbie and Mortal Kombat: Intersectional perspectives and inclusive designs in gaming. Lulu. com.",
      "doi": ""
    },
    {
      "text": "Dominic Kao. 2019. The effects of anthropomorphic avatars vs. non-anthropomorphic avatars in a jumping game. In Proceedings of the 14th International Conference on the Foundations of Digital Games. 1–5.",
      "doi": "10.1145/3337722.3341829"
    },
    {
      "text": "Dominic Kao. 2019. Infinite Loot Box: A platform for simulating video game loot boxes. IEEE Transactions on Games 12, 2 (2019), 219–224.",
      "doi": ""
    },
    {
      "text": "Dominic Kao. 2019. JavaStrike: A Java Programming Engine Embedded in Virtual Worlds. In Proceedings of The Fourteenth International Conference on the Foundations of Digital Games.",
      "doi": "10.1145/3337722.3341828"
    },
    {
      "text": "Dominic Kao. 2020. The effects of juiciness in an action RPG. Entertainment Computing 34 (2020), 100359.",
      "doi": ""
    },
    {
      "text": "Dominic Kao and D. Fox Harrell. 2016. Exploring the Impact of Avatar Color on Game Experience in Educational Games. Proceedings of the 34th Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI 2016)(2016).",
      "doi": "10.1145/2851581.2892281"
    },
    {
      "text": "Dominic Kao and D. Fox Harrell. 2017. MazeStar: A Platform for Studying Virtual Identity and Computer Science Education. In Foundations of Digital Games.",
      "doi": ""
    },
    {
      "text": "Dominic Kao and D. Fox Harrell. 2018. The Effects of Badges and Avatar Identification on Play and Making in Educational Games. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC Canada, 1–19. https://doi.org/10.1145/3173574.3174174",
      "doi": "10.1145/3173574.3174174"
    },
    {
      "text": "Dominic Kao, Rabindra Ratan, Christos Mousas, and Alejandra Magana. 2021. The Effects of a Self-Similar Avatar Voice in Educational Games. CHI PLAY (2021).",
      "doi": ""
    },
    {
      "text": "Oleksandra Keehl and Edward Melcer. 2019. Radical tunes: exploring the impact of music on memorization of stroke order in logographic writing systems. In Proceedings of the 14th International Conference on the Foundations of Digital Games. 1–6.",
      "doi": "10.1145/3337722.3337764"
    },
    {
      "text": "Ahmed Kharrufa, David Leat, and Patrick Olivier. 2010. Digital mysteries: designing for learning at the tabletop. In ACM International Conference on Interactive Tabletops and Surfaces. 197–206.",
      "doi": "10.1145/1936652.1936689"
    },
    {
      "text": "Changsoo Kim, Sang-Gun Lee, and Minchoel Kang. 2012. I Became an Attractive Person in the Virtual World: Users’ Identification with Virtual Communities and Avatars. Computers in Human Behavior 28, 5 (Sept. 2012), 1663–1669. https://doi.org/10.1016/j.chb.2012.04.004",
      "doi": "10.1016/j.chb.2012.04.004"
    },
    {
      "text": "Soomin Kim, Joonhwan Lee, and Gahgene Gweon. 2019. Comparing data from chatbot and web surveys: Effects of platform and conversational style on survey response quality. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3290605.3300316"
    },
    {
      "text": "Tae Soo Kim, Seungsu Kim, Yoonseo Choi, and Juho Kim. 2021. Winder: Linking Speech and Visual Objects to Support Communication in Asynchronous Collaboration. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3411764.3445686"
    },
    {
      "text": "René F Kizilcec, Jeremy N Bailenson, and Charles J Gomez. 2015. The instructor’s face in video instruction: Evidence from two large-scale field studies.Journal of Educational Psychology 107, 3 (2015), 724.",
      "doi": ""
    },
    {
      "text": "René F Kizilcec, Kathryn Papadopoulos, and Lalida Sritanyaratana. 2014. Showing face in video instruction: effects on information retention, visual attention, and affect. In Proceedings of the SIGCHI conference on human factors in computing systems. 2095–2102.",
      "doi": "10.1145/2556288.2557207"
    },
    {
      "text": "Christoph Klimmt. 2003. Dimensions and determinants of the enjoyment of playing digital games: A three-level model. In Level up: Digital games research conference. 246–257.",
      "doi": ""
    },
    {
      "text": "Christoph Klimmt, Dorothée Hefner, Peter Vorderer, Christian Roth, and Christopher Blake. 2010. Identification with video game characters as automatic shift of self-perceptions. Media Psychology 13, 4 (2010), 323–338.",
      "doi": ""
    },
    {
      "text": "Christoph Klimmt, Daniel Possler, Nicolas May, Hendrik Auge, Louisa Wanjek, and Anna-Lena Wolf. 2019. Effects of Soundtrack Music on the Video Game Experience. Media Psychology 22, 5 (Sept. 2019), 689–713. https://doi.org/10.1080/15213269.2018.1507827",
      "doi": ""
    },
    {
      "text": "Anya Kolesnichenko, Joshua McVeigh-Schultz, and Katherine Isbister. 2019. Understanding emerging design practices for avatar systems in the commercial social vr ecology. In Proceedings of the 2019 on Designing Interactive Systems Conference. 241–252.",
      "doi": "10.1145/3322276.3322352"
    },
    {
      "text": "Jordan Koulouris, Zoe Jeffery, James Best, Eamonn O’Neill, and Christof Lutteroth. 2020. Me vs. Super(Wo)Man: Effects of Customization and Identification in a VR Exergame. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–17. https://doi.org/10.1145/3313831.3376661",
      "doi": "10.1145/3313831.3376661"
    },
    {
      "text": "Christof Kuhbandner and Reinhard Pekrun. 2013. Joint effects of emotion and color on memory.Emotion (Washington, D.C.) 13, 3 (2013), 375–9. https://doi.org/10.1037/a0031821",
      "doi": ""
    },
    {
      "text": "Rohit Kumar, Gahgene Gweon, Mahesh Joshi, Yue Cui, and Carolyn Penstein Rosé. 2007. Supporting students working together on math with social dialogue. In Workshop on Speech and Language Technology in Education. Citeseer.",
      "doi": ""
    },
    {
      "text": "Daniël Lakens. 2013. Calculating and reporting effect sizes to facilitate cumulative science: a practical primer for t-tests and ANOVAs. Frontiers in psychology 4 (2013), 863.",
      "doi": ""
    },
    {
      "text": "Monica Landoni, Emiliana Murgia, Theo Huibers, and Maria Soledad Pera. 2019. My Name is Sonny, How May I help You Searching for Information?. In 18th ACM International Conference on Interaction Design and Children, IDC 2019. Association for Computing Machinery (ACM).",
      "doi": ""
    },
    {
      "text": "Pontus Larsson, Aleksander Väljamäe, Daniel Västfjäll, Ana Tajadura-Jiménez, and Mendel Kleiner. 2010. Auditory-Induced Presence in Mixed Reality Environments and Related Technology. (2010), 143–163. https://doi.org/10.1007/978-1-84882-733-2_8 arxiv:arXiv:1011.1669v3",
      "doi": ""
    },
    {
      "text": "Eun Ju Lee, Clifford Nass, and Scott Brave. 2000. Can computer-generated speech have gender? An experimental test of gender stereotype. In CHI’00 extended abstracts on Human factors in computing systems. 289–290.",
      "doi": ""
    },
    {
      "text": "Kwan Min Lee, Katharine Liao, and Seoungho Ryu. 2007. Children’s responses to computer-synthesized speech in educational media: gender consistency and gender similarity effects. Human communication research 33, 3 (2007), 310–329.",
      "doi": ""
    },
    {
      "text": "Benjamin J. Li and May O. Lwin. 2016. Player See, Player Do: Testing an Exergame Motivation Model Based on the Influence of the Self Avatar. Computers in Human Behavior 59 (June 2016), 350–357. https://doi.org/10.1016/j.chb.2016.02.034",
      "doi": ""
    },
    {
      "text": "Benjamin J Li, May O Lwin, and Younbo Jung. 2014. Wii, Myself, and Size: The Influence of Proteus Effect and Stereotype Threat on Overweight Children’s Exercise Motivation and Behavior in Exergames. Games for health: Research, Development, and Clinical Applications 3, 1(2014), 40–48.",
      "doi": ""
    },
    {
      "text": "Gen-Yih Liao, TCE Cheng, and Ching-I Teng. 2019. How do avatar attractiveness and customization impact online gamers’ flow and loyalty?Internet Research (2019).",
      "doi": ""
    },
    {
      "text": "Mats Liljedahl. 2011. Sound for Fantasy and Freedom. In Game Sound Technology and Player Interaction: Concepts and Developments. IGI Global, 22–43.",
      "doi": ""
    },
    {
      "text": "Sohye Lim and Byron Reeves. 2009. Being in the Game: Effects of Avatar Choice and Point of View on Psychophysiological Responses During Play. Media Psychology 12, 4 (Nov. 2009), 348–370. https://doi.org/10.1080/15213260903287242",
      "doi": ""
    },
    {
      "text": "Limelight Networks. 2021. State of Online Gaming 2021. (2021). https://www.limelight.com/lp/state-of-online-gaming-2021/",
      "doi": ""
    },
    {
      "text": "Lorraine Lin, Dhaval Parmar, Sabarish V. Babu, Alison E. Leonard, Shaundra B. Daily, and Sophie Jörg. 2017. How Character Customization Affects Learning in Computational Thinking. In Proceedings of the ACM Symposium on Applied Perception. ACM, Cottbus Germany, 1–8. https://doi.org/10.1145/3119881.3119884",
      "doi": "10.1145/3119881.3119884"
    },
    {
      "text": "Linden Lab. 2003. Second Life. Game [Multiple Platforms]. Linden Lab, San Francisco, USA.",
      "doi": ""
    },
    {
      "text": "Conor Linehan, George Bellord, Ben Kirman, Zachary H. Morford, and Bryan Roche. 2014. Learning curves: Analysing pace and challenge in four successful puzzle games. CHI PLAY 2014 - Proceedings of the 2014 Annual Symposium on Computer-Human Interaction in Play(2014), 181–190. https://doi.org/10.1145/2658537.2658695",
      "doi": "10.1145/2658537.2658695"
    },
    {
      "text": "LingoJam. 2020. Robot Voice Generator. https://lingojam.com/RobotVoiceGenerator",
      "doi": ""
    },
    {
      "text": "Duri Long, Hannah Guthrie, and Brian Magerko. 2018. Don’t steal my balloons: designing for musical adult-child ludic engagement. In Proceedings of the 17th ACM Conference on Interaction Design and Children. 657–662.",
      "doi": "10.1145/3202185.3210795"
    },
    {
      "text": "Nichola Lubold, Erin Walker, and Heather Pon-Barry. 2021. Effects of adapting to user pitch on rapport perception, behavior, and state with a social robotic learning companion. User Modeling and User-Adapted Interaction 31, 1 (2021), 35–73.",
      "doi": "10.1007/s11257-020-09267-3"
    },
    {
      "text": "Michelle Lui, Rhonda McEwen, and Martha Mullally. 2020. Immersive virtual reality for supporting complex scientific knowledge: Augmenting our understanding with physiological monitoring. British Journal of Educational Technology 51, 6 (2020), 2181–2199.",
      "doi": ""
    },
    {
      "text": "Roberto Martinez Maldonado, Judy Kay, Kalina Yacef, and Beat Schwendimann. 2012. An interactive teacher’s dashboard for monitoring groups in a multi-tabletop learning environment. In International Conference on Intelligent Tutoring Systems. Springer, 482–492.",
      "doi": "10.1007/978-3-642-30950-2_62"
    },
    {
      "text": "Hazel Markus and Paula Nurius. 1986. Possible selves.American psychologist 41, 9 (1986), 954.",
      "doi": ""
    },
    {
      "text": "Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon’s Mechanical Turk. Behavior Research Methods 44, 1 (2012), 1–23. https://doi.org/10.3758/s13428-011-0124-6",
      "doi": ""
    },
    {
      "text": "Richard E Mayer, Kristina Sobko, and Patricia D Mautone. 2003. Social cues in multimedia learning: Role of speaker’s voice.Journal of educational Psychology 95, 2 (2003), 419.",
      "doi": ""
    },
    {
      "text": "Oscar Mayor, Jordi Bonada, and Jordi Janer. 2009. Kaleivoicecope: Voice transformation from interactive installations to video-games. In Proceedings of the AES International Conference.",
      "doi": ""
    },
    {
      "text": "Victoria McArthur. 2017. The UX of Avatar Customization. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver Colorado USA, 5029–5033. https://doi.org/10.1145/3025453.3026020",
      "doi": "10.1145/3025453.3026020"
    },
    {
      "text": "Victoria McArthur. 2018. Challenging the User-Avatar Dichotomy in Avatar Customization Research. 9, 1 (2018), 21.",
      "doi": ""
    },
    {
      "text": "Victoria McArthur. 2019. Making Mii: Studying the Effects of Methodological Approaches and Gaming Contexts on Avatar Customization. Behaviour & Information Technology 38, 3 (March 2019), 230–243. https://doi.org/10.1080/0144929X.2018.1526969",
      "doi": ""
    },
    {
      "text": "Victoria McArthur and Jennifer Jenson. 2014. E Is for Everyone? Best Practices for the Socially Inclusive Design of Avatar Creation Interfaces. In Proceedings of the 2014 Conference on Interactive Entertainment. ACM, Newcastle NSW Australia, 1–8. https://doi.org/10.1145/2677758.2677783",
      "doi": "10.1145/2677758.2677783"
    },
    {
      "text": "Victoria McArthur, Robert John Teather, and Jennifer Jenson. 2015. The Avatar Affordances Framework: Mapping Affordances and Design Trends in Character Creation Interfaces. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play. ACM, London United Kingdom, 231–240. https://doi.org/10.1145/2793107.2793121",
      "doi": "10.1145/2793107.2793121"
    },
    {
      "text": "Edward McAuley, Terry Duncan, and Vance V Tammen. 1989. Psychometric properties of the Intrinsic Motivation Inventory in a competitive sport setting: A confirmatory factor analysis. Research Quarterly for Exercise and Sport 60, 1 (1989), 48–58.",
      "doi": ""
    },
    {
      "text": "Ravi Mehta and Rui(Juliet) Zhu. 2008. Blue or Red? Exploring the Effect of Color on Cognitive Task Performances. Science 323, February (2008), 1226–1229. https://doi.org/10.1126/science.1169144",
      "doi": ""
    },
    {
      "text": "M.A. Meier, Russell A. Hill, Andrew J. Elliot, and R.A. Barton. 2015. Color in Achievement Contexts in Humans. Handbook of Color Psychology 44, February (2015), 0–103. https://doi.org/10.1063/1.2756072",
      "doi": ""
    },
    {
      "text": "Scott Menard. 2002. Applied logistic regression analysis. Vol. 106. Sage.",
      "doi": ""
    },
    {
      "text": "Microsoft Game Studios and Electronic Arts. 2007. Mass Effect. Game [Multiple Platforms].",
      "doi": ""
    },
    {
      "text": "Jeremy Miles and Mark Shevlin. 2001. Applying regression and correlation: A guide for students and researchers. Sage.",
      "doi": ""
    },
    {
      "text": "Modulate. 2021. VoiceWear. https://www.modulate.ai/voice-wear",
      "doi": ""
    },
    {
      "text": "Toni-Jan Keith Palma Monserrat, Shengdong Zhao, Kevin McGee, and Anshul Vikram Pandey. 2013. Notevideo: Facilitating navigation of blackboard-style lecture videos. In Proceedings of the SIGCHI conference on human factors in computing systems. 1139–1148.",
      "doi": "10.1145/2470654.2466147"
    },
    {
      "text": "Marlene M Moretti and E Tory Higgins. 1990. Relating self-discrepancy to self-esteem: The contribution of discrepancy beyond actual-self ratings. Journal of Experimental Social Psychology 26, 2 (1990), 108–123.",
      "doi": ""
    },
    {
      "text": "Briana B Morrison and Betsy DiSalvo. 2014. Khan academy gamifies computer science. In Proceedings of the 45th ACM technical symposium on Computer science education. 39–44.",
      "doi": "10.1145/2538862.2538946"
    },
    {
      "text": "Sheila C Murphy. 2004. ‘Live in your world, play in ours’: The spaces of video game identity. Journal of visual culture 3, 2 (2004), 223–238.",
      "doi": ""
    },
    {
      "text": "Lennart E. Nacke and Mark Grimshaw. 2011. Player-Game Interaction Through Affective Sound. Game Sound Technology and Player Interaction (2011), 264–285. https://doi.org/10.4018/978-1-61692-828-5.ch013",
      "doi": ""
    },
    {
      "text": "Lennart E. Nacke, Mark N. Grimshaw, and Craig A. Lindley. 2010. More than a Feeling: Measurement of Sonic User Experience and Psychophysiology in a First-Person Shooter Game. Interacting with Computers 22, 5 (Sept. 2010), 336–343. https://doi.org/10.1016/j.intcom.2010.04.005",
      "doi": "10.1016/j.intcom.2010.04.005"
    },
    {
      "text": "Lisa Nakamura. 2013. Cybertypes: Race, Ethnicity, and Identity on the Internet. Routledge.",
      "doi": "10.5555/515277"
    },
    {
      "text": "Clifford Nass and Kwan Min Lee. 2000. Does Computer-Generated Speech Manifest Personality? An Experimental Test of Similarity-Attraction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’00. ACM Press, The Hague, The Netherlands, 329–336. https://doi.org/10.1145/332040.332452",
      "doi": "10.1145/332040.332452"
    },
    {
      "text": "Clifford Nass and Kwan Min Lee. 2001. Does Computer-Synthesized Speech Manifest Personality? Experimental Tests of Recognition, Similarity-Attraction, and Consistency-Attraction.Journal of Experimental Psychology: Applied 7, 3 (2001), 171–181. https://doi.org/10.1037/1076-898X.7.3.171",
      "doi": ""
    },
    {
      "text": "Greg L Nelson, Benjamin Xie, and Andrew J Ko. 2017. Comprehension first: evaluating a novel pedagogy and tutoring system for program tracing in CS1. In Proceedings of the 2017 ACM Conference on International Computing Education Research. 2–11.",
      "doi": "10.1145/3105726.3106178"
    },
    {
      "text": "Tobias Neuhold. [n.d.]. The Role of Audio for Spatial and Affective Involvement in Survival Horror Games. ([n. d.]), 16.",
      "doi": ""
    },
    {
      "text": "Raymond Ng and Robb Lindgren. 2013. Examining the Effects of Avatar Customization and Narrative on Engagement and Learning in Video Games. In Proceedings of CGAMES’2013 USA. IEEE, Louisville, KY, 87–90. https://doi.org/10.1109/CGames.2013.6632611",
      "doi": ""
    },
    {
      "text": "Nintendo EAD. 2006. The Legend of Zelda: Twilight Princess. Game [Multiple Platforms]. Nintendo, Kyoto, Japan.",
      "doi": ""
    },
    {
      "text": "Tyler Pace, Aaron Houssian, and Victoria McArthur. 2009. Are Socially Exclusive Values Embedded in the Avatar Creation Interfaces of MMORPGs?Journal of Information, Communication and Ethics in Society (2009).",
      "doi": ""
    },
    {
      "text": "Pearl Abyss. 2015. Black Desert Online. Game [Multiple Platforms].",
      "doi": ""
    },
    {
      "text": "Anthony J Pellicone and June Ahn. 2017. The Game of Performing Play: Understanding streaming as cultural production. In Proceedings of the 2017 CHI conference on human factors in computing systems. 4863–4874.",
      "doi": "10.1145/3025453.3025854"
    },
    {
      "text": "Wei Peng, Jih Hsuan Lin, Karin A. Pfeiffer, and Brian Winn. 2012. Need Satisfaction Supportive Game Features as Motivational Determinants: An Experimental Study of a Self-Determination Theory Guided Exergame. Media Psychology 15, 2 (2012), 175–196. https://doi.org/10.1080/15213269.2012.673850",
      "doi": ""
    },
    {
      "text": "Daniel Pimentel and Sri Kalyanaraman. 2020. Your Own Worst Enemy: Implications of the Customization, and Destruction, of Non-Player Characters. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. ACM, Virtual Event Canada, 93–106. https://doi.org/10.1145/3410404.3414269",
      "doi": "10.1145/3410404.3414269"
    },
    {
      "text": "Cale Plut and Philippe Pasquier. 2019. Music Matters: An Empirical Study on the Effects of Adaptive Music on Experienced and Perceived Player Affect. In 2019 IEEE Conference on Games (CoG). IEEE, London, United Kingdom, 1–8. https://doi.org/10.1109/CIG.2019.8847951",
      "doi": ""
    },
    {
      "text": "Andrew K. Przybylski, C. Scott Rigby, and Richard M. Ryan. 2010. A Motivational Model of Video Game Engagement. Review of General Psychology 14, 2 (2010), 154–166. https://doi.org/10.1037/a0019440",
      "doi": ""
    },
    {
      "text": "Andrew K Przybylski, Richard M Ryan, and C Scott Rigby. 2009. The motivating role of violence in video games. Personality and social psychology bulletin 35, 2 (2009), 243–259.",
      "doi": ""
    },
    {
      "text": "Rabindra Ratan. 2017. Companions & Vehicles. In Avatars, Assembled: The Sociotechnical Anatomy of Digital Bodies, Jaime Banks (Ed.). Peter Lang, Digital Formations Series.",
      "doi": ""
    },
    {
      "text": "Rabindra Ratan, David Beyea, Benjamin J. Li, and Luis Graciano. 2020. Avatar Characteristics Induce Users’ Behavioral Conformity with Small-to-Medium Effect Sizes: A Meta-Analysis of the Proteus Effect. Media Psychology 23, 5 (Sept. 2020), 651–675. https://doi.org/10.1080/15213269.2019.1623698",
      "doi": ""
    },
    {
      "text": "Rabindra Ratan and Young June Sah. 2015. Leveling up on stereotype threat: The role of avatar customization and avatar embodiment. Computers in Human Behavior 50 (2015), 367–374.",
      "doi": "10.1016/j.chb.2015.04.010"
    },
    {
      "text": "Johnmarshall Reeve. 1989. The interest-enjoyment distinction in intrinsic motivation. Motivation and emotion 13, 2 (1989), 83–103.",
      "doi": ""
    },
    {
      "text": "Gabriela T Richard and Kishonna L Gray. 2018. Gendered play, racialized reality: Black cyberfeminism, inclusive communities of practice, and the intersections of learning, socialization, and resilience in online gaming. Frontiers: A Journal of Women Studies 39, 1 (2018), 112–148.",
      "doi": ""
    },
    {
      "text": "Gabriela T Richard and Christopher M Hoadley. 2013. Investigating a supportive online gaming community as a means of reducing stereotype threat vulnerability across gender. Proceedings of Games, Learning & Society 9 (2013), 261–266.",
      "doi": ""
    },
    {
      "text": "Jessica Roberts, Amartya Banerjee, Annette Hong, Steven McGee, Michael Horn, and Matt Matcuk. 2018. Digital exhibit labels in museums: promoting visitor engagement with cultural artifacts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3174197"
    },
    {
      "text": "Rockstar Games. 2018. Red Dead Redemption 2. Game [Multiple Platforms].",
      "doi": ""
    },
    {
      "text": "Katja Rogers. 2017. Exploring the Role of Audio in Games. In Extended Abstracts Publication of the Annual Symposium on Computer-Human Interaction in Play. ACM, Amsterdam The Netherlands, 727–731. https://doi.org/10.1145/3130859.3133227",
      "doi": ""
    },
    {
      "text": "Elisa Rubegni, Rebecca Dore, Monica Landoni, and Ling Kan. 2021. “The girl who wants to fly”: Exploring the role of digital technology in enhancing dialogic reading. International Journal of Child-Computer Interaction 30 (2021), 100239.",
      "doi": "10.1016/j.ijcci.2020.100239"
    },
    {
      "text": "Elisa Rubegni, Vito Gentile, Alessio Malizia, Salvatore Sorce, and Niko Kargas. 2020. Child–display interaction: Lessons learned on touchless avatar-based large display interfaces. Personal and Ubiquitous Computing(2020), 1–14.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2000. Intrinsic and extrinsic motivations: Classic definitions and new directions. Contemporary educational psychology 25, 1 (2000), 54–67.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan, Richard Koestner, and Edward L Deci. 1991. Ego-involved persistence: When free-choice behavior is not intrinsically motivated. Motivation and emotion 15, 3 (1991), 185–205.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan, C. Scott Rigby, and Andrew Przybylski. 2006. The Motivational Pull of Video Games: A Self-Determination Theory Approach. Motivation and Emotion 30, 4 (2006), 344–360. https://doi.org/10.1007/s11031-006-9051-8",
      "doi": ""
    },
    {
      "text": "Timothy Sanders and Paul Cairns. 2010. Time perception, immersion and music in videogames. Proceedings of HCI 2010 24(2010), 160–167.",
      "doi": ""
    },
    {
      "text": "Carol Sansone, Charlene Weir, Lora Harpster, and Carolyn Morgan. 1992. Once a Boring Task Always a Boring Task?: Interest as a Self-Regulatory Mechanism. Journal of Personality and Social Psychology (1992). https://doi.org/10.1037/0022-3514.63.3.379",
      "doi": ""
    },
    {
      "text": "Mike Schmierbach, Anthony M. Limperos, and Julia K. Woolley. 2012. Feeling the Need for (Personalized) Speed: How Natural Controls and Customization Contribute to Enjoyment of a Racing Game Through Enhanced Immersion. Cyberpsychology, Behavior, and Social Networking 15, 7 (July 2012), 364–369. https://doi.org/10.1089/cyber.2012.0025",
      "doi": ""
    },
    {
      "text": "Alexander M. Schoemann, Aaron J. Boulton, and Stephen D. Short. 2017. Determining Power and Sample Size for Simple and Complex Mediation Models. Social Psychological and Personality Science 8, 4 (2017), 379–386. https://doi.org/10.1177/1948550617715068",
      "doi": ""
    },
    {
      "text": "P E Shrout and J L Fleiss. 1979. Intraclass correlations: uses in assessing rater reliability.Psychological bulletin 86, 2 (1979), 420–428. https://doi.org/10.1037/0033-2909.86.2.420",
      "doi": ""
    },
    {
      "text": "Janet Siegmund, Christian Kästner, Jörg Liebig, Sven Apel, and Stefan Hanenberg. 2014. Measuring and modeling programming experience. Empirical Software Engineering 19, 5 (2014), 1299–1334. https://doi.org/10.1007/s10664-013-9286-4",
      "doi": "10.1007/s10664-013-9286-4"
    },
    {
      "text": "Siu-Lan Tan, John Baxa, and Matthew P. Spackman. 2010. Effects of Built-in Audio versus Unrelated Background Music on Performance In an Adventure Role-Playing Game. International Journal of Gaming and Computer-mediated Simulations (2010). https://doi.org/10.4018/jgcms.2010070101",
      "doi": ""
    },
    {
      "text": "Peter Smucker. 2018. Gaming Sober, Playing Drunk: Sound Effects of Alcohol in Video Games. The Computer Games Journal 7, 4 (2018), 291–311.",
      "doi": ""
    },
    {
      "text": "Alistair Raymond Bryce Soutter and Michael Hitchens. 2016. The Relationship between Character Identification and Flow State within Video Games. Computers in Human Behavior 55 (Feb. 2016), 1030–1038. https://doi.org/10.1016/j.chb.2015.11.012",
      "doi": ""
    },
    {
      "text": "Square Enix. 2013. Final Fantasy XIV. Game [Multiple Platforms].",
      "doi": ""
    },
    {
      "text": "Standing Stone Games. 2007. The Lord of the Rings Online. Game [Multiple Platforms]. Warner Bros. Interactive Entertainment, California, USA.",
      "doi": ""
    },
    {
      "text": "Sharon T. Steinemann, Elisa D. Mekler, and Klaus Opwis. 2015. Increasing Donating Behavior Through a Game for Change. https://doi.org/10.1145/2793107.2793125",
      "doi": ""
    },
    {
      "text": "Axel Stockburger. 2010. The play of the voice: The role of the voice in contemporary video and computer games. Voice: Vocal aesthetics in digital arts and media. Cambridge: MIT Press. van Leeuwen (2010).",
      "doi": ""
    },
    {
      "text": "Barbara G Tabachnick and Linda S Fidell. 2007. Using multivariate statistics. Allyn & Bacon/Pearson Education.",
      "doi": ""
    },
    {
      "text": "Telltale Games. 2012. The Walking Dead. Game [Multiple Platforms].",
      "doi": ""
    },
    {
      "text": "Gary F Templeton. 2011. A two-step approach for transforming continuous variables to normal: implications and recommendations for IS research. Communications of the Association for Information Systems 28, 1(2011), 4.",
      "doi": ""
    },
    {
      "text": "Ching-I Teng. 2021. How can avatar’s item customizability impact gamer loyalty?Telematics and Informatics 62 (2021), 101626.",
      "doi": ""
    },
    {
      "text": "Xiaoyi Tian, Nichola Lubold, Leah Friedman, and Erin Walker. 2020. Understanding Rapport over Multiple Sessions with a Social, Teachable Robot. In International Conference on Artificial Intelligence in Education. Springer, 318–323.",
      "doi": ""
    },
    {
      "text": "Sabine Trepte and Leonard Reinecke. 2010. Avatar Creation and Video Game Enjoyment: Effects of Life-Satisfaction, Game Competitiveness, and Identification with the Avatar. Journal of Media Psychology 22, 4 (Jan. 2010), 171–184. https://doi.org/10.1027/1864-1105/a000022",
      "doi": ""
    },
    {
      "text": "Stefano Triberti, Ilaria Durosini, Filippo Aschieri, Daniela Villani, and Giuseppe Riva. 2017. Changing Avatars, Changing Selves? The Influence of Social and Contextual Expectations on Digital Rendition of Identity. Cyberpsychology, Behavior, and Social Networking 20, 8 (Aug. 2017), 501–507. https://doi.org/10.1089/cyber.2016.0424",
      "doi": ""
    },
    {
      "text": "Selen Turkay and Sonam Adinolf. 2010. Free to Be Me: A Survey Study on Customization with World of Warcraft and City Of Heroes/Villains Players. Procedia - Social and Behavioral Sciences 2, 2 (2010), 1840–1845. https://doi.org/10.1016/j.sbspro.2010.03.995",
      "doi": ""
    },
    {
      "text": "Selen Turkay and Charles K. Kinzer. 2014. The Effects of Avatar-Based Customization on Player Identification:. International Journal of Gaming and Computer-Mediated Simulations 6, 1 (Jan. 2014), 1–25. https://doi.org/10.4018/ijgcms.2014010101",
      "doi": "10.4018/ijgcms.2014010101"
    },
    {
      "text": "Selen Turkay and Charles K Kinzer. 2015. The effects of avatar-based customization on player identification. In Gamification: Concepts, methodologies, tools, and applications. IGI Global, 247–272.",
      "doi": ""
    },
    {
      "text": "Ubisoft Kyiv Ubisoft Montreal, Ubisoft Milan. 2013. Assassin’s Creed IV: Black Flag. Game [Multiple Platforms]. Ubisoft, Paris, France.",
      "doi": ""
    },
    {
      "text": "Ubisoft Toronto. 2013. Tom Clancy’s Splinter Cell: Blacklist. Game [Multiple Platforms]. Ubisoft, Paris, France.",
      "doi": ""
    },
    {
      "text": "Jan Van Looy, Cédric Courtois, Melanie De Vocht, and Lieven De Marez. 2012. Player Identification in Online Games: Validation of a Scale for Measuring Identification in MMOGs. Media Psychology 15, 2 (May 2012), 197–221. https://doi.org/10.1080/15213269.2012.674917",
      "doi": ""
    },
    {
      "text": "Kellie Vella, Madison Klarkowski, Selen Turkay, and Daniel Johnson. 2020. Making friends in online games: gender differences and designing for greater social connectedness. Behaviour and Information Technology(2020). https://doi.org/10.1080/0144929X.2019.1625442",
      "doi": ""
    },
    {
      "text": "VentureBeat. 2020. Newzoo: U.S. gamers are in love with skins and in-game cosmetics. https://venturebeat.com/2020/12/18/newzoo-u-s-gamers-are-in-love-with-skins-and-in-game-cosmetics/",
      "doi": ""
    },
    {
      "text": "Daniela Villani, Elena Gatti, Stefano Triberti, Emanuela Confalonieri, and Giuseppe Riva. 2016. Exploration of Virtual Body-Representation in Adolescence: The Role of Age and Sex in Avatar Customization. SpringerPlus 5, 1 (Dec. 2016), 740. https://doi.org/10.1186/s40064-016-2520-y",
      "doi": ""
    },
    {
      "text": "Jellyvision Vivarium. 1999. Seaman. Game [Multiple Platforms]. Sega, Tokyo, Japan.",
      "doi": ""
    },
    {
      "text": "Voicemod. 2020. Voicemod. https://www.voicemod.net/",
      "doi": ""
    },
    {
      "text": "Volition and Deep Silver. 2013. Saints Row IV. Game [Multiple Platforms].",
      "doi": ""
    },
    {
      "text": "Greg Wadley, Marcus Carter, and Martin Gibbs. 2015. Voice in virtual worlds: The design, use, and influence of voice chat in online play. Human–Computer Interaction 30, 3-4 (2015), 336–365.",
      "doi": ""
    },
    {
      "text": "Greg Wadley, Martin Gibbs, and Peter Benda. 2007. Speaking in character: using voice-over-IP to communicate within MMORPGs. In Proceedings of the 4th Australasian conference on Interactive entertainment. 1–8.",
      "doi": ""
    },
    {
      "text": "Greg Wadley, Martin R. Gibbs, and Nicolas Ducheneaut. 2009. You can be too rich: Mediated communication in a virtual world. In Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group - Design: Open 24/7, OZCHI ’09. https://doi.org/10.1145/1738826.1738835",
      "doi": ""
    },
    {
      "text": "Zachary Charles Waggoner. 2007. Passage to morrowind: (dis) locating virtual and” real” identities in video role-playing games. Arizona State University.",
      "doi": ""
    },
    {
      "text": "Helen Wauck, Gale Lucas, Ari Shapiro, Andrew Feng, Jill Boberg, and Jonathan Gratch. 2018. Analyzing the effect of avatar self-similarity on men and women in a search and rescue game. Conference on Human Factors in Computing Systems - Proceedings 2018-April (2018). https://doi.org/10.1145/3173574.3174059",
      "doi": "10.1145/3173574.3174059"
    },
    {
      "text": "David Westerman, Ron Tamborini, and Nicholas David Bowman. 2015. The effects of static avatars on impression formation across different contexts on social networking sites. Computers in Human Behavior 53 (2015), 111–117.",
      "doi": "10.1016/j.chb.2015.06.026"
    },
    {
      "text": "Hanna Elina Wirman and Rhys Jones. 2017. Voice and Sound: Player Contributions to Speech. Peter Lang, Digital Formations Series.",
      "doi": ""
    },
    {
      "text": "Wizet. 2003. MapleStory. [Microsoft Windows]. Nexon, Seoul, South Korea.",
      "doi": ""
    },
    {
      "text": "Nick Yee and J Bailenson. 2007. The Proteus Effect: The Effect of Transformed Self-Representation on Behavior. Human communication research(2007), 1–38. http://onlinelibrary.wiley.com/doi/10.1111/j.1468-2958.2007.00299.x/full",
      "doi": ""
    },
    {
      "text": "Robert B Zajonc. 2001. Mere exposure: A gateway to the subliminal. Current directions in psychological science 10, 6 (2001), 224–228.",
      "doi": ""
    },
    {
      "text": "David Zendle, Paul Cairns, and Daniel Kudenko. 2015. Higher graphical fidelity decreases players’ access to aggressive concepts in violent video games. In CHI PLAY 2015 - Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play. https://doi.org/10.1145/2793107.2793113",
      "doi": "10.1145/2793107.2793113"
    },
    {
      "text": "Lotus Zhang, Lucy Jiang, Nicole Washington, Augustina Ao Liu, Jingyao Shao, Adam Fourney, Meredith Ringel Morris, and Leah Findlater. 2021. Social Media through Voice: Synthesized Voice Qualities and Self-Presentation. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1 (April 2021), 1–21. https://doi.org/10.1145/3449235",
      "doi": "10.1145/3449235"
    },
    {
      "text": "Oren Zuckerman, Dina Walker, Andrey Grishko, Tal Moran, Chen Levy, Barak Lisak, Iddo Yehoshua Wald, and Hadas Erel. 2020. Companionship Is Not a Function: The Effect of a Novel Robotic Object on Healthy Older Adults’ Feelings of” Being-Seen”. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3313831.3376411"
    }
  ]
}