{
  "doi": "10.1145/3491102.3517703",
  "title": "Supporting the Contact Tracing Process with WiFi Location Data: Opportunities and Challenges",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "Contact tracers assist in containing the spread of highly infectious diseases such as COVID-19 by engaging community members who receive a positive test result in order to identify close contacts. Many contact tracers rely on community member’s recall for those identifications, and face limitations such as unreliable memory. To investigate how technology can alleviate this challenge, we developed a visualization tool using de-identified location data sensed from campus WiFi and provided it to contact tracers during mock contact tracing calls. While the visualization allowed contact tracers to find and address inconsistencies due to gaps in community member’s memory, it also introduced inconsistencies such as false-positive and false-negative reports due to imperfect data, and information sharing hesitancy. We suggest design implications for technologies that can better highlight and inform contact tracers of potential areas of inconsistencies, and further present discussion on using imperfect data in decision making.",
  "tags": [
    "WiFi data",
    "contact tracing",
    "visualization"
  ],
  "authors": [
    {
      "name": "Kaely Hall",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236517",
      "orcid": "0000-0003-1266-8908"
    },
    {
      "name": "Dong Whi Yoo",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365255",
      "orcid": "missing"
    },
    {
      "name": "Wenrui Zhang",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236113",
      "orcid": "missing"
    },
    {
      "name": "Mehrab Bin Morshed",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659130413",
      "orcid": "missing"
    },
    {
      "name": "Vedant Das Swain",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659254374",
      "orcid": "0000-0001-6871-3523"
    },
    {
      "name": "Gregory D. Abowd",
      "institution": "Dept. of Electrical and Computer Engineering, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100251687",
      "orcid": "0000-0002-3408-587X"
    },
    {
      "name": "Munmun De Choudhury",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343491309",
      "orcid": "0000-0002-8939-264X"
    },
    {
      "name": "Alex Endert",
      "institution": "Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460654929",
      "orcid": "0000-0002-6914-610X"
    },
    {
      "name": "John Stasko",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/do/10.1145/contrib-81100573160/rel-imgonly/stasko-06oct-small.jpg",
      "acmid": "81100573160",
      "orcid": "missing"
    },
    {
      "name": "Jennifer G Kim",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81498653663",
      "orcid": "0000-0003-3253-3963"
    }
  ],
  "references": [
    {
      "text": "2019. Appendices. https://www.cdc.gov/coronavirus/2019-ncov/php/contact-tracing/contact-tracing-plan/appendix.html#contact",
      "doi": ""
    },
    {
      "text": "2020. Singapore government launches new app for contact tracing to combat spread of COVID-19. https://www.mobihealthnews.com/news/asia/singapore-government-launches-new-app-contact-tracing-combat-spread-covid-19",
      "doi": ""
    },
    {
      "text": "[3] 2021. https://www.tracetogether.gov.sg/common/privacystatement/index.html",
      "doi": ""
    },
    {
      "text": "2021. Coursera contact tracing course. https://www.coursera.org/learn/covid-19-contact-tracing",
      "doi": ""
    },
    {
      "text": "2021. COVID-19 Contact Tracing. https://www.cdc.gov/coronavirus/2019-ncov/daily-life-coping/contact-tracing.html",
      "doi": ""
    },
    {
      "text": "2021. How TraceFi works. https://covidtech.harvard.edu/howitworks.html",
      "doi": ""
    },
    {
      "text": "2021. Operational Considerations for Adapting a Contact Tracing Program to Respond to the COVID-19 Pandemic in non-US Settings. https://www.cdc.gov/coronavirus/2019-ncov/global-covid-19/operational-considerations-contact-tracing.html#anchor_1624283937257",
      "doi": ""
    },
    {
      "text": "2021. proximity. https://dictionary.cambridge.org/us/dictionary/english/proximity",
      "doi": ""
    },
    {
      "text": "MEDHA KALLEM | August 19. 2020. NOVID app makes contact tracing mobile. https://www.jhunewsletter.com/article/2020/08/novid-app-makes-contact-tracing-mobile",
      "doi": ""
    },
    {
      "text": "Mark S Ackerman. 2000. The intellectual challenge of CSCW: The gap between social requirements and technical feasibility. Human–Computer Interaction 15, 2-3 (2000), 179–203.",
      "doi": "10.1207/S15327051HCI1523_5"
    },
    {
      "text": "Nadeem Ahmed, Regio A Michelin, Wanli Xue, Sushmita Ruj, Robert Malaney, Salil S Kanhere, Aruna Seneviratne, Wen Hu, Helge Janicke, and Sanjay K Jha. 2020. A survey of COVID-19 contact tracing apps. IEEE access 8(2020), 134577–134601.",
      "doi": ""
    },
    {
      "text": "Adriana Alvarado Garcia, Alyson L Young, and Lynn Dombrowski. 2017. On making data actionable: How activists use imperfect data to foster social change for human rights violations in Mexico. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–19.",
      "doi": "10.1145/3134654"
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N Bennett, Kori Inkpen, 2019. Guidelines for human-AI interaction. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "James Benneyan, Christopher Gehrke, Iulian Ilies, and Nicole Nehls. 2021. Community and Campus COVID-19 Risk Uncertainty Under University Reopening Scenarios: Model-Based Analysis. JMIR public health and surveillance 7, 4 (2021), e24292.",
      "doi": ""
    },
    {
      "text": "Isobel Braithwaite, Thomas Callender, Miriam Bullock, and Robert W Aldridge. 2020. Automated and partly automated contact tracing: a systematic review to inform the control of COVID-19. The Lancet Digital Health(2020).",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis.(2012).",
      "doi": ""
    },
    {
      "text": "Carrie J Cai, Emily Reif, Narayan Hegde, Jason Hipp, Been Kim, Daniel Smilkov, Martin Wattenberg, Fernanda Viegas, Greg S Corrado, Martin C Stumpe, 2019. Human-centered tools for coping with imperfect algorithms during medical decision-making. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300234"
    },
    {
      "text": "Carrie J Cai, Samantha Winter, David Steiner, Lauren Wilcox, and Michael Terry. 2021. Onboarding Materials as Cross-functional Boundary Objects for Developing AI Assistants. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–7.",
      "doi": "10.1145/3411763.3443435"
    },
    {
      "text": "Wallace Clark. 1922. The Gantt chart: A working tool of management. Ronald Press Company.",
      "doi": ""
    },
    {
      "text": "Muawya Habib Sarnoub Eldaw, Mark Levene, and George Roussos. 2018. Presence analytics: making sense of human social presence within a learning environment. In 2018 IEEE/ACM 5th International Conference on Big Data Computing Applications and Technologies (BDCAT). IEEE, 174–183.",
      "doi": ""
    },
    {
      "text": "[21] People who care at Expii.2021. https://www.novid.org/#how-it-works",
      "doi": ""
    },
    {
      "text": "Christophe Fraser, Lucie Abeler-Dörner, Luca Ferretti, Michael Parker, Michelle Kendall, and David Bonsall. 2020. Digital contact tracing: comparing the capabilities of centralised and decentralised data architectures to effectively suppress the COVID-19 epidemic whilst maximising freedom of movement and maintaining privacy. University of Oxford(2020).",
      "doi": ""
    },
    {
      "text": "Kara Gavin. 2020. Flattening the Curve for COVID-19: What Does It Mean and How Can You Help?https://healthblog.uofmhealth.org/wellness-prevention/flattening-curve-for-covid-19-what-does-it-mean-and-how-can-you-help",
      "doi": ""
    },
    {
      "text": "Judith A Holton. 2007. The coding process and its challenges. The Sage handbook of grounded theory 3 (2007), 265–289.",
      "doi": ""
    },
    {
      "text": "Jeremy Hsu. 2021. Contact Tracing Apps Struggle to Be Both Effective and Private. https://spectrum.ieee.org/contact-tracing-apps-struggle-to-be-both-effective-and-private",
      "doi": ""
    },
    {
      "text": "Gabriel Kaptchuk, Daniel G Goldstein, Eszter Hargittai, Jake Hofman, and Elissa M Redmiles. 2020. How good is good enough for COVID19 apps? The influence of benefits, accuracy, and privacy on willingness to adopt. arXiv preprint arXiv:2005.04343(2020).",
      "doi": ""
    },
    {
      "text": "Naveena Karusala, Jennifer Wilson, Phebe Vayanos, and Eric Rice. 2019. Street-Level Realities of Data Practices in Homeless Services Provision. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359286"
    },
    {
      "text": "Cristina Criddle & Leo Kelion. 2020. Coronavirus contact-tracing: World split between two types of app. https://www.bbc.com/news/technology-52355028",
      "doi": ""
    },
    {
      "text": "Vera Khovanskaya, Phoebe Sengers, and Lynn Dombrowski. 2020. Bottom-Up Organizing with Tools from On High: Understanding the Data Practices of Labor Organizers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376185"
    },
    {
      "text": "John D Lee and Katrina A See. 2004. Trust in automation: Designing for appropriate reliance. Human factors 46, 1 (2004), 50–80.",
      "doi": ""
    },
    {
      "text": "Tianshi Li, Cori Faklaris, Jennifer King, Yuvraj Agarwal, Laura Dabbish, Jason I Hong, 2020. Decentralized is not risk-free: Understanding public perceptions of privacy-utility trade-offs in COVID-19 contact-tracing apps. arXiv preprint arXiv:2005.11957(2020).",
      "doi": ""
    },
    {
      "text": "Xi Lu, Tera L. Reynolds, Eunkyung Jo, Hwajung Hong, Xinru Page, Yunan Chen, and Daniel A. Epstein. 2021. Comparing Perspectives Around Human and Technology Support for Contact Tracing. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": ""
    },
    {
      "text": "Alison Mack, Eileen R Choffnes, Margaret A Hamburg, David A Relman, 2009. Microbial evolution and co-adaptation: a tribute to the life and scientific legacies of Joshua Lederberg: workshop summary. National Academies Press.",
      "doi": ""
    },
    {
      "text": "Amanda Meng, Carl DiSalvo, and Ellen Zegura. 2019. Collaborative data work towards a caring democracy. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359144"
    },
    {
      "text": "Australian Government Department of Health. 2020. COVIDSafe app. https://www.health.gov.au/resources/apps-and-tools/covidsafe-app",
      "doi": ""
    },
    {
      "text": "World Health Organization 2019. Non-pharmaceutical public health measures for mitigating the risk and impact of epidemic and pandemic influenza: annex: report of systematic literature reviews. Technical Report. World Health Organization.",
      "doi": ""
    },
    {
      "text": "Thomas D Palmer and N Ann Fields. 1994. Computer supported cooperative work. Computer 27, 5 (1994), 15–17.",
      "doi": "10.1109/2.291295"
    },
    {
      "text": "Jung Wook Park, Hayley I Evans, Hue Watson, Gregory D Abowd, and Rosa I Arriaga. 2020. Growing Apart: How Smart Devices Impact the Proximity of Users to Their Smartphones. IEEE Pervasive Computing 19, 3 (2020), 79–88.",
      "doi": "10.1109/MPRV.2020.2985229"
    },
    {
      "text": "Sangchul Park, Gina Jeehyun Choi, and Haksoo Ko. 2020. Information technology–based tracing strategy in response to COVID-19 in South Korea—privacy controversies. Jama 323, 21 (2020), 2129–2130.",
      "doi": ""
    },
    {
      "text": "Sharoda A Paul and Madhu C Reddy. 2010. Understanding together: sensemaking in collaborative information seeking. In Proceedings of the 2010 ACM conference on Computer supported cooperative work. 321–330.",
      "doi": "10.1145/1718918.1718976"
    },
    {
      "text": "Shriti Raj, Joyce M Lee, Ashley Garrity, and Mark W Newman. 2019. Clinical data in context: towards Sensemaking tools for interpreting personal health data. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 1 (2019), 1–20.",
      "doi": "10.1145/3314409"
    },
    {
      "text": "Elissa M Redmiles. 2020. User Concerns 8 Tradeoffs in Technology-facilitated COVID-19 Response. Digital Government: Research and Practice 2, 1 (2020), 1–12.",
      "doi": "10.1145/3428093"
    },
    {
      "text": "Jessica Schroeder, Jane Hoffswell, Chia-Fang Chung, James Fogarty, Sean Munson, and Jasmine Zia. 2017. Supporting patient-provider collaboration to identify individual triggers using food and symptom journals. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 1726–1739.",
      "doi": "10.1145/2998181.2998276"
    },
    {
      "text": "Ira B. Schwartz, James Kaufman, Kun Hu, and Simone Bianco. 2020. Predicting the impact of asymptomatic transmission, non-pharmaceutical intervention and testing on the spread of COVID19. (2020).",
      "doi": ""
    },
    {
      "text": "Lucy Simko, Ryan Calo, Franziska Roesner, and Tadayoshi Kohno. 2020. COVID-19 contact tracing and privacy: studying opinion and preferences. arXiv preprint arXiv:2005.06056(2020).",
      "doi": ""
    },
    {
      "text": "Vedant Das Swain, Jiajia Xie, Maanit Madan, Sonia Sargolzaei, James Cai, Munmun De Choudhury, Gregory D Abowd, Lauren N Steimle, and B Aditya Prakash. 2021. WiFi mobility models for COVID-19 enable less burdensome and more localized interventions for university campuses. medRxiv (2021).",
      "doi": ""
    },
    {
      "text": "Yvonne Taunton. 2020. Smartphone-based automated contact tracing: Is it possible to balance privacy, accuracy and security.",
      "doi": ""
    },
    {
      "text": "Alina Trifan, Maryse Oliveira, and José Luís Oliveira. 2019. Passive sensing of health outcomes through smartphones: systematic review of current solutions and possible limitations. JMIR mHealth and uHealth 7, 8 (2019), e12649.",
      "doi": ""
    },
    {
      "text": "Amee Trivedi and Deepak Vasisht. 2020. Digital Contact Tracing: Technologies, Shortcomings, and the Path Forward. SIGCOMM Comput. Commun. Rev. 50, 4 (2020), 75—81. https://doi.org/10.1145/3431832.3431841",
      "doi": "10.1145/3431832.3431841"
    },
    {
      "text": "Amee Trivedi, Camellia Zakaria, Rajesh Balan, Ann Becker, George Corey, and Prashant Shenoy. 2021. WiFiTrace: Network-based Contact Tracing for Infectious Diseases Using Passive WiFi Sensing. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 5, 1 (2021), 1–26.",
      "doi": "10.1145/3448084"
    },
    {
      "text": "Viktor Von Wyl, Sebastian Bonhoeffer, Edouard Bugnion, Milo Alan Puhan, Marcel Salathé, Theresa Stadler, Carmela Troncoso, Effy Vayena, and Nicola Low. 2020. A research agenda for digital proximity tracing apps. Swiss medical weekly 150(2020), w20324.",
      "doi": ""
    },
    {
      "text": "Laurel Wamsley. 2021. Singapore Says COVID-19 Contact-Tracing Data Can Be Requested By Police. https://www.npr.org/sections/coronavirus-live-updates/2021/01/05/953604553/singapore-says-covid-19-contact-tracing-data-can-be-requested-by-police",
      "doi": ""
    },
    {
      "text": "Shweta Ware, Chaoqun Yue, Reynaldo Morillo, Jin Lu, Chao Shang, Jayesh Kamath, Athanasios Bamis, Jinbo Bi, Alexander Russell, and Bing Wang. 2018. Large-scale automatic depression screening using meta-data from wifi infrastructure. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (2018), 1–27.",
      "doi": "10.1145/3287073"
    },
    {
      "text": "Peter West, Max Van Kleek, Richard Giordano, Mark J Weal, and Nigel Shadbolt. 2018. Common barriers to the use of patient-generated data across clinical settings. In proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3174058"
    },
    {
      "text": "Ye Xia and Gwendolyn Lee. 2020. How to return to normalcy: fast and comprehensive contact tracing of COVID-19 through proximity sensing using mobile devices. arXiv preprint arXiv:2004.12576(2020).",
      "doi": ""
    }
  ]
}