{
  "doi": "10.1145/3491102.3502129",
  "title": "Designing and Assessing a Virtual Reality Simulation to Build Resilience to Street Harassment",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "Street harassment is a widespread problem that can constrain people’s freedom to enjoy public spaces safely, along with many other negative psychological impacts. However, very little research has looked at how immersive technology can help in addressing it. We conducted three studies to investigate the design decisions, ethical issues and efficacy of an immersive simulation of street harassment: an online design study (n=20), an interview study with experts working in the area (n=9), and a comparative lab study investigating design, ethics and efficacy (n=44). Our results deepen understanding of the design decisions that contribute to a realistic psychological experience, such as the effects of screen-based video vs passive VR vs interactive VR. They also highlight important ethical issues such as traumatisation and potential for victim blaming, and how they can be approached in an ethical manner. Finally, they provide insights into efficacy in terms of perceived usefulness, competence and empathy.",
  "tags": [
    "design",
    "street harassment",
    "ethics",
    "virtual reality"
  ],
  "authors": [
    {
      "name": "Crescent Jicol",
      "institution": "Computer Science, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702356",
      "orcid": "0000-0003-0599-8108"
    },
    {
      "name": "Julia Feltham",
      "institution": "Department of Computer Science, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660232841",
      "orcid": "missing"
    },
    {
      "name": "Jinha Yoon",
      "institution": "Department of Psychology, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701371",
      "orcid": "0000-0001-6184-8433"
    },
    {
      "name": "Michael J Proulx",
      "institution": "Department of Psychology, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490649352",
      "orcid": "0000-0003-4066-3645"
    },
    {
      "name": "Eamonn O'Neill",
      "institution": "Department of Computer Science, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100041277",
      "orcid": "0000-0002-1637-458X"
    },
    {
      "name": "Christof Lutteroth",
      "institution": "Computer Science, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100238140",
      "orcid": "0000-0003-0634-7569"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. EmpowHER: Self-Defense Training. https://www.oculus.com/experiences/rift/2923737841073277/?locale=en_GB",
      "doi": ""
    },
    {
      "text": "[n.d.]. Regatta VR. https://regattavr.com/",
      "doi": ""
    },
    {
      "text": "[n.d.]. Vantage Point. https://www.tryvantagepoint.com/",
      "doi": ""
    },
    {
      "text": "Mikel Aickin and Helen Gensler. 1996. Adjusting for multiple testing when reporting research results: the Bonferroni vs Holm methods.American journal of public health 86, 5 (1996), 726–728.",
      "doi": ""
    },
    {
      "text": "APPG for UN Women. 2021. Prevalence and reporting of sexual harassment in UK public spaces. (2021).",
      "doi": ""
    },
    {
      "text": "Ali Azarbarzin, Michele Ostrowski, Patrick Hanly, and Magdy Younes. 2014. Relationship between arousal intensity and heart rate response to arousal. Sleep 37, 4 (2014), 645–653.",
      "doi": ""
    },
    {
      "text": "Rosa María Baños, Cristina Botella, Mariano Alcañiz, Víctor Liaño, Belén Guerrero, and Beatriz Rey. 2004. Immersion and emotion: their impact on the sense of presence. Cyberpsychology & behavior 7, 6 (2004), 734–741.",
      "doi": ""
    },
    {
      "text": "Alan S Bellack. 1983. Recurrent problems in the behavioral assessment of social skill. Behaviour Research and Therapy 21, 1 (1983), 29–41.",
      "doi": ""
    },
    {
      "text": "Michelle CD Blaxall, Barry S Parsonsona, and Neville R Robertson. 1993. The development and evaluation of a sexual harassment contact person training package. Behavior modification 17, 2 (1993), 148–163.",
      "doi": ""
    },
    {
      "text": "Cynthia Grant Bowman. 1993. Street Harassment and the Informal Ghettoization of Women. Harvard Law Review 106, 3 (1993), 517–580. http://www.jstor.org/stable/1341656",
      "doi": ""
    },
    {
      "text": "Emily Carl, Aliza T Stein, Andrew Levihn-Coon, Jamie R Pogue, Barbara Rothbaum, Paul Emmelkamp, Gordon JG Asmundson, Per Carlbring, and Mark B Powers. 2019. Virtual reality exposure therapy for anxiety and related disorders: A meta-analysis of randomized controlled trials. Journal of anxiety disorders 61 (2019), 27–36.",
      "doi": ""
    },
    {
      "text": "Christopher P Cerasoli, Jessica M Nicklin, and Michael T Ford. 2014. Intrinsic motivation and extrinsic incentives jointly predict performance: a 40-year meta-analysis.Psychological bulletin 140, 4 (2014), 980.",
      "doi": ""
    },
    {
      "text": "Shi-Yi Chen, Zhe Feng, and Xiaolian Yi. 2017. A general introduction to adjustment for multiple comparisons. Journal of thoracic disease 9, 6 (2017), 1725.",
      "doi": ""
    },
    {
      "text": "Rachel K Chesham, John M Malouff, and Nicola S Schutte. 2018. Meta-analysis of the efficacy of virtual reality exposure therapy for social anxiety. Behaviour Change 35, 3 (2018), 152–166.",
      "doi": ""
    },
    {
      "text": "Joon Hao Chuah, Andrew Robb, Casey White, Adam Wendling, Samsun Lampotang, Regis Kopper, and Benjamin Lok. 2012. Increasing agent physicality to raise social presence and elicit realistic behavior. In 2012 IEEE Virtual Reality Workshops (VRW). IEEE, 19–22.",
      "doi": "10.1109/VR.2012.6180871"
    },
    {
      "text": "M Meghan Davidson, Michael S Butchko, Krista Robbins, Lindsey W Sherd, and Sarah J Gervais. 2016. The mediating role of perceived safety on street harassment and anxiety.Psychology of Violence 6, 4 (2016), 553.",
      "doi": ""
    },
    {
      "text": "Edward L Deci. 86. Ryan. RM (1985). Intrinsic motivation and self-determination in human behavior. New York and London: Plenum 86 (86), 18–19.",
      "doi": ""
    },
    {
      "text": "Maria DelGreco and John Christensen. 2020. Effects of street harassment on anxiety, depression, and sleep quality of college women. Sex Roles 82, 7 (2020), 473–481.",
      "doi": ""
    },
    {
      "text": "Micaela Di Leonardo. 1981. The political economy of street harassment. Aegis (1981), 51–57.",
      "doi": ""
    },
    {
      "text": "Julia Diemer, Georg W Alpers, Henrik M Peperkorn, Youssef Shiban, and Andreas Mühlberger. 2015. The impact of perception and presence on emotional reactions: a review of research in virtual reality. Frontiers in psychology 6 (2015), 26.",
      "doi": ""
    },
    {
      "text": "Petra L Doan. 2010. The tyranny of gendered spaces–reflections from beyond the gender dichotomy. Gender, Place & Culture 17, 5 (2010), 635–654.",
      "doi": ""
    },
    {
      "text": "Anders Drachen, Lennart E Nacke, Georgios Yannakakis, and Anja Lee Pedersen. 2010. Correlation between heart rate, electrodermal activity and player experience in first-person shooter games. In Proceedings of the 5th ACM SIGGRAPH Symposium on Video Games. 49–54.",
      "doi": "10.1145/1836135.1836143"
    },
    {
      "text": "Tracey L Earle, Wolfgang Linden, and Joanne Weinberg. 1999. Differential effects of harassment on cardiovascular and salivary cortisol stress reactivity and recovery in women and men. Journal of psychosomatic research 46, 2 (1999), 125–141.",
      "doi": ""
    },
    {
      "text": "Darragh Egan, Sean Brennan, John Barrett, Yuansong Qiao, Christian Timmerer, and Niall Murray. 2016. An evaluation of Heart Rate and ElectroDermal Activity as an objective QoE evaluation method for immersive virtual reality environments. In 2016 Eighth International Conference on Quality of Multimedia Experience (QoMEX). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "John O Ekore. 2012. Gender differences in perception of sexual harassment among university students. Gender and Behaviour 10, 1 (2012), 4358–4369.",
      "doi": ""
    },
    {
      "text": "Mai ElSherief and Elizabeth Belding. 2015. The Urban Characteristics of Street Harassment: A First Look. In Proceedings of the 1st International ACM SIGSPATIAL Workshop on Smart Cities and Urban Analytics. 28–31.",
      "doi": "10.1145/2835022.2835027"
    },
    {
      "text": "Paul MG Emmelkamp, Katharina Meyerbröker, and Nexhmedin Morina. 2020. Virtual reality therapy in social anxiety disorder. Current psychiatry reports 22, 7 (2020).",
      "doi": ""
    },
    {
      "text": "Franz Faul, Edgar Erdfelder, Albert-Georg Lang, and Axel Buchner. 2007. G* Power 3: A flexible statistical power analysis program for the social, behavioral, and biomedical sciences. Behavior research methods 39, 2 (2007), 175–191.",
      "doi": ""
    },
    {
      "text": "Barbara L Fredrickson and Tomi-Ann Roberts. 1997. Objectification theory: Toward understanding women’s lived experiences and mental health risks. Psychology of women quarterly 21, 2 (1997), 173–206.",
      "doi": ""
    },
    {
      "text": "Peter Fromberger, Sabrina Meyer, Christina Kempf, Kirsten Jordan, and Jürgen L Müller. 2015. Virtual viewing time: the relationship between presence and sexual interest in androphilic and gynephilic men. PloS one 10, 5 (2015), e0127156.",
      "doi": ""
    },
    {
      "text": "Sarah Garcia, Soumya Joseph Abraham, and Marvin Andujar. 2021. Exploring Perceptions of Bystander Intervention Training using Virtual Reality. In ACM International Conference on Interactive Media Experiences. 253–257.",
      "doi": "10.1145/3452918.3465497"
    },
    {
      "text": "Carol Brooks Gardner. 1995. Passing by: Gender and public harassment. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Tom Geller. 2008. Overcoming the uncanny valley. IEEE computer graphics and applications 28, 4 (2008), 11–17.",
      "doi": "10.1109/MCG.2008.79"
    },
    {
      "text": "Sharon Goulds, Sophie Tanner, Nicole Kalms, and Gill Matthewson. 2018. Unsafe in the City - The Everyday Experiences of Girls and Young Women: The State of the World’s Girls 2018. Plan International. MDQLTY - F.",
      "doi": ""
    },
    {
      "text": "Wendy Hadley, Christopher Houck, Larry K Brown, Josh S Spitalnick, Mirtha Ferrer, and David Barker. 2019. Moving beyond role-play: evaluating the use of virtual reality to teach emotion regulation for the prevention of adolescent risk behavior within a randomized pilot trial. Journal of pediatric psychology 44, 4 (2019), 425–435.",
      "doi": ""
    },
    {
      "text": "André Helgert, Sabrina C Eimler, and Alexander Arntz. 2021. Stop Catcalling-A Virtual Environment Educating Against Street Harassment. In 2021 International Conference on Advanced Learning Technologies (ICALT). IEEE, 419–421.",
      "doi": ""
    },
    {
      "text": "Kathryn J Holland, Verónica Caridad Rabelo, Amber M Gustafson, Rita C Seabrook, and Lilia M Cortina. 2016. Sexual harassment against men: Examining the roles of feminist activism, sexuality, and organizational context.Psychology of Men & Masculinity 17, 1 (2016), 17.",
      "doi": ""
    },
    {
      "text": "Crescent Jicol, Chun Hin Wan, Benjamin Doling, Caitlin H Illingworth, Jinha Yoon, Charlotte Headey, Christof Lutteroth, Michael J Proulx, Karin Petrini, and Eamonn O’Neill. 2021. Effects of Emotion and Agency on Presence in Virtual Reality. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445588"
    },
    {
      "text": "Ernest N Jouriles, Renee McDonald, Antje Kullowatz, David Rosenfield, Gabriella S Gomez, and Anthony Cuevas. 2009. Can virtual reality increase the realism of role plays used to teach college women sexual coercion and rape-resistance skills?Behavior therapy 40, 4 (2009), 337–345.",
      "doi": ""
    },
    {
      "text": "Ernest N Jouriles, Lorelei Simpson Rowe, Renee McDonald, Cora G Platt, and Gabriella S Gomez. 2011. Assessing women’s responses to sexual threat: Validity of a virtual role-play procedure. Behavior therapy 42, 3 (2011), 475–484.",
      "doi": ""
    },
    {
      "text": "Mike Just, Hasmeet Chandok, Raghav Sampangi, Kirstie Hawkey, Alette Willis, JeyaBalaji Samuthiravelu, Dilpreet Gill, and Michael Altair. 2019. Personal Safety App Effectiveness. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": ""
    },
    {
      "text": "Naveena Karusala and Neha Kumar. 2017. Women’s safety in public spaces: Examining the efficacy of panic buttons in New Delhi. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3340–3351.",
      "doi": "10.1145/3025453.3025532"
    },
    {
      "text": "Holly Kearl. 2014. Unsafe and harassed in public spaces: A national street harassment report. (2014).",
      "doi": ""
    },
    {
      "text": "Konstantina Kilteni, Raphaela Groten, and Mel Slater. 2012. The sense of embodiment in virtual reality. Presence: Teleoperators and Virtual Environments 21, 4(2012), 373–387.",
      "doi": "10.1162/PRES_a_00124"
    },
    {
      "text": "Panagiotis Kourtesis, Simona Collina, Leonidas AA Doumas, and Sarah E MacPherson. 2019. Validation of the virtual reality neuroscience questionnaire: maximum duration of immersive virtual reality sessions without the presence of pertinent adverse symptomatology. Frontiers in human neuroscience 13 (2019), 417.",
      "doi": ""
    },
    {
      "text": "Daniël Lakens. 2013. Calculating and reporting effect sizes to facilitate cumulative science: a practical primer for t-tests and ANOVAs. Frontiers in psychology 4 (2013), 863.",
      "doi": ""
    },
    {
      "text": "Po-Hung Lin and Jun-Hao Chen. 2020. Effects of video type, display technique, and ambient illumination on visual and physiological performance. Journal of Ambient Intelligence and Humanized Computing (2020), 1–8.",
      "doi": ""
    },
    {
      "text": "Beth Livingston, M Grillo, and R Paluch. 2014. Cornell international survey on street harassment.",
      "doi": ""
    },
    {
      "text": "Roberto Lloréns, Enrique Noé, Carolina Colomer, and Mariano Alcañiz. 2015. Effectiveness, usability, and cost-benefit of a virtual reality–based telerehabilitation program for balance recovery after stroke: A randomized controlled trial. Archives of physical medicine and rehabilitation 96, 3(2015), 418–425.",
      "doi": ""
    },
    {
      "text": "Matthew Lombard, Theresa B Ditton, and Lisa Weinstein. 2009. Measuring presence: the temple presence inventory. In Proceedings of the 12th annual international workshop on presence. 1–15.",
      "doi": ""
    },
    {
      "text": "Claudie Loranger and Stéphane Bouchard. 2017. Validating a virtual environment for sexual assault victims. Journal of traumatic stress 30, 2 (2017), 157–165.",
      "doi": ""
    },
    {
      "text": "Laura Loucks, Carly Yasinski, Seth D Norrholm, Jessica Maples-Keller, Loren Post, Liza Zwiebach, Devika Fiorillo, Megan Goodlin, Tanja Jovanovic, Albert A Rizzo, 2019. You can do that?!: Feasibility of virtual reality exposure therapy in the treatment of PTSD due to military sexual trauma. Journal of anxiety disorders 61 (2019), 55–63.",
      "doi": ""
    },
    {
      "text": "Manish Madan and Mahesh K Nalla. 2016. Sexual harassment in public spaces: Examining gender differences in perceived seriousness and victimization. International criminal justice review 26, 2 (2016), 80–97.",
      "doi": ""
    },
    {
      "text": "Moira Maguire and Brid Delahunt. 2017. Doing a thematic analysis: A practical, step-by-step guide for learning and teaching scholars.All Ireland Journal of Higher Education 9, 3 (2017).",
      "doi": ""
    },
    {
      "text": "Guido Makransky, Lau Lilleholt, and Anders Aaby. 2017. Development and validation of the Multimodal Presence Scale for virtual reality environments: A confirmatory factor analysis and item response theory approach. Computers in Human Behavior 72 (2017), 276–285.",
      "doi": "10.1016/j.chb.2017.02.066"
    },
    {
      "text": "Abigail A Marsh and Robert James R Blair. 2008. Deficits in facial affect recognition among antisocial populations: A meta-analysis. Neuroscience & Biobehavioral Reviews 32, 3 (2008), 454–465.",
      "doi": ""
    },
    {
      "text": "Scott E Maxwell, Harold D Delaney, and Ken Kelley. 2017. Designing experiments and analyzing data: A model comparison perspective. Routledge.",
      "doi": ""
    },
    {
      "text": "Donald Meichenbaum. 2017. Stress inoculation training: A preventative and treatment approach. In The evolution of cognitive behavior therapy. Routledge, 101–124.",
      "doi": ""
    },
    {
      "text": "Miguel Melo, Sofia Sampaio, Luís Barbosa, José Vasconcelos-Raposo, and Maximino Bessa. 2016. The impact of different exposure times to 360 video experience on the sense of presence. In 2016 23rd Portuguese Meeting on Computer Graphics and Interaction (EPCGI). IEEE, 1–5.",
      "doi": ""
    },
    {
      "text": "Stanley Milgram. 1963. Behavioral study of obedience.The Journal of abnormal and social psychology 67, 4(1963), 371.",
      "doi": ""
    },
    {
      "text": "Mats Najström and Billy Jansson. 2007. Skin conductance responses as predictor of emotional responses to stressful life events. Behaviour research and therapy 45, 10 (2007), 2456–2463.",
      "doi": ""
    },
    {
      "text": "Viviane K Namaste. 2013. Genderbashing: Sexuality, Gender, and the Regulation of Public Space. Routledge.",
      "doi": ""
    },
    {
      "text": "Amie R Newins, Laura C Wilson, and Rebekah Z Kanefsky. 2020. What’s in a label? The impact of media and sexual assault characteristics on survivor rape acknowledgment. Journal of Traumatic Stress(2020).",
      "doi": ""
    },
    {
      "text": "Solène Neyret, Xavi Navarro, Alejandro Beacco, Ramon Oliva, Pierre Bourdin, Jose Valenzuela, Itxaso Barberia, and Mel Slater. 2020. An embodied perspective as a victim of sexual harassment in virtual reality reduces action conformity in a later Milgram obedience scenario. Scientific reports 10, 1 (2020), 1–18.",
      "doi": ""
    },
    {
      "text": "Federica Pallavicini, Luca Argenton, Nicola Toniazzi, Luciana Aceti, and Fabrizia Mantovani. 2016. Virtual reality applications for stress management training in the military. Aerospace medicine and human performance 87, 12 (2016), 1021–1030.",
      "doi": ""
    },
    {
      "text": "Mark B Powers and Paul MG Emmelkamp. 2008. Virtual reality exposure therapy for anxiety disorders: A meta-analysis. Journal of anxiety disorders 22, 3 (2008), 561–569.",
      "doi": ""
    },
    {
      "text": "Daniel J Rea, Denise Geiskkovitch, and James E Young. 2017. Wizard of awwws: Exploring psychological impact on the researchers in social HRI experiments. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. 21–29.",
      "doi": "10.1145/3029798.3034782"
    },
    {
      "text": "Laura A Reese and Karen E Lindenberg. 2005. Gender, age, and sexual harassment. Review of Public Personnel Administration 25, 4 (2005), 325–352.",
      "doi": ""
    },
    {
      "text": "Giuseppe Riva. 2002. The sociocognitive psychology of computer-mediated communication: The present and future of technology-based interactions. Cyberpsychology & behavior 5, 6 (2002), 581–598.",
      "doi": ""
    },
    {
      "text": "Giuseppe Riva, Fabrizia Mantovani, Claret Samantha Capideville, Alessandra Preziosa, Francesca Morganti, Daniela Villani, Andrea Gaggioli, Cristina Botella, and Mariano Alcañiz. 2007. Affective interactions using virtual reality: the link between presence and emotions. Cyberpsychology & behavior 10, 1 (2007), 45–56.",
      "doi": ""
    },
    {
      "text": "Albert Rizzo. 2005. Bravemind: virtual reality exposure therapy. University of Southern California Institute for Creatrive Technologies (2005).",
      "doi": ""
    },
    {
      "text": "Albert ‘Skip’ Rizzo and Russell Shilling. 2017. Clinical virtual reality tools to advance the prevention, assessment, and treatment of PTSD. European Journal of Psychotraumatology 8, sup5 (2017), 1414560.",
      "doi": ""
    },
    {
      "text": "Shane L Rogers, Ross Hollett, Yanqi R Li, and Craig P Speelman. 2020. An Evaluation of Virtual Reality Role-Play Experiences for Helping-Profession Courses. Teaching of Psychology(2020), 0098628320983231.",
      "doi": ""
    },
    {
      "text": "Maria Rotundo, Dung-Hanh Nguyen, and Paul R Sackett. 2001. A meta-analytic review of gender differences in perceptions of sexual harassment.Journal of applied psychology 86, 5 (2001), 914.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan, Heather Patrick, Edward L Deci, and Geoffrey C Williams. 2008. Facilitating health behaviour change and its maintenance: Interventions based on self-determination theory. The European health psychologist 10, 1 (2008), 2–5.",
      "doi": ""
    },
    {
      "text": "D Sapkaroski, M Mundy, and MR Dimmock. 2020. Virtual reality versus conventional clinical role-play for radiographic positioning training: a students’ perception study. Radiography 26, 1 (2020), 57–62.",
      "doi": ""
    },
    {
      "text": "Thomas Schubert, Frank Friedmann, and Holger Regenbrecht. 2001. The experience of presence: Factor analytic insights. Presence: Teleoperators & Virtual Environments 10, 3(2001), 266–281.",
      "doi": "10.1162/105474601300343603"
    },
    {
      "text": "Martijn J Schuemie, Peter Van Der Straaten, Merel Krijn, and Charles APG Van Der Mast. 2001. Research on presence in virtual reality: A survey. CyberPsychology & Behavior 4, 2 (2001), 183–201.",
      "doi": ""
    },
    {
      "text": "Sofia Seinfeld, Minye Zhan, Marta Poyo-Solanas, Giulia Barsuola, Maarten Vaessen, Mel Slater, Maria V Sanchez-Vives, and Beatrice de Gelder. 2021. Being the victim of virtual abuse changes default mode network responses to emotional expressions. cortex 135(2021), 268–284.",
      "doi": ""
    },
    {
      "text": "Anil K Seth, Keisuke Suzuki, and Hugo D Critchley. 2012. An interoceptive predictive coding model of conscious presence. Frontiers in psychology 2 (2012), 395.",
      "doi": ""
    },
    {
      "text": "Grant S Shields, Matthew A Sazma, and Andrew P Yonelinas. 2016. The effects of acute stress on core executive functions: A meta-analysis and comparison with cortisol. Neuroscience & Biobehavioral Reviews 68 (2016), 651–668.",
      "doi": ""
    },
    {
      "text": "Yu Shu, Yen-Zhang Huang, Shu-Hsuan Chang, and Mu-Yen Chen. 2019. Do virtual reality head-mounted displays make a difference? A comparison of presence and self-efficacy between head-mounted displays and desktop computer-facilitated virtual environments. Virtual Reality 23, 4 (2019), 437–446.",
      "doi": "10.1007/s10055-018-0376-x"
    },
    {
      "text": "Matthew J Smith, Emily J Ginger, Katherine Wright, Michael A Wright, Julie Lounds Taylor, Laura Boteler Humm, Dale E Olsen, Morris D Bell, and Michael F Fleming. 2014. Virtual reality job interview training in adults with autism spectrum disorder. Journal of autism and developmental disorders 44, 10(2014), 2450–2463.",
      "doi": ""
    },
    {
      "text": "Charles D Spielberger. 1983. State-trait anxiety inventory for adults. (1983).",
      "doi": ""
    },
    {
      "text": "Jette Sponholz, Eike Born, and Torsten Reiners. 2010. Simulation of Workplace Harassment in 3D Worlds. In EdMedia+ Innovate Learning. Association for the Advancement of Computing in Education (AACE), 3862–3865.",
      "doi": ""
    },
    {
      "text": "Margaret S Stockdale. 1996. Sexual harassment in the workplace: Perspectives, frontiers, and response strategies. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Joachim Taelman, Steven Vandeput, Arthur Spaepen, and Sabine Van Huffel. 2009. Influence of mental stress on heart rate and heart rate variability. In 4th European conference of the international federation for medical and biological engineering. Springer, 1366–1369.",
      "doi": ""
    },
    {
      "text": "Katy Tcha-Tokey, Emilie Loup-Escande, Olivier Christmann, and Simon Richir. 2016. A questionnaire to measure the user experience in immersive virtual environments. In Proceedings of the 2016 virtual reality international conference. 1–5.",
      "doi": "10.1145/2927929.2927955"
    },
    {
      "text": "Rebecca A Thacker and Haidee Allerton. 1992. Preventing sexual harassment in the workplace. Training & Development 46, 2 (1992), 50–54.",
      "doi": ""
    },
    {
      "text": "Frank Friedmann Isabelle Viaud-Delmon Thomas Schubert, Holger Regenbrecht. 2016. Igroup Presence Questionnaire (IPQ) Database. Retrieved Jan 5, 2021 from http://www.igroup.org/pq/ipq/data.php",
      "doi": ""
    },
    {
      "text": "Sara Ventura, Georgina Cardenas, Marta Miragall, Giuseppe Riva, and Rosa Baños. 2020. How Does It Feel to Be a Woman Victim of Sexual Harassment? The Effect of 360°-Video-Based Virtual Reality on Empathy and Related Variables. Cyberpsychology, Behavior, and Social Networking (2020).",
      "doi": ""
    },
    {
      "text": "Paul Hendriks Vettehen, Daan Wiltink, Maite Huiskamp, Gabi Schaap, and Paul Ketelaar. 2019. Taking the full view: How viewers respond to 360-degree video news. Computers in human behavior 91 (2019), 24–32.",
      "doi": ""
    },
    {
      "text": "James TR Walters, Jonathan I Bisson, and Jonathan P Shepherd. 2007. Predicting post-traumatic stress disorder: validation of the Trauma Screening Questionnaire in victims of assault. Psychological medicine 37, 1 (2007), 143–150.",
      "doi": ""
    },
    {
      "text": "D. Watson, L. Clark, and A. Tellegen. 1988. Development and validation of brief measures of positive and negative affect: the PANAS scales.Journal of personality and social psychology 54 6 (1988), 1063–70.",
      "doi": ""
    },
    {
      "text": "Theresa F Wechsler, Franziska Kümpers, and Andreas Mühlberger. 2019. Inferiority or even superiority of virtual reality exposure therapy in phobias?–A systematic review and quantitative meta-analysis on randomized controlled trials specifically comparing the efficacy of virtual reality exposure to gold standard in vivo exposure in agoraphobia, specific phobia, and social phobia. Frontiers in psychology 10 (2019), 1758.",
      "doi": ""
    },
    {
      "text": "Brenda K Wiederhold and Mark D Wiederhold. 2008. Virtual reality for posttraumatic stress disorder and stress inoculation training. Journal of CyberTherapy & Rehabilitation 1, 1 (2008), 23–35.",
      "doi": ""
    },
    {
      "text": "Dennis Patrick Wood, Jennifer A Murphy, Kristy B Center, Carol Russ, Robert N McLay, Dennis Reeves, Jeff Pyne, Russell Shilling, Jack Hagan, and Brenda K Wiederhold. 2008. Combat related post traumatic stress disorder: a multiple case report using virtual reality graded exposure therapy with physiological monitoring. Studies in health technology and informatics 132 (2008), 556.",
      "doi": ""
    },
    {
      "text": "Huizhong Wu. 2017. India says every phone must have a’panic button’by 2017, 2016.",
      "doi": ""
    },
    {
      "text": "YouGov. [n.d.]. YouGov Omnibus Safety. https://d25d2506sfb94s.cloudfront.net/cumulus_uploads/document/t8rytgg6ee/Results%20for%20YouGov%20Omnibus%20(Safety)%20072%2020.3.2019.xlsx%20%20[Group].pdf.",
      "doi": ""
    },
    {
      "text": "Pavel Zahorik and Rick L Jenison. 1998. Presence as being-in-the-world. Presence 7, 1 (1998), 78–89.",
      "doi": "10.1162/105474698565541"
    },
    {
      "text": "Chenyan Zhang, Aud Sissel Hoel, Andrew Perkis, and Saman Zadtootaghaj. 2018. How Long is Long Enough to Induce Immersion?. In 2018 Tenth International Conference on Quality of Multimedia Experience (QoMEX). IEEE, 1–6.",
      "doi": ""
    }
  ]
}