{
  "doi": "10.1145/3491102.3502136",
  "title": "Users Can Deduce Sensitive Locations Protected by Privacy Zones on Fitness Tracking Apps",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-21",
  "year": 2022,
  "badges": [],
  "abstract": "Fitness tracking applications allow athletes to record and share their exercises online, including GPS routes of their activities. However, sharing mobility data potentially raises real-world privacy and safety risks. One strategy to mitigate that risk is a “Privacy Zone,” which conceals portions of the exercise routes that fall within a certain radius of a user-designated sensitive location. A pressing concern is whether privacy zones are an effective deterrent against common attackers, such as a bike thief that carefully scrutinizes online exercise activities in search of their next target. Further, little is known about user perceptions of privacy zones or how they fit into the broader landscape of available privacy precautions.  This work presents an online user study (N=603) that investigates the privacy concerns of fitness tracking users and evaluates the efficacy of privacy zones. Participants were first asked about their privacy behaviors with respect to fitness tracking applications. Next, participants completed an interactive task in which they attempted to deduce hidden locations protected by a privacy zone; we manipulated the number of displayed exercise activities that interacted with the privacy zone, as well as its size. Finally, participants were asked further questions about their impressions of privacy zones and use of other privacy precautions. We found that participants successfully inferred protected locations; for the most common privacy zone size, 68% of guesses fell within 50 meters of the hidden location when participants were shown just 3 activities. Further, we found that participants who viewed 3 activities were more confident about their success in the task compared to participants who viewed 1 activity. Combined, these results indicate that users’ privacy-sensitive locations are at risk even when using a privacy zone. We conclude by considering the implications of our findings on related privacy features and discuss recommendations to fitness tracking users and services to improve the privacy and safety of fitness trackers.",
  "tags": [
    "privacy",
    "privacy zones",
    "online survey",
    "Fitness trackers",
    "data sharing"
  ],
  "authors": [
    {
      "name": "Jaron Mink",
      "institution": "Computer Science, University of Illinois at Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659658615",
      "orcid": "missing"
    },
    {
      "name": "Amanda Rose Yuile",
      "institution": "Psychology Department, University of Illinois at Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234816",
      "orcid": "missing"
    },
    {
      "name": "Uma Pal",
      "institution": "College of Information & Computer Sciences, University of Massachusetts Amherst, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660232833",
      "orcid": "missing"
    },
    {
      "name": "Adam J Aviv",
      "institution": "Computer Science, The George Washington University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81392608516",
      "orcid": "missing"
    },
    {
      "name": "Adam Bates",
      "institution": "Computer Science, University of Illinois at Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548267456",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Hazim Almuhimedi, Florian Schaub, Norman Sadeh, Idris Adjerid, Alessandro Acquisti, Joshua Gluck, Lorrie Faith Cranor, and Yuvraj Agarwal. 2015. Your Location Has Been Shared 5,398 Times! A Field Study on Mobile App Privacy Nudging. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 787–796. https://doi.org/10.1145/2702123.2702210",
      "doi": "10.1145/2702123.2702210"
    },
    {
      "text": "Abdulmajeed Alqhatani and Heather Richter Lipford. 2019. ”There is Nothing That i Need to Keep Secret”: Sharing practices and concerns of wearable fitness data. In Proceedings of the fifteenth USENIX conference on usable privacy and security(SOUPS’19). USENIX Association, Santa Clara, CA, USA, 421–434.",
      "doi": ""
    },
    {
      "text": "App Annie. 2019. State of Mobile 2019 Report. https://www.appannie.com/en/go/state-of-mobile-2019/",
      "doi": ""
    },
    {
      "text": "Athletic.net. 2020. GPS Privacy Zones. https://support.athletic.net/article/ghuixgcew6-gps-privacy-zones",
      "doi": ""
    },
    {
      "text": "[Mrs Balls]. 2017. Strava and stolen bikes. https://community.bikehub.co.za/topic/166972-strava-and-stolen-bikes/",
      "doi": ""
    },
    {
      "text": "Dale J. Barr, Roger Levy, Christoph Scheepers, and Harry J. Tily. 2013. Random effects structure for confirmatory hypothesis testing: Keep it maximal. Journal of Memory and Language 68, 3 (2013), 255–278. https://doi.org/10.1016/j.jml.2012.11.001",
      "doi": ""
    },
    {
      "text": "Douglas Bates, Martin Maechler, Ben Bolker, Steven Walker, Rune Haubo Bojesen Christensen, Henrik Singmann, Bin Dai, and Fabian Scheipl. 2012. Package ‘lme4’. CRAN. R Foundation for Statistical Computing, Vienna, Austria (2012).",
      "doi": ""
    },
    {
      "text": "Igor Bilogrevic and Martin Ortlieb. 2016. ”If You Put All The Pieces Together...”: Attitudes Towards Data Combination and Sharing Across Services and Companies. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 5215–5227. https://doi.org/10.1145/2858036.2858432",
      "doi": "10.1145/2858036.2858432"
    },
    {
      "text": "R. Chatterjee, P. Doerfler, H. Orgad, S. Havron, J. Palmer, D. Freed, K. Levy, N. Dell, D. McCoy, and T. Ristenpart. 2018. The Spyware Used in Intimate Partner Violence. In 2018 IEEE Symposium on Security and Privacy (SP). 441–458. https://doi.org/10.1109/SP.2018.00061",
      "doi": ""
    },
    {
      "text": "Konstantinos Chatzikokolakis, Miguel E Andrés, Nicolás Emilio Bordenabe, and Catuscia Palamidessi. 2013. Broadening the scope of differential privacy using metrics. In International Symposium on Privacy Enhancing Technologies Symposium. Springer, 82–102.",
      "doi": ""
    },
    {
      "text": "David Curry. 2020. Strava Revenue and Usage Statistics (2020). https://www.businessofapps.com/data/strava-statistics/.",
      "doi": ""
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2018. ”A Stalker’s Paradise”: How Intimate Partner Abusers Exploit Technology. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174241",
      "doi": "10.1145/3173574.3174241"
    },
    {
      "text": "Sandra Gabriele and Sonia Chiasson. 2020. Understanding Fitness Tracker Users’ Security and Privacy Knowledge, Attitudes and Behaviours. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376651",
      "doi": "10.1145/3313831.3376651"
    },
    {
      "text": "Garmin. 2021. Understanding Privacy Zones in Garmin Connect. https://support.garmin.com/en-US/?faq=B9dlXYxQIr97DQwho5TBR7",
      "doi": ""
    },
    {
      "text": "Matthew Gordon. 2018. Update to Privacy Zones Functionality. https://medium.com/strava-engineering/update-to-privacy-zones-functionality-98a570f6ebb.",
      "doi": ""
    },
    {
      "text": "Grand View Research. 2021. Fitness App Market Size, Share & Trends Analysis Report By Type (Exercise & Weight Loss, Activity Tracking), By Platform (Android, iOS), By Device (Smartphones, Wearable Devices), And Segment Forecasts, 2021 - 2028. https://www.grandviewresearch.com/industry-analysis/fitness-app-market.",
      "doi": ""
    },
    {
      "text": "Xinning Gui, Yu Chen, Clara Caldeira, Dan Xiao, and Yunan Chen. 2017. When Fitness Meets Social Networks: Investigating Fitness Tracking and Social Practices on WeRun. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 1647–1659. https://doi.org/10.1145/3025453.3025654",
      "doi": "10.1145/3025453.3025654"
    },
    {
      "text": "Wajih Ul Hassan, Saad Hussain, and Adam Bates. 2018. Analysis of privacy protections in fitness tracking social networks: You can run, but can you hide?. In Proceedings of the 27th USENIX conference on security symposium(SEC’18). USENIX Association, Baltimore, MD, USA, 497–512.",
      "doi": ""
    },
    {
      "text": "Alex Hern. 2018. Fitness tracking app Strava gives away location of secret US army bases. The Guardian (Jan. 2018). https://www.theguardian.com/world/2018/jan/28/fitness-tracking-app-gives-away-location-of-secret-us-army-bases",
      "doi": ""
    },
    {
      "text": "Predrag Klasnja, Sunny Consolvo, Tanzeem Choudhury, Richard Beckwith, and Jeffrey Hightower. 2009. Exploring privacy concerns about personal sensing. In International Conference on Pervasive Computing. Springer, 176–183.",
      "doi": "10.1007/978-3-642-01516-8_13"
    },
    {
      "text": "Alexandra Kuznetsova, Per Bruun Brockhoff, Rune Haubo Bojesen Christensen, 2015. Package ‘lmertest’. R package version 2, 0 (2015).",
      "doi": ""
    },
    {
      "text": "Steve Loughran. 2018. Advanced Deanonymization through Strava. http://steveloughran.blogspot.com/2018/01/advanced-denanonymization-through-strava.html",
      "doi": ""
    },
    {
      "text": "Ray Maker. 2021. Strava Adds Major New Privacy Zone Features, Plus More Privacy & Map Options. https://www.dcrainmaker.com/2021/08/strava-new-privacy-zone-features-options.html.",
      "doi": ""
    },
    {
      "text": "Megan McFadden. 2021. Privacy Zones. https://support.strava.com/hc/en-us/articles/115000173384-Privacy-Zones",
      "doi": ""
    },
    {
      "text": "Vivian Genaro Motti and Kelly Caine. 2015. Users’ privacy concerns about wearables. In International Conference on Financial Cryptography and Data Security. Springer, 231–244.",
      "doi": ""
    },
    {
      "text": "Nick Mueller. 2018. Strava’s privacy zone feature is almost worthless.https://medium.com/@nickolaus/stravas-privacy-zone-feature-is-almost-worthless-f47c5cebfece",
      "doi": ""
    },
    {
      "text": "Mark W. Newman, Debra Lauterbach, Sean A. Munson, Paul Resnick, and Margaret E. Morris. 2011. It’s Not That i Don’t Have Problems, i’m Just Not Putting Them on Facebook: Challenges and Opportunities in Using Online Social Networks for Health. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (Hangzhou, China) (CSCW ’11). Association for Computing Machinery, New York, NY, USA, 341–350. https://doi.org/10.1145/1958824.1958876",
      "doi": "10.1145/1958824.1958876"
    },
    {
      "text": "Olivia Nuzzi. 2020. What It’s Like to Get Doxed for Taking a Bike Ride. https://nymag.com/intelligencer/2020/06/what-its-like-to-get-doxed-for-taking-a-bike-ride.html",
      "doi": ""
    },
    {
      "text": "Liarna La Porta. 2018. Strava’s privacy zones have been revealing users’ hidden locations. https://www.wandera.com/stravas-privacy-zone/.",
      "doi": ""
    },
    {
      "text": "R Core Team. 2013. R: A language and environment for statistical computing. (2013).",
      "doi": ""
    },
    {
      "text": "Elissa M. Redmiles, Sean Kross, and Michelle L. Mazurek. 2019. How Well Do My Results Generalize? Comparing Security and Privacy Survey Results from MTurk, Web, and Telephone Samples. In 2019 IEEE Symposium on Security and Privacy (SP). 1326–1343. https://doi.org/10.1109/SP.2019.00014 ISSN: 2375-1207.",
      "doi": ""
    },
    {
      "text": "Stefan Schneegass, Romina Poguntke, and Tonja Machulla. 2019. Understanding the Impact of Information Representation on Willingness to Share Information. Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290605.3300753",
      "doi": ""
    },
    {
      "text": "Jeroen Stragier, Tom Evens, and Peter Mechant. 2015. Broadcast yourself: an exploratory study of sharing physical activity on social networking sites. Media International Australia 155, 1 (2015), 120–129.",
      "doi": ""
    },
    {
      "text": "Karen P. Tang, Jason I. Hong, and Daniel P. Siewiorek. 2011. Understanding How Visual Representations of Location Feeds Affect End-User Privacy Concerns. In Proceedings of the 13th International Conference on Ubiquitous Computing (Beijing, China) (UbiComp ’11). Association for Computing Machinery, New York, NY, USA, 207–216. https://doi.org/10.1145/2030112.2030141",
      "doi": "10.1145/2030112.2030141"
    },
    {
      "text": "Karen P. Tang, Jialiu Lin, Jason I. Hong, Daniel P. Siewiorek, and Norman Sadeh. 2010. Rethinking Location Sharing: Exploring the Implications of Social-Driven vs. Purpose-Driven Location Sharing. In Proceedings of the 12th ACM International Conference on Ubiquitous Computing (Copenhagen, Denmark) (UbiComp ’10). Association for Computing Machinery, New York, NY, USA, 85–94. https://doi.org/10.1145/1864349.1864363",
      "doi": "10.1145/1864349.1864363"
    },
    {
      "text": "Nick Tatt. 2014. Hide sensitive locations with privacy zones. https://www.mapmytracks.com/blog/entry/hide-sensitive-locations-with-privacy-zones",
      "doi": ""
    },
    {
      "text": "Rannie Teodoro and Mor Naaman. 2013. Fitter with Twitter: Understanding Personal Health and Fitness Activity in Social Media. In ICWSM, Vol. 7.",
      "doi": ""
    },
    {
      "text": "The Strava Club. 2021. More Privacy, More Control and More Fun. https://www.strava.com/clubs/231407/posts/17432797.",
      "doi": ""
    },
    {
      "text": "Alan Thompson. 2012. Lock your GPS data against bicycle thieves. https://www.scarletfire.co.uk/lock-your-gps-data-against-bicycle-thieves/ Section: Cycling.",
      "doi": ""
    },
    {
      "text": "Alan Thompson. 2014. Strava Security: Why bike thieves are laughing at Strava users. https://www.scarletfire.co.uk/bike-thieves-strava-security/ Section: Cycling.",
      "doi": ""
    },
    {
      "text": "Philippe Tremblay. 2018. Thieves allegedly use Strava to identify and steal cyclist’s $21,000 bike collection. https://cyclingmagazine.ca/sections/news/thieves-allegedly-use-strava-to-help-steal-cyclists-21000-bike-collection/",
      "doi": ""
    },
    {
      "text": "Jessica Vitak, Yuting Liao, Priya Kumar, Michael Zimmer, and Katherine Kritikos. 2018. Privacy attitudes and data valuation among fitness tracker users. In International Conference on Information. Springer, 229–239.",
      "doi": ""
    },
    {
      "text": "Michael Zimmer, Priya Kumar, Jessica Vitak, Yuting Liao, and Katie Chamberlain Kritikos. 2020. ‘There’s nothing really they can do with this information’: Unpacking how users manage privacy boundaries for personal fitness information. Information, Communication & Society 23, 7 (2020), 1020–1037.",
      "doi": ""
    }
  ]
}