{
  "doi": "10.1145/3491102.3502088",
  "title": "Nudging Behavior Change: Using In-Group and Out-Group Social Comparisons to Encourage Healthier Choices",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "This paper revisits concepts of nudge in the context of helping consumers to make healthier food choices. We introduce a novel form of social influence nudge not yet investigated by HCI scholars, the out-group social comparison, and test whether this form of nudging works at the point of checkout rather than the more conventional point of product consideration. Across two online experiments, we measure the effectiveness of using nutritional information nudges with added in-group (people like you) and out-group (people not like you) social comparisons. Our preliminary findings suggest that out-group social comparison nudges can be effective in encouraging both normal weight and overweight adults to reduce calories, even when these adults indicate that they do not typically change their diet behaviors. This research has implications for digital information design, interactive marketing, and public health.",
  "authors": [
    {
      "name": "Blake M. DiCosola III",
      "institution": "Oxford Internet Institute, University of Oxford, United Kingdom and Informatics, University of California, Irvine, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233713",
      "orcid": "missing"
    },
    {
      "name": "Gina Neff",
      "institution": "Minderoo Centre for Technology and Democracy, University of Cambridge, United Kingdom and Oxford Internet Institute, University of Oxford, United Kingdom",
      "img": "/do/10.1145/contrib-99659197282/rel-imgonly/neff_cogx2019_cropped2.jpg",
      "acmid": "99659197282",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M.S. 2000. The Intellectual Challenge of CSCW: The Gap Between Social Requirements and Technical Feasibility. Human–Computer Interaction. 15, 2–3 (Sep. 2000), 179–203. DOI:https://doi.org/10.1207/S15327051HCI1523_5.",
      "doi": "10.1207/S15327051HCI1523_5"
    },
    {
      "text": "Altarriba Bertran, F. 2018. Visualising the landscape of human-food interaction research. (2018), 243–248.",
      "doi": ""
    },
    {
      "text": "Ariely, D. and Levav, J. 2000. Sequential choice in group settings: Taking the road less traveled and less enjoyed. Journal of consumer Research. 27, 3 (2000), 279–290.",
      "doi": ""
    },
    {
      "text": "Ashburn-Nardo, L. 2001. Implicit associations as the seeds of intergroup bias: How easily do they take root? Journal of personality and social psychology. 81, 5 (2001), 789.",
      "doi": ""
    },
    {
      "text": "Benlian, A. 2012. Differential effects of provider recommendations and consumer reviews in e-commerce transactions: An experimental study. Journal of Management Information Systems. 29, 1 (Jul. 2012), 237–272. DOI:https://doi.org/10.2753/MIS0742-1222290107.",
      "doi": "10.2753/MIS0742-1222290107"
    },
    {
      "text": "Boseley, S. 2017. Global cost of obesity-related illness to hit $1.2tn a year from 2025.",
      "doi": ""
    },
    {
      "text": "Brewer, M.B. 1979. In-group bias in the minimal intergroup situation: A cognitive-motivational analysis. Psychological Bulletin. 86, 2 (Mar. 1979), 307–324.",
      "doi": ""
    },
    {
      "text": "Brewer, M.B. 1999. The Psychology of Prejudice: Ingroup Love and Outgroup Hate? Journal of Social Issues. 55, 3 (1999), 429–444. DOI:https://doi.org/10.1111/0022-4537.00126.",
      "doi": ""
    },
    {
      "text": "Brownell, K.D. and Horgen, K.B. 2004. Food fight: The inside story of the food industry, America's obesity crisis, and what we can do about it. (2004).",
      "doi": ""
    },
    {
      "text": "Bruner, G.C. 2017. Marketing scales handbook: multi-item measures for consumer insight research. Volume 9: ... GCBII Productions, LLC.",
      "doi": ""
    },
    {
      "text": "Cadario, R. and Chandon, P. 2019. Effectiveness or consumer acceptance? Tradeoffs in selecting healthy eating nudges. Food policy. 85, (2019), 1–6.",
      "doi": ""
    },
    {
      "text": "Cadario, R. and Chandon, P. 2019. Which Healthy Eating Nudges Work Best? A Meta-Analysis of Field Experiments. Marketing Science. (Jul. 2019), mksc.2018.1128. DOI:https://doi.org/10.1287/mksc.2018.1128.",
      "doi": ""
    },
    {
      "text": "Cadario, R. and Chandon, P. 2019. Which Healthy Eating Nudges Work Best? A Meta-Analysis of Field Experiments. Marketing Science. (Jul. 2019). DOI:https://doi.org/10.1287/mksc.2018.1128.",
      "doi": ""
    },
    {
      "text": "Caraban, A. 2019. 23 Ways to Nudge: A Review of Technology-Mediated Nudging in Human-Computer Interaction. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland UK, May 2019), 1–15.",
      "doi": "10.1145/3290605.3300733"
    },
    {
      "text": "Charness, G. and Chen, Y. 2020. Social Identity, Group Behavior, and Teams. Annual Review of Economics. 12, 1 (2020), 691–713. DOI:https://doi.org/10.1146/annurev-economics-091619-032800.",
      "doi": ""
    },
    {
      "text": "Cialdini, R.B. 2006. Influence: the psychology of persuasion, revised edition. New York: William Morrow. (2006).",
      "doi": ""
    },
    {
      "text": "Cialdini, R.B. 1993. The psychology of persuasion. New York. (1993).",
      "doi": ""
    },
    {
      "text": "Cioffi, C.E. 2015. A nudge in a healthy direction. The effect of nutrition labels on food purchasing behaviors in university dining facilities. Appetite. 92, (2015), 7–14.",
      "doi": ""
    },
    {
      "text": "Cohen, J. 2013. Statistical power analysis for the behavioral sciences. Academic press.",
      "doi": ""
    },
    {
      "text": "Colusso, L. 2016. Designing Closeness to Increase Gamers’ Performance. (2016), 3020–3024.",
      "doi": ""
    },
    {
      "text": "Conroy, D.E. 2014. Behavior Change Techniques in Top-Ranked Mobile Apps for Physical Activity. American Journal of Preventive Medicine. 46, 6 (Jun. 2014), 649–652. DOI:https://doi.org/10.1016/j.amepre.2014.01.010.",
      "doi": ""
    },
    {
      "text": "Cruwys, T. 2015. Social modeling of eating: A review of when and why social influence affects food intake and choice. Appetite. 86, (2015), 3–18.",
      "doi": ""
    },
    {
      "text": "DiCosola III, B.M. and Neff, G. 2020. Using social comparisons to facilitate healthier choices in online grocery shopping contexts. (2020), 1–8.",
      "doi": ""
    },
    {
      "text": "Effect size: http://www.psy.gla.ac.uk/∼steve/best/effect.html. Accessed: 2019-12-29.",
      "doi": ""
    },
    {
      "text": "Ensaff, H. 2021. A nudge in the right direction: the role of food choice architecture in changing populations’ diets. Proceedings of the Nutrition Society. 80, 2 (May 2021), 195–206. DOI:https://doi.org/10.1017/S0029665120007983.",
      "doi": ""
    },
    {
      "text": "[2Escalas, J.E. and Bettman, J.R. 2005. Self‐Construal, Reference Groups, and Brand Meaning. Journal of Consumer Research. 32, 3 (Dec. 2005), 378–389. DOI:https://doi.org/10.1086/497549.",
      "doi": ""
    },
    {
      "text": "Escalas, J.E. and Bettman, J.R. 2003. You Are What They Eat: The Influence of Reference Groups on Consumers’ Connections to Brands. Journal of Consumer Psychology. 13, 3 (2003), 339–348. DOI:https://doi.org/10.1207/S15327663JCP1303_14.",
      "doi": ""
    },
    {
      "text": "Evans, J.S.B.T. and Stanovich, K.E. 2013. Dual-Process Theories of Higher Cognition: Advancing the Debate. Perspectives on Psychological Science. 8, 3 (May 2013), 223–241. DOI:https://doi.org/10.1177/1745691612460685.",
      "doi": ""
    },
    {
      "text": "Experts: How do diets need to change to meet climate targets? 2020. https://www.carbonbrief.org/experts-how-do-diets-need-to-change-to-meet-climate-targets. Accessed: 2021-08-26.",
      "doi": ""
    },
    {
      "text": "Felsen, G. 2013. Decisional enhancement and autonomy: public attitudes towards overt and covert nudges. Judgment and Decision Making. 8, 3 (2013), 12.",
      "doi": ""
    },
    {
      "text": "Festinger, L. 1954. A theory of social comparison processes. Human relations. 7, 2 (1954), 117–140.",
      "doi": ""
    },
    {
      "text": "Fogg, B. 2009. A behavior model for persuasive design. Proceedings of the 4th International Conference on Persuasive Technology (Claremont, California, USA, Apr. 2009), 1–7.",
      "doi": "10.1145/1541948.1541999"
    },
    {
      "text": "For better or worse: The impact of upward social comparison on self-evaluations. - PsycNET: https://psycnet.apa.org/doiLanding?doi=10.1037%2F0033-2909.119.1.51. Accessed: 2021-12-23.",
      "doi": ""
    },
    {
      "text": "Forwood, S.E. 2015. Offering within-category food swaps to reduce energy density of food purchases: a study using an experimental online supermarket. International Journal of Behavioral Nutrition and Physical Activity. 12, 1 (Jun. 2015), 85. DOI:https://doi.org/10.1186/s12966-015-0241-1.",
      "doi": ""
    },
    {
      "text": "Gestel, L.C.V. 2018. Nudging at the checkout counter – A longitudinal study of the effect of a food repositioning nudge on healthy food choice. Psychology & Health. 33, 6 (Jun. 2018), 800–809. DOI:https://doi.org/10.1080/08870446.2017.1416116.",
      "doi": ""
    },
    {
      "text": "Gomez-Uribe, C.A. and Hunt, N. 2015. The Netflix recommender system: Algorithms, business value, and innovation. ACM Transactions on Management Information Systems (TMIS). 6, 4 (2015), 1–19.",
      "doi": "10.1145/2843948"
    },
    {
      "text": "Gouveia, R. 2016. Exploring the design space of glanceable feedback for physical activity trackers. (2016), 144–155.",
      "doi": ""
    },
    {
      "text": "Haubl, G. and Trifts, V. 2000. Consumer Decision Making in Online Shopping Environments: The Effects of Interactive Decision Aids. Marketing Science. 19, 1 (2000), 4–21.",
      "doi": "10.5555/2882592.2882594"
    },
    {
      "text": "van Herpen, E. and Trijp, H.C.M. van 2011. Front-of-pack nutrition labels. Their effect on attention and choices when consumers have varying goals and time constraints. Appetite. 57, 1 (Aug. 2011), 148–160. DOI:https://doi.org/10.1016/j.appet.2011.04.011.",
      "doi": ""
    },
    {
      "text": "In 2021, online grocery sales will surpass $100 billion: https://www.emarketer.com/content/2021-online-grocery-sales-will-surpass-100-billion. Accessed: 2021-08-27.",
      "doi": ""
    },
    {
      "text": "Jacobson, R.P. 2011. Bodies obliged and unbound: Differentiated response tendencies for injunctive and descriptive social norms. Journal of personality and social psychology. 100, 3 (2011), 433.",
      "doi": ""
    },
    {
      "text": "Kurt, D. 2011. The influence of friends on consumer spending: The role of agency–communion orientation and self-monitoring. Journal of Marketing Research. 48, 4 (2011), 741–754.",
      "doi": ""
    },
    {
      "text": "Lawrence, R.D. 2001. Personalization of Supermarket Product Recommendations. Applications of Data Mining to Electronic Commerce. R. Kohavi and F. Provost, eds. Springer US. 11–32.",
      "doi": ""
    },
    {
      "text": "Leary, M.R. 1995. Self-presentation: impression management and interpersonal behavior. Brown & Benchmark Publishers.",
      "doi": ""
    },
    {
      "text": "Leary, M.R. and Kowalski, R.M. 1990. Impression management: A literature review and two-component model. Psychological bulletin. 107, 1 (1990), 34.",
      "doi": ""
    },
    {
      "text": "List of 100 Top Selling Grocery Items 2021 & Tips: 2021. https://businessnes.com/list-of-top-selling-grocery-items-and-tips/. Accessed: 2021-08-26.",
      "doi": ""
    },
    {
      "text": "Liu, P.J. 2015. Vice-Virtue Bundles. 61, 1 (2015), 204–228.",
      "doi": ""
    },
    {
      "text": "Lockdown drives up lager sales but wipes £180m off makeup: 2020. http://www.theguardian.com/business/2020/dec/18/virus-drives-healthy-lager-sales-wipes-180m-makeup. Accessed: 2021-08-26.",
      "doi": ""
    },
    {
      "text": "Lowell, J. 2004. The food industry and its impact upon increasing global obesity: a case study. British food journal. (2004).",
      "doi": ""
    },
    {
      "text": "McFerran, B. 2010. I'll Have What She's Having: Effects of Social Influence and Body Type on the Food Choices of Others. Journal of Consumer Research. 36, 6 (Apr. 2010), 915–929. DOI:https://doi.org/10.1086/644611.",
      "doi": ""
    },
    {
      "text": "Meena, Satish; Swerdlow, Fiona; Kumar, S. The State of Global Online Grocery Retail, 2018.",
      "doi": ""
    },
    {
      "text": "Mollen, S. 2013. Healthy and unhealthy social norms and food selection. Findings from a field-experiment. Appetite. 65, (Jun. 2013), 83–89. DOI:https://doi.org/10.1016/j.appet.2013.01.020.",
      "doi": ""
    },
    {
      "text": "Munt, A.E. 2017. The barriers and enablers of healthy eating among young adults: a missing piece of the obesity puzzle: A scoping review. Obesity Reviews. 18, 1 (2017), 1–17. DOI:https://doi.org/10.1111/obr.12472.",
      "doi": ""
    },
    {
      "text": "Neff, G. and Nafus, D. 2016. Self-tracking. MIT Press.",
      "doi": ""
    },
    {
      "text": "Online grocery shopping boom to continue post-COVID-19: https://www.mintel.com/press-centre/food-and-drink/click-spend-90-of-brits-plan-to-continue-online-grocery-shopping-even-after-peak-covid-19-passes. Accessed: 2021-08-20.",
      "doi": ""
    },
    {
      "text": "Partington, R. 2017. Britons just need nudge to drive better or opt for healthier drinks, says report. The Guardian.",
      "doi": ""
    },
    {
      "text": "Perdices, M. 2018. Null hypothesis significance testing, p-values, effects sizes and confidence intervals. Brain Impairment. 19, 1 (2018), 70–80.",
      "doi": ""
    },
    {
      "text": "Promotions of unhealthy foods restricted from April 2022: https://www.gov.uk/government/news/promotions-of-unhealthy-foods-restricted-from-april-2022. Accessed: 2021-08-26.",
      "doi": ""
    },
    {
      "text": "Publications | The Behavioural Insights Team: https://www.bi.team/our-work/publications/. Accessed: 2019-12-29.",
      "doi": ""
    },
    {
      "text": "Ratner, R.K. and Kahn, B.E. 2002. The Impact of Private versus Public Consumption on Variety-Seeking Behavior. Journal of Consumer Research. 29, 2 (Sep. 2002), 246–257. DOI:https://doi.org/10.1086/341574.",
      "doi": ""
    },
    {
      "text": "Raturi, A. 2017. Designing sustainable food systems. (2017), 609–616.",
      "doi": ""
    },
    {
      "text": "Ren, X. 2018. Exploring Cooperative Fitness Tracking to Encourage Physical Activity among Office Workers. Proceedings of the ACM on Human-Computer Interaction. 2, CSCW (Nov. 2018), 146:1-146:20. DOI:https://doi.org/10.1145/3274415.",
      "doi": "10.1145/3274415"
    },
    {
      "text": "Salmon, S.J. 2015. Social proof in the supermarket: Promoting healthy choices under low self-control conditions. Food Quality and Preference. 45, (Oct. 2015), 113–120. DOI:https://doi.org/10.1016/j.foodqual.2015.06.004.",
      "doi": ""
    },
    {
      "text": "Schlenker, B.R. 1980. Impression management. Brooks/Cole Publishing Company Monterey, CA.",
      "doi": ""
    },
    {
      "text": "Sherif, M. 1958. Assimilation and contrast effects of anchoring stimuli on judgments. Journal of experimental psychology. 55, 2 (1958), 150.",
      "doi": ""
    },
    {
      "text": "Shteynberg, G. 2014. Feeling more together: Group attention intensifies emotion. Emotion. 14, 6 (2014), 1102.",
      "doi": ""
    },
    {
      "text": "Spiel, K. 2018. Fitter, Happier, More Productive: The Normative Ontology of Fitness Trackers. Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18 (Montreal QC, Canada, 2018), 1–10.",
      "doi": ""
    },
    {
      "text": "Study finds growing government use of sensitive data to ‘nudge’ behaviour: 2021. https://www.theguardian.com/technology/2021/sep/08/study-finds-growing-government-use-of-sensitive-data-to-nudge-behaviour. Accessed: 2021-09-08.",
      "doi": ""
    },
    {
      "text": "Sunstein, C.R. 2014. The Ethics of Nudging. SSRN Electronic Journal. (2014). DOI:https://doi.org/10.2139/ssrn.2526341.",
      "doi": ""
    },
    {
      "text": "Tajfel, H. 1971. Social categorization and intergroup behaviour. European journal of social psychology. 1, 2 (1971), 149–178.",
      "doi": ""
    },
    {
      "text": "Thaler, R.H. and Sunstein, C.R. 2008. Nudge: improving decisions about health, wealth, and happiness. Yale University Press.",
      "doi": ""
    },
    {
      "text": "The fastest-growing products and categories during the pandemic: Top Products 2020: https://www.thegrocer.co.uk/top-products/the-fastest-growing-products-and-categories-during-the-pandemic-top-products-2020/651534.article. Accessed: 2021-08-26.",
      "doi": ""
    },
    {
      "text": "Touré-Tillery, R. 2020. Feeling Judged? the Presence of Outgroup Members Promotes Virtuous Choices. ACR North American Advances. (2020).",
      "doi": ""
    },
    {
      "text": "VanEpps, E.M. 2021. EXPRESS: Choosing the Light Meal: Real-time Aggregation of Calorie Information Reduces Meal Calories. Journal of Marketing Research. (2021), 00222437211022367.",
      "doi": ""
    },
    {
      "text": "Wansink, B. 1998. An anchoring and adjustment model of purchase quantity decisions. Journal of Marketing Research. 35, 1 (1998), 71–81.",
      "doi": ""
    },
    {
      "text": "White, K. 2014. The Motivating Role of Dissociative Out-Groups in Encouraging Positive Consumer Behaviors. Journal of Marketing Research. 51, 4 (Aug. 2014), 433–447. DOI:https://doi.org/10.1509/jmr.12.0335.",
      "doi": ""
    },
    {
      "text": "Wilson Vanvoorhis, C.R. and Morgan, B.L. 2007. Understanding Power and Rules of Thumb for Determining Sample Sizes.",
      "doi": ""
    },
    {
      "text": "Yuan, M. 2016. Walmart Online Grocery Personalization: Behavioral Insights and Basket Recommendations. Advances in Conceptual Modeling (Cham, 2016), 49–64.",
      "doi": ""
    },
    {
      "text": "Zajonc, R.B. 1965. Social facilitation. Science. 149, 3681 (1965), 269–274.",
      "doi": ""
    },
    {
      "text": "2013. Measuring Up. The Medical Profession's Prescription for the Nation's Obesity Crisis.",
      "doi": ""
    }
  ]
}