{
  "doi": "10.1145/3491102.3501958",
  "title": "Impact of Out-of-Vocabulary Words on the Twitter Experience of Blind Users",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2022,
  "badges": [],
  "abstract": "Most people who are blind interact with social media content with the assistance of a screen reader, a software that converts text to speech. However, the language used in social media is well-known to contain several informal out-of-vocabulary words (e.g., abbreviations, wordplays, slang), many of which do not have corresponding standard pronunciations. The narration behavior of screen readers for such out-of-vocabulary words and the corresponding impact on the social media experience of blind screen reader users are still uncharted research territories. Therefore we seek to plug this knowledge gap by examining how current popular screen readers narrate different types of out-of-vocabulary words found on Twitter, and also, how the presence of such words in tweets influences the interaction behavior and comprehension of blind screen reader users. Our investigation showed that screen readers rarely autocorrect out-of-vocabulary words, and moreover they do not always exhibit ideal behavior for certain prolific types of out-of-vocabulary words such as acronyms and initialisms. We also observed that blind users often rely on tedious and taxing workarounds to comprehend actual meanings of out-of-vocabulary words. Informed by the observations, we finally discuss methods that can potentially reduce this interaction burden for blind users on social media.",
  "authors": [
    {
      "name": "Hae-Na Lee",
      "institution": "Department of Computer Science, Stony Brook University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659549541",
      "orcid": "missing"
    },
    {
      "name": "Vikas Ashok",
      "institution": "Department of Computer Science, Old Dominion University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "88158989757",
      "orcid": "0000-0002-4772-1265"
    }
  ],
  "references": [
    {
      "text": "American Foundation for the Blind. 2020. Screen Readers | American Foundation for the Blind. https://www.afb.org/blindness-and-low-vision/using-technology/assistive-technology-products/screen-readers.",
      "doi": ""
    },
    {
      "text": "Apple Inc.2021. Accessibility - Vision - Apple. https://www.apple.com/accessibility/vision/.",
      "doi": ""
    },
    {
      "text": "Apple Inc.2021. Change how VoiceOver pronounces text and symbols on Mac - Apple Support. https://support.apple.com/guide/voiceover/change-voiceover-pronounces-text-symbols-unac049/mac.",
      "doi": ""
    },
    {
      "text": "Apple Inc.2021. Use VoiceOver to correct misspelled words on Mac - Apple Support. https://support.apple.com/guide/voiceover/correct-misspelled-words-vo18514/mac.",
      "doi": ""
    },
    {
      "text": "Apple Inc.2021. Use VoiceOver to read text on Mac - Apple Support. https://support.apple.com/guide/voiceover/read-text-vo2706/mac.",
      "doi": ""
    },
    {
      "text": "[6] Ariana Grande.2021. https://twitter.com/ArianaGrande/status/1412803402371829766",
      "doi": ""
    },
    {
      "text": "Sercan Ö. Arik, Mike Chrzanowski, Adam Coates, Gregory Diamos, Andrew Gibiansky, Yongguo Kang, Xian Li, John Miller, Andrew Ng, Jonathan Raiman, Shubho Sengupta, and Mohammad Shoeybi. 2017. Deep Voice: Real-Time Neural Text-to-Speech. In Proceedings of the 34th International Conference on Machine Learning - Volume 70 (Sydney, NSW, Australia) (ICML’17). JMLR.org, 195–204.",
      "doi": ""
    },
    {
      "text": "Muhammad Zubair Asghar, Fazal Masud Kundi, Shakeel Ahmad, Aurangzeb Khan, and Furqan Khan. 2018. T-SAF: Twitter sentiment analysis framework using a hybrid classification scheme. Expert Systems 35, 1 (2018), e12233. https://doi.org/10.1111/exsy.12233 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/exsy.12233e12233 EXSY-Jul-16-169.R1.",
      "doi": ""
    },
    {
      "text": "Tyler Baldwin and Joyce Chai. 2011. Beyond normalization: Pragmatics of word form in text messages. In Proceedings of 5th International Joint Conference on Natural Language Processing. 1437–1441.",
      "doi": ""
    },
    {
      "text": "Timothy Baldwin, Paul Cook, Marco Lui, Andrew MacKinlay, and Li Wang. 2013. How Noisy Social Media Text, How Diffrnt Social Media Sources?. In Proceedings of the Sixth International Joint Conference on Natural Language Processing. Asian Federation of Natural Language Processing, Nagoya, Japan, 356–364. https://aclanthology.org/I13-1041",
      "doi": ""
    },
    {
      "text": "Timothy Baldwin, Marie Catherine de Marneffe, Bo Han, Young-Bum Kim, Alan Ritter, and Wei Xu. 2015. Shared Tasks of the 2015 Workshop on Noisy User-generated Text: Twitter Lexical Normalization and Named Entity Recognition. In Proceedings of the Workshop on Noisy User-generated Text. Association for Computational Linguistics, Beijing, China, 126–135. https://doi.org/10.18653/v1/W15-4319",
      "doi": ""
    },
    {
      "text": "Tiberiu Boroș, Dan Ștefănescu, and Radu Ion. 2013. Handling Two Difficult Challenges for Text-to-Speech Synthesis Systems: Out-of-Vocabulary Words and Prosody: A Case Study in Romanian. Springer New York, New York, NY, 137–161. https://doi.org/10.1007/978-1-4614-6934-6_7",
      "doi": ""
    },
    {
      "text": "James V. Bradley. 1958. Complete Counterbalancing of Immediate Sequential Effects in a Latin Square Design. J. Amer. Statist. Assoc. 53, 282 (1958), 525–528. https://doi.org/10.1080/01621459.1958.10501456 arXiv:https://amstat.tandfonline.com/doi/pdf/10.1080/01621459.1958.10501456",
      "doi": ""
    },
    {
      "text": "Phil Bradley. 2010. Be where the conversations are: The critical importance of social media. Business Information Review 27, 4 (2010), 248–252. https://doi.org/10.1177/0266382110390976",
      "doi": ""
    },
    {
      "text": "Erin L. Brady, Yu Zhong, Meredith Ringel Morris, and Jeffrey P. Bigham. 2013. Investigating the Appropriateness of Social Network Question Asking as a Resource for Blind Users. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (San Antonio, Texas, USA) (CSCW ’13). Association for Computing Machinery, New York, NY, USA, 1225–1236. https://doi.org/10.1145/2441776.2441915",
      "doi": "10.1145/2441776.2441915"
    },
    {
      "text": "Danielle Bragg, Cynthia Bennett, Katharina Reinecke, and Richard Ladner. 2018. A Large Inclusive Study of Human Listening Rates. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174018",
      "doi": ""
    },
    {
      "text": "Samuel Brody and Nicholas Diakopoulos. 2011. Cooooooooooooooollllllllllllll!!!!!!!!!!!!!! Using Word Lengthening to Detect Sentiment in Microblogs. In Proceedings of the Conference on Empirical Methods in Natural Language Processing (Edinburgh, United Kingdom) (EMNLP ’11). Association for Computational Linguistics, USA, 562–570.",
      "doi": ""
    },
    {
      "text": "Marcel Broersma and Todd Graham. 2013. Twitter as a news source: How Dutch and British newspapers used tweets in their news coverage, 2007–2011. Journalism practice 7, 4 (2013), 446–464.",
      "doi": ""
    },
    {
      "text": "[19] Bruno Mars.2021. https://twitter.com/BrunoMars/status/1368698305769742336",
      "doi": ""
    },
    {
      "text": "Chris Woodford. 2021. Speech synthesizers. https://www.explainthatstuff.com/how-speech-synthesis-works.html.",
      "doi": ""
    },
    {
      "text": "Eleanor Clark and Kenji Araki. 2011. Text Normalization in Social Media: Progress, Problems and Applications for a Pre-Processing System of Casual English. Procedia - Social and Behavioral Sciences 27 (2011), 2 – 11. https://doi.org/10.1016/j.sbspro.2011.10.577 Computational Linguistics and Related Fields.",
      "doi": ""
    },
    {
      "text": "Aliya Deri and Kevin Knight. 2016. Grapheme-to-Phoneme Models for (Almost) Any Language. In Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). Association for Computational Linguistics, Berlin, Germany, 399–408. https://doi.org/10.18653/v1/P16-1038",
      "doi": ""
    },
    {
      "text": "Digital.gov. 2020. Federal Social Media Accessibility Toolkit Hackpad. https://digital.gov/resources/federal-social-media-accessibility-toolkit-hackpad/.",
      "doi": ""
    },
    {
      "text": "Peter Ebden and Richard Sproat. 2015. The Kestrel TTS text normalization system. Natural Language Engineering 21, 3 (2015), 333.",
      "doi": ""
    },
    {
      "text": "Jacob Eisenstein. 2013. What to do about bad language on the internet. In Proceedings of the 2013 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, Atlanta, Georgia, 359–369. https://aclanthology.org/N13-1037",
      "doi": ""
    },
    {
      "text": "Facebook. 2021. Facebook Reports Second Quarter 2021 Results. https://investor.fb.com/investor-news/press-release-details/2021/facebook-reports-second-quarter-2021-results/default.aspx.",
      "doi": ""
    },
    {
      "text": "Tim Finin, William Murnane, Anand Karandikar, Nicholas Keller, Justin Martineau, and Mark Dredze. 2010. Annotating Named Entities in Twitter Data with Crowdsourcing. In Mturk@HLT-NAACL. 80–88. https://aclanthology.info/papers/W10-0713/w10-0713",
      "doi": ""
    },
    {
      "text": "Freedom Scientific. 2021. Dictionary Manager in JAWS and MAGic. https://doccenter.freedomscientific.com/doccenter2/doccenter/rs25c51746a0cc/dictionarymanager/02_dictionarymanager.htm.",
      "doi": ""
    },
    {
      "text": "Freedom Scientific. 2021. JAWS Reading Commands. https://www.freedomscientific.com/SurfsUp/Reading_Commands.htm.",
      "doi": ""
    },
    {
      "text": "Freedom Scientific. 2021. JAWS ® – Freedom Scientific. https://www.freedomscientific.com/products/software/jaws/.",
      "doi": ""
    },
    {
      "text": "Cole Gleason, Patrick Carrington, Cameron Cassidy, Meredith Ringel Morris, Kris M. Kitani, and Jeffrey P. Bigham. 2019. “It’s Almost like They’re Trying to Hide It”: How User-Provided Image Descriptions Have Failed to Make Twitter Accessible. In The World Wide Web Conference (San Francisco, CA, USA) (WWW ’19). Association for Computing Machinery, New York, NY, USA, 549–559. https://doi.org/10.1145/3308558.3313605",
      "doi": "10.1145/3308558.3313605"
    },
    {
      "text": "Cole Gleason, Amy Pavel, Himalini Gururaj, Kris Kitani, and Jeffrey Bigham. 2020. Making GIFs Accessible. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, Greece) (ASSETS ’20). Association for Computing Machinery, New York, NY, USA, Article 24, 10 pages. https://doi.org/10.1145/3373625.3417027",
      "doi": ""
    },
    {
      "text": "Cole Gleason, Amy Pavel, Xingyu Liu, Patrick Carrington, Lydia B. Chilton, and Jeffrey P. Bigham. 2019. Making Memes Accessible. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility (Pittsburgh, PA, USA) (ASSETS ’19). Association for Computing Machinery, New York, NY, USA, 367–376. https://doi.org/10.1145/3308561.3353792",
      "doi": "10.1145/3308561.3353792"
    },
    {
      "text": "Cole Gleason, Amy Pavel, Emma McCamey, Christina Low, Patrick Carrington, Kris M. Kitani, and Jeffrey P. Bigham. 2020. Twitter A11y: A Browser Extension to Make Twitter Images Accessible. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376728",
      "doi": "10.1145/3313831.3376728"
    },
    {
      "text": "Kristina Gligorić, Ashton Anderson, and Robert West. 2018. How Constraints Affect Content: The Case of Twitter’s Switch from 140 to 280 Characters. Proceedings of the International AAAI Conference on Web and Social Media 12, 1 (Jun. 2018). https://ojs.aaai.org/index.php/ICWSM/article/view/15079",
      "doi": ""
    },
    {
      "text": "Xavi Gonzalvo, Siamak Tazari, Chun an Chan, Markus Becker, Alexander Gutkin, and Hanna Silen (Eds.). 2016. Recent Advances in Google Real-time HMM-driven Unit Selection Synthesizer. Sep 8–12, San Francisco, USA. http://www.isca-speech.org/archive/Interspeech_2016/pdfs/0264.PDF",
      "doi": ""
    },
    {
      "text": "Bo Han and Timothy Baldwin. 2011. Lexical Normalisation of Short Text Messages: Makn Sens a #twitter. In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, Portland, Oregon, USA, 368–378. https://www.aclweb.org/anthology/P11-1038",
      "doi": "10.5555/2002472.2002520"
    },
    {
      "text": "Bo Han, Paul Cook, and Timothy Baldwin. 2013. Lexical Normalization for Social Media Text. ACM Trans. Intell. Syst. Technol. 4, 1, Article 5 (Feb. 2013), 27 pages. https://doi.org/10.1145/2414425.2414430",
      "doi": "10.1145/2414425.2414430"
    },
    {
      "text": "Yuheng Hu, Kartik Talamadupula, and Subbarao Kambhampati. 2013. Dude, srsly?: The surprisingly formal nature of Twitter’s language. In Proceedings of the 7th International Conference on Weblogs and Social Media, ICWSM 2013. AAAI press, 244–253. 7th International AAAI Conference on Weblogs and Social Media, ICWSM 2013 ; Conference date: 08-07-2013 Through 11-07-2013.",
      "doi": ""
    },
    {
      "text": "Muhammad Imran, Prasenjit Mitra, and Carlos Castillo. 2016. Twitter as a lifeline: Human-annotated Twitter corpora for NLP of crisis-related messages. In Proceedings of the 10th International Conference on Language Resources and Evaluation, LREC 2016(Proceedings of the 10th International Conference on Language Resources and Evaluation, LREC 2016), Nicoletta Calzolari, Khalid Choukri, Helene Mazo, Asuncion Moreno, Thierry Declerck, Sara Goggi, Marko Grobelnik, Jan Odijk, Stelios Piperidis, Bente Maegaard, and Joseph Mariani (Eds.). European Language Resources Association (ELRA), 1638–1643.",
      "doi": ""
    },
    {
      "text": "[41] jimmy fallon.2020. https://twitter.com/jimmyfallon/status/1304436658218172419",
      "doi": ""
    },
    {
      "text": "Jonathan Avila. 2016. ZIP, Z I P, or Z.I.P.? Forcing Correct Pronunciation in Screen Readers. https://www.levelaccess.com/zip-z-p-z-p-forcing-correct-pronunciation-screen-readers/",
      "doi": ""
    },
    {
      "text": "[43] Justin Timberlake.2016. https://twitter.com/jtimberlake/status/696535631757860864",
      "doi": ""
    },
    {
      "text": "Bam Bahadur Kadayat and Evelyn Eika. 2020. Impact of Sentence Length on the Readability of Web for Screen Reader Users. In Universal Access in Human-Computer Interaction. Design Approaches and Supporting Technologies, Margherita Antona and Constantine Stephanidis (Eds.). Springer International Publishing, Cham, 261–271.",
      "doi": ""
    },
    {
      "text": "[45] KATY PERRY.2021. https://twitter.com/katyperry/status/1395640269073096706",
      "doi": ""
    },
    {
      "text": "Taiwo Kolajo, Olawande Daramola, Ayodele Adebiyi, and Aaditeshwar Seth. 2020. A framework for pre-processing of social media feeds based on integrated local knowledge base. Information Processing & Management 57, 6 (2020), 102348. https://doi.org/10.1016/j.ipm.2020.102348",
      "doi": ""
    },
    {
      "text": "[47] Lady Gaga.2020. https://twitter.com/ladygaga/status/1266217765645381632",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Aaron Allen, Jason Kleinman, and Chris Malarkey. 2007. What Frustrates Screen Reader Users on the Web: A Study of 100 Blind Users. International Journal of Human–Computer Interaction 22, 3(2007), 247–269. https://doi.org/10.1080/10447310709336964 arXiv:https://doi.org/10.1080/10447310709336964",
      "doi": ""
    },
    {
      "text": "Chen Li and Yang Liu. 2012. Improving Text Normalization using Character-Blocks Based Models and System Combination. In Proceedings of COLING 2012. The COLING 2012 Organizing Committee, Mumbai, India, 1587–1602. https://aclanthology.org/C12-1097",
      "doi": ""
    },
    {
      "text": "Fei Liu, Fuliang Weng, and Xiao Jiang. 2012. A Broad-Coverage Normalization System for Social Media Language. In Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics: Long Papers - Volume 1 (Jeju Island, Korea) (ACL ’12). Association for Computational Linguistics, USA, 1035–1044.",
      "doi": ""
    },
    {
      "text": "Fei Liu, Fuliang Weng, Bingqing Wang, and Yang Liu. 2011. Insertion, Deletion, or Substitution? Normalizing Text Messages without Pre-categorization nor Supervision. In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, Portland, Oregon, USA, 71–76. https://www.aclweb.org/anthology/P11-2013",
      "doi": ""
    },
    {
      "text": "Kun Liu. 2021. Incorporate Out-of-Vocabulary Words for Psycholinguistic Analysis using Social Media Texts-An OOV-Aware Data Curation Process and a Hybrid Approach. Ph. D. Dissertation. The Claremont Graduate University.",
      "doi": ""
    },
    {
      "text": "Xingyu Liu, Patrick Carrington, Xiang ’Anthony’ Chen, and Amy Pavel. 2021. What Makes Videos Accessible to Blind and Visually Impaired People?Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445233",
      "doi": ""
    },
    {
      "text": "Nikola Ljubešić, Darja Fišer, Tomaž Erjavec, Jaka Čibej, Dafne Marko, Senja Pollak, and Iza Škrjanec. 2015. Predicting the Level of Text Standardness in User-generated Content. In Proceedings of the International Conference Recent Advances in Natural Language Processing. INCOMA Ltd. Shoumen, BULGARIA, Hissar, Bulgaria, 371–378. https://aclanthology.org/R15-1049",
      "doi": ""
    },
    {
      "text": "Ismini Lourentzou, Kabir Manghnani, and ChengXiang Zhai. 2019. Adapting Sequence to Sequence Models for Text Normalization in Social Media. Proceedings of the International AAAI Conference on Web and Social Media 13, 01 (Jul. 2019), 335–345. https://www.aaai.org/ojs/index.php/ICWSM/article/view/3234",
      "doi": ""
    },
    {
      "text": "Haley MacLeod, Cynthia L. Bennett, Meredith Ringel Morris, and Edward Cutrell. 2017. Understanding Blind People’s Experiences with Computer-Generated Captions of Social Media Images. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 5988–5999. https://doi.org/10.1145/3025453.3025814",
      "doi": "10.1145/3025453.3025814"
    },
    {
      "text": "Suman Maity, Anshit Chaudhary, Shraman Kumar, Animesh Mukherjee, Chaitanya Sarda, Abhijeet Patil, and Akash Mondal. 2016. Wassup? lol: Characterizing out-of-vocabulary words in twitter. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion. 341–344.",
      "doi": "10.1145/2818052.2869110"
    },
    {
      "text": "Meredith Ringel Morris, Annuska Zolyomi, Catherine Yao, Sina Bahram, Jeffrey P. Bigham, and Shaun K. Kane. 2016. ”With Most of It Being Pictures Now, I Rarely Use It”: Understanding Twitter’s Evolving Accessibility to Blind Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 5506–5516. https://doi.org/10.1145/2858036.2858116",
      "doi": "10.1145/2858036.2858116"
    },
    {
      "text": "Dong Nguyen and Jack Grieve. 2020. Do Word Embeddings Capture Spelling Variation?. In Proceedings of the 28th International Conference on Computational Linguistics. International Committee on Computational Linguistics, Barcelona, Spain (Online), 870–881. https://doi.org/10.18653/v1/2020.coling-main.75",
      "doi": ""
    },
    {
      "text": "Rasmus Kleis Nielsen and Kim Christian Schrøder. 2014. The Relative Importance of Social Media for Accessing, Finding, and Engaging with News. Digital Journalism 2, 4 (2014), 472–489. https://doi.org/10.1080/21670811.2013.872420",
      "doi": ""
    },
    {
      "text": "NV Access. 2021. NV Access. https://www.nvaccess.org/.",
      "doi": ""
    },
    {
      "text": "Corinna Oschatz, Sebastian Stier, and Jürgen Maier. 2021. Twitter in the news: An analysis of embedded tweets in political news coverage. Digital Journalism (2021), 1–20.",
      "doi": ""
    },
    {
      "text": "Deana Pennell and Yang Liu. 2011. Toward text message normalization: Modeling abbreviation generation. In 2011 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). 5364–5367. https://doi.org/10.1109/ICASSP.2011.5947570",
      "doi": ""
    },
    {
      "text": "Deana L. Pennell and Yang Liu. 2010. Normalization of text messages for text-to-speech. In 2010 IEEE International Conference on Acoustics, Speech and Signal Processing. 4842–4845. https://doi.org/10.1109/ICASSP.2010.5495127",
      "doi": ""
    },
    {
      "text": "Deana L Pennell and Yang Liu. 2014. Normalization of informal text. Computer Speech & Language 28, 1 (2014), 256–277.",
      "doi": "10.1016/j.csl.2013.07.001"
    },
    {
      "text": "Cal Peyser, Hao Zhang, Tara N Sainath, and Zelin Wu. 2019. Improving performance of end-to-end ASR on numeric sequences. arXiv preprint arXiv:1907.01372(2019).",
      "doi": ""
    },
    {
      "text": "Kanishka Rao, Fuchun Peng, Haşim Sak, and Françoise Beaufays. 2015. Grapheme-to-phoneme conversion using Long Short-Term Memory recurrent neural networks. In 2015 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). 4225–4229. https://doi.org/10.1109/ICASSP.2015.7178767",
      "doi": ""
    },
    {
      "text": "[68] Rihanna.2019. https://twitter.com/rihanna/status/1175960582467588096",
      "doi": ""
    },
    {
      "text": "Johnny Saldaña. 2015. The coding manual for qualitative researchers. Sage.",
      "doi": ""
    },
    {
      "text": "Elliot Salisbury, Ece Kamar, and Meredith Ringel Morris. 2017. Toward Scalable Social Alt Text: Conversational Crowdsourcing as a Tool for Refining Vision-to-Language Technology for the Blind.",
      "doi": ""
    },
    {
      "text": "Rebecca Sawyer and Guo-Ming Chen. 2012. The impact of social media on intercultural adaptation. (2012).",
      "doi": ""
    },
    {
      "text": "Richard Sproat and Navdeep Jaitly. 2017. An RNN Model of Text Normalization.. In INTERSPEECH. Stockholm, 754–758.",
      "doi": ""
    },
    {
      "text": "Abigale Stangl, Meredith Ringel Morris, and Danna Gurari. 2020. ”Person, Shoes, Tree. Is the Person Naked?” What People with Vision Impairments Want in Image Descriptions. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376404",
      "doi": "10.1145/3313831.3376404"
    },
    {
      "text": "Simo Editha Tchokni, Diarmuid O Séaghdha, and Daniele Quercia. 2014. Emoticons and phrases: Status symbols in social media. In Eighth International AAAI Conference on Weblogs and Social Media.",
      "doi": ""
    },
    {
      "text": "Irina Temnikova, Sarah Vieweg, and Carlos Castillo. 2015. The Case for Readability of Crisis Communications in Social Media. In Proceedings of the 24th International Conference on World Wide Web (Florence, Italy) (WWW ’15 Companion). Association for Computing Machinery, New York, NY, USA, 1245–1250. https://doi.org/10.1145/2740908.2741718",
      "doi": "10.1145/2740908.2741718"
    },
    {
      "text": "Garreth W. Tigwell, Benjamin M. Gorman, and Rachel Menzies. 2020. Emoji Accessibility for Visually Impaired People. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376267",
      "doi": "10.1145/3313831.3376267"
    },
    {
      "text": "Keiichi Tokuda. 2019. Statistical Approach to Speech Synthesis: Past, Present and Future.. In INTERSPEECH.",
      "doi": ""
    },
    {
      "text": "Twitter. 2021. Q2 2021 Letter to Shareholders. https://s22.q4cdn.com/826641620/files/doc_financials/2021/q2/Q2'21-Shareholder-Letter.pdf.",
      "doi": ""
    },
    {
      "text": "Violeta Voykinska, Shiri Azenkot, Shaomei Wu, and Gilly Leshed. 2016. How Blind People Interact with Visual Content on Social Networking Services. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 1584–1595. https://doi.org/10.1145/2818048.2820013",
      "doi": "10.1145/2818048.2820013"
    },
    {
      "text": "Pidong Wang and Hwee Tou Ng. 2013. A Beam-Search Decoder for Normalization of Social Media Text with Application to Machine Translation. In Proceedings of the 2013 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, Atlanta, Georgia, 471–481. https://www.aclweb.org/anthology/N13-1050",
      "doi": ""
    },
    {
      "text": "WebAIM. 2019. WebAIM: Screen Reader User Survey #8 Results. https://webaim.org/projects/screenreadersurvey8/",
      "doi": ""
    },
    {
      "text": "Brian Wentz and Jonathan Lazar. 2011. Are Separate Interfaces Inherently Unequal? An Evaluation with Blind Users of the Usability of Two Interfaces for a Social Networking Platform. In Proceedings of the 2011 IConference (Seattle, Washington, USA) (iConference ’11). Association for Computing Machinery, New York, NY, USA, 91–97. https://doi.org/10.1145/1940761.1940774",
      "doi": "10.1145/1940761.1940774"
    },
    {
      "text": "Shaomei Wu and Lada A. Adamic. 2014. Visually Impaired Users on an Online Social Network. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 3133–3142. https://doi.org/10.1145/2556288.2557415",
      "doi": "10.1145/2556288.2557415"
    },
    {
      "text": "Shaomei Wu, Jeffrey Wieland, Omid Farivar, and Julie Schiller. 2017. Automatic Alt-Text: Computer-Generated Image Descriptions for Blind Users on a Social Network Service. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1180–1192. https://doi.org/10.1145/2998181.2998364",
      "doi": "10.1145/2998181.2998364"
    },
    {
      "text": "Yi Yang and Jacob Eisenstein. 2013. A Log-Linear Model for Unsupervised Text Normalization. In Proceedings of the 2013 Conference on Empirical Methods in Natural Language Processing. Association for Computational Linguistics, Seattle, Washington, USA, 61–72. https://www.aclweb.org/anthology/D13-1007",
      "doi": ""
    },
    {
      "text": "Chengzhu Yu, Heng Lu, Na Hu, Meng Yu, Chao Weng, Kun Xu, Peng Liu, Deyi Tuo, Shiyin Kang, Guangzhi Lei, Dan Su, and Dong Yu. 2020. DurIAN: Duration Informed Attention Network for Speech Synthesis. In Proc. Interspeech 2020. 2027–2031. https://doi.org/10.21437/Interspeech.2020-2968",
      "doi": ""
    },
    {
      "text": "Hao Zhang, Richard Sproat, Axel H Ng, Felix Stahlberg, Xiaochang Peng, Kyle Gorman, and Brian Roark. 2019. Neural models of text normalization for speech applications. Computational Linguistics 45, 2 (2019), 293–337.",
      "doi": "10.1162/coli_a_00349"
    }
  ]
}