{
  "doi": "10.1145/3491102.3502077",
  "title": "Interaction with Touch-Sensitive Knitted Fabrics: User Perceptions and Everyday Use Experiments",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2022,
  "badges": [],
  "abstract": "Recent work has investigated the construction of touch-sensitive knitted fabrics, capable of being manufactured at scale, and having only two connections to external hardware. Additionally, several sensor design patterns and application prototypes have been introduced. Our aim is to start shaping the future of this technology according to user expectations. Through a formative focus group study, we explore users’ views of using these fabrics in different contexts and discuss potential concerns and application areas. Subsequently, we take steps toward addressing relevant questions, by first providing design guidelines for application designers. Furthermore, in one user study, we demonstrate that it is possible to distinguish different swipe gestures and identify accidental contact with the sensor, a common occurrence in everyday life. We then present experiments investigating the effect of stretching and laundering of the sensors on their resistance, providing insights about considerations necessary to include in computational models.",
  "authors": [
    {
      "name": "Denisa Qori McDonald",
      "institution": "Computer Science Department, Drexel University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659543171",
      "orcid": "missing"
    },
    {
      "name": "Shruti Mahajan",
      "institution": "Computer Science, Worcester Polytechnic Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659646301",
      "orcid": "missing"
    },
    {
      "name": "Richard Vallett",
      "institution": "Center for Functional Fabrics, Drexel University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658620615",
      "orcid": "missing"
    },
    {
      "name": "Genevieve Dion",
      "institution": "Westphal College of Media Arts & Design, Drexel University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81487652580",
      "orcid": "missing"
    },
    {
      "name": "Ali Shokoufandeh",
      "institution": "College of Computing and Informatics, Drexel University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100377116",
      "orcid": "missing"
    },
    {
      "name": "Erin Solovey",
      "institution": "Computer Science Department, Worcester Polytechnic Institute, United States",
      "img": "/do/10.1145/contrib-81324494052/rel-imgonly/erinsolovey.jpg",
      "acmid": "81324494052",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "[n. d.]. The American Association of Textile Chemists and Colorists [Online]. https://aatcc.org/",
      "doi": ""
    },
    {
      "text": "[n. d.]. Atlas.ti [Online]. https://atlasti.com/",
      "doi": ""
    },
    {
      "text": "[n. d.]. Otter.ai [Online]. https://otter.ai/home",
      "doi": ""
    },
    {
      "text": "Talha Agcayazi, Michael McKnight, Hannah Kausche, Tushar Ghosh, and Alper Bozkurt. 2016. A finger touch force detection method for textile based capacitive tactile sensor arrays. In 2016 IEEE SENSORS. 1–3. https://doi.org/10.1109/ICSENS.2016.7808528",
      "doi": ""
    },
    {
      "text": "Roland Aigner, Andreas Pointner, Thomas Preindl, Patrick Parzer, and Michael Haller. 2020. Embroidered resistive pressure sensors: A novel approach for textile interfaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376305"
    },
    {
      "text": "Lea Albaugh, James McCann, Scott E Hudson, and Lining Yao. 2021. Engineering Multifunctional Spacer Fabrics Through Machine Knitting. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445564"
    },
    {
      "text": "Margaret Anzul, Maryann Downing, Margot Ely, and Ruth Vinz. 2003. On writing qualitative research: Living by words. Routledge.",
      "doi": ""
    },
    {
      "text": "Asli Atalay, Ozgur Atalay, Muhammad D Husain, Anura Fernando, and Prasad Potluri. 2017. Piezofilm yarn sensor-integrated knitted fabric for healthcare applications. Journal of Industrial Textiles 47, 4 (2017), 505–521.",
      "doi": ""
    },
    {
      "text": "Ozgur Atalay. 2018. Textile-based, interdigital, capacitive, soft-strain sensor for wearable applications. Materials 11, 5 (2018), 768.",
      "doi": ""
    },
    {
      "text": "H. W. Bode. 1940. Relations between attenuation and phase in feedback amplifier design. The Bell System Technical Journal 19, 3 (July 1940), 421–454. https://doi.org/10.1002/j.1538-7305.1940.tb00839.x",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Rachael Bevill Burns, Hasti Seifi, Hyosang Lee, and Katherine J Kuchenbecker. 2021. Getting in touch with children with autism: Specialist guidelines for a touch-perceiving robot. Paladyn, Journal of Behavioral Robotics 12, 1 (2021), 115–135.",
      "doi": ""
    },
    {
      "text": "Amy Chen. 2020. The Design and Creation of Tactile Knitted E-textiles for Interactive Applications. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction. 905–909.",
      "doi": "10.1145/3374920.3374959"
    },
    {
      "text": "Felecia Davis. 2015. The textility of emotion: A study relating computational textile textural expression to emotion. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition. 23–32.",
      "doi": "10.1145/2757226.2757231"
    },
    {
      "text": "D. De Rossi, F. Carpi, F. Lorussi, A. Mazzoldi, E. P. Scilingo, and A. Tognetti. 2002. Electroactive fabrics for distributed, conformable and interactive systems. In SENSORS, 2002 IEEE, Vol. 2. 1608–1613. https://doi.org/10.1109/ICSENS.2002.1037364",
      "doi": ""
    },
    {
      "text": "Laura Devendorf, Joanne Lo, Noura Howell, Jung Lin Lee, Nan-Wei Gong, M Emre Karagozler, Shiho Fukuhara, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. ” I don’t Want to Wear a Screen” Probing Perceptions of and Possibilities for Dynamic Displays on Clothing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 6028–6039.",
      "doi": "10.1145/2858036.2858192"
    },
    {
      "text": "Mollie Dollinger and Jessica Vanderlelie. 2021. Closing the loop: co-designing with students for greater market orientation. Journal of Marketing for Higher Education 31, 1 (2021), 41–57.",
      "doi": ""
    },
    {
      "text": "Rachel Freire, Cedric Honnet, and Paul Strohmeier. 2017. Second Skin: An Exploration of eTextile Stretch Circuits on the Body. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction. 653–658.",
      "doi": "10.1145/3024969.3025054"
    },
    {
      "text": "W Gaver, J Beaver, and S Benford. 2003. Designing design: Ambiguity as a resource for design Proceedings of the conference on Human factors in computing systems, April 2003.",
      "doi": ""
    },
    {
      "text": "Scott Gilliland, Nicholas Komor, Thad Starner, and Clint Zeagler. 2010. The Textile Interface Swatchbook: Creating graphical user interface-like widgets with conductive embroidery. In Proceedings of the 2010 International Symposium on Wearable Computers(ISWC ’10’). 1–8. https://doi.org/10.1109/ISWC.2010.5665876",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1959. The Presentation of Self in Everyday Life. New York: Anchor. 1963 Stigma.",
      "doi": ""
    },
    {
      "text": "Nur Al-huda Hamdan, Jeffrey R. Blum, Florian Heller, Ravi Kanth Kosuru, and Jan Borchers. 2016. Grabbing at an Angle: Menu Selection for Fabric Interfaces. In Proceedings of the 2016 ACM International Symposium on Wearable Computers (Heidelberg, Germany) (ISWC ’16). ACM, New York, NY, USA, 1–7. https://doi.org/10.1145/2971763.2971786",
      "doi": "10.1145/2971763.2971786"
    },
    {
      "text": "Nur Al-huda Hamdan, Simon Voelker, and Jan Borchers. 2018. Sketch&Stitch: Interactive Embroidery for E-textiles. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 82, 13 pages. https://doi.org/10.1145/3173574.3173656",
      "doi": "10.1145/3173574.3173656"
    },
    {
      "text": "Yuji Hasegawa, M. Shikida, D. Ogura, and Kazuo Sato. 2007. Novel type of fabric tactile sensor made from artificial hollow fiber. In 2007 IEEE 20th International Conference on Micro Electro Mechanical Systems (MEMS). 603–606. https://doi.org/10.1109/MEMSYS.2007.4433079",
      "doi": ""
    },
    {
      "text": "Dick Hebdige. 1979. Subculture: The Meaning of Style Routledge.",
      "doi": ""
    },
    {
      "text": "Cedric Honnet, Hannah Perner-Wilson, Marc Teyssier, Bruno Fruchard, Jürgen Steimle, Ana C Baptista, and Paul Strohmeier. 2020. PolySense: Augmenting Textiles with Electrical Functionality using In-Situ Polymerization. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376841"
    },
    {
      "text": "Jochen Huber, Mohamed Sheik-Nainar, and Nada Matic. 2017. Force-enabled touch input on the steering wheel: An elicitation study. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications Adjunct. 168–172.",
      "doi": "10.1145/3131726.3131740"
    },
    {
      "text": "Masayuki Inaba, Yukiko Hoshino, K. Nagasaka, T. Ninomiya, Satoshi Kagami, and H. Inoue. 1996. A full-body tactile sensor suit using electrically conductive fabric and strings. In Proceedings of IEEE/RSJ International Conference on Intelligent Robots and Systems. IROS ’96, Vol. 2. 450–457. https://doi.org/10.1109/IROS.1996.570816",
      "doi": ""
    },
    {
      "text": "Lee Jones, Sara Nabil, Amanda McLeod, and Audrey Girouard. 2020. Wearable Bits: scaffolding creativity with a prototyping toolkit for wearable e-textiles. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction. 165–177.",
      "doi": "10.1145/3374920.3374954"
    },
    {
      "text": "Thorsten Karrer, Moritz Wittenhagen, Leonhard Lichtschlag, Florian Heller, and Jan Borchers. 2011. Pinstripe: eyes-free continuous input on interactive clothing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1313–1322.",
      "doi": "10.1145/1978942.1979137"
    },
    {
      "text": "Keil. [n. d.]. ARM CMSIS-DSP. https://arm-software.github.io/CMSIS_5/DSP/html/modules.html.",
      "doi": ""
    },
    {
      "text": "Ewa Korzeniewska and Andrzej Krawczyk. 2019. Applications of smart textiles in electromedicine. In 2019 19th International Symposium on Electromagnetic Fields in Mechatronics, Electrical and Electronic Engineering (ISEF). IEEE, 1–2.",
      "doi": ""
    },
    {
      "text": "Richard A Krueger and Mary Anne Casey. 2002. Designing and conducting focus group interviews.",
      "doi": ""
    },
    {
      "text": "Kung Jin Lee, Wendy Roldan, Tian Qi Zhu, Harkiran Kaur Saluja, Sungmin Na, Britnie Chin, Yilin Zeng, Jin Ha Lee, and Jason Yip. 2021. The Show Must Go On: A Conceptual Model of Conducting Synchronous Participatory Design With Children Online. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445715"
    },
    {
      "text": "Joanne Leong, Patrick Parzer, Florian Perteneder, Teo Babic, Christian Rendl, Anita Vogl, Hubert Egger, Alex Olwal, and Michael Haller. 2016. proCover: sensory augmentation of prosthetic limbs using smart textile covers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 335–346.",
      "doi": "10.1145/2984511.2984572"
    },
    {
      "text": "Vladimir I Levenshtein. 1966. Binary codes capable of correcting deletions, insertions, and reversals. In Soviet physics doklady, Vol. 10. 707–710.",
      "doi": ""
    },
    {
      "text": "Yiyue Luo, Kui Wu, Tomás Palacios, and Wojciech Matusik. 2021. KnitUI: Fabricating Interactive and Sensing Textiles with Machine Knitting. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445780"
    },
    {
      "text": "Denisa Qori McDonald, Richard Vallett, Erin Solovey, Geneviève Dion, and Ali Shokoufandeh. 2020. Knitted Sensors: Designs and Novel Approaches for Real-Time, Real-World Sensing. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 4 (2020), 1–25.",
      "doi": "10.1145/3432201"
    },
    {
      "text": "Sara Mlakar and Michael Haller. 2020. Design Investigation of Embroidered Interactive Elements on Non-Wearable Textile Interfaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–10.",
      "doi": "10.1145/3313831.3376692"
    },
    {
      "text": "Sara Nabil, Lee Jones, and Audrey Girouard. 2021. Soft Speakers: Digital Embroidering of DIY Customizable Fabric Actuators. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction. 1–12.",
      "doi": "10.1145/3430524.3440630"
    },
    {
      "text": "Satoshi Nakamaru, Ryosuke Nakayama, Ryuma Niiyama, and Yasuaki Kakehi. 2017. FoamSense: Design of Three Dimensional Soft Sensors with Porous Materials. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 437–447. https://doi.org/10.1145/3126594.3126666",
      "doi": "10.1145/3126594.3126666"
    },
    {
      "text": "Ryosuke Nakayama, Ryo Suzuki, Satoshi Nakamaru, Ryuma Niiyama, Yoshihiro Kawahara, and Yasuaki Kakehi. 2019. MorphIO: Entirely Soft Sensing and Actuation Modules for Programming Shape Changes through Tangible Interaction. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 975–986. https://doi.org/10.1145/3322276.3322337",
      "doi": "10.1145/3322276.3322337"
    },
    {
      "text": "Vijayakumar Nanjappan, Rongkai Shi, Hai-Ning Liang, Kim King-Tong Lau, Yong Yue, and Katie Atkinson. 2019. Towards a taxonomy for in-vehicle interactions using wearable smart textiles: insights from a user-elicitation study. Multimodal Technologies and Interaction 3, 2 (2019), 33.",
      "doi": ""
    },
    {
      "text": "Deysi Helen Ortega, Franceli Linney Cibrian, and Mónica Tentori. 2015. BendableSound: a fabric-based interactive surface to promote free play in children with autism. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. 315–316.",
      "doi": "10.1145/2700648.2811355"
    },
    {
      "text": "Patrick Parzer, Florian Perteneder, Kathrin Probst, Christian Rendl, Joanne Leong, Sarah Schuetz, Anita Vogl, Reinhard Schwoediauer, Martin Kaltenbrunner, Siegfried Bauer, and Michael Haller. 2018. RESi: A Highly Flexible, Pressure-Sensitive, Imperceptible Textile Interface Based on Resistive Yarns. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). ACM, New York, NY, USA, 745–756. https://doi.org/10.1145/3242587.3242664",
      "doi": "10.1145/3242587.3242664"
    },
    {
      "text": "Patrick Parzer, Kathrin Probst, Teo Babic, Christian Rendl, Anita Vogl, Alex Olwal, and Michael Haller. 2016. FlexTiles: a flexible, stretchable, formable, pressure-sensitive, tactile input sensor. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 3754–3757.",
      "doi": "10.1145/2851581.2890253"
    },
    {
      "text": "Patrick Parzer, Adwait Sharma, Anita Vogl, Jürgen Steimle, Alex Olwal, and Michael Haller. 2017. SmartSleeve: Real-time Sensing of Surface and Deformation Gestures on Flexible, Interactive Textiles, Using a Hybrid Gesture Detection Pipeline. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology(Québec City, QC, Canada) (UIST ’17). ACM, New York, NY, USA, 565–577. https://doi.org/10.1145/3126594.3126652",
      "doi": "10.1145/3126594.3126652"
    },
    {
      "text": "Michael Quinn Patton. 1990. Qualitative evaluation and research methods. SAGE Publications, inc.",
      "doi": ""
    },
    {
      "text": "Andreas Pointner, Thomas Preindl, Sara Mlakar, Roland Aigner, and Michael Haller. 2020. Knitted RESi: A Highly Flexible, Force-Sensitive Knitted Textile Based on Resistive Yarns. In ACM SIGGRAPH 2020 Emerging Technologies (Virtual Event, USA) (SIGGRAPH ’20). Association for Computing Machinery, New York, NY, USA, Article 21, 2 pages. https://doi.org/10.1145/3388534.3407292",
      "doi": "10.1145/3388534.3407292"
    },
    {
      "text": "Andreas Pointner, Thomas Preindl, Sara Mlakar, Roland Aigner, and Michael Haller. 2020. Knitted RESi: A Highly Flexible, Force-Sensitive Knitted Textile Based on Resistive Yarns. In ACM SIGGRAPH 2020 Emerging Technologies. 1–2.",
      "doi": ""
    },
    {
      "text": "E. R. Post, M. Orth, P. R. Russo, and N. Gershenfeld. 2000. E-broidery: Design and Fabrication of Textile-based Computing. IBM Syst. J. 39, 3-4 (July 2000), 840–860. https://doi.org/10.1147/sj.393.0840",
      "doi": "10.1147/sj.393.0840"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 4216–4227. https://doi.org/10.1145/2858036.2858176",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Casey Reas and Ben Fry. 2006. Processing: Programming for the Media Arts. AI Soc. 20, 4 (Aug. 2006), 526–538. https://doi.org/10.1007/s00146-006-0050-9",
      "doi": "10.1007/s00146-006-0050-9"
    },
    {
      "text": "Stefan Schneegass and Alexandra Voit. 2016. GestureSleeve: using touch sensitive fabrics for gestural input on the forearm for controlling smartwatches. In Proceedings of the 2016 ACM International Symposium on Wearable Computers. 108–115.",
      "doi": "10.1145/2971763.2971797"
    },
    {
      "text": "Nur Siyam and Sherief Abdallah. 2021. A Pilot Study Investigating the Use of Mobile Technology for Coordinating Educational Plans in Inclusive Settings. Journal of Special Education Technology(2021), 01626434211033581.",
      "doi": ""
    },
    {
      "text": "Clay Spinuzzi. 2005. The methodology of participatory design. Technical communication 52, 2 (2005), 163–174.",
      "doi": ""
    },
    {
      "text": "Patricia Sullivan. 1991. Multiple methods and the usability of interface prototypes: the complementarity of laboratory observation and focus groups. In Proceedings of the 9th annual international conference on Systems documentation. 106–112.",
      "doi": "10.1145/122778.122795"
    },
    {
      "text": "Mathias Sundholm, Jingyuan Cheng, Bo Zhou, Akash Sethi, and Paul Lukowicz. 2014. Smart-mat: Recognizing and counting gym exercises with low-cost resistive pressure sensing matrix. In Proceedings of the 2014 ACM international joint conference on pervasive and ubiquitous computing. 373–382.",
      "doi": "10.1145/2632048.2636088"
    },
    {
      "text": "Seiichi Takamatsu, Takeshi Kobayashi, Nobuhisa Shibayama, Koji Miyake, and Toshihiro Itoh. 2011. Meter-scale surface capacitive type of touch sensors fabricated by weaving conductive-polymer-coated fibers. In 2011 Symposium on Design, Test, Integration Packaging of MEMS/MOEMS (DTIP). 142–147.",
      "doi": ""
    },
    {
      "text": "Anupriya Tuli, Shaan Chopra, Pushpendra Singh, and Neha Kumar. 2020. Menstrual (Im) mobilities and safe spaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376653"
    },
    {
      "text": "Jennifer Underwood. 2009. The Design of 3D Shape Knitted Preforms. Ph. D. Dissertation. RMIT University.",
      "doi": ""
    },
    {
      "text": "Richard Vallett, Denisa Qori McDonald, Genevieve Dion, Youngmoo Kim, and Ali Shokoufandeh. 2020. Toward Accurate Sensing with Knitted Fabric: Applications and Technical Considerations. 4, EICS (2020). https://doi.org/10.1145/3394981",
      "doi": "10.1145/3394981"
    },
    {
      "text": "Richard Vallett, Ryan Young, Chelsea Knittel, Youngmoo Kim, and Geneviève Dion. 2016. Development of a Carbon Fiber Knitted Capacitive Touch Sensor. MRS Advances 1, 38 (2016), 2641–2651. https://doi.org/10.1557/adv.2016.498",
      "doi": ""
    },
    {
      "text": "Vianey Vazquez, Carlos Cardenas, Franceli L Cibrian, and Mónica Tentori. 2016. Designing a musical fabric-based surface to encourage children with Autism to practice motor movements. In Proceedings of the 6th mexican conference on human-computer interaction. 1–4.",
      "doi": "10.1145/2967175.2967384"
    },
    {
      "text": "Irmandy Wicaksono and Joseph Paradiso. 2020. KnittedKeyboard: Digital Knitting of Electronic Textile Musical Controllers.",
      "doi": ""
    },
    {
      "text": "Irmandy Wicaksono, Carson I Tucker, Tao Sun, Cesar A Guerrero, Clare Liu, Wesley M Woo, Eric J Pence, and Canan Dagdeviren. 2020. A tailored, electronic textile conformable suit for large-scale spatiotemporal physiological sensing in vivo. npj Flexible Electronics 4, 1 (2020), 1–13.",
      "doi": ""
    },
    {
      "text": "Tony Wu, Shiho Fukuhara, Nicholas Gillian, Kishore Sundara-Rajan, and Ivan Poupyrev. 2020. ZebraSense: A Double-sided Textile Touch Sensor for Smart Clothing. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 662–674.",
      "doi": "10.1145/3379337.3415886"
    },
    {
      "text": "Te-Yen Wu, Shutong Qi, Junchi Chen, MuJie Shang, Jun Gong, Teddy Seyed, and Xing-Dong Yang. 2020. Fabriccio: Touchless gestural input on interactive fabrics. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376681"
    },
    {
      "text": "Te-Yen Wu, Lu Tan, Yuji Zhang, Teddy Seyed, and Xing-Dong Yang. 2020. Capacitivo: Contact-Based Object Recognition on Interactive Fabrics using Capacitive Sensing. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 649–661.",
      "doi": "10.1145/3379337.3415829"
    },
    {
      "text": "Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: Pneumatically Actuated Soft Composite Materials for Shape Changing Interfaces. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 13–22. https://doi.org/10.1145/2501988.2502037",
      "doi": "10.1145/2501988.2502037"
    },
    {
      "text": "Andrew Lukas Yin, Pargol Gheissari, Inna Wanyin Lin, Michael Sobolev, John P Pollak, Curtis Cole, and Deborah Estrin. 2020. Role of Technology in Self-Assessment and Feedback Among Hospitalist Physicians: Semistructured Interviews and Thematic Analysis. Journal of medical Internet research 22, 11 (2020), e23299.",
      "doi": ""
    },
    {
      "text": "Bo Zhou, Monit Shah Singh, Sugandha Doda, Muhammet Yildirim, Jingyuan Cheng, and Paul Lukowicz. 2017. The carpet knows: Identifying people in a smart environment from a single step. In 2017 IEEE International Conference on Pervasive Computing and Communications Workshops (PerCom Workshops). IEEE, 527–532.",
      "doi": ""
    },
    {
      "text": "Mengjia Zhu, Amirhossein H Memar, Aakar Gupta, Majed Samad, Priyanshu Agarwal, Yon Visell, Sean J Keller, and Nicholas Colonnese. 2020. Pneusleeve: In-fabric multimodal actuation and sensing in a soft, compact, and expressive haptic sleeve. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376333"
    }
  ]
}