{
  "doi": "10.1145/3491102.3517590",
  "title": "ARGONAUT: An Inclusive Design Process for Wearable Health Monitoring Systems",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2022,
  "badges": [],
  "abstract": "Wearable biosignal monitoring systems are becoming increasingly ubiquitous as tools for autonomous health monitoring and other real-world applications. Despite the continual advancements in this field, anthropometric considerations for women’s form are often overlooked in the design process, making systems ill fit and less effective. In this paper, we present a full garment assembly, ARGONAUT, with integrated textile electrocardiogram (ECG) electrodes in a 3-lead configuration that is designed specifically for women’s form. Through the exploration of materials, anthropometry, and garment assembly, we designed and tested ARGONAUT against the laboratory standard to determine performance through R-peak detection and noise interference. We investigated common issues faced when designing a wearable ECG garment, such as fit, motion artifact mitigation, and social wearability, to develop a dynamic design process that can be used to expand the advancing technology sensor integrated garments to all individuals in order to allow for equal access to potential health benefits.",
  "tags": [
    "smart textiles",
    "Electrocardiogram (ECG)",
    "iterative design",
    "motion artifact",
    "technological integration"
  ],
  "authors": [
    {
      "name": "Gabriella Schauss",
      "institution": "Ann and H.J Smead Aerospace Engineering Sciences, University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240472",
      "orcid": "missing"
    },
    {
      "name": "Katya Arquilla",
      "institution": "Department of Aeronautics and Astronautics, Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528624",
      "orcid": "missing"
    },
    {
      "name": "Allison Anderson",
      "institution": "Ann and H.J Smead Aerospace Engineering Sciences, University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528358",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Lea Albaugh, Scott Hudson, and Lining Yao. 2019. Digital Fabrication of Soft Actuated Objects by Machine Knitting. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300414",
      "doi": "10.1145/3290605.3300414"
    },
    {
      "text": "Celia Fernández Aller and Sara Román Navarro. 2018. Gender in Software Engineering Degrees. In Proceedings of the 12th European Conference on Software Architecture: Companion Proceedings (Madrid, Spain) (ECSA ’18). Association for Computing Machinery, New York, NY, USA, Article 15, 4 pages. https://doi.org/10.1145/3241403.3241420",
      "doi": "10.1145/3241403.3241420"
    },
    {
      "text": "Teresa Almeida, Rob Comber, and Madeline Balaam. 2016. HCI and Intimate Care as an Agenda for Change in Women’s Health. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 2599–2611. https://doi.org/10.1145/2858036.2858187",
      "doi": "10.1145/2858036.2858187"
    },
    {
      "text": "Katya Arquilla, Sarah Leary, Andrea K Webb, and Allie P Anderson. 2020. Wearable 3-Lead Electrocardiogram Placement Model for Fleet Sizing of Medical Devices. Aerospace Medicine and Human Performance 91, 11 (2020), 868–875.",
      "doi": ""
    },
    {
      "text": "Katya Arquilla, Andrea K Webb, and Allison P Anderson. 2020. Textile electrocardiogram (ECG) electrodes for wearable health monitoring. Sensors 20, 4 (2020), 1013.",
      "doi": ""
    },
    {
      "text": "Katya Arquilla, Andrea K Webb, and Allison P Anderson. 2020. Woven electrocardiogram (ECG) electrodes for health monitoring in operational environments. In 2020 42nd Annual International Conference of the IEEE Engineering in Medicine & Biology Society (EMBC). IEEE, Piscataway, NJ, USA, 4498–4501.",
      "doi": ""
    },
    {
      "text": "Athira Balachandran, M Ganesan, and EP Sumesh. 2014. Daubechies algorithm for highly accurate ECG feature extraction. In 2014 International Conference on Green Computing Communication and Electrical Engineering (ICGCCEE). IEEE, Piscataway, NJ, USA, 1–5.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1301–1310. https://doi.org/10.1145/1753326.1753521",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Paddy M Barrett, Ravi Komatireddy, Sharon Haaser, Sarah Topol, Judith Sheard, Jackie Encinas, Angela J Fought, and Eric J Topol. 2014. Comparison of 24-hour Holter monitoring with 14-day novel adhesive patch electrocardiographic monitoring. The American journal of medicine 127, 1 (2014), 95–e11.",
      "doi": ""
    },
    {
      "text": "Eric B Bass, Edward I Curtiss, Vincent C Arena, Barbara H Hanusa, Alfred Cecchetti, Micheal Karpf, and Wishwa M Kapoor. 1990. The duration of Holter monitoring in patients with syncope: is 24 hours enough?Archives of Internal Medicine 150, 5 (1990), 1073–1078.",
      "doi": ""
    },
    {
      "text": "Laura Beckwith, Margaret Burnett, Susan Wiedenbeck, Curtis Cook, Shraddha Sorte, and Michelle Hastings. 2005. Effectiveness of End-User Debugging Software Features: Are There Gender Issues?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 869–878. https://doi.org/10.1145/1054972.1055094",
      "doi": "10.1145/1054972.1055094"
    },
    {
      "text": "Gary G Berntson, J Thomas Bigger Jr, Dwain L Eckberg, Paul Grossman, Peter G Kaufmann, Marek Malik, Haikady N Nagaraja, Stephen W Porges, J Philip Saul, Peter H Stone, 1997. Heart rate variability: origins, methods, and interpretive caveats. Psychophysiology 34, 6 (1997), 623–648.",
      "doi": ""
    },
    {
      "text": "Margaret Burnett. 2017. Gendermag: Getting Gender Biases out of Software. J. Comput. Sci. Coll. 33, 1 (Oct. 2017), 100–101.",
      "doi": ""
    },
    {
      "text": "Yu Mike Chi, Tzyy-Ping Jung, and Gert Cauwenberghs. 2010. Dry-contact and noncontact biopotential electrodes: Methodological review. IEEE reviews in biomedical engineering 3 (2010), 106–119.",
      "doi": ""
    },
    {
      "text": "VS Chouhan and SS Mehta. 2008. Detection of QRS complexes in 12-lead ECG using adaptive quantized threshold. International Journal of Computer Science and Network Security 8, 1(2008), 155–163.",
      "doi": ""
    },
    {
      "text": "Alper Cömert, Markku Honkala, and Jari Hyttinen. 2013. Effect of pressure and padding on motion artifact of textile electrodes. Biomedical engineering online 12, 1 (2013), 1–18.",
      "doi": ""
    },
    {
      "text": "Abe Crystal and Beth Ellington. 2004. Task analysis and human-computer interaction: approaches, techniques, and levels of analysis. AMCIS 2004 Proceedings 391 (2004), 1–9.",
      "doi": ""
    },
    {
      "text": "Mary Czerwinski, Desney S. Tan, and George G. Robertson. 2002. Women Take a Wider View. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Minneapolis, Minnesota, USA) (CHI ’02). Association for Computing Machinery, New York, NY, USA, 195–202. https://doi.org/10.1145/503376.503412",
      "doi": "10.1145/503376.503412"
    },
    {
      "text": "Bruce Del Mar. 2005. The history of clinical Holter monitoring. Annals of noninvasive electrocardiology: the official journal of the International Society for Holter and Noninvasive Electrocardiology, Inc 10, 2(2005), 226.",
      "doi": ""
    },
    {
      "text": "B Aldecoa Sanchez Del Rio, T Lopetegi, and I Romero. 2011. Assessment of different methods to estimate electrocardiogram signal quality. In 2011 Computing in Cardiology. IEEE, Piscataway, NJ, USA, 609–612.",
      "doi": ""
    },
    {
      "text": "John P DiMarco and John T Philbrick. 1990. Use of ambulatory electrocardiographic (Holter) monitoring. Annals of internal medicine 113, 1 (1990), 53–68.",
      "doi": ""
    },
    {
      "text": "Genevieve Dion. 2013. Garment Device: Challenges to Fabrication of Wearable Technology. In Proceedings of the 8th International Conference on Body Area Networks (Boston, Massachusetts) (BodyNets ’13). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), Brussels, BEL, 97–102. https://doi.org/10.4108/icst.bodynets.2013.253707",
      "doi": "10.4108/icst.bodynets.2013.253707"
    },
    {
      "text": "Susan M. Dray, Daniela K. Busse, Anke Marei Brock, Anicia N. Peters, Shaowen Bardzell, Allison Druin, Margaret M. Burnett, Elizabeth F. Churchill, Gayna Williams, Karen Holtzblatt, and Diane Murray. 2014. Perspectives on Gender and Product Design. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI EA ’14). Association for Computing Machinery, New York, NY, USA, 53–56. https://doi.org/10.1145/2559206.2559218",
      "doi": ""
    },
    {
      "text": "Lucy E Dunne, Halley Profita, Clint Zeagler, James Clawson, Scott Gilliland, Ellen Yi-Luen Do, and Jim Budd. 2014. The social comfort of wearable technology and gestural interaction. In 2014 36th annual international conference of the IEEE engineering in medicine and biology society. IEEE, Piscataway, NJ, USA, 4159–4162.",
      "doi": ""
    },
    {
      "text": "Catherine A Elliot, Michael J Hamlin, and Catherine A Lizamore. 2019. Validity and reliability of the hexoskin wearable biometric vest during maximal aerobic power testing in elite cyclists. The Journal of Strength & Conditioning Research 33, 5 (2019), 1437–1444.",
      "doi": ""
    },
    {
      "text": "Stephen H. Fairclough, Alexander J. Karran, and Kiel Gilleade. 2015. Classification Accuracy from the Perspective of the User: Real-Time Interaction with Physiological Computing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 3029–3038. https://doi.org/10.1145/2702123.2702454",
      "doi": "10.1145/2702123.2702454"
    },
    {
      "text": "Mikhaila Friske, Shanel Wu, and Laura Devendorf. 2019. AdaCAD: Crafting Software For Smart Textiles Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300575",
      "doi": "10.1145/3290605.3300575"
    },
    {
      "text": "Vivian Genaro Motti and Kelly Caine. 2015. An Overview of Wearable Applications for Healthcare: Requirements and Challenges. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (Osaka, Japan) (UbiComp/ISWC’15 Adjunct). Association for Computing Machinery, New York, NY, USA, 635–641. https://doi.org/10.1145/2800835.2809436",
      "doi": ""
    },
    {
      "text": "Norman RS Hollies, Anna G Custer, Catherine J Morin, and Marilyn E Howard. 1979. A human perception analysis approach to clothing comfort. Textile Research Journal 49, 10 (1979), 557–564.",
      "doi": ""
    },
    {
      "text": "AD Jeyarani and T Jaya Singh. 2010. Analysis of noise reduction techniques on QRS ECG waveform-by applying different filters. In Recent Advances in Space Technology Services and Climate Change 2010 (RSTS & CC-2010). IEEE, Piscataway, NJ, USA, 149–152.",
      "doi": ""
    },
    {
      "text": "Yasmin V. Kafai. 1998. Video Game Designs by Girls and Boys: Variability and Consistency of Gender Differences. MIT Press, Cambridge, MA, USA, 90–114.",
      "doi": ""
    },
    {
      "text": "Arun Kumar, Edwin Levin, Patricia Cowings, and William B Toscano. 2015. Evaluation of the Accuracy of Astroskin as a Behavioral Health Self-Monitoring System for Spaceflight. In Annual Summer STEM Internship Symposium. NASA, Washington DC, USA, 1.",
      "doi": ""
    },
    {
      "text": "Susan Leavy. 2018. Gender Bias in Artificial Intelligence: The Need for Diversity and Gender Theory in Machine Learning. In Proceedings of the 1st International Workshop on Gender Equality in Software Engineering (Gothenburg, Sweden) (GE ’18). Association for Computing Machinery, New York, NY, USA, 14–16. https://doi.org/10.1145/3195570.3195580",
      "doi": "10.1145/3195570.3195580"
    },
    {
      "text": "Yangdong Liao, Ru-Xin Na, and Derek Rayside. 2014. Accurate ECG R-peak detection for telemedicine. In 2014 IEEE Canada International Humanitarian Technology Conference-(IHTC). IEEE, Piscataway, NJ, USA, 1–5.",
      "doi": ""
    },
    {
      "text": "Ching-Wen Lou, Chih-Hung He, and Jia-Horng Lin. 2019. Manufacturing techniques and property evaluations of conductive elastic knits. Journal of Industrial Textiles 49, 4 (2019), 503–533.",
      "doi": ""
    },
    {
      "text": "N Luk and W Yu. 2016. Bra fitting assessment and alteration. In Advances in Women’s Intimate Apparel Technology. Elsevier, Amsterdam, The Netherlands, 109–133.",
      "doi": ""
    },
    {
      "text": "Deirdre E McGhee and Julie R Steele. 2020. Biomechanics of breast support for active women. Exercise and sport sciences reviews 48, 3 (2020), 99–109.",
      "doi": ""
    },
    {
      "text": "Paola Medel and Vahab Pournaghshband. 2017. Eliminating Gender Bias in Computer Science Education Materials. In Proceedings of the 2017 ACM SIGCSE Technical Symposium on Computer Science Education (Seattle, Washington, USA) (SIGCSE ’17). Association for Computing Machinery, New York, NY, USA, 411–416. https://doi.org/10.1145/3017680.3017794",
      "doi": "10.1145/3017680.3017794"
    },
    {
      "text": "Yao Meng, Heung-Kook Choi, and Hee-Cheol Kim. 2011. Exploring the user requirements for wearable healthcare systems. In 2011 IEEE 13th International Conference on e-Health Networking, Applications and Services. IEEE, Piscataway, NJ, USA, 74–77.",
      "doi": ""
    },
    {
      "text": "Carey R. Merritt, H. Troy Nagle, and Edward Grant. 2009. Fabric-Based Active Electrode Design and Fabrication for Health Monitoring Clothing. IEEE Transactions on Information Technology in Biomedicine 13, 2(2009), 274–280. https://doi.org/10.1109/TITB.2009.2012408",
      "doi": "10.1109/TITB.2009.2012408"
    },
    {
      "text": "Michael A Messner. 1988. Sports and male domination: The female athlete as contested ideological terrain. Sociology of sport journal 5, 3 (1988), 197–211.",
      "doi": ""
    },
    {
      "text": "Suneet Mittal, John Rogers, Shantanu Sarkar, Jodi Koehler, Eduardo N Warman, Todd T Tomson, and Rod S Passman. 2016. Real-world performance of an enhanced atrial fibrillation detection algorithm in an insertable cardiac monitor. Heart Rhythm 13, 8 (2016), 1624–1630.",
      "doi": ""
    },
    {
      "text": "Manasee Narvilkar, Josiah Mangiameli, Adriana Alvarado Garcia, Azra Ismail, Daniel Schiff, Danielle Schechter, Jordan Chen, Karthik Bhat, Marisol Wong-Villacres, Anusha Vasudeva, Aparna Ramesh, Michaelanne Dye, Naveena Karusala, Pragati Singh, Savanthi Murthy, Shubhangi Gupta, Udaya Lakshmi, and Neha Kumar. 2019. Bringing Shades of Feminism To Human-Centered Computing. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290607.3310419",
      "doi": ""
    },
    {
      "text": "Pravin Pawar, Val Jones, Bert-Jan F Van Beijnum, and Hermie Hermens. 2012. A framework for the comparison of mobile patient monitoring systems. Journal of biomedical informatics 45, 3 (2012), 544–556.",
      "doi": "10.1016/j.jbi.2012.02.007"
    },
    {
      "text": "Marek N. Posard. 2014. Status processes in human-computer interactions: Does gender matter?Computers in Human Behavior 37 (2014), 189–195. https://doi.org/10.1016/j.chb.2014.04.025",
      "doi": ""
    },
    {
      "text": "Raj Rakshit, V Ramu Reddy, and Parijat Deshpande. 2016. Emotion Detection and Recognition Using HRV Features Derived from Photoplethysmogram Signals. In Proceedings of the 2nd Workshop on Emotion Representations and Modelling for Companion Systems (Tokyo, Japan) (ERM4CT ’16). Association for Computing Machinery, New York, NY, USA, Article 2, 6 pages. https://doi.org/10.1145/3009960.3009962",
      "doi": "10.1145/3009960.3009962"
    },
    {
      "text": "Pentti M Rautaharju, Lawrence Park, Farida S Rautaharju, and Richard Crow. 1998. A standardized procedure for locating and documenting ECG chest electrode positions: consideration of the effect of breast tissue on ECG amplitudes in women. Journal of electrocardiology 31, 1 (1998), 17–29.",
      "doi": ""
    },
    {
      "text": "Tanushree Sharma and Kamalesh Kumar Sharma. 2017. QRS complex detection in ECG signals using locally adaptive weighted total variation denoising. Computers in biology and medicine 87 (2017), 187–199.",
      "doi": ""
    },
    {
      "text": "H-Y Song, J-H Lee, D Kang, H Cho, H-S Cho, J-W Lee, and Y-J Lee. 2010. Textile electrodes of jacquard woven fabrics for biosignal measurement. The Journal of the Textile Institute 101, 8 (2010), 758–770.",
      "doi": ""
    },
    {
      "text": "Catherine A. Spann, James Schaeffer, and George Siemens. 2017. Expanding the Scope of Learning Analytics Data: Preliminary Findings on Attention and Self-Regulation Using Wearable Technology. In Proceedings of the Seventh International Learning Analytics ; Knowledge Conference (Vancouver, British Columbia, Canada) (LAK ’17). Association for Computing Machinery, New York, NY, USA, 203–207. https://doi.org/10.1145/3027385.3027427",
      "doi": "10.1145/3027385.3027427"
    },
    {
      "text": "Katta Spiel, Os Keyes, and Pınar Barlas. 2019. Patching Gender: Non-Binary Utopias in HCI. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290607.3310425",
      "doi": "10.1145/3290607.3310425"
    },
    {
      "text": "Yan Sun, Kap Luk Chan, and Shankar Muthu Krishnan. 2005. Characteristic wave detection in ECG signal using morphological transform. BMC cardiovascular disorders 5, 1 (2005), 1–7.",
      "doi": ""
    },
    {
      "text": "Tadashi Suzuki, Tsugiyasu Kanda, Sachio Kubota, Susumu Imai, and Kazuhiko Murata. 1994. Holter monitoring as a noninvasive indicator of cardiac involvement in sarcoidosis. Chest 106, 4 (1994), 1021–1024.",
      "doi": ""
    },
    {
      "text": "Hakw Tam and John G Webster. 1977. Minimizing electrode motion artifact by skin abrasion. IEEE Transactions on Biomedical Engineering BME-24, 2 (1977), 134–139.",
      "doi": ""
    },
    {
      "text": "DA Tong, KA Bartels, and KS Honeyager. 2002. Adaptive reduction of motion artifact in the electrocardiogram. In Proceedings of the Second Joint 24th Annual Conference and the Annual Fall Meeting of the Biomedical Engineering Society][Engineering in Medicine and Biology, Vol. 2. IEEE, Piscataway, NJ, USA, 1403–1404.",
      "doi": ""
    },
    {
      "text": "Rodrigo Villar, Thomas Beltrame, and Richard L Hughson. 2015. Validation of the Hexoskin wearable vest during lying, sitting, standing, and walking activities. Applied Physiology, Nutrition, and Metabolism 40, 10(2015), 1019–1024.",
      "doi": ""
    },
    {
      "text": "Mihaela Vorvoreanu, Lingyi Zhang, Yun-Han Huang, Claudia Hilderbrand, Zoe Steine-Hanson, and Margaret Burnett. 2019. From Gender Biases to Gender-Inclusive Design: An Empirical Investigation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300283",
      "doi": "10.1145/3290605.3300283"
    },
    {
      "text": "Ya Xu, Guangyuan Liu, Min Hao, Wanhui Wen, and Xiting Huang. 2010. Analysis of affective ECG signals toward emotion recognition. Journal of Electronics (China) 27, 1 (2010), 8–14.",
      "doi": ""
    },
    {
      "text": "Murat A Yokus and Jesse S Jur. 2015. Fabric-based wearable dry electrodes for body surface biopotential recording. IEEE Transactions on Biomedical Engineering 63, 2 (2015), 423–430.",
      "doi": ""
    },
    {
      "text": "W Yu and J Zhou. 2016. Sports bras and breast kinetics. In Advances in women’s intimate apparel technology. Elsevier, Amsterdam, The Netherlands, 135–146.",
      "doi": ""
    },
    {
      "text": "Rong Zheng, Winnie Yu, and Jintu Fan. 2007. Development of a new Chinese bra sizing system based on breast anthropometric measurements. International Journal of Industrial Ergonomics 37, 8(2007), 697–705.",
      "doi": ""
    }
  ]
}