{
  "doi": "10.1145/3491102.3502493",
  "title": "At-Home Pupillometry using Smartphone Facial Identification Cameras",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2022,
  "badges": [],
  "abstract": "With recent developments in medical and psychiatric research surrounding pupillary response, cheap and accessible pupillometers could enable medical benefits from early neurological disease detection to measurements of cognitive load. In this paper, we introduce a novel smartphone-based pupillometer to allow for future development in clinical research surrounding at-home pupil measurements. Our solution utilizes a NIR front-facing camera for facial recognition paired with the RGB selfie camera to perform tracking of absolute pupil dilation with sub-millimeter accuracy. In comparison to a gold standard pupillometer during a pupillary light reflex test, the smartphone-based system achieves a median MAE of 0.27mm for absolute pupil dilation tracking and a median error of 3.52% for pupil dilation change tracking. Additionally, we remotely deployed the system to older adults as part of a usability study that demonstrates promise for future smartphone deployments to remotely collect data in older, inexperienced adult users operating the system themselves.",
  "authors": [
    {
      "name": "Colin Barry",
      "institution": "Electrical and Computer Engineering, University of California, San Diego, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659837507",
      "orcid": "missing"
    },
    {
      "name": "Jessica de Souza",
      "institution": "Electrical and Computer Engineering, University of California, San Diego, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238631",
      "orcid": "missing"
    },
    {
      "name": "Yinan Xuan",
      "institution": "Electrical and Computer Engineering, University of California, San Diego, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238068",
      "orcid": "missing"
    },
    {
      "name": "Jason Holden",
      "institution": "Psychiatry, University of California, San Diego, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235669",
      "orcid": "missing"
    },
    {
      "name": "Eric Granholm",
      "institution": "Psychiatry, University of California, San Diego, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233505",
      "orcid": "missing"
    },
    {
      "name": "Edward Jay Wang",
      "institution": "Electrical and Computer Engineering, University of California, San Diego, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659826524",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ron Amadeo. 2019. Google pixel 4 REVIEW-OVERPRICED, uncompetitive, and out of touch. https://arstechnica.com/gadgets/2019/11/google-pixel-4-review-overpriced-uncompetitive-and-out-of-touch/",
      "doi": ""
    },
    {
      "text": "Colin Barry, Tauhidur Rahman, and Edward J. Wang. 2021. Tenets towards Smartphone-Based Medical Tricorders. In Proceedings of the 2021 Workshop on Future of Digital Biomarkers (Virtual Event, Wisconsin) (DigiBiom ’21). Association for Computing Machinery, New York, NY, USA, 12–18. https://doi.org/10.1145/3469266.3469880",
      "doi": "10.1145/3469266.3469880"
    },
    {
      "text": "Pratik S. Chougule, Raymond P. Najjar, Maxwell T. Finkelstein, Nagaendran Kandiah, and Dan Milea. 2019. Light-Induced Pupillary Responses in Alzheimer’s Disease. Frontiers in Neurology 10 (2019), 360. https://doi.org/10.3389/fneur.2019.00360",
      "doi": ""
    },
    {
      "text": "D.C DeBuc. 2016. The Role of Retinal Imaging and Portable Screening Devices in Tele-ophthalmology Applications for Diabetic Retinopathy Management. Current Diabetes Reports 16 (2016). https://doi.org/10.1007/s11892-016-0827-2",
      "doi": ""
    },
    {
      "text": "Shaharam Eivazi, Thiago Santini, Alireza Keshavarzi, Thomas Kübler, and Andrea Mazzei. 2019. Improving real-time CNN-based pupil detection through domain-specific data augmentation. In In Proceedings of the 11th ACM Symposium on Eye Tracking Research and Applications (New York, NY, USA) (ETRA ’19). Association for Computing Machinery. https://doi.org/10.1145/3314111.3319914",
      "doi": "10.1145/3314111.3319914"
    },
    {
      "text": "Eric L. Granholm, Matthew S. Panizzon, Jeremy A. Elman, Amy J. Jak, Richard L. Hauger, Mark W. Bondi, Michael J. Lyons, Carol E. Franz, and William S. Kremen. 2017. Pupillary Responses as a Biomarker of Early Risk for Alzheimer’s Disease. Journal of Alzheimer’s Disease 56 (2017). https://doi.org/10.3233/JAD-161078",
      "doi": ""
    },
    {
      "text": "Charlotte A Hall and Robert P Chilcott. 2018. Eyeing up the Future of the Pupillary Light Reflex in Neurodiagnostics. Diagnostics 8(2018). https://doi.org/10.3390/diagnostics8010019",
      "doi": ""
    },
    {
      "text": "A Hamrakova, I Ondrejka, N Sekaninova, L Peregrim, and I Tonhajzerova. 2019. Pupillary Light Reflex in Children with ADHD. Acta Medica Martiniana 19, 1 (2019), 30–37. https://doi.org/doi:10.2478/acm-2019-0004",
      "doi": ""
    },
    {
      "text": "Michael Xuelin Huang, Jiajia Li, Grace Ngai, and Hong Va Leong. 2017. ScreenGlint: Practical, In-Situ Gaze Estimation on Smartphones. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 2546–2557. https://doi.org/10.1145/3025453.3025794",
      "doi": "10.1145/3025453.3025794"
    },
    {
      "text": "Elman JA, Panizzon MS, Hagler DJ Jr, Eyler LT, Granholm EL, Fennema-Notestine C, Lyons MJ, McEvoy LK, Franz CE, Dale AM, and Kremen WS. 2017. Task-evoked pupil dilation and BOLD variance as indicators of locus coeruleus dysfunction. Cortex. Cortex (2017). https://doi.org/10.1016/j.cortex.2017.09.025",
      "doi": ""
    },
    {
      "text": "McAnany JJ, Smith BM, Garland A, and Kagen SL. 2018. iPhone-based Pupillometry: A Novel Approach for Assessing the Pupillary Light Reflex. Optom Vis Sci (2018). https://doi.org/10.1097/OPX.0000000000001289",
      "doi": ""
    },
    {
      "text": "Merlin D. MD Larson and Matthias MD Behrends. 2015. Portable Infrared Pupillometry. Anesthesia and Analgesia 120 (June 2015). https://doi.org/10.1213/ANE.0000000000000314",
      "doi": ""
    },
    {
      "text": "Reddy LF, Reavis EA, Wynn JK, and Green MF. 2018. Pupillary responses to a cognitive effort task in schizophrenia. Schizophrenia Research (March 2018). https://doi.org/10.1016/j.schres.2018.03.005",
      "doi": ""
    },
    {
      "text": "Zhengzhen Liu and Tianding Chen. 2009. Distance Measurement System Based on Binocular Stereo Vision. In 2009 International Joint Conference on Artificial Intelligence. 456–459. https://doi.org/10.1109/JCAI.2009.77",
      "doi": ""
    },
    {
      "text": "Alex Mariakakis, Jacob Baudin, Eric Whitmire, Vardhman Mehta, Megan A Banks, Anthony Law, Lynn McGrath, and Shwetak N Patel. 2017. PupilScreen: Using Smartphones to Assess Traumatic Brain Injury. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 81. https://doi.org/10.1145/3131896",
      "doi": "10.1145/3131896"
    },
    {
      "text": "Sebastiaan Mathôt. 2018. Pupillometry: Psychology, Physiology, and Function. Journal of Cognition (Feb. 2018). https://doi.org/10.5334/joc.18",
      "doi": ""
    },
    {
      "text": "G. Micieli, C. Tassorelli, E. Martignoni, C. Pacchetti, P. Bruggi, M. Magri, and G. Nappi. 1991. Disordered pupil reactivity in Parkinson’s disease. Clinical Autonomic Research(1991), 55–58.",
      "doi": ""
    },
    {
      "text": "Yasir M Mustafah, Rahizall Noor, Hasbullah Hasbi, and Amelia Wong Azma. 2012. Stereo vision images processing for real-time object distance and size measurements. In 2012 International Conference on Computer and Communication Engineering (ICCCE). 659–663. https://doi.org/10.1109/ICCCE.2012.6271270",
      "doi": ""
    },
    {
      "text": "Andrew E. Neice, Cedar Fowler, Richard A. Jaffe, and John G. Brock-Utne. 2020. Feasibility study of a smartphone pupillometer and evaluation of its accuracy. Journal of Clinical Monitoring and Computing (2020). https://doi.org/10.1007/s10877-020-00592-x",
      "doi": ""
    },
    {
      "text": "K. Ohtsuka, K. Asakura, H. Kawasaki, and M. Sawa. 1988. Respiratory fluctuations of the human pupil. Experimental Brain Research 71 (1988), 215–217. https://doi.org/10.1007/BF00247537",
      "doi": ""
    },
    {
      "text": "PupilLabs [n.d.]. Eye tracking technology - gain insight into human behavior - pupil labs. https://pupil-labs.com/",
      "doi": ""
    },
    {
      "text": "PupilLabs 2015. Improving your research with eye tracking since 2001 - TOBII Pro. https://www.tobiipro.com/",
      "doi": ""
    },
    {
      "text": "Maurice Schallenberg, Valerie Bangre, Klaus-Peter Steuhl, Stephan Kremmer, and J. Michael Selbach. 2010. Comparison of the Colvard, Procyon, and Neuroptics Pupillometers for Measuring Pupil Diameter Under Low Ambient Illumination. Journal of Refractive Surgery 26, 2 (2010), 134–143. https://doi.org/10.3928/1081597X-20100121-09 arXiv:https://journals.healio.com/doi/pdf/10.3928/1081597X-20100121-09",
      "doi": ""
    },
    {
      "text": "A Tales, T Troscianko, D Lush, J Haworth, GK Wilcock, and SR Butler. 2001. The pupillary light reflex in aging and Alzheimer’s disease. Aging (Milan, Italy) 13, 6 (December 2001), 473—478. http://europepmc.org/abstract/MED/11845975",
      "doi": ""
    },
    {
      "text": "A Tales, T Troscianko, D Lush, J Haworth, GK Wilcock, and SR Butler. 2001. The pupillary light reflex in aging and Alzheimer’s disease. Aging (Milan, Italy) 13, 6 (December 2001), 473—478. http://europepmc.org/abstract/MED/11845975",
      "doi": ""
    },
    {
      "text": "Sindri Traustason, Adam Elias Brondsted, Birgit Sander, and Henrik Lund-Andersen. 2016. Pupillary response to direct and consensual chromatic light stimuli. Acta Ophthalmologica(2016). https://doi.org/10.1111/aos.12894",
      "doi": ""
    },
    {
      "text": "Nachiappan Valliappan, Na Dai, Ethan Steinberg, Junfeng He, Kantwon Rogers, Venky Ramachandran, Pingmei Xu, Mina Shojaeizadeh, Li Guo, Kai Kohlhoff, and Vidhya Navalpakkam. 2020. Accelerating eye movement research via accurate and affordable smartphone eye tracking. Nature Communications 11(2020). https://doi.org/10.1038/s41467-020-18360-5",
      "doi": ""
    },
    {
      "text": "Nachiappan Valliappan, Na Dai, Ethan Steinberg, Junfeng He, Kantwon Rogers, Venky Ramachandran, Pingmei Xu, Mina Shojaeizadeh, Li Guo, Kai Kohlhoff, and Vidhya Navalpakkam. 2020. Accelerating eye movement research via accurate and affordable smartphone eye tracking. Nature Communications(2020). https://doi.org/10.1038/s41467-020-18360-5",
      "doi": ""
    },
    {
      "text": "P. van der Wel and H van Steenbergen. 2018. Pupil dilation as an index of effort in cognitive control tasks: A review. Psychonomic Bulletin and Review(2018). https://doi.org/10.3758/s13423-018-1432-y",
      "doi": ""
    },
    {
      "text": "M. B. Winn, D. Wendt, T. Koelewijn, and S. E. Kuchinsky. 2018. Best Practices and Advice for Using Pupillometry to Measure Listening Effort: An Introduction for Those Who Want to Get Started. Trends in hearing 22(2018). https://doi.org/10.1177/2331216518800869",
      "doi": ""
    },
    {
      "text": "Kremen WS, Panizzon MS, Elman JA, Granholm EL, Andreassen OA, Gillespie NA Dale AM, Gustavson DE, Logue MW, Lyons MJ, Neale MC, Reynolds CA, Whitsel N, and Franz CE. 2019. Pupillary dilation responses as a midlife indicator of risk for Alzheimer’s disease: association with Alzheimer’s disease polygenic risk. Neurobiology of Aging(2019). https://doi.org/10.1016/j.neurobiolaging.2019.09.001",
      "doi": ""
    }
  ]
}