{
  "doi": "10.1145/3491102.3502132",
  "title": "The Challenge of (Non-)Disclosure: Exploring the Lived Experience of Ethiopian Adolescents with HIV and Their Attitudes Toward Technology",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2022,
  "badges": [],
  "abstract": "Adolescents in sub-Saharan Africa are at the epicenter of the global HIV epidemic. Yet, technology to support HIV management overwhelmingly focuses on adult medication adherence, neglecting the complex lives of adolescents in low-income regions. We present findings from interviews and focus groups that included twelve HIV-positive adolescents in Ethiopia, and eleven adults from their care circles. We leverage the Integrated Behavioral Model to examine the lived experience of HIV and the space for technology. Additionally, we present an inductive thematic analysis, which highlights non-disclosure as a central theme, i.e., adolescents remaining unaware of their HIV status. Drawing from these findings, we discuss how to account for (the lack of) disclosure in the design of technology to support HIV management, and reflect on whether technology could (and should) support the process. We further highlight the risks that researchers and designers need to be aware of when designing HIV management technology for this audience.",
  "authors": [
    {
      "name": "Alemitu Mequanint Bezabih",
      "institution": "Department of Computer Science, e-Media Research Lab, KU Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233638",
      "orcid": "missing"
    },
    {
      "name": "Kathrin Gerling",
      "institution": "Department of Computer Science, e-Media Research Lab, KU Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657431",
      "orcid": "0000-0002-8449-6124"
    },
    {
      "name": "Workeabeba Abebe",
      "institution": "Pediatrics and Child Health Department, College of Health Sciences, Addis Ababa University, Ethiopia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237544",
      "orcid": "0000-0003-3224-1899"
    },
    {
      "name": "Vero Vanden Abeele",
      "institution": "Department of Computer Science, e-Media Research Lab, KU Leuven, Belgium",
      "img": "/do/10.1145/contrib-81416596596/rel-imgonly/polaroid_vero_v4.png",
      "acmid": "81416596596",
      "orcid": "0000-0002-3031-9579"
    }
  ],
  "references": [
    {
      "text": "Workeabeba Abebe and Solomon Teferra. 2012. Disclosure of diagnosis by parents and caregivers to children infected with HIV: Prevalence associated factors and perceived barriers in Addis Ababa, Ethiopia. AIDS Care 24, 9 (September 2012), 1097–1102. DOI:https://doi.org/10.1080/09540121.2012.656565",
      "doi": ""
    },
    {
      "text": "Oluyemisi Aderomilehin, Angella Hanciles-Amu, and Oluwatobi Ohiole Ozoya. 2016. Perspectives and Practice of HIV Disclosure to Children and Adolescents by Health-Care Providers and Caregivers in sub-Saharan Africa: A Systematic Review. Front. Public Health 4, (2016), 166. DOI:https://doi.org/10.3389/fpubh.2016.00166",
      "doi": ""
    },
    {
      "text": "Icek Ajzen. 1985. From Intentions to Actions: A Theory of Planned Behavior. In Action Control: From Cognition to Behavior, Julius Kuhl and Jürgen Beckmann (eds.). Springer, Berlin, Heidelberg, 11–39. DOI:https://doi.org/10.1007/978-3-642-69746-3_2",
      "doi": ""
    },
    {
      "text": "Wondwossen Asefa Alemayehu, Jeanitte Maritz, and Lizeth Roets. 2021. Application of Integrated Behavioral Model (IBM) to measure intention to get early screening and treatment of Sexually Transmitted Infections (STIs) among HIV at- risk sub-populations in Ethiopia. Afr. Health Sci. 21, 2 (August 2021), 538–546. DOI:https://doi.org/10.4314/ahs.v21i2.8",
      "doi": ""
    },
    {
      "text": "N. Ammon, S. Mason, and J. M. Corkery. 2018. Factors impacting antiretroviral therapy adherence among human immunodeficiency virus–positive adolescents in Sub-Saharan Africa: a systematic review. Public Health 157, (April 2018), 20–31. DOI:https://doi.org/10.1016/j.puhe.2017.12.010",
      "doi": ""
    },
    {
      "text": "Mariam Arain, Maliha Haque, Lina Johal, Puja Mathur, Wynand Nel, Afsha Rais, Ranbir Sandhu, and Sushil Sharma. 2013. Maturation of the adolescent brain. Neuropsychiatr. Dis. Treat. 9, (2013), 449–461. DOI:https://doi.org/10.2147/NDT.S39776",
      "doi": ""
    },
    {
      "text": "S. Ashaba, C. Cooper-Vince, S. Maling, G. Z. Rukundo, D. Akena, and A. C. Tsai. 2018. Internalized HIV stigma, bullying, major depressive disorder, and high-risk suicidality among HIV-positive adolescents in rural Uganda. Glob. Ment. Health 5, (ed 2018). DOI:https://doi.org/10.1017/gmh.2018.15",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1986. Social Foundations of Thought and Action: A Social Cognitive Theory. Prentice-Hall.",
      "doi": ""
    },
    {
      "text": "Kevin Louis Bardosh, Melanie Murray, Antony M. Khaemba, Kirsten Smillie, and Richard Lester. 2017. Operationalizing mHealth to improve patient care: a qualitative implementation science evaluation of the WelTel texting intervention in Canada and Kenya. Glob. Health 13, 1 (December 2017), 87. DOI:https://doi.org/10.1186/s12992-017-0311-z",
      "doi": ""
    },
    {
      "text": "Adam W. Bartlett, Pagakrong Lumbiganon, Thahira A. Jamal Mohamed, Keswadee Lapphra, Dina Muktiarti, Quy Tuan Du, Rawiwan Hansudewechakul, Penh Sun Ly, Khanh Huu Truong, Lam Van Nguyen, Thanyawee Puthanakit, Tavitiya Sudjaritruk, Kulkanya Chokephaibulkit, Viet Chau Do, Nagalingeswaran Kumarasamy, Nik Khairulddin Nik Yusoff, Nia Kurniati, Moy Siew Fong, Dewi Kumara Wati, Revathy Nallusamy, Annette H. Sohn, Azar Kariminia, and TREAT Asia Pediatric HIV Observational Database of IeDEA Asia-Pacific. 2019. Dual Analysis of Loss to Follow-up for Perinatally HIV-Infected Adolescents Receiving Combination Antiretroviral Therapy in Asia. J. Acquir. Immune Defic. Syndr. 1999 82, 5 (December 2019), 431–438. DOI:https://doi.org/10.1097/QAI.0000000000002184",
      "doi": ""
    },
    {
      "text": "Alemitu Mequanint Bezabih, Kathrin Gerling, Workeabeba Abebe, and Vero Vanden Abeele. 2021. Behavioral Theories and Motivational Features Underlying eHealth Interventions for Adolescent Antiretroviral Adherence: Systematic Review. JMIR MHealth UHealth 9, 12 (December 2021), e25129. DOI:https://doi.org/10.2196/25129",
      "doi": ""
    },
    {
      "text": "Silenat Biressaw, Woldaregay Erku Abegaz, Markos Abebe, Workeabeba Abebe Taye, and Mulugeta Belay. 2013. Adherence to Antiretroviral Therapy and associated factors among HIV infected children in Ethiopia: unannounced home-based pill count versus caregivers’ report. BMC Pediatr. 13, (September 2013), 132. DOI:https://doi.org/10.1186/1471-2431-13-132",
      "doi": ""
    },
    {
      "text": "Arjan E.R. Bos, Herman P. Schaalma, and John B. Pryor. 2008. Reducing AIDS-related stigma in developing countries: The importance of theory- and evidence-based interventions. Psychol. Health Med. 13, 4 (August 2008), 450–460. DOI:https://doi.org/10.1080/13548500701687171",
      "doi": ""
    },
    {
      "text": "Paul Branscum and Amir Bhochhibhoya. 2016. Exploring Gender Differences in Predicting Physical Activity Among Elementary Aged Children: An Application of the Integrated Behavioral Model. Am. J. Health Educ. 47, 4 (July 2016), 234–242. DOI:https://doi.org/10.1080/19325037.2016.1178608",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qual. Res. Psychol. 3, 2 (January 2006), 77–101. DOI:https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Sander Broström, Axel Andersson, Inger Hallström, and Degu Jerene. 2020. Transitioning from child to adult-oriented HIV clinical care for adolescents living with HIV in Ethiopia: results from a retrospective cohort study. Pan Afr. Med. J. 37, 13 (September 2020). DOI:https://doi.org/10.11604/pamj.2020.37.13.21407",
      "doi": ""
    },
    {
      "text": "Adrian Bussone, Bakita Kasadha, Simone Stumpf, Abigail C. Durrant, Shema Tariq, Jo Gibbs, Karen C. Lloyd, and Jon Bird. 2020. Trust, Identity, Privacy, and Security Considerations for Designing a Peer Data Sharing Platform Between People Living With HIV. Proc. ACM Hum.-Comput. Interact. 4, CSCW2 (October 2020), 173:1-173:27. DOI:https://doi.org/10.1145/3415244",
      "doi": "10.1145/3415244"
    },
    {
      "text": "Adrian Bussone, Simone Stumpf, and George Buchanan. 2016. It Feels Like I'm Managing Myself: HIV+ People Tracking Their Personal Health Information. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (NordiCHI ’16), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/2971485.2971542",
      "doi": "10.1145/2971485.2971542"
    },
    {
      "text": "Adrian Bussone, Simone Stumpf, and Stephanie Wilson. 2017. The use of online forums by people living with HIV for help in understanding personal health information. Int. J. Med. Inf. 108, (December 2017), 64–70. DOI:https://doi.org/10.1016/j.ijmedinf.2017.10.001",
      "doi": ""
    },
    {
      "text": "Adrian Bussone, Simone Stumpf, and Stephanie Wilson. 2019. Designing for Reflection on Shared HIV Health Information. In Proceedings of the 13th Biannual Conference of the Italian SIGCHI Chapter: Designing the next Interaction (CHItaly ’19), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/3351995.3352036",
      "doi": "10.1145/3351995.3352036"
    },
    {
      "text": "Dathan Mirembe Byonanebye, Maria S. Nabaggala, Agnes Bwanika Naggirinya, Mohammed Lamorde, Elizabeth Oseku, Rachel King, Noela Owarwo, Eva Laker, Richard Orama, Barbara Castelnuovo, Agnes Kiragga, and Rosalind Parkes-Ratanshi. 2021. An Interactive Voice Response Software to Improve the Quality of Life of People Living With HIV in Uganda: Randomized Controlled Trial. JMIR MHealth UHealth 9, 2 (February 2021), e22229. DOI:https://doi.org/10.2196/22229",
      "doi": ""
    },
    {
      "text": "A.D. Castel, S. Qasmieh, D. Greenberg, N. Ellenberger, T.H. Howell, C. Griffith, B.C. Wilbourn, K. Ganesan, N. Hussein, G. Ralte, and N. Rakhmanina. 2018. Digital gaming to improve adherence among adolescents and young adults living with HIV: Mixed-Methods study to test feasibility and acceptability. J. Med. Internet Res. 20, 10 (2018). DOI:https://doi.org/10.2196/10213",
      "doi": ""
    },
    {
      "text": "Caricia Catalani, William Philbrick, Hamish Fraser, Mechael Patricia, and Dennis M. Israelski. 2013. mHealth for HIV Treatment & Prevention: A Systematic Review of the Literature. Open AIDS J. 7, (August 2013), 17–41. DOI:https://doi.org/10.2174/1874613620130812003",
      "doi": ""
    },
    {
      "text": "Ashley Chory, Winstone Nyandiko, Roxanne Martin, Josephine Aluoch, Michael Scanlon, Celestine Ashimosi, Tabitha Njoroge, Carole McAteer, Edith Apondi, and Rachel Vreeman. 2021. HIV-Related Knowledge, Attitudes, Behaviors and Experiences of Kenyan Adolescents Living with HIV Revealed in WhatsApp Group Chats. J. Int. Assoc. Provid. AIDS Care 20, (December 2021), 2325958221999579. DOI:https://doi.org/10.1177/2325958221999579",
      "doi": ""
    },
    {
      "text": "Deborah Christie and Russell Viner. 2005. Adolescent development. BMJ 330, 7486 (February 2005), 301–304.",
      "doi": ""
    },
    {
      "text": "Lucie D. Cluver, Rebecca J. Hodes, Elona Toska, Khameer K. Kidia, F. Mark Orkin, Lorraine Sherr, and Franziska Meinck. 2015. ‘HIV is like a tsotsi. ARVs are your guns’: associations between HIV-disclosure and adherence to antiretroviral treatment among adolescents in South Africa. AIDS 29, (June 2015), S57. DOI:https://doi.org/10.1097/QAD.0000000000000695",
      "doi": ""
    },
    {
      "text": "Vanessa Cooper, Jane Clatworthy, Jennifer Whetham, and EmERGE Consortium. 2017. mHealth Interventions To Support Self-Management In HIV: A Systematic Review. Open AIDS J. 11, (November 2017), 119–132. DOI:https://doi.org/10.2174/1874613601711010119",
      "doi": ""
    },
    {
      "text": "Abdul-Razak Doat, Elham Navab, and Akram Sadat Sadat Hoseini. 2021. Lived Experiences of Adolescent Living with human immunodeficiency virus in Ghana: A Phenomenology Study. Nurs. Open 8, 1 (January 2021), 299–307. DOI:https://doi.org/10.1002/nop2.630",
      "doi": ""
    },
    {
      "text": "Abdul-Razak Doat, Reza Negarandeh, and Marzieh Hasanpour. 2019. Disclosure of HIV Status to Children in Sub-Saharan Africa: A Systematic Review. Med. Kaunas Lith. 55, 8 (August 2019), E433. DOI:https://doi.org/10.3390/medicina55080433",
      "doi": ""
    },
    {
      "text": "N. Dowshen, L.M. Kuhns, A. Johnson, B.J. Holoyda, and R. Garofalo. 2012. Improving adherence to antiretroviral therapy for youth living with HIV/AIDS: A pilot study using personalized, interactive, daily text message reminders. J. Med. Internet Res. 14, 2 (2012), 168–175. DOI:https://doi.org/10.2196/jmir.2015",
      "doi": ""
    },
    {
      "text": "M. Dworkin, A. Chakraborty, S. Lee, C. Monahan, L. Hightow-Weidman, R. Garofalo, D. Qato, and A. Jimenez. 2018. A realistic talking human embodied agent mobile phone intervention to promote HIV medication adherence and retention in care in young HIV-positive African American men who have sex with men: Qualitative study. JMIR MHealth UHealth 6, 7 (2018). DOI:https://doi.org/10.2196/10211",
      "doi": ""
    },
    {
      "text": "Mark S. Dworkin, Sangyoon Lee, Apurba Chakraborty, Colleen Monahan, Lisa Hightow-Weidman, Robert Garofalo, Dima M. Qato, Li Liu, and Antonio Jimenez. 2019. Acceptability, Feasibility, and Preliminary Efficacy of a Theory-Based Relational Embodied Conversational Agent Mobile Phone Intervention to Promote HIV Medication Adherence in Young HIV-Positive African American MSM. AIDS Educ. Prev. 31, 1 (February 2019), 17–37. DOI:https://doi.org/10.1521/aeap.2019.31.1.17",
      "doi": ""
    },
    {
      "text": "Ministry of Health Ethiopia. 2018. National Consolidated Guidelines for Comprehensive HIV Prevention, Care and Treatment. Retrieved December 20, 2021 from https://www.afro.who.int/sites/default/files/2019-04/National%20Comprehensive%20HIV%20Care%20%20Guideline%202018.pdf",
      "doi": ""
    },
    {
      "text": "Juan F. Maestre, Tawanna Dillahunt, Alec Andrew Theisz, Megan Furness, Vaishnav Kameswaran, Tiffany Veinot, and Patrick C. Shih. 2021. Examining Mobility Among People Living with HIV in Rural Areas. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), Association for Computing Machinery, New York, NY, USA, 1–17. DOI:https://doi.org/10.1145/3411764.3445086",
      "doi": ""
    },
    {
      "text": "Heather Farthing, Nancy R. Reynolds, Sampson Antwi, Amina Alhassan, Irene Pokuaa Ofori, Lorna Renner, Kofi Aikins Amissah, Jonas Tettey Kusah, Margaret Lartey, Elijah Paintsil, and the Sankofa Study Team. 2020. Illness Narratives of Children Living with HIV Who Do Not Know Their HIV Status in Ghana: I'm Sick, But I Don't Know the Sickness—A Qualitative Study. AIDS Behav. 24, 11 (November 2020), 3225–3231. DOI:https://doi.org/10.1007/s10461-020-02884-4",
      "doi": ""
    },
    {
      "text": "M. Fishbein. 1979. A theory of reasoned action: Some applications and implications. Nebr. Symp. Motiv. 27, (1979), 65–116.",
      "doi": ""
    },
    {
      "text": "Daniel Fitton and Beth Bell. 2014. Working with Teenagers Within HCI Research: Understanding Teen-Computer Interaction. In Proceedings of the 28th International BCS Human Computer Interaction Conference on HCI 2014 - Sand, Sea and Sky - Holiday HCI (BCS-HCI ’14), BCS, UK, 201–206. DOI:https://doi.org/10.14236/ewic/hci2014.23",
      "doi": "10.14236/ewic/HCI2014.31"
    },
    {
      "text": "Joseph Fokam, Samuel Martin Sosso, Bouba Yagai, Serge Clotaire Billong, Rina Estelle Djubgang Mbadie, Rachel Kamgaing Simo, Serge Valery Edimo, Alex Durand Nka, Aline Tiga Ayissi, Junie Flore Yimga, Désiré Takou, Sylvie Moudourou, Marinette Ngo Nemb, Jean-Bosco Nfetam Elat, Maria-Mercedes Santoro, Carlo-Federico Perno, Vittorio Colizzi, and Alexis Ndjolo. 2019. Viral suppression in adults, adolescents and children receiving antiretroviral therapy in Cameroon: adolescents at high risk of virological failure in the era of “test and treat.” AIDS Res. Ther. 16, 1 (November 2019), 36. DOI:https://doi.org/10.1186/s12981-019-0252-0",
      "doi": ""
    },
    {
      "text": "Steven S. Forsythe, William McGreevey, Alan Whiteside, Maunank Shah, Joshua Cohen, Robert Hecht, Lori A. Bollinger, and Anthony Kinghorn. 2019. Twenty Years Of Antiretroviral Therapy For People Living With HIV: Global Costs, Health Achievements, Economic Benefits. Health Aff. (Millwood) 38, 7 (July 2019), 1163–1172. DOI:https://doi.org/10.1377/hlthaff.2018.05391",
      "doi": ""
    },
    {
      "text": "Lisa J. Frigati, Karryn Brown, Mark F. Cotton, Landon Myer, and Heather J. Zar. 2020. Hospitalization in South African Adolescents With Perinatally Acquired HIV on Antiretroviral Therapy. Pediatr. Infect. Dis. J. 39, 11 (November 2020), 1035–1039. DOI:https://doi.org/10.1097/INF.0000000000002826",
      "doi": ""
    },
    {
      "text": "Zheng Gao and Patrick C. Shih. 2019. Communities of support: social support exchange in a HIV online forum. In Proceedings of the Seventh International Symposium of Chinese CHI (Chinese CHI ’19), Association for Computing Machinery, New York, NY, USA, 37–43. DOI:https://doi.org/10.1145/3332169.3333576",
      "doi": "10.1145/3332169.3333576"
    },
    {
      "text": "Erving Goffman. 1963. Stigma: notes on the management of spoiled identity. Prentice-Hall, Englewood Cliffs, N.J.",
      "doi": ""
    },
    {
      "text": "Robert Gross, Justin Ritz, Michael D. Hughes, Robert Salata, Peter Mugyenyi, Evelyn Hogg, Linda Wieclaw, Catherine Godfrey, Carole L. Wallis, John W. Mellors, Victor O. Mudhune, Sharlaa Badal-Faesen, Beatriz Grinsztejn, and Ann C. Collier. 2019. Two-way mobile phone intervention compared with standard-of-care adherence support after second-line antiretroviral therapy failure: a multinational, randomised controlled trial. Lancet Digit. Health 1, 1 (May 2019), e26–e34. DOI:https://doi.org/10.1016/S2589-7500(19)30006-8",
      "doi": ""
    },
    {
      "text": "Eric Gyamfi, Paul Okyere, Emmanuel Appiah-Brempong, Rose Odotei Adjei, and Kofi Akohene Mensah. 2015. Benefits of Disclosure of HIV Status to Infected Children and Adolescents: Perceptions of Caregivers and Health Care Providers. J. Assoc. Nurses AIDS Care 26, 6 (November 2015), 770–780. DOI:https://doi.org/10.1016/j.jana.2015.08.001",
      "doi": ""
    },
    {
      "text": "Jessica E. Haberer, Angella Musiimenta, Esther C. Atukunda, Nicholas Musinguzi, Monique A. Wyatt, Norma C. Ware, and David R. Bangsberg. 2016. Short message service (SMS) reminders and real-time adherence monitoring improve antiretroviral therapy adherence in rural Uganda. AIDS 30, 8 (May 2016), 1295–1299. DOI:https://doi.org/10.1097/QAD.0000000000001021",
      "doi": ""
    },
    {
      "text": "Oliver Haimson, Kathryn Ringland, Simone Simpson, and Christine Wolf. 2014. Using Depression Analytics to Reduce Stigma via Social Media: BlueFriends.",
      "doi": ""
    },
    {
      "text": "Rohan Hazra, George K. Siberry, and Lynne M. Mofenson. 2010. Growing up with HIV: children, adolescents, and young adults with perinatally acquired HIV infection. Annu. Rev. Med. 61, (2010), 169–185. DOI:https://doi.org/10.1146/annurev.med.050108.151127",
      "doi": ""
    },
    {
      "text": "Kirk D. Henny, Aisha L. Wilkes, Christina M. McDonald, Damian J. Denson, and Mary Spink Neumann. 2018. A Rapid Review of eHealth Interventions Addressing the Continuum of HIV Care (2007-2017). AIDS Behav. 22, 1 (2018), 43–63. DOI:https://doi.org/10.1007/s10461-017-1923-2",
      "doi": ""
    },
    {
      "text": "Yitbarek Tenaw Hibstie, Getiye Dejenu Kibret, Asmare Talie, Belisty Temesgen, Mamaru Wubale Melkamu, and Animut Alebel. 2020. Nearly one in every six HIV-infected children lost from ART follow-up at Debre Markos Referral Hospital, Northwest Ethiopia: A 14-year retrospective follow-up study. PloS One 15, 9 (2020), e0239013. DOI:https://doi.org/10.1371/journal.pone.0239013",
      "doi": ""
    },
    {
      "text": "L. Hightow-Weidman, K. Muessig, K. Knudtson, M. Srivatsa, E. Lawrence, S. LeGrand, A. Hotten, and S. Hosek. 2018. A gamified smartphone app to support engagement in care and medication adherence for HIV-positive young men who have sex with men (AllyQuest): Development and pilot study. J. Med. Internet Res. 20, 4 (2018). DOI:https://doi.org/10.2196/publichealth.8923",
      "doi": ""
    },
    {
      "text": "Carly Hudelson and Lucie Cluver. 2015. Factors associated with adherence to antiretroviral therapy among adolescents living with HIV/AIDS in low- and middle-income countries: a systematic review. AIDS Care 27, 7 (July 2015), 805–816. DOI:https://doi.org/10.1080/09540121.2015.1011073",
      "doi": ""
    },
    {
      "text": "Seth C. Inzaule, Raph L. Hamers, Cissy Kityo, Tobias F. Rinke de Wit, and Maria Roura. 2016. Long-Term Antiretroviral Treatment Adherence in HIV-Infected Adolescents and Adults in Uganda: A Qualitative Study. PLOS ONE 11, 11 (November 2016), e0167492. DOI:https://doi.org/10.1371/journal.pone.0167492",
      "doi": ""
    },
    {
      "text": "Degu Jerene, Workeabeba Abebe, Kefyalew Taye, Andrea Ruff, and Inger Hallstrom. 2019. Adolescents living with HIV are at higher risk of death and loss to follow up from care: Analysis of cohort data from eight health facilities in Ethiopia. PLoS ONE 14, 10 (2019). DOI:https://doi.org/10.1371/journal.pone.0223655",
      "doi": ""
    },
    {
      "text": "Anirudha Joshi, D.G. Saple, Kamalika Sen, Els Veldeman, Romain Rutten, Mandar Rane, Debjani Roy, Nagraj Emmadi, Padma Srinivasan, N. Kumarasamy, Sanjay Pujari, Davidson Solomon, and Rashmi Rodrigues. 2014. Supporting treatment of people living with HIV / AIDS in resource limited settings with IVRs. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14, ACM Press, Toronto, Ontario, Canada, 1595–1604. DOI:https://doi.org/10.1145/2556288.2557236",
      "doi": "10.1145/2556288.2557236"
    },
    {
      "text": "Azar Kariminia, Matthew Law, Mary-Ann Davies, Michael Vinikoor, Kara Wools-Kaloustian, Valeriane Leroy, Andrew Edmonds, Catherine McGowan, Rachel Vreeman, Lee Fairlie, Samuel Ayaya, Marcel Yotebieng, Elom Takassi, Jorge Pinto, Adebola Adedimeji, Karen Malateste, Daisy M. Machado, Martina Penazzato, Rohan Hazra, Annette H. Sohn, and IeDEA. 2018. Mortality and losses to follow-up among adolescents living with HIV in the IeDEA global cohort collaboration. J. Int. AIDS Soc. 21, 12 (December 2018), e25215. DOI:https://doi.org/10.1002/jia2.25215",
      "doi": ""
    },
    {
      "text": "Naveena Karusala, David Odhiambo Seeh, Cyrus Mugo, Brandon Guthrie, Megan A Moreno, Grace John-Stewart, Irene Inwani, Richard Anderson, and Keshet Ronen. 2021. “That courage to encourage”: Participation and Aspirations in Chat-based Peer Support for Youth Living with HIV. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–17. DOI:https://doi.org/10.1145/3411764.3445313",
      "doi": "10.1145/3411764.3445313"
    },
    {
      "text": "Danuta Kasprzyk and Daniel Montano. 2007. Application of an integrated behavioral model to understand HIV prevention behavior of high-risk men in rural Zimbabwe. Predict. Change Health Behav. Appl. Reason. Action Approach (January 2007), 149–172.",
      "doi": ""
    },
    {
      "text": "Danuta Kasprzyk, Daniel E. Montaño, and Martin Fishbein. 1998. Application of an Integrated Behavioral Model to Predict Condom Use: A Prospective Study Among High HIV Risk Groups1. J. Appl. Soc. Psychol. 28, 17 (1998), 1557–1583. DOI:https://doi.org/10.1111/j.1559-1816.1998.tb01690.x",
      "doi": ""
    },
    {
      "text": "Pamela M. Kato, Steve W. Cole, Andrew S. Bradlyn, and Brad H. Pollock. 2008. A Video Game Improves Behavioral Outcomes in Adolescents and Young Adults With Cancer: A Randomized Trial. Pediatrics 122, 2 (August 2008), e305–e317. DOI:https://doi.org/10.1542/peds.2007-3134",
      "doi": ""
    },
    {
      "text": "Maria H. Kim, Alick C. Mazenga, Xiaoying Yu, Saeed Ahmed, Mary E. Paul, Peter N. Kazembe, and Elaine J. Abrams. 2017. High self-reported non-adherence to antiretroviral therapy amongst adolescents living with HIV in Malawi: barriers and associated factors. J. Int. AIDS Soc. 20, 1 (2017), 21437. DOI:https://doi.org/10.7448/IAS.20.1.21437",
      "doi": ""
    },
    {
      "text": "Sung-Hee Kim, Sarah M. Gerver, Sarah Fidler, and Helen Ward. 2014. Adherence to antiretroviral therapy in adolescents living with HIV: systematic review and meta-analysis. AIDS Lond. Engl. 28, 13 (August 2014), 1945–1956. DOI:https://doi.org/10.1097/QAD.0000000000000316",
      "doi": ""
    },
    {
      "text": "Emmanuel Kimera, Sofie Vindevogel, Didier Reynaert, Kintu Mugenyi Justice, John Rubaihayo, Jessica De Maeyer, Anne-Mie Engelen, Khamisi Musanje, and Johan Bilsen. 2020. Experiences and effects of HIV-related stigma among youth living with HIV/AIDS in Western Uganda: A photovoice study. PloS One 15, 4 (2020), e0232359. DOI:https://doi.org/10.1371/journal.pone.0232359",
      "doi": ""
    },
    {
      "text": "Katharina Kranzer, John Bradley, Joseph Musaazi, Mary Nyathi, Hilary Gunguwo, Wedu Ndebele, Mark Dixon, Mbongeni Ndhlovu, Andrea Rehman, Palwasha Khan, Florian Vogt, Tsitsi Apollo, and Rashida Abbas Ferrand. 2017. Loss to follow-up among children and adolescents growing up with HIV infection: age really matters. J. Int. AIDS Soc. 20, 1 (2017). DOI:https://doi.org/10.7448/IAS.20.1.21737",
      "doi": ""
    },
    {
      "text": "Neha Kumar, Azra Ismail, Samyukta Sherugar, and Rajesh Chandwani. 2019. Restoration Work: Responding to Everyday Challenges of HIV Outreach. Proc. ACM Hum.-Comput. Interact. 3, CSCW (November 2019), 54:1-54:26. DOI:https://doi.org/10.1145/3359156",
      "doi": "10.1145/3359156"
    },
    {
      "text": "Stephen B. Lee and Joanne Valerius. 2020. mHealth Interventions to Promote Anti-Retroviral Adherence in HIV: Narrative Review. JMIR MHealth UHealth 8, 8 (August 2020), e14739. DOI:https://doi.org/10.2196/14739",
      "doi": ""
    },
    {
      "text": "Sara LeGrand, Kathryn Elizabeth Muessig, Tobias McNulty, Karina Soni, Kelly Knudtson, Alex Lemann, Nkechinyere Nwoko, and Lisa B. Hightow-Weidman. 2016. Epic Allies: Development of a Gaming App to Improve Antiretroviral Therapy Adherence Among Young HIV-Positive Men Who Have Sex With Men. JMIR SERIOUS GAMES 4, 1 (June 2016), E6-U94. DOI:https://doi.org/10.2196/games.5687",
      "doi": ""
    },
    {
      "text": "A. Lesch, L. Swartz, A. Kagee, K. Moodley, Z. Kafaar, L. Myer, and M. Cotton. 2007. Paediatric HIV/AIDS disclosure: towards a developmental and process-oriented approach. AIDS Care 19, 6 (July 2007), 811–816. DOI:https://doi.org/10.1080/09540120601129301",
      "doi": ""
    },
    {
      "text": "Richard T. Lester, Paul Ritvo, Edward J. Mills, Antony Kariri, Sarah Karanja, Michael H. Chung, William Jack, James Habyarimana, Mohsen Sadatsafavi, Mehdi Najafzadeh, Carlo A. Marra, Benson Estambale, Elizabeth Ngugi, T. Blake Ball, Lehana Thabane, Lawrence J. Gelmon, Joshua Kimani, Marta Ackers, and Francis A. Plummer. 2010. Effects of a mobile phone short message service on antiretroviral treatment adherence in Kenya (WelTel Kenya1): a randomised trial. The Lancet 376, 9755 (November 2010), 1838–1845. DOI:https://doi.org/10.1016/S0140-6736(10)61997-6",
      "doi": ""
    },
    {
      "text": "S. Linnemayr, H. Huang, J. Luoto, A. Kambugu, H. Thirumurthy, J.E. Haberer, G. Wagner, and B. Mukasa. 2017. Text messaging for improving antiretroviral therapy adherence: No effects after 1 year in a randomized controlled trial among adolescents and young adults. Am. J. Public Health 107, 12 (2017), 1944–1950. DOI:https://doi.org/10.2105/AJPH.2017.304089",
      "doi": ""
    },
    {
      "text": "S. Linnemayr, H. Huang, J. Luoto, A. Kambugu, H. Thirumurthy, J.E. Haberer, G. Wagner, and B. Mukasa. 2017. Text messaging for improving antiretroviral therapy adherence: No effects after 1 year in a randomized controlled trial among adolescents and young adults. Am. J. Public Health 107, 12 (2017), 1944–1950. DOI:https://doi.org/10.2105/AJPH.2017.304089",
      "doi": ""
    },
    {
      "text": "Linda Little, Daniel Fitton, Beth T. Bell, and Nicola Toth (Eds.). 2016. Perspectives on HCI Research with Teenagers. Springer International Publishing. DOI:https://doi.org/10.1007/978-3-319-33450-9",
      "doi": ""
    },
    {
      "text": "Elizabeth Lowenthal, Mitchelle Matesva, Tafireyi Marukutira, One Bayani, Jennifer Chapman, Ontibile Tshume, Mogomotsi Matshaba, Meredith Hickson, and Robert Gross. 2021. Psychological Reactance is a Novel Risk Factor for Adolescent Antiretroviral Treatment Failure. AIDS Behav. 25, 5 (May 2021), 1474–1479. DOI:https://doi.org/10.1007/s10461-020-02986-z",
      "doi": ""
    },
    {
      "text": "Sarah MacCarthy, Uzaib Saya, Clare Samba, Josephine Birungi, Stephen Okoboi, and Sebastian Linnemayr. 2018. “How am I going to live?”: exploring barriers to ART adherence among adolescents and young adults living with HIV in Uganda. BMC Public Health 18, 1 (October 2018), 1158. DOI:https://doi.org/10.1186/s12889-018-6048-7",
      "doi": ""
    },
    {
      "text": "Sphiwe Madiba and Cynthia Diko. 2020. The Consequences of Delaying Telling Children with Perinatal HIV About Their Diagnosis as Perceived by Healthcare Workers in the Eastern Cape; A Qualitative Study. Child. Basel Switz. 7, 12 (December 2020), E289. DOI:https://doi.org/10.3390/children7120289",
      "doi": ""
    },
    {
      "text": "Sphiwe Madiba and Unaswi Josiah. 2019. Perceived Stigma and Fear of Unintended Disclosure are Barriers in Medication Adherence in Adolescents with Perinatal HIV in Botswana: A Qualitative Study. BioMed Res. Int. 2019, (2019), 9623159. DOI:https://doi.org/MacCarthy",
      "doi": ""
    },
    {
      "text": "Juan F. Maestre, Patrycja Zdziarska, Aehong Min, Anna N. Baglione, Chia-Fang Chung, and Patrick C. Shih. 2021. Not Another Medication Adherence App: Critical Reflections on Addressing Public HIV-related Stigma Through Design. Proc. ACM Hum.-Comput. Interact. 4, CSCW3 (January 2021), 262:1-262:28. DOI:https://doi.org/10.1145/3434171",
      "doi": "10.1145/3434171"
    },
    {
      "text": "P. Mandalazi, C. Bandawe, and E. Umar. 2014. HIV Disclosure: Parental dilemma in informing HIV infected Children about their HIV Status in Malawi. Malawi Med. J. J. Med. Assoc. Malawi 26, 4 (December 2014), 101–104.",
      "doi": ""
    },
    {
      "text": "Limin Mao, Andrew Buchanan, Horas Tze Hoo Wong, and Asha Persson. 2018. Beyond mere pill taking: SMS reminders for HIV treatment adherence delivered to mobile phones of clients in a community support network in Australia. Health Soc. Care Community 26, 4 (2018), 486–494. DOI:https://doi.org/10.1111/hsc.12544",
      "doi": ""
    },
    {
      "text": "Gabriela Marcu, Nadia Dowshen, Shuvadittya Saha, Ressa Reneth Sarreal, and Nazanin Andalibi. 2016. TreatYoSelf: empathy-driven behavioral intervention for marginalized youth living with HIV. In Proceedings of the 10th EAI International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth ’16), ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), Cancun, Mexico, 69–76.",
      "doi": "10.5555/3021319.3021330"
    },
    {
      "text": "Giulia Martelli, Rosa Antonucci, Alphonsina Mukurasi, Henry Zepherine, and Christiana Nöstlinger. 2019. Adherence to antiretroviral treatment among children and adolescents in Tanzania: Comparison between pill count and viral load outcomes in a rural context of Mwanza region. PLOS ONE 14, 3 (March 2019), e0214014. DOI:https://doi.org/10.1371/journal.pone.0214014",
      "doi": ""
    },
    {
      "text": "Liam Mason, Kathrin Gerling, Patrick Dickinson, and Antonella De Angeli. 2019. Design Goals for Playful Technology to Support Physical Activity Among Wheelchair Users. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), ACM, New York, NY, USA, 32:1-32:12. DOI:https://doi.org/10.1145/3290605.3300262",
      "doi": "10.1145/3290605.3300262"
    },
    {
      "text": "Megan S. McHenry, Edith Apondi, Carole I. McAteer, Winstone M. Nyandiko, Lydia J. Fischer, Ananda R. Ombitsa, Josephine Aluoch, Michael L. Scanlon, and Rachel C. Vreeman. 2018. Tablet-based disclosure counselling for HIV-infected children, adolescents, and their caregivers: a pilot study. Afr. J. AIDS Res. 17, 3 (September 2018), 249–258. DOI:https://doi.org/10.2989/16085906.2018.1509101",
      "doi": ""
    },
    {
      "text": "Grace McHugh, Victoria Simms, Chido Dziva Chikwari, Hilda Mujuru, Kusum Nathoo, Prosper Chonzi, Shungu Munyati, Ethel Dauya, Tsitsi Bandason, Joanna Busza, and Rashida A Ferrand. 2018. Familial silence surrounding HIV and non-disclosure of HIV status to older children and adolescents. AIDS Care 30, 7 (July 2018), 830–835. DOI:https://doi.org/10.1080/09540121.2018.1434118",
      "doi": ""
    },
    {
      "text": "Rebecca J. Meisenbach. 2010. Stigma Management Communication: A Theory and Agenda for Applied Research on How Individuals Manage Moments of Stigmatized Identity. J. Appl. Commun. Res. 38, 3 (August 2010), 268–292. DOI:https://doi.org/10.1080/00909882.2010.490841",
      "doi": ""
    },
    {
      "text": "Avani C. Modi, Ahna L. Pai, Kevin A. Hommel, Korey K. Hood, Sandra Cortina, Marisa E. Hilliard, Shanna M. Guilfoyle, Wendy N. Gray, and Dennis Drotar. 2012. Pediatric Self-management: A Framework for Research, Practice, and Policy. Pediatrics 129, 2 (February 2012), e473–e485. DOI:https://doi.org/10.1542/peds.2011-1635",
      "doi": ""
    },
    {
      "text": "Daniel E. Montaño and Danuta Kasprzyk. 2015. Theory of reasoned action, theory of planned behavior, and the integrated behavioral model. In Health behavior: Theory, research, and practice, 5th ed. Jossey-Bass, San Francisco, CA, US, 95–124.",
      "doi": ""
    },
    {
      "text": "Marta I. Mulawa, Sara LeGrand, and Lisa B. Hightow-Weidman. 2018. eHealth to Enhance Treatment Adherence Among Youth Living with HIV. Curr. HIV/AIDS Rep. 15, 4 (August 2018), 336–349. DOI:https://doi.org/10.1007/s11904-018-0407-y",
      "doi": ""
    },
    {
      "text": "Pamela M. Murnane, Stacy-Lee Sigamoney, Francoise Pinillos, Stephanie Shiau, Renate Strehlau, Faeezah Patel, Afaaf Liberty, Elaine J. Abrams, Stephen Arpadi, Ashraf Coovadia, Avy Violari, and Louise Kuhn. 2017. Extent of disclosure: what perinatally HIV-infected children have been told about their own HIV status. AIDS Care 29, 3 (March 2017), 378–386. DOI:https://doi.org/10.1080/09540121.2016.1224310",
      "doi": ""
    },
    {
      "text": "Meena Natarajan and Tapan Parikh. 2013. Understanding Barriers to Information Access and Disclosure for HIV+ Women. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers - Volume 1 (ICTD ’13), Association for Computing Machinery, New York, NY, USA, 143–152. DOI:https://doi.org/10.1145/2516604.2516627",
      "doi": "10.1145/2516604.2516627"
    },
    {
      "text": "S. Nimkar, C. Valvi, D. Kadam, B. B. Rewari, A. Kinikar, N. Gupte, N. Suryavanshi, A. Deluca, A. Shankar, J. Golub, R. Bollinger, A. Gupta, I. Marbaniang, and V. Mave. 2018. Loss to follow-up and mortality among HIV-infected adolescents receiving antiretroviral therapy in Pune, India. HIV Med. 19, 6 (July 2018), 395–402. DOI:https://doi.org/10.1111/hiv.12605",
      "doi": ""
    },
    {
      "text": "Erick Oduor, Carolyn Pang, Charles Wachira, Rachel K. E. Bellamy, Timothy Nyota, Sekou L. Remy, Aisha Walcott-Bryant, Wycliffe Omwanda, and Julius Mbeya. 2019. Exploring Rural Community Practices in HIV Management for the Design of Technology for Hypertensive Patients Living with HIV. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS ’19), ACM, New York, NY, USA, 1595–1606. DOI:https://doi.org/10.1145/3322276.3322348",
      "doi": "10.1145/3322276.3322348"
    },
    {
      "text": "Catherine Orrell, Karen Cohen, Katya Mauff, David R. Bangsberg, Gary Maartens, and Robin Wood. 2015. A Randomized Controlled Trial of Real-Time Electronic Adherence Monitoring With Text Message Dosing Reminders in People Starting First-Line Antiretroviral Therapy. JAIDS J. Acquir. Immune Defic. Syndr. 70, 5 (December 2015), 495–502. DOI:https://doi.org/10.1097/QAI.0000000000000770",
      "doi": ""
    },
    {
      "text": "Chrysanthi Papoutsi and Ian Brown. 2015. Privacy as Articulation Work in HIV Health Services. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW ’15), Association for Computing Machinery, New York, NY, USA, 339–348. DOI:https://doi.org/10.1145/2675133.2675204",
      "doi": "10.1145/2675133.2675204"
    },
    {
      "text": "George C Patton, Susan M Sawyer, John S Santelli, David A Ross, Rima Afifi, Nicholas B Allen, Monika Arora, Peter Azzopardi, Wendy Baldwin, Christopher Bonell, Ritsuko Kakuma, Elissa Kennedy, Jaqueline Mahon, Terry McGovern, Ali H Mokdad, Vikram Patel, Suzanne Petroni, Nicola Reavley, Kikelomo Taiwo, Jane Waldfogel, Dakshitha Wickremarathne, Carmen Barroso, Zulfiqar Bhutta, Adesegun O Fatusi, Amitabh Mattoo, Judith Diers, Jing Fang, Jane Ferguson, Frederick Ssewamala, and Russell M Viner. 2016. Our future: a Lancet commission on adolescent health and wellbeing. The Lancet 387, 10036 (June 2016), 2423–2478. DOI:https://doi.org/10.1016/S0140-6736(16)00579-1",
      "doi": ""
    },
    {
      "text": "Michael J. A. Reid, Andrew P. Steenhoff, James Thompson, Lesego Gabaitiri, Mark S. Cary, Katherine Steele, Susan Mayisela, Diana Dickinson, Peter Ehrenkranz, Harvey M. Friedman, and Darren R. Linkin. 2017. Evaluation of the effect of cellular SMS reminders on consistency of antiretroviral therapy pharmacy pickups in HIV-infected adults in Botswana: a randomized controlled trial. Health Psychol. Behav. Med. 5, 1 (January 2017), 101–109. DOI:https://doi.org/10.1080/21642850.2016.1271333",
      "doi": ""
    },
    {
      "text": "Whitney S. Rice, Kaylee B. Crockett, Michael J. Mugavero, James L. Raper, Ghislaine C. Atkins, and Bulent Turan. 2017. Association Between Internalized HIV-Related Stigma and HIV Care Visit Adherence. JAIDS J. Acquir. Immune Defic. Syndr. 76, 5 (December 2017), 482–487. DOI:https://doi.org/10.1097/QAI.0000000000001543",
      "doi": ""
    },
    {
      "text": "Rob van Roy, Sebastian Deterding, and Bieke Zaman. 2019. Collecting Pokémon or receiving rewards? How people functionalise badges in gamified online learning environments in the wild. Int. J. Hum.-Comput. Stud. 127, (July 2019), 62–80. DOI:https://doi.org/10.1016/j.ijhcs.2018.09.003",
      "doi": "10.1016/j.ijhcs.2018.09.003"
    },
    {
      "text": "Ye Ruan, Xueling Xiao, Jia Chen, Xianhong Li, Ann Bartley Williams, and Honghong Wang. 2017. Acceptability and efficacy of interactive short message service intervention in improving HIV medication adherence in Chinese antiretroviral treatment-naïve individuals. Patient Prefer. Adherence 11, (2017), 221–228. DOI:https://doi.org/10.2147/PPA.S120003",
      "doi": ""
    },
    {
      "text": "Rebecca Schnall, Hwayoung Cho, Alexander Mangone, Adrienne Pichon, and Haomiao Jia. 2018. Mobile Health Technology for Improving Symptom Management in Low Income Persons Living with HIV. AIDS Behav. 22, 10 (October 2018), 3373–3383. DOI:https://doi.org/10.1007/s10461-017-2014-0",
      "doi": ""
    },
    {
      "text": "Aneesha Singh, Jo Gibbs, and Ann Blandford. 2019. Emotion and Experience in Negotiating HIV-Related Digital Resources: “It's Not Just a Runny Nose!” In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/3290605.3300829",
      "doi": "10.1145/3290605.3300829"
    },
    {
      "text": "Aneesha Singh, Jo Gibbs, Claudia Estcourt, Pam Sonnenberg, and Ann Blandford. 2017. Are HIV Smartphone Apps and Online Interventions Fit for Purpose? In Proceedings of the 2017 International Conference on Digital Health (DH ’17), Association for Computing Machinery, New York, NY, USA, 6–15. DOI:https://doi.org/10.1145/3079452.3079469",
      "doi": "10.1145/3079452.3079469"
    },
    {
      "text": "Amy L. Slogrove, Mary Mahy, Alice Armstrong, and Mary-Ann Davies. 2017. Living and dying to be counted: What we know about the epidemiology of the global adolescent HIV epidemic. J. Int. AIDS Soc. 20, S3 (2017), 21520. DOI:https://doi.org/10.7448/IAS.20.4.21520",
      "doi": ""
    },
    {
      "text": "Amy L. Slogrove, Michael Schomaker, Mary-Ann Davies, Paige Williams, Suna Balkan, Jihane Ben-Farhat, Nancy Calles, Kulkanya Chokephaibulkit, Charlotte Duff, Tanoh François Eboua, Adeodata Kekitiinwa-Rukyalekere, Nicola Maxwell, Jorge Pinto, George Seage, Chloe A. Teasdale, Sebastian Wanless, Josiane Warszawski, Kara Wools-Kaloustian, Marcel Yotebieng, Venessa Timmerman, Intira J. Collins, Ruth Goodall, Colette Smith, Kunjal Patel, Mary Paul, Diana Gibb, Rachel Vreeman, Elaine J. Abrams, Rohan Hazra, Russell Van Dyke, Linda-Gail Bekker, Lynne Mofenson, Marissa Vicari, Shaffiq Essajee, Martina Penazzato, Gabriel Anabwani, Edith Q Mohapi, Peter N Kazembe, Makhosazana Hlatshwayo, Mwita Lumumba, Tessa Goetghebuer, Claire Thorne, Luisa Galli, Annemarie van Rossum, Carlo Giaquinto, Magdalena Marczynska, Laura Marques, Filipa Prata, Luminita Ene, Liubov Okhonskaia, Pablo Rojo, Claudia Fortuny, Lars Naver, Christoph Rudin, Sophie Le Coeur, Alla Volokha, Vanessa Rouzier, Regina Succi, Annette Sohn, Azar Kariminia, Andrew Edmonds, Patricia Lelo, Samuel Ayaya, Patricia Ongwen, Laura F. Jefferys, Sam Phiri, Mwangelwa Mubiana-Mbewe, Shobna Sawry, Lorna Renner, Mariam Sylla, Mark J. Abzug, Myron Levin, James Oleske, Miriam Chernoff, Shirley Traite, Murli Purswani, Ellen G. Chadwick, Ali Judd, and Valériane Leroy. 2018. The epidemiology of adolescents living with perinatally acquired HIV: A cross-region global cohort analysis. PLoS Med. 15, 3 (March 2018), e1002514. DOI:https://doi.org/10.1371/journal.pmed.1002514",
      "doi": ""
    },
    {
      "text": "Judith G. Smetana, Nicole Campione-Barr, and Aaron Metzger. 2006. Adolescent Development in Interpersonal and Societal Contexts. Annu. Rev. Psychol. 57, 1 (2006), 255–284. DOI:https://doi.org/10.1146/annurev.psych.57.102904.190124",
      "doi": ""
    },
    {
      "text": "Piya Sorcar, Benjamin Strauber, Prashant Loyalka, Neha Kumar, and Shelley Goldman. 2017. Sidestepping the Elephant in the Classroom: Using Culturally Localized Technology To Teach Around Taboos. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), Association for Computing Machinery, New York, NY, USA, 2792–2804. DOI:https://doi.org/10.1145/3025453.3025958",
      "doi": "10.1145/3025453.3025958"
    },
    {
      "text": "E. S. Spratt, C. E. Papa, M. Mueller, S. Patel, T. Killeen, E. Maher, C. Drayton, T. C. Dixon, S. L. Fowler, and F. Treiber. 2017. Using Technology to Improve Adherence to HIV Medications in Transitional Age Youth: Research Reviewed, Methods Tried, Lessons Learned. J. Gen. Med. Dover Del 1, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Kurt Squire. 2003. Video Games and Education: Designing learning systems for an interactive age. Int J Intell Games Simul. 2, (January 2003).",
      "doi": ""
    },
    {
      "text": "L. Steinberg and A. S. Morris. 2001. Adolescent development. Annu. Rev. Psychol. 52, (2001), 83–110. DOI:https://doi.org/10.1146/annurev.psych.52.1.83",
      "doi": ""
    },
    {
      "text": "Laurence Steinberg. 2004. Risk taking in adolescence: what changes, and why? Ann. N. Y. Acad. Sci. 1021, (June 2004), 51–58. DOI:https://doi.org/10.1196/annals.1308.005",
      "doi": ""
    },
    {
      "text": "Laurence Steinberg. 2005. Cognitive and affective development in adolescence. Trends Cogn. Sci. 9, 2 (February 2005), 69–74. DOI:https://doi.org/10.1016/j.tics.2004.12.005",
      "doi": ""
    },
    {
      "text": "Mary M. Step, Kristina Knight, Jennifer McMillen Smith, Steven A. Lewis, Theodore J. Russell, and Ann K. Avery. 2020. Positive Peers Mobile Application Reduces Stigma Perception Among Young People Living With HIV. Health Promot. Pract. 21, 5 (September 2020), 744–754. DOI:https://doi.org/10.1177/1524839920936244",
      "doi": ""
    },
    {
      "text": "Elysée Manziasi Sumbi, Emilie Venables, Rebecca Harrison, Mariana Garcia, Kleio Iakovidi, Gilles van Cutsem, and Jean Lambert Chalachala. 2021. “It's a secret between us”: a qualitative study on children and care-giver experiences of HIV disclosure in Kinshasa, Democratic Republic of Congo. BMC Public Health 21, 1 (February 2021), 313. DOI:https://doi.org/10.1186/s12889-021-10327-5",
      "doi": ""
    },
    {
      "text": "Shannon M. Sweeney and Peter A. Vanable. 2016. The Association of HIV-Related Stigma to HIV Medication Adherence: A Systematic Review and Synthesis of the Literature. AIDS Behav. 20, 1 (January 2016), 29–50. DOI:https://doi.org/10.1007/s10461-015-1164-1",
      "doi": ""
    },
    {
      "text": "Danielle Taddeo, Maud Egedy, and Jean-Yves Frappier. 2008. Adherence to treatment in adolescents. Paediatr. Child Health 13, 1 (January 2008), 19–24.",
      "doi": ""
    },
    {
      "text": "Kymeng Tang, Kathrin Gerling, Luc Geurts, and Katta Spiel. 2021. Understanding the Role of Technology to Support Breastfeeding. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), Association for Computing Machinery, New York, NY, USA, 1–13. DOI:https://doi.org/10.1145/3411764.3445247",
      "doi": "10.1145/3411764.3445247"
    },
    {
      "text": "Piet Tutenel, S. Fuentes Ramaekers, and Ann Heylighen. 2019. Conversations between procedural and situated ethics: Learning from video research with children in a cancer care ward. DOI:https://doi.org/10.1080/14606925.2019.1595444",
      "doi": ""
    },
    {
      "text": "Elo Umeh. 2019. Three reasons why African mobile connectivity is misleading. The Africa Report.com. Retrieved September 9, 2021 from https://www.theafricareport.com/14567/three-reasons-why-african-mobile-connectivity-is-misleading/",
      "doi": ""
    },
    {
      "text": "Tiffany C. Veinot. “We have a lot of information to share with each other”. Understanding the value of peer-based health information exchange. Retrieved September 9, 2021 from http://informationr.net/ir/15-4/paper452.html",
      "doi": ""
    },
    {
      "text": "Willem Daniel Francois Venter, Alex Fischer, Samanta Tresha Lalla-Edward, Jesse Coleman, Vincent Lau Chan, Zara Shubber, Mothepane Phatsoane, Marelize Gorgens, Lynsey Stewart-Isherwood, Sergio Carmona, and Nicole Fraser-Hurt. 2019. Improving Linkage to and Retention in Care in Newly Diagnosed HIV-Positive Patients Using Smartphones in South Africa: Randomized Controlled Trial. JMIR MHealth UHealth 7, 4 (April 2019), e12652. DOI:https://doi.org/10.2196/12652",
      "doi": ""
    },
    {
      "text": "Nandita Vijayakumar, Zdena Op de Macks, Elizabeth A. Shirtcliff, and Jennifer H. Pfeifer. 2018. Puberty and the human brain: Insights into adolescent development. Neurosci. Biobehav. Rev. 92, (September 2018), 417–436. DOI:https://doi.org/10.1016/j.neubiorev.2018.06.004",
      "doi": ""
    },
    {
      "text": "Mark Warner, Andreas Gutmann, M. Angela Sasse, and Ann Blandford. 2018. Privacy Unraveling Around Explicit HIV Status Disclosure Fields in the Online Geosocial Hookup App Grindr. Proc ACM Hum-Comput Interact 2, CSCW (November 2018). DOI:https://doi.org/10.1145/3274450",
      "doi": "10.1145/3274450"
    },
    {
      "text": "Mark Warner, Agnieszka Kitkowska, Jo Gibbs, Juan F. Maestre, and Ann Blandford. 2020. Evaluating “Prefer not to say” Around Sensitive Disclosures. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, ACM, Honolulu HI USA, 1–13. DOI:https://doi.org/10.1145/3313831.3376150",
      "doi": "10.1145/3313831.3376150"
    },
    {
      "text": "Mark Warner, Juan F. Maestre, Jo Gibbs, Chia-Fang Chung, and Ann Blandford. 2019. Signal Appropriation of Explicit HIV Status Disclosure Fields in Sex-Social Apps Used by Gay and Bisexual Men. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/3290605.3300922",
      "doi": "10.1145/3290605.3300922"
    },
    {
      "text": "Daniel Welsh, Kellie Morrissey, Sarah Foley, Roisin McNaney, Christos Salis, John McCarthy, and John Vines. 2018. Ticket to Talk: Supporting Conversation between Young People and People with Dementia through Digital Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–14. DOI:https://doi.org/10.1145/3173574.3173949",
      "doi": "10.1145/3173574.3173949"
    },
    {
      "text": "L. Whiteley, L. Brown, M. Lally, N. Heck, and J.J. van den Berg. 2018. A mobile gaming intervention to increase adherence to antiretroviral treatment for youth living with hiv: Development guided by the information, motivation, and behavioral skills model. JMIR MHealth UHealth 6, 4 (2018). DOI:https://doi.org/10.2196/mhealth.8155",
      "doi": ""
    },
    {
      "text": "Laura Whiteley, Larry K. Brown, Leandro Mena, Lacey Craker, and Trisha Arnold. 2018. Enhancing health among youth living with HIV using an iPhone game. AIDS Care 30, sup4 (July 2018), 21–33. DOI:https://doi.org/10.1080/09540121.2018.1503224",
      "doi": ""
    },
    {
      "text": "Kate Winskell, Kim S. Miller, Kristi Ann Allen, and Christopher O. Obong'o. 2016. Guiding and supporting adolescents living with HIV in sub-Saharan Africa: The development of a curriculum for family and community members. Child. Youth Serv. Rev. 61, (February 2016), 253–260.",
      "doi": ""
    },
    {
      "text": "Bieke Zaman and Vero Vanden Abeele. 2010. Laddering with young children in User eXperience evaluations: theoretical groundings and a practical case. In Proceedings of the 9th International Conference on Interaction Design and Children (IDC ’10), Association for Computing Machinery, New York, NY, USA, 156–165. DOI:https://doi.org/10.1145/1810543.1810561",
      "doi": "10.1145/1810543.1810561"
    },
    {
      "text": "2015. HIV and AIDS in East and Southern Africa regional overview. AVERT. Retrieved March 21, 2019 from https://www.avert.org/professionals/hiv-around-world/sub-saharan-africa/overview",
      "doi": ""
    },
    {
      "text": "HIV and AIDS in Adolescents. UNICEF DATA. Retrieved August 30, 2021 from https://data.unicef.org/topic/adolescents/hiv-aids/",
      "doi": ""
    },
    {
      "text": "Wisepill Technologies. Wisepill Technologies. Retrieved September 1, 2021 from https://www.wisepill.com",
      "doi": ""
    },
    {
      "text": "Thematic analysis. - PsycNET. Retrieved September 2, 2021 from https://content.apa.org/record/2011-23864-004",
      "doi": ""
    },
    {
      "text": "Ending the AIDS epidemic for adolescents, with adolescents. 32.",
      "doi": ""
    },
    {
      "text": "AdhereTech. Retrieved September 1, 2021 from https://adheretech.com/",
      "doi": ""
    },
    {
      "text": "Battle in the Blood (#BitB). ETCH. Retrieved September 7, 2021 from https://etch.lstmed.ac.uk/games/battle-in-the-blood-bitb",
      "doi": ""
    }
  ]
}