{
  "doi": "10.1145/3491102.3517644",
  "title": "Forgetting Practices in the Data Sciences",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2022,
  "badges": [],
  "abstract": "HCI engages with data science through many topics and themes. Researchers have addressed biased dataset problems, arguing that bad data can cause innocent software to produce bad outcomes. But what if our software is not so innocent? What if the human decisions that shape our data-processing software, inadvertently contribute their own sources of bias? And what if our data-work technology causes us to forget those decisions and operations? Based in feminisms and critical computing, we analyze forgetting practices in data work practices. We describe diverse beneficial and harmful motivations for forgetting. We contribute: (1) a taxonomy of data silences in data work, which we use to analyze how data workers forget, erase, and unknow aspects of data; (2) a detailed analysis of forgetting practices in machine learning; and (3) an analytic vocabulary for future work in remembering, forgetting, and erasing in HCI and the data sciences.",
  "authors": [
    {
      "name": "Michael Muller",
      "institution": "Human Centered AI, IBM Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332517372",
      "orcid": "0000-0001-7860-163X"
    },
    {
      "name": "Angelika Strohmayer",
      "institution": "Northumbria University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658702171",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "James Abourezk. 1978. Indian Child Welfare Act. 25 U.S.C. §§ 1901–1963, November 8 1978.",
      "doi": ""
    },
    {
      "text": "Mark S Ackerman and Christine Halverson. 2004. Organizational memory as objects, processes, and trajectories: An examination of organizational memory in use. Computer Supported Cooperative Work (CSCW) 13, 2 (2004), 155–189.",
      "doi": ""
    },
    {
      "text": "Mark S Ackerman and Eric Mandel. 1999. Memory in the small: Combining collective memory and task support for a scientific community. Journal of Organizational Computing and Electronic Commerce 9, 2-3(1999), 105–127.",
      "doi": ""
    },
    {
      "text": "Mark S Ackerman and David W McDonald. 1996. Answer Garden 2: merging organizational memory with collaborative help. In Proceedings of the 1996 ACM conference on Computer supported cooperative work. 97–105.",
      "doi": "10.1145/240080.240203"
    },
    {
      "text": "Shazia Afzal, Manish Kesarwani, Sameep Mehta, Hima Patel, 2020. Data Readiness Report. arXiv preprint arXiv:2010.07213(2020).",
      "doi": ""
    },
    {
      "text": "Michel Anteby and Virag Molnar. 2012. Collective memory meets organizational identity: Remembering to forget in a firm’s rhetorical history. Academy of Management Journal 55, 3 (2012), 515–540.",
      "doi": ""
    },
    {
      "text": "Cecilia Aragon, Shion Guha, Marina Kogan, Michael Muller, and Gina Neff. 2022. Human centered data science: An introduction. MIT Press.",
      "doi": ""
    },
    {
      "text": "Otmane Azeroual. 2020. Data wrangling in database systems: purging of dirty data. Data 5, 2 (2020), 50.",
      "doi": ""
    },
    {
      "text": "B Mathura Bai, Nimmala Mangathayaru, and B Padmaja Rani. 2015. An approach to find missing values in medical datasets. In Proceedings of the The International Conference on Engineering & MIS 2015. 1–7.",
      "doi": "10.1145/2832987.2833083"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI conference on human factors in computing systems. 1301–1310.",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Solon Barocas, Moritz Hardt, and Arvind Narayanan. 2017. Fairness in machine learning. Nips tutorial 1(2017), 2017.",
      "doi": ""
    },
    {
      "text": "Amin Beheshti, Boualem Benatallah, Alireza Tabebordbar, Hamid Reza Motahari-Nezhad, Moshe Chai Barukh, and Reza Nouri. 2019. Datasynapse: A social data curation foundry. Distributed and Parallel Databases 37, 3 (2019), 351–384.",
      "doi": "10.1007/s10619-018-7245-1"
    },
    {
      "text": "Rachel KE Bellamy, Kuntal Dey, Michael Hind, Samuel C Hoffman, Stephanie Houde, Kalapriya Kannan, Pranay Lohia, Jacquelyn Martino, Sameep Mehta, Aleksandra Mojsilovic, 2018. AI Fairness 360: An extensible toolkit for detecting, understanding, and mitigating unwanted algorithmic bias. arXiv preprint arXiv:1810.01943(2018).",
      "doi": ""
    },
    {
      "text": "Rosanna Bellini, Angelika Strohmayer, Patrick Olivier, and Clara Crivellaro. 2019. Mapping the margins: Navigating the ecologies of domestic violence service provision. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300352"
    },
    {
      "text": "Emily M Bender, Timnit Gebru, Angelina McMillan-Major, and Shmargaret Shmitchell. 2021. On the Dangers of Stochastic Parrots: Can Language Models Be Too Big?. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency. 610–623.",
      "doi": "10.1145/3442188.3445922"
    },
    {
      "text": "Hélène Bilis. 20188. ”Mapping fiction: Social networks and the novel”, Wellesley College conference Shifting (the) Boundaries.",
      "doi": ""
    },
    {
      "text": "Anthony Blinken. 2021. Proposing Changes to the Department’s Policies on Gender on U.S. Passports and Consular Reports of Birth Abroad. https://www.state.gov/proposing-changes-to-the-departments-policies-on-gender-on-u-s-passports-and-consular-reports-of-birth-abroad/ Accessed Sep 4, 2021.",
      "doi": ""
    },
    {
      "text": "Shahin Boluki, Siamak Zamani Dadaneh, Xiaoning Qian, and Edward R Dougherty. 2018. Optimal Clustering with Missing Values. In Proceedings of the 2018 ACM International Conference on Bioinformatics, Computational Biology, and Health Informatics. 593–594.",
      "doi": "10.1145/3233547.3233687"
    },
    {
      "text": "Christine L Borgman. 2020. Big Data, Little Data, or No Data? Why Human Interaction with Data is a Hard Problem. In Proceedings of the 2020 Conference on Human Information Interaction and Retrieval. 1–1.",
      "doi": "10.1145/3343413.3377979"
    },
    {
      "text": "Geoff Bowker. 2005. Memory Practices in the Sciences. MIT.",
      "doi": ""
    },
    {
      "text": "Geoffrey C Bowker, C Geoffrey, W Bernard Carlson, 1994. Science on the run: Information management and industrial geophysics at Schlumberger, 1920-1940. MIT press.",
      "doi": ""
    },
    {
      "text": "Geoffrey C Bowker and Susan Leigh Star. 2000. Sorting things out: Classification and its consequences. MIT press.",
      "doi": "10.5555/380681"
    },
    {
      "text": "Danah Boyd and Kate Crawford. 2012. Critical questions for big data: Provocations for a cultural, technological, and scholarly phenomenon. Information, communication & society 15, 5 (2012), 662–679.",
      "doi": ""
    },
    {
      "text": "Michael Brenner, Jeannie Suk Gersen, Michael Haley, Matthew Lin, Amil Merchant, Richard Jagdishwar Millett, Suproteem K Sarkar, and Drew Wegner. 2020. Constitutional Dimensions of Predictive Algorithms in Criminal Justice. Harv. CR-CLL Rev. 55(2020), 267.",
      "doi": ""
    },
    {
      "text": "Brianna Brunson. 2020. “Jes Go Back to de Fiel a Singin”: The Spiritual as a Vehicle of Resistance in the Antebellum South. Global Africana (2020), 3.",
      "doi": ""
    },
    {
      "text": "Peter Buneman, Sanjeev Khanna, and Tan Wang-Chiew. 2001. Why and where: A characterization of data provenance. In International conference on database theory. Springer, 316–330.",
      "doi": ""
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender shades: Intersectional accuracy disparities in commercial gender classification. In Conference on fairness, accountability and transparency. PMLR, 77–91.",
      "doi": ""
    },
    {
      "text": "Julie Cassidy. 2009. The Canadian response to Aboriginal residential schools: Lessons for Australia and the United States. eLaw J. 16(2009), 38.",
      "doi": ""
    },
    {
      "text": "Aleksandar Chakarov, Aditya Nori, Sriram Rajamani, Shayak Sen, and Deepak Vijaykeerthy. 2016. Debugging machine learning tasks. arXiv preprint arXiv:1603.07292(2016).",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Eric PS Baumer, and Munmun De Choudhury. 2019. Who is the” human” in human-centered machine learning: The case of predicting mental health from social media. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–32.",
      "doi": "10.1145/3359249"
    },
    {
      "text": "Lu Cheng, Kush R Varshney, and Huan Liu. 2021. Socially responsible ai algorithms: Issues, purposes, and challenges. arXiv preprint arXiv:2101.02032(2021).",
      "doi": ""
    },
    {
      "text": "Jean-Marie Chenou and Roxana Radu. 2019. The “right to be forgotten”: Negotiating public and private ordering in the European Union. Business & Society 58, 1 (2019), 74–102.",
      "doi": ""
    },
    {
      "text": "D Christozov, K Rasheva-Yordanova, and S Toleva-Stoimenova. 2019. Designing data science curriculum in a way to address expected students entry competences. In Proceedings of INTED2019 Conference. 2635–2640.",
      "doi": ""
    },
    {
      "text": "Maine Wabanaki-State Child Welfare Truth & Reconciliation Commission. 2015. Beyond the Mandate: Continuing the Conversation: Report of the Maine Wabanaki-State Child Welfare Truth & Reconciliation Commission. https://d3n8a8pro7vhmx.cloudfront.net/mainewabanakireach/pages/17/attachments/original/1468974047/TRC-Report-Expanded_July2015.pdf?1468974047 Accessed Aug 26, 2021.",
      "doi": ""
    },
    {
      "text": "Paul Connerton. 2008. Seven types of forgetting. Memory studies 1, 1 (2008), 59–71.",
      "doi": ""
    },
    {
      "text": "Sasha Costanza-Chock. 2020. Design justice: Community-led practices to build the worlds we need. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Luca De Alfaro, Ashutosh Kulshreshtha, Ian Pye, and B Thomas Adler. 2011. Reputation systems for open collaboration. Commun. ACM 54, 8 (2011), 81–87.",
      "doi": "10.1145/1978542.1978560"
    },
    {
      "text": "Michel de Certeau. 1984. The Practice of Everyday Life. University of California Press.",
      "doi": ""
    },
    {
      "text": "Pablo Martin de Holan. 2004. Managing Organizational Forgetting. MIT Sloan management review 45, 2 (2004), 45–51.",
      "doi": ""
    },
    {
      "text": "Andrea De Lucia and Evi Xhelo. 2019. Data Science Pipeline Containerization. 17th SC@ RUG 2020(2019), 39.",
      "doi": ""
    },
    {
      "text": "Cleidson RB de Souza, Fernando Figueira Filho, Müller Miranda, Renato Pina Ferreira, Christoph Treude, and Leif Singer. 2016. The social side of software platform ecosystems. In Proceedings of the 2016 CHI conference on human factors in computing systems. 3204–3214.",
      "doi": "10.1145/2858036.2858431"
    },
    {
      "text": "Cleidson RB de Souza, David Redmiles, Li-Te Cheng, David Millen, and John Patterson. 2004. How a good software practice thwarts collaboration: the multiple roles of APIs in software development. In Proceedings of the 12th ACM SIGSOFT twelfth international symposium on Foundations of software engineering. 221–230.",
      "doi": "10.1145/1029894.1029925"
    },
    {
      "text": "Cleidson RB de Souza, David Redmiles, Li-Te Cheng, David Millen, and John Patterson. 2004. Sometimes you need to see through walls: a field study of application programming interfaces. In Proceedings of the 2004 ACM conference on Computer supported cooperative work. 63–71.",
      "doi": "10.1145/1031607.1031620"
    },
    {
      "text": "Sebastian Deterding, Jonathan Hook, Rebecca Fiebrink, Marco Gillies, Jeremy Gow, Memo Akten, Gillian Smith, Antonios Liapis, and Kate Compton. 2017. Mixed-initiative creative interfaces. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 628–635.",
      "doi": "10.1145/3027063.3027072"
    },
    {
      "text": "José Dias, Jácome Cunha, and Rui Pereira. 2020. Data curation: towards a tool for all. In International Conference on Human-Computer Interaction. Springer, 176–183.",
      "doi": ""
    },
    {
      "text": "Florian Diekmann. 2012. Data practices of agricultural scientists: Results from an exploratory study. Journal of Agricultural & Food Information 13, 1 (2012), 14–34.",
      "doi": ""
    },
    {
      "text": "Catherine D’Ignazio. 2021. Making data work for social justice. Presentation at NotEqual Social Justice Summer School.",
      "doi": ""
    },
    {
      "text": "Catherine D’ignazio and Lauren F Klein. 2020. Data feminism. MIT press.",
      "doi": ""
    },
    {
      "text": "Shalini D’Ignazio. 2020. Making Data Work for Social Justice, Social Justice Summer School, UKRI.",
      "doi": ""
    },
    {
      "text": "E. Dijkstra. 1979. Go to statement considered harmful. In Classics in software engineering (incoll). Yourdon Press, Upper Saddle River, NJ, USA, 27–33. http://portal.acm.org/citation.cfm?id=1241515.1241518",
      "doi": ""
    },
    {
      "text": "Edsger W Dijkstra. 1982. On the role of scientific thought. In Selected writings on computing: a personal perspective. Springer, 60–66.",
      "doi": ""
    },
    {
      "text": "AnHai Doan. 2018. Human-in-the-loop data analysis: a personal perspective. In Proceedings of the Workshop on Human-In-the-Loop Data Analytics. 1–6.",
      "doi": "10.1145/3209900.3209913"
    },
    {
      "text": "Mary Douglas. 1986. How institutions think. Syracuse University Press.",
      "doi": ""
    },
    {
      "text": "Qwo-Li Driskill. 2010. Doubleweaving two-spirit critiques: Building alliances between native and queer studies. GLQ: A Journal of Lesbian and Gay Studies 16, 1-2 (2010), 69–92.",
      "doi": ""
    },
    {
      "text": "MARISA ELENA DUARTE and MORGAN VIGIL-HAYES. 2021. How We Connect. Indigenous Peoples Rise Up: The Global Ascendency of Social Media Activism (2021), 64.",
      "doi": ""
    },
    {
      "text": "Marisa Elena Duarte, Morgan Vigil-Hayes, Sandra Littletree, and Miranda Belarde-Lewis. 2019. Of Course, Data Can Never Fully Represent Reality”: Assessing the Relationship between “Indigenous Data” and “Indigenous Knowledge,”“Traditional Ecological Knowledge,” and “Traditional Knowledge. Human biology 91, 3 (2019), 163–178.",
      "doi": ""
    },
    {
      "text": "Richard Dybowski. 2020. Interpretable machine learning as a tool for scientific discovery in chemistry. New Journal of Chemistry 44, 48 (2020), 20914–20920.",
      "doi": ""
    },
    {
      "text": "Mark Easterby-Smith and Marjorie A Lyles. 2011. In praise of organizational forgetting. Journal of Management Inquiry 20, 3 (2011), 311–316.",
      "doi": ""
    },
    {
      "text": "Upol Ehsan, Philipp Wintersberger, Q Vera Liao, Martina Mara, Marc Streit, Sandra Wachter, Andreas Riener, and Mark O Riedl. 2021. Operationalizing Human-Centered Perspectives in Explainable AI. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": ""
    },
    {
      "text": "Fatima El-Tayeb. 2020. The Universal Museum: How the New Germany Built its Future on Colonial Amnesia. Nka: Journal of Contemporary African Art 2020, 46 (2020), 72–82.",
      "doi": ""
    },
    {
      "text": "Yrjö Engeström, Katherine Brown, Ritva Engeström, and Kirsi Koistinen. 1990. Organizational forgetting: An activity-theoretical perspective.(1990).",
      "doi": ""
    },
    {
      "text": "Thomas Erickson and Wendy A Kellogg. 2000. Social translucence: an approach to designing systems that support social processes. ACM transactions on computer-human interaction (TOCHI) 7, 1(2000), 59–83.",
      "doi": ""
    },
    {
      "text": "Melanie Feinberg. 2017. A design perspective on data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 2952–2963.",
      "doi": "10.1145/3025453.3025837"
    },
    {
      "text": "Melanie Feinberg. 2017. Material Vision. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 604–617.",
      "doi": ""
    },
    {
      "text": "Melanie Feinberg, Daniel Carter, and Julia Bullard. 2014. A story without end: writing the residual into descriptive infrastructure. In Proceedings of the 2014 conference on Designing interactive systems. 385–394.",
      "doi": "10.1145/2598510.2598553"
    },
    {
      "text": "Carolyn Forché 1993. Against forgetting: Twentieth-century poetry of witness. WW Norton New York.",
      "doi": ""
    },
    {
      "text": "Karën Fort. 2016. Collaborative Annotation for Reliable Natural Language Processing: Technical and Sociological Aspects. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Suzanne Fournier and Ernie Crey. 1997. Stolen From Our Embrace: The Abduction of First Nations Children and the Restoration of Aboriginal Communities.ERIC.",
      "doi": ""
    },
    {
      "text": "Miranda Fricker. 2007. Epistemic injustice: Power and the ethics of knowing. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Batya Friedman and David G Hendry. 2019. Value sensitive design: Shaping technology with moral imagination. Mit Press.",
      "doi": ""
    },
    {
      "text": "Mikhaila Friske, Jordan Wirfs-Brock, and Laura Devendorf. 2020. Entangling the Roles of Maker and Interpreter in Interpersonal Data Narratives: Explorations in Yarn and Sound. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 297–310.",
      "doi": "10.1145/3357236.3395442"
    },
    {
      "text": "Rolando Garcia, Vikram Sreekanti, Neeraja Yadwadkar, Daniel Crankshaw, Joseph E Gonzalez, and Joseph M Hellerstein. 2018. Context: The missing piece in the machine learning lifecycle. In KDD CMI Workshop, Vol. 114.",
      "doi": ""
    },
    {
      "text": "R Stuart Geiger, Kevin Yu, Yanlai Yang, Mindy Dai, Jie Qiu, Rebekah Tang, and Jenny Huang. 2020. Garbage in, garbage out? Do machine learning application papers in social computing report where human-labeled training data comes from?. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency. 325–336.",
      "doi": "10.1145/3351095.3372862"
    },
    {
      "text": "Lisa Gitelman. 2013. Raw Data is an Oxymoron. MIT Press.",
      "doi": ""
    },
    {
      "text": "Boris Glavic, Klaus R Dittrich, A Kemper, H Schöning, T Rose, M Jarke, T Seidl, C Quix, and C Brochhaus. 2007. Data provenance: A Cctegorization of existing approaches. BTW’07: Datenbanksysteme in Buisness, Technologie und Web103 (2007), 227–241.",
      "doi": ""
    },
    {
      "text": "Erving Goffman 1978. The presentation of self in everyday life. Vol. 21. Harmondsworth London.",
      "doi": ""
    },
    {
      "text": "Agnes Grant. 1996. No End of Grief: Indian Residential Schools in Canada.ERIC.",
      "doi": ""
    },
    {
      "text": "Mary L Gray and Siddharth Suri. 2019. Ghost Work: How to Stop Silicon Valley from Building a New Global Underclass. Eamon Dolan Books.",
      "doi": ""
    },
    {
      "text": "Derek Gregory. 2004. ”The colonial present”. Oxford.",
      "doi": ""
    },
    {
      "text": "Joel Grus. 2019. Data science from scratch: first principles with python. O’Reilly Media.",
      "doi": ""
    },
    {
      "text": "Philip J Guo, Sean Kandel, Joseph M Hellerstein, and Jeffrey Heer. 2011. Proactive wrangling: Mixed-initiative end-user programming of data transformation scripts. In Proceedings of the 24th annual ACM symposium on User interface software and technology. 65–74.",
      "doi": "10.1145/2047196.2047205"
    },
    {
      "text": "Christine A Halverson and Mark S Ackerman. 2003. Yeah, the Rush ain’t here yet-Take a break: Creation and use of an artifact as organizational memory. In 36th Annual Hawaii International Conference on System Sciences, 2003. Proceedings of the. IEEE, 10–pp.",
      "doi": ""
    },
    {
      "text": "John G Hansen and Emeka E Dim. 2019. Canada’s missing and murdered indigenous people and the imperative for a more inclusive perspective. International Indigenous Policy Journal 10, 1 (2019).",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 1988. Situated knowledges: The science question in feminism and the privilege of partial perspective. Feminist studies 14, 3 (1988), 575–599.",
      "doi": ""
    },
    {
      "text": "Sandra Harding. 1992. Rethinking standpoint epistemology: What is” strong objectivity?”. The Centennial Review 36, 3 (1992), 437–470.",
      "doi": ""
    },
    {
      "text": "Sandra Harding. 2007. Feminist standpoints. Handbook of feminist research: Theory and praxis (2007), 45–69.",
      "doi": ""
    },
    {
      "text": "Sandra G Harding. 2004. The feminist standpoint theory reader: Intellectual and political controversies. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Jim Harris. 2020. [Online]. ”Data Silence”. OCDQ Blog. http://www.ocdqblog.com/home/data-silence.html",
      "doi": ""
    },
    {
      "text": "Elliott Hauser. 2020. [Online]. ”Logical force in the giving and taking of data”. Interrogating Data Science workshop at CHI 2020 (title only). https://sites.google.com/view/interrogating-data-science-wk/home",
      "doi": ""
    },
    {
      "text": "David G Hendry, Batya Friedman, and Stephanie Ballard. 2021. Value sensitive design as a formative framework. Ethics and Information Technology 23, 1 (2021), 39–44.",
      "doi": "10.1007/s10676-021-09579-x"
    },
    {
      "text": "Andrew Hertzberg, Jose Maria Liberti, and Daniel Paravisini. 2010. Information and incentives inside the firm: Evidence from loan officer rotation. The Journal of Finance 65, 3 (2010), 795–828.",
      "doi": ""
    },
    {
      "text": "Anthony JG Hey, Stewart Tansley, Kristin Michele Tolle, 2009. The fourth paradigm: data-intensive scientific discovery. Vol. 1. Microsoft research Redmond, WA.",
      "doi": ""
    },
    {
      "text": "Jeremy Heyer, Zachary Schmitt, Lynn Dombrowski, and Svetlana Yarosh. 2020. Opportunities for enhancing access and efficacy of peer sponsorship in substance use disorder recovery. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376241"
    },
    {
      "text": "Fred Hohman, Kanit Wongsuphasawat, Mary Beth Kery, and Kayur Patel. 2020. Understanding and visualizing data iteration in machine learning. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376177"
    },
    {
      "text": "Naja Holten Møller, Irina Shklovski, and Thomas T Hildebrandt. 2020. Shifting concepts of value: Designing algorithmic decision-support systems for public services. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. 1–12.",
      "doi": "10.1145/3419249.3420149"
    },
    {
      "text": "Tristan Hopper. 2021. The graves were never a secret: Why so many residential school cemeteries remain unmarked. National Post (2 June 2021).",
      "doi": ""
    },
    {
      "text": "Jessica Hullman and Andrew Gelman. 2021. Designing for interactive exploratory data analysis requires theories of graphical inference. Harvard Data Science Review(2021).",
      "doi": ""
    },
    {
      "text": "Jane Hunter, Abdulmonem Alabri, and Catharine van Ingen. 2013. Assessing the quality and trustworthiness of citizen science data. Concurrency and Computation: Practice and Experience 25, 4(2013), 454–466.",
      "doi": ""
    },
    {
      "text": "Ben Hutchinson, Andrew Smart, Alex Hanna, Emily Denton, Christina Greer, Oddur Kjartansson, Parker Barnes, and Margaret Mitchell. 2021. Towards accountability for machine learning datasets: Practices from software engineering and infrastructure. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency. 560–575.",
      "doi": "10.1145/3442188.3445918"
    },
    {
      "text": "Lilly Irani. 2015. The cultural work of microwork. New Media & Society 17, 5 (2015), 720–739.",
      "doi": ""
    },
    {
      "text": "Lilly C Irani and M Six Silberman. 2013. Turkopticon: Interrupting worker invisibility in amazon mechanical turk. In Proceedings of the SIGCHI conference on human factors in computing systems. 611–620.",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Julie Ireton. 2021. Residential school records once held in Canada now in Rome, researchers say (CBC 15 Nov 2021). https://www.cbc.ca/news/canada/ottawa/residential-school-records-now-in-rome-researchers-survivors-concerned-1.6241449 Accessed 5 Jan 2022.",
      "doi": ""
    },
    {
      "text": "Devon S Isaacs and Amanda R Young. 2019. Missing and murdered Indigenous women (MMIW): Bringing awareness through the power of student activism. Journal of Indigenous Research 7, 1 (2019), 2.",
      "doi": ""
    },
    {
      "text": "Tsunenori Ishioka. 2014. Investigations into Missing Values Imputation Using Random Forests for Semi-supervised Data. In Proceedings of the 16th International Conference on Information Integration and Web-based Applications & Services. 296–301.",
      "doi": "10.1145/2684200.2684288"
    },
    {
      "text": "A Javadpour and S Samiei. 2017. Motivation and barriers to participation in virtual knowledge-sharing communities of practice. Management Science Letters 7, 2 (2017), 81–86.",
      "doi": ""
    },
    {
      "text": "Kabul_Resident. 2021. An Afghan woman in Kabul: ‘Now I have to burn everything I achieved’, The Guardian 15 Aug, 2021. https://www.theguardian.com/world/2021/aug/15/an-afghan-woman-in-kabul-now-i-have-to-burn-everything-i-achieved Accessed Aug 25, 2021.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman. 2011. Thinking, fast and slow. Macmillan.",
      "doi": ""
    },
    {
      "text": "Sean Kandel, Jeffrey Heer, Catherine Plaisant, Jessie Kennedy, Frank Van Ham, Nathalie Henry Riche, Chris Weaver, Bongshin Lee, Dominique Brodbeck, and Paolo Buono. 2011. Research directions in data wrangling: Visualizations and transformations for usable and credible data. Information Visualization 10, 4 (2011), 271–288.",
      "doi": "10.1177/1473871611415994"
    },
    {
      "text": "Sean Kandel, Andreas Paepcke, Joseph Hellerstein, and Jeffrey Heer. 2011. Wrangler: Interactive visual specification of data transformation scripts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3363–3372.",
      "doi": "10.1145/1978942.1979444"
    },
    {
      "text": "Shalini Kantayya. 2020. Coded Bias.",
      "doi": ""
    },
    {
      "text": "Grigoris Karvounarakis, Zachary G Ives, and Val Tannen. 2010. Querying data provenance. In Proceedings of the 2010 ACM SIGMOD International Conference on Management of data. 951–962.",
      "doi": "10.1145/1807167.1807269"
    },
    {
      "text": "Gunay Kazimzade and Milagros Miceli. 2020. Biased Priorities, Biased Outcomes: Three Recommendations for Ethics-oriented Data Annotation Practices. In Proceedings of the AAAI/ACM Conference on AI, Ethics, and Society. 71–71.",
      "doi": "10.1145/3375627.3375809"
    },
    {
      "text": "Mary Beth Kery, Amber Horvath, and Brad A Myers. 2017. Variolite: Supporting Exploratory Programming by Data Scientists.. In CHI, Vol. 10. 3025453–3025626.",
      "doi": "10.1145/3025453.3025626"
    },
    {
      "text": "Mary Beth Kery, Bonnie E John, Patrick O’Flaherty, Amber Horvath, and Brad A Myers. 2019. Towards effective foraging by data scientists to find past analysis choices. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300322"
    },
    {
      "text": "Mary Beth Kery and Brad A Myers. 2017. Exploring exploratory programming. In 2017 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). IEEE, 25–29.",
      "doi": ""
    },
    {
      "text": "Martin Luther King Jr. 1967. Conscience for Change: Massey Lectures, Seventh Series. Toronto: Canadian Broadcasting Corporation I 967 (1967).",
      "doi": ""
    },
    {
      "text": "Ákos Kiss and Tamás Szirányi. 2013. Evaluation of manually created ground truth for multi-view people localization. In Proceedings of the International Workshop on Video and Image Ground Truth in Computer Vision Applications. 1–6.",
      "doi": "10.1145/2501105.2501106"
    },
    {
      "text": "Edward Kissam. 2019. How low response among Latino immigrants will lead to differential undercount if the United States’ 2020 census includes a question on sensitive citizenship. Statistical Journal of the IAOS 35, 2 (2019), 221–243.",
      "doi": ""
    },
    {
      "text": "Atay Kizilaslan and Aziz A Lookman. 2017. Can Economically Intuitive Factors Improve Ability of Proprietary Algorithms to Predict Defaults of Peer-to-Peer Loans?Available at SSRN 2987613(2017).",
      "doi": ""
    },
    {
      "text": "Donald Ervin Knuth. 1984. Literate programming. The computer journal 27, 2 (1984), 97–111.",
      "doi": ""
    },
    {
      "text": "Donald E. Knuth. 1997. The Art of Computer Programming, Vol. 1: Fundamental Algorithms (3rd. ed.). Addison Wesley Longman Publishing Co., Inc.",
      "doi": "10.5555/260999"
    },
    {
      "text": "Marina Kogan, Aaron Halfaker, Shion Guha, Cecilia Aragon, Michael Muller, and Stuart Geiger. 2020. Mapping Out Human-Centered Data Science: Methods, Approaches, and Best Practices. In Companion of the 2020 ACM International Conference on Supporting Group Work. 151–156.",
      "doi": "10.1145/3323994.3369898"
    },
    {
      "text": "Christoph Kollwitz, Mximilian Perez Mengual, and Barbara Dinter. 2018. Cross-Disciplinary Collaboration for Designing Data-Driven Products and Services. In 2018 Pre-ICIS SIGDSA Symposium on Decision Analytics Connecting People, Data & Things. 1–15.",
      "doi": ""
    },
    {
      "text": "Robert Kozma, Roman Ilin, and Hava T Siegelmann. 2018. Evolution of abstraction across layers in deep learning neural networks. Procedia computer science 144 (2018), 203–213.",
      "doi": ""
    },
    {
      "text": "Scott Krig. 2016. Ground truth data, content, metrics, and analysis. In Computer Vision Metrics. Springer, 247–271.",
      "doi": ""
    },
    {
      "text": "Sean Kross and Philip J Guo. 2019. Practitioners teaching data science in industry and academia: Expectations, workflows, and challenges. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300493"
    },
    {
      "text": "Sean Kross and Philip J Guo. 2021. Orienting, Framing, Bridging, Magic, and Counseling: How Data Scientists Navigate the Outer Loop of Client Collaborations in Industry and Academia. arXiv preprint arXiv:2105.05849(2021).",
      "doi": ""
    },
    {
      "text": "Kateryna Kuksenok, Cecilia Aragon, James Fogarty, Charlotte P Lee, and Gina Neff. 2017. Deliberate Individual Change Framework for Understanding Programming Practices in four Oceanography Groups. Computer Supported Cooperative Work (CSCW) 26, 4 (2017), 663–691.",
      "doi": "10.1007/s10606-017-9285-x"
    },
    {
      "text": "Neha Kumar and Naveena Karusala. 2021. Braving citational justice in human-computer interaction. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–9.",
      "doi": "10.1145/3411763.3450389"
    },
    {
      "text": "Milan Kundera and Michael Henry (trans.) Heim. 1981. The Book of Laughter and Forgetting. 1979. (1981).",
      "doi": ""
    },
    {
      "text": "Xiaochen Lai, Liwen Mao, Zheng Zhang, and Genglin Zhang. 2021. Multi-task learning modeling of attribute mutual association based on confidence and imputation of missing values. In 2021 2nd International Conference on Computing, Networks and Internet of Things (CNIOT 2021). 1–6.",
      "doi": "10.1145/3468691.3468709"
    },
    {
      "text": "Han Lamers, Toon Van Hal, and Sebastiaan G Clercx. 2020. How to Deal with Scholarly Forgetting in the History of the Humanities: Starting points for discussion. History of Humanities 5, 1 (2020), 5–29.",
      "doi": ""
    },
    {
      "text": "Larry Laudan. 1978. Progress and its problems: Towards a theory of scientific growth. Vol. 282. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Debora de Castro Leal, Angelika Strohmayer, and Max Krüger. 2021. On Activism and Academia: Reflecting Together and Sharing Experiences Among Critical Friends. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3411764.3445263"
    },
    {
      "text": "Dokyun Lee, Emaad Manzoor, and Zhaoqi Cheng. 2018. Focused concept miner (FCM): Interpretable deep learning for text exploration. Available at SSRN 3304756(2018).",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star. 2010. This is not a boundary object: Reflections on the origin of a concept. Science, Technology, & Human Values 35, 5 (2010), 601–617.",
      "doi": ""
    },
    {
      "text": "Eric Lesser, Michael Fontaine, and Jason Slusher. 2009. Knowledge and communities. Routledge.",
      "doi": ""
    },
    {
      "text": "Antonios Liapis, Gillian Smith, and Noor Shaker. 2016. Mixed-initiative content creation. In Procedural content generation in games. Springer, 195–214.",
      "doi": ""
    },
    {
      "text": "Sijia Liu, Parikshit Ram, Deepak Vijaykeerthy, Djallel Bouneffouf, Gregory Bramble, Horst Samulowitz, Dakuo Wang, Andrew Conn, and Alexander Gray. 2020. An ADMM based framework for automl pipeline configuration. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 34. 4892–4899.",
      "doi": ""
    },
    {
      "text": "Helen E Longino. 1993. Feminist standpoint theory and the problems of knowledge.",
      "doi": ""
    },
    {
      "text": "Alexandra Lyn. 2020. Risky Business: Artificial Intelligence and Risk Assessments in Sentencing and Bail Procedures in the United States. Available at SSRN 3831441(2020).",
      "doi": ""
    },
    {
      "text": "Jean-François Lyotard. 1984. The postmodern condition: A report on knowledge. U of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Diana Lynn MacLean and Jeffrey Heer. 2013. Identifying medical terms in patient-authored text: a crowdsourcing-based approach. Journal of the american medical informatics association 20, 6(2013), 1120–1127.",
      "doi": ""
    },
    {
      "text": "Yaoli Mao, Dakuo Wang, Michael Muller, Kush R Varshney, Ioana Baldini, Casey Dugan, and Aleksandra Mojsilović. 2019. How data scientistswork together with domain experts in scientific collaborations: To find the right answer or to ask the right question?Proceedings of the ACM on Human-Computer Interaction 3, GROUP(2019), 1–23.",
      "doi": ""
    },
    {
      "text": "Donald Martin Jr, Vinodkumar Prabhakaran, Jill Kuhlberg, Andrew Smart, and William S Isaac. 2020. Participatory problem formulation for fairer machine learning through community based system dynamics. arXiv preprint arXiv:2005.07572(2020).",
      "doi": ""
    },
    {
      "text": "Helena M Mentis, Ahmed Rahim, and Pierre Theodore. 2016. Crafting the image in surgical telemedicine. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. 744–755.",
      "doi": "10.1145/2818048.2819978"
    },
    {
      "text": "Edmund Metatawabin and Alexandra Shimo. 2015. Up Ghost River: A Chief’s Journey Through the Turbulent Waters of Native History. Vintage Canada.",
      "doi": ""
    },
    {
      "text": "Milagros Miceli, Martin Schuessler, and Tianling Yang. 2020. Between subjectivity and imposition: Power dynamics in data annotation for computer vision. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–25.",
      "doi": "10.1145/3415186"
    },
    {
      "text": "Barbara J Mills. 2008. Remembering while forgetting: depositional practices and social memory at Chaco. Memory work: Archaeologies of material practices (2008), 81–108.",
      "doi": ""
    },
    {
      "text": "Cindy Minarova-Banjac. 2018. Collective Memory and Forgetting: A Theoretical. (2018).",
      "doi": ""
    },
    {
      "text": "Hrushikesha Mohanty. 2015. Big data: An introduction. In Big Data. Springer, 1–28.",
      "doi": ""
    },
    {
      "text": "Naja Holten Møller, Claus Bossen, Kathleen H Pine, Trine Rask Nielsen, and Gina Neff. 2020. Who does the work of data?Interactions 27, 3 (2020), 52–55.",
      "doi": ""
    },
    {
      "text": "Arnaldo Momigliano, Glen Warren Bowersock, Tim Cornell, Glen Warren Bowersock, and Tim Cornell. 1994. Studies on modern scholarship. University of California Press Berkeley.",
      "doi": ""
    },
    {
      "text": "Lenard Monkman. 2022. ’There’s got to be ways’ Indigenous language names can be registered in Manitoba, says SCO grand chief (CBC 18 Feb 2022). https://www.cbc.ca/news/indigenous/manitoba-indigenous-language-baby-names-1.6357478 Accessed 19 Feb 2022.",
      "doi": ""
    },
    {
      "text": "Christine Moorman and Anne S Miner. 1998. Organizational improvisation and organizational memory. Academy of management Review 23, 4 (1998), 698–723.",
      "doi": ""
    },
    {
      "text": "Michael Muller, Cecilia Aragon, Shion Guha, Marina Kogan, Gina Neff, Cathrine Seidelin, Katie Shilton, and Anissa Tanweer. 2020. Interrogating Data Science. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing. 467–473.",
      "doi": ""
    },
    {
      "text": "Michael Muller, Ingrid Lange, Dakuo Wang, David Piorkowski, Jason Tsay, Q Vera Liao, Casey Dugan, and Thomas Erickson. 2019. How data science workers work with data: Discovery, capture, curation, design, creation. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–15.",
      "doi": "10.1145/3290605.3300356"
    },
    {
      "text": "Michael Muller, Christine T Wolf, Josh Andres, Michael Desmond, Narendra Nath Joshi, Zahra Ashktorab, Aabhas Sharma, Kristina Brimijoin, Qian Pan, Evelyn Duesterwald, 2021. Designing Ground Truth and the Social Life of Labels. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445402"
    },
    {
      "text": "Dylan Mulvin. 2021. Proxies: The cultural work of standing in. MIT Press.",
      "doi": ""
    },
    {
      "text": "Gina Neff, Anissa Tanweer, Brittany Fiore-Gartland, and Laura Osburn. 2017. Critique and contribute: A practice-based framework for improving critical data studies and data science. Big data 5, 2 (2017), 85–97.",
      "doi": ""
    },
    {
      "text": "Katherine L Nichols. 2020. 3 The Brandon Indian Residential School Cemetery Project. Working with and for Ancestors: Collaboration in the Care and Study of Ancestral Remains (2020), 43.",
      "doi": ""
    },
    {
      "text": "Pádraig Ó Tuama. 2019. Makebelieve. Retrieved August 12, 2021 from https://poets.org/poem/makebelieve",
      "doi": ""
    },
    {
      "text": "Anne Oeldorf-Hirsch and Darren Gergle. 2020. ’Who Knows What’ Audience Targeting for Question Asking on Facebook. Proceedings of the ACM on Human-Computer Interaction 4, GROUP(2020), 1–20.",
      "doi": ""
    },
    {
      "text": "Cathy O’neil. 2016. Weapons of math destruction: How big data increases inequality and threatens democracy. Crown.",
      "doi": ""
    },
    {
      "text": "Mimi Onuoha. 2016. ”The Library of Missing Datasets [Online]”. https://mimionuoha.com/the-library-of-missing-datasets",
      "doi": ""
    },
    {
      "text": "George Orwell. 2021. Nineteen eighty-four. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Harold Ossher and Peri Tarr. 2001. Using multidimensional separation of concerns to (re) shape evolving software. Commun. ACM 44, 10 (2001), 43–50.",
      "doi": "10.1145/383845.383856"
    },
    {
      "text": "Sinan Ozdemir and Divya Susarla. 2018. Feature Engineering Made Easy: Identify unique features from your dataset in order to build powerful machine learning systems. Packt Publishing Ltd.",
      "doi": ""
    },
    {
      "text": "Fereniki Panagopoulou-Koutnatzi. 2012. The right to be forgotten in the digital era. In Proceedings of Interntional Conference on Information Law ICIL 2012. 305–322.",
      "doi": ""
    },
    {
      "text": "Samir Passi. 2021. Making Data Work: The Human and Organizational Lifeworlds of Data Science. Cornell University.",
      "doi": ""
    },
    {
      "text": "Samir Passi and Solon Barocas. 2019. Problem formulation and fairness. In Proceedings of the Conference on Fairness, Accountability, and Transparency. 39–48.",
      "doi": "10.1145/3287560.3287567"
    },
    {
      "text": "Samir Passi and Steven Jackson. 2017. Data vision: Learning to see through algorithmic abstraction. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. 2436–2447.",
      "doi": "10.1145/2998181.2998331"
    },
    {
      "text": "Samir Passi and Steven J Jackson. 2018. Trust in data science: Collaboration, translation, and accountability in corporate data science projects. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–28.",
      "doi": "10.1145/3274405"
    },
    {
      "text": "Kayur Patel, James Fogarty, James A Landay, and Beverly Harrison. 2008. Investigating statistical machine learning as a tool for software development. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 667–676.",
      "doi": "10.1145/1357054.1357160"
    },
    {
      "text": "Deana Pennington, Imme Ebert-Uphoff, Natalie Freed, Jo Martin, and Suzanne A Pierce. 2020. Bridging sustainability science, earth science, and data science through interdisciplinary education. Sustainability Science 15, 2 (2020), 647–661.",
      "doi": ""
    },
    {
      "text": "Kathleen Pine and Claus Bossen. 2020. [Online]. ”Multiple Virtues in Data Work: CDIS’ Practices of Generating Healthcare Data”. Interrogating Data Science workshop at CHI 2020 (title only). https://sites.google.com/view/interrogating-data-science-wk/home",
      "doi": ""
    },
    {
      "text": "Kathleen H Pine and Max Liboiron. 2015. The politics of measurement and action. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 3147–3156.",
      "doi": "10.1145/2702123.2702298"
    },
    {
      "text": "Liedeke Plate. 2016. Amnesiology: Towards the study of cultural oblivion. Memory Studies 9, 2 (2016), 143–155.",
      "doi": ""
    },
    {
      "text": "Ivens Portugal, Paulo Alencar, and Donald Cowan. 2018. The use of machine learning algorithms in recommender systems: A systematic review. Expert Systems with Applications 97 (2018), 205–227.",
      "doi": ""
    },
    {
      "text": "Line Pouchard. 2015. Revisiting the data lifecycle with big data curation. (2015).",
      "doi": ""
    },
    {
      "text": "Robert N Proctor and Londa Schiebinger. 2008. Agnotology: The making and unmaking of ignorance. (2008).",
      "doi": ""
    },
    {
      "text": "Inioluwa Deborah Raji and Joy Buolamwini. 2019. Actionable auditing: Investigating the impact of publicly naming biased performance results of commercial ai products. In Proceedings of the 2019 AAAI/ACM Conference on AI, Ethics, and Society. 429–435.",
      "doi": "10.1145/3306618.3314244"
    },
    {
      "text": "Tye Rattenbury, Joseph M Hellerstein, Jeffrey Heer, Sean Kandel, and Connor Carreras. 2017. Principles of data wrangling: Practical techniques for data preparation. ” O’Reilly Media, Inc.”.",
      "doi": ""
    },
    {
      "text": "Paulette Regan. 2010. Unsettling the settler within: Indian residential schools, truth telling, and reconciliation in Canada. ubc Press.",
      "doi": ""
    },
    {
      "text": "Margaret Robinson. 2017. Two-spirit and bisexual people: Different umbrella, same rain. Journal of Bisexuality 17, 1 (2017), 7–29.",
      "doi": ""
    },
    {
      "text": "Marina Roseman. 2003. Singers of the Landscape: Song, History, and PropertyR ights in the Malaysian Rainforest. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Sabirat Rubya and Svetlana Yarosh. 2017. Interpretations of online anonymity in Alcoholics Anonymous and Narcotics Anonymous. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–22.",
      "doi": "10.1145/3134726"
    },
    {
      "text": "Adam Rule, Aurélien Tabard, and James D Hollan. 2018. Exploration and explanation in computational notebooks. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173606"
    },
    {
      "text": "Mihai Stelian Rusu 2011. The Colonization of the Past and the Construction of Mnemonic Order. Studia Universitatis Babes-Bolyai-Sociologia 56, 2(2011), 39–57.",
      "doi": ""
    },
    {
      "text": "James Sadd, Rachel Morello-Frosch, Manuel Pastor, Martha Matsuoka, Michele Prichard, and Vanessa Carter. 2014. The truth, the whole truth, and nothing but the ground-truth: Methods to advance environmental justice and researcher–community partnerships. Health education & behavior 41, 3 (2014), 281–290.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Shivani Kapania, Hannah Highfill, Diana Akrong, Praveen Paritosh, and Lora M Aroyo. 2021. “Everyone wants to do the model work, not the data work”: Data Cascades in High-Stakes AI. In proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": ""
    },
    {
      "text": "Viviane Santos, Alfredo Goldman, Eduardo Guerra, Cleidson De Souza, and Helen Sharp. 2013. A pattern language for inter-team knowledge sharing in agile software development. In 20th Conference on Pattern Languages of Programs, Monticello, IL.",
      "doi": "10.5555/2725669.2725693"
    },
    {
      "text": "Mike Schaekermann, Carrie J Cai, Abigail E Huang, and Rory Sayres. 2020. Expert Discussions Improve Comprehension of Difficult Cases in Medical Image Assessment. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376290"
    },
    {
      "text": "Morgan Klaus Scheuerman, Jacob M Paul, and Jed R Brubaker. 2019. How computers see gender: An evaluation of gender classification in commercial facial analysis services. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–33.",
      "doi": "10.1145/3359246"
    },
    {
      "text": "Joni Seager. 2016. ”Missing women, blank maps, and data fields: What gets counted counts”, Boston Public Library Lectures in Cartography.",
      "doi": ""
    },
    {
      "text": "Cathrine Seidelin, Yvonne Dittrich, and Erik Grönvall. 2018. Data Work in a Knowledge-Broker Organisation: How Cross-Organisational Data Maintenance Shapes Human Data Interactions. In Proceedings of the 32nd International BCS Human Computer Interaction Conference (Belfast, United Kingdom) (HCI ’18). BCS Learning & Development Ltd., Swindon, GBR, Article 14, 12 pages. https://doi.org/10.14236/ewic/HCI2018.14",
      "doi": "10.14236/ewic/HCI2018.14"
    },
    {
      "text": "Andrew D Selbst, Danah Boyd, Sorelle A Friedler, Suresh Venkatasubramanian, and Janet Vertesi. 2019. Fairness and abstraction in sociotechnical systems. In Proceedings of the conference on fairness, accountability, and transparency. 59–68.",
      "doi": "10.1145/3287560.3287598"
    },
    {
      "text": "Dilruba Showcat and Eric P.S. Baumer. 2020. [Online]. ”Outliers: More Than Numbers?”. Interrogating Data Science workshop at CHI 2020. https://www.researchgate.net/profile/Dilruba-Showkat/publication/345774805_Outliers_More_Than_Numbers/links/5fad80eda6fdcc9389b15a15/Outliers-More-Than-Numbers.pdf",
      "doi": ""
    },
    {
      "text": "Miguel-Ángel Sicilia, Elena García-Barriocanal, Salvador Sánchez-Alonso, Marçal Mora-Cantallops, and Juan-José Cuadrado. 2018. Ontologies for data science: On its application to data pipelines. In Research Conference on Metadata and Semantics Research. Springer, 169–180.",
      "doi": ""
    },
    {
      "text": "Yogesh L Simmhan, Beth Plale, and Dennis Gannon. 2005. A survey of data provenance in e-science. ACM Sigmod Record 34, 3 (2005), 31–36.",
      "doi": "10.1145/1084805.1084812"
    },
    {
      "text": "Eric Simons, Andrew Martindale, and Alison Wylie. 2020. Bearing witness: What can archaeology contribute in an Indian Residential School context?In Working with and for Ancestors. Routledge, 21–31.",
      "doi": ""
    },
    {
      "text": "Jesper Simonsen, Helena Karasti, and Morten Hertzum. 2020. Infrastructuring and participatory design: Exploring infrastructural inversion as analytic, empirical and generative. Computer Supported Cooperative Work (CSCW) 29, 1 (2020), 115–151.",
      "doi": "10.1007/s10606-019-09365-w"
    },
    {
      "text": "Lucy Simpson and Cherrah Giles (Eds.). 2022. Special edition on Missing and Murdered Indigenous Women. Restoration 18, 4 (2022).",
      "doi": ""
    },
    {
      "text": "Stolen Sisters. 2004. A Human Rights Response to Discrimination and Violence against Indigenous Women in Canada. Amnesty International(2004).",
      "doi": ""
    },
    {
      "text": "Katta Spiel. 2021. ” Why are they all obsessed with Gender?”—(Non) binary Navigations through Technological Infrastructures. In Designing Interactive Systems Conference 2021. 478–494.",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Julia Makhaeva, and Christopher Frauenberger. 2016. Embodied companion technologies for autistic children. In Proceedings of the TEI’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction. 245–252.",
      "doi": "10.1145/2839462.2839495"
    },
    {
      "text": "Susan Leigh Star and Anselm Strauss. 1999. Layers of silence, arenas of voice: The ecology of visible and invisible work. Computer supported cooperative work (CSCW) 8, 1-2 (1999), 9–30.",
      "doi": ""
    },
    {
      "text": "Chris Stokel-Walker. 2021. Afghans are racing to erase their online lives: Every photo and every data point is a link to the old way of life in Afghanistan – and a reason for Taliban retribution, Wired 17 Aug, 2021. https://www.wired.co.uk/article/afghanistan-social-media-delete, Aug 17, 2021 Accessed Aug 25, 2021.",
      "doi": ""
    },
    {
      "text": "Angelika Strohmayer, Jenn Clamen, and Mary Laing. 2019. Technologies for social justice: Lessons from sex workers on the front lines. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300882"
    },
    {
      "text": "Angelika Strohmayer, Mary Laing, and Rob Comber. 2017. Technologies and social justice outcomes in sex work charities: Fighting stigma, saving lives. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3352–3364.",
      "doi": "10.1145/3025453.3025615"
    },
    {
      "text": "Angelika Strohmayer, Janis Lena Meissner, Alexander Wilson, Sarah Charlton, and Laura McIntyre. 2020. ” We come together as one... and hope for solidarity to live on” On Designing Technologies for Activism and the Commemoration of Lost Lives. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 87–100.",
      "doi": "10.1145/3357236.3395452"
    },
    {
      "text": "Ki Hyun Tae, Yuji Roh, Young Hun Oh, Hyunsu Kim, and Steven Euijong Whang. 2019. Data cleaning for accurate, fair, and robust models: A big data-AI integration approach. In Proceedings of the 3rd International Workshop on Data Management for End-to-End Machine Learning. 1–4.",
      "doi": "10.1145/3329486.3329493"
    },
    {
      "text": "Anissa Tanweer, Brittany Fiore-Gartland, and Cecilia Aragon. 2016. Impediment to insight to innovation: understanding data assemblages through the breakdown–repair process. Information, Communication & Society 19, 6 (2016), 736–752.",
      "doi": ""
    },
    {
      "text": "Lisa Tatonetti. 2021. Written by the Body: Gender Expansiveness and Indigenous Non-Cis Masculinities. U of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Alex S Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger, and Jessica Lingel. 2015. Data-in-place: Thinking through the relations between data and community. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2863–2872.",
      "doi": "10.1145/2702123.2702558"
    },
    {
      "text": "Kristinn R Thórisson, Jordi Bieger, Xiang Li, and Pei Wang. 2019. Cumulative learning. In International Conference on Artificial General Intelligence. Springer, 198–208.",
      "doi": ""
    },
    {
      "text": "Truth and Reconciliation Commission. 2015. Truth & Reconciliation Commission of Canada – Findings & Reports. https://archive.org/stream/TruthReconciliationCanada/Volume_4_Missing_Children_English_Web_djvu.txt.",
      "doi": ""
    },
    {
      "text": "Muhammad Fahim Uddin, Jeongkyu Lee, Syed Rizvi, and Samir Hamada. 2018. Proposing enhanced feature engineering and a selection model for machine learning processes. Applied Sciences 8, 4 (2018), 646.",
      "doi": ""
    },
    {
      "text": "Wil MP Van der Aalst. 2014. Data scientist: The engineer of the future. In Enterprise interoperability VI. Springer, 13–26.",
      "doi": ""
    },
    {
      "text": "Morgan Vigil-Hayes, Marisa Duarte, Nicholet Deschine Parkhurst, and Elizabeth Belding. 2017. # indigenous: Tracking the connective actions of native american advocates on twitter. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. 1387–1399.",
      "doi": "10.1145/2998181.2998194"
    },
    {
      "text": "Morgan Vigil-Hayes, Nicholet Deschine Parkhurst, and Marisa Duarte. 2019. Complex, contemporary, and unconventional: Characterizing the tweets of the# NativeVote movement and Native American candidates through the 2018 US midterm elections. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–27.",
      "doi": "10.1145/3359205"
    },
    {
      "text": "Manu Vimalassery, Juliana Hu Pegues, and Alyosha Goldstein. 2017. Colonial unknowing and relations of study. Theory & Event 20, 4 (2017), 1042–1054.",
      "doi": ""
    },
    {
      "text": "João Vinagre and Alípio Mário Jorge. 2012. Forgetting mechanisms for scalable collaborative filtering. Journal of the Brazilian Computer Society 18, 4 (2012), 271–282.",
      "doi": ""
    },
    {
      "text": "Vered Vinitzky-Seroussi and Chana Teeger. 2010. Unpacking the unspoken: Silence in collective memory and forgetting. Social forces 88, 3 (2010), 1103–1122.",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Josh Andres, Justin D Weisz, Erick Oduor, and Casey Dugan. 2021. AutoDS: Towards Human-Centered Automation of Data Science. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445526"
    },
    {
      "text": "Dakuo Wang, Justin D Weisz, Michael Muller, Parikshit Ram, Werner Geyer, Casey Dugan, Yla Tausczik, Horst Samulowitz, and Alexander Gray. 2019. Human-ai collaboration in data science: Exploring data scientists’ perceptions of automated ai. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–24.",
      "doi": "10.1145/3359313"
    },
    {
      "text": "Anne L Washington. 2018. How to argue with an algorithm: Lessons from the COMPAS-ProPublica debate. Colo. Tech. LJ 17(2018), 131.",
      "doi": ""
    },
    {
      "text": "Frederick Whitling. 2010. Damnatio memoriae and the power of remembrance. A European memory (2010).",
      "doi": ""
    },
    {
      "text": "Doris Xin, Hui Miao, Aditya Parameswaran, and Neoklis Polyzotis. 2021. Production Machine Learning Pipelines: Empirical Analysis and Optimization Opportunities. In Proceedings of the 2021 International Conference on Management of Data. 2639–2652.",
      "doi": "10.1145/3448016.3457566"
    },
    {
      "text": "Wei Xu. 2019. Toward human-centered AI: a perspective from human-computer interaction. Interactions 26, 4 (2019), 42–46.",
      "doi": "10.1145/3328485"
    },
    {
      "text": "Matthew Yapchain. 2018. Human-Centered Data Science: A New Paradigm for Industrial IoT. In Ethnographic Praxis in Industry Conference Proceedings, Vol. 2018. Wiley Online Library, 53–61.",
      "doi": ""
    },
    {
      "text": "Carlos Vladimiro González Zelaya. 2019. Towards explaining the effects of data preprocessing on machine learning. In 2019 IEEE 35th international conference on data engineering (ICDE). IEEE, 2086–2090.",
      "doi": ""
    },
    {
      "text": "Amy X Zhang, Michael Muller, and Dakuo Wang. 2020. How do data science workers collaborate? roles, workflows, and tools. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–23.",
      "doi": "10.1145/3392826"
    },
    {
      "text": "Shoshana Zuboff. 2019. The Age of Surveillance Capitalism: The Fight for a Human Future at the New Frontier of Power. PublicAffairs.",
      "doi": ""
    },
    {
      "text": "Jean-Daniel Zucker. 2003. A grounded theory of abstraction in artificial intelligence. Philosophical Transactions of the Royal Society of London. Series B: Biological Sciences 358, 1435 (2003), 1293–1309.",
      "doi": ""
    }
  ]
}