{
  "doi": "10.1145/3491102.3517692",
  "title": "Design is Worth a Thousand Words: The Effect of Digital Interaction Design on Picture-Prompted Reminiscence",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2022,
  "badges": [],
  "abstract": "Interactions with our personal and family pictures are essential to continued social reminiscence, leading to long-term benefits, including reduced social isolation. Previous research has identified how designs of digital picture tools fall short of physical options specifically in terms of reminiscence. However, the relative prompting abilities of different digital interactions, including the types of memories prompted like external facts or person-centred memories, have not yet been explored. To investigate this, we present a controlled study of the memories prompted by three digital picture interactions (slideshow, gallery, and tabletop) on personal touchscreen devices. We find differences in how these tools and the interactions they support prompt reminiscence. In particular, gallery views prompt significantly fewer memories than either the tabletop or slideshow. Slideshows prompt significantly more external, factual memories, but not more person-centred memories, which are key to reminiscence. This has implications for the overall social usability of digital picture interactions.",
  "authors": [
    {
      "name": "Benett Axtell",
      "institution": "TAGlab, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659196405",
      "orcid": "0000-0002-3988-4830"
    },
    {
      "name": "Raheleh Saryazdi",
      "institution": "Psychology, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234247",
      "orcid": "missing"
    },
    {
      "name": "Cosmin Munteanu",
      "institution": "Institute for Communication, Culture, Information, and Technology, University of Toronto Mississauga, Canada and Technologies for Ageing Gracefully, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100559377",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Andrew D. Althouse. 2016. Adjust for multiple comparisons? It's not that simple. The Annals of thoracic surgery 101, 5 (2016), 1644–1645. DOI:https://doi.org/10.1016/j.athoracsur.2015.11.024",
      "doi": ""
    },
    {
      "text": "Morgan Ames, Dean Eckles, Mor Naaman, Mirjana Spasojevic, and Nancy House. 2010. Requirements for mobile photoware. Personal and Ubiquitous Computing 14, 2 (2010), 95–109. DOI:https://doi.org/10.1007/s00779-009-0237-4",
      "doi": "10.1007/s00779-009-0237-4"
    },
    {
      "text": "Arlene J. Astell, Maggie P. Ellis, Norman Alm, Richard Dye, and Gary Gowans. 2010. Stimulating people with dementia to reminisce using personal and generic photographs. International Journal of Computers in Healthcare 1, 2 (January 2010), 177–198. DOI:https://doi.org/10.1504/IJCIH.2010.037461",
      "doi": "10.1504/IJCIH.2010.037461"
    },
    {
      "text": "Benett Axtell and Cosmin Munteanu. 2019. PhotoFlow in Action: Picture-Mediated Reminiscence Supporting Family Socio-Connectivity. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, INT050. DOI:https://doi.org/10.1145/3290607.3313272",
      "doi": "10.1145/3290607.3313272"
    },
    {
      "text": "Bojan Blažica, Daniel Vladušič, and Dunja Mladenić. 2013. A personal perspective on photowork: implicit human–computer interaction for photo collection management. Personal and ubiquitous computing 17, 8 (2013), 1787–1795. DOI:https://doi.org/10.1007/s00779-013-0650-6",
      "doi": ""
    },
    {
      "text": "Robin Brewer and Anne Marie Piper. 2016. “Tell It Like It Really Is”: A Case of Online Content Creation and Sharing Among Older Adult Bloggers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), ACM, New York, NY, USA, 5529–5542. DOI:https://doi.org/10.1145/2858036.2858379",
      "doi": "10.1145/2858036.2858379"
    },
    {
      "text": "Mendel Broekhuijsen, Elise van den Hoven, and Panos Markopoulos. 2017. From PhotoWork to PhotoUse: exploring personal digital photo activities. Behaviour & Information Technology (2017), 1–14. DOI:https://doi.org/10.1080/0144929X.2017.1288266",
      "doi": "10.1080/0144929X.2017.1288266"
    },
    {
      "text": "Mendel Broekhuijsen, Elise van den Hoven, and Panos Markopoulos. 2017. Design Directions for Media-Supported Collocated Remembering Practices. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI ’17), Association for Computing Machinery, New York, NY, USA, 21–30. DOI:https://doi.org/10.1145/3024969.3024996",
      "doi": "10.1145/3024969.3024996"
    },
    {
      "text": "Richard Chalfen. 1987. Snapshot versions of life. University of Wisconsin Press.",
      "doi": ""
    },
    {
      "text": "Richard Chalfen. 1998. Interpreting family photography as pictorial communication. Image-based research: A sourcebook for qualitative researchers (1998), 214–234.",
      "doi": ""
    },
    {
      "text": "Ya-Xi Chen, Michael Reiter, and Andreas Butz. 2010. PhotoMagnets: Supporting Flexible Browsing and Searching in Photo Collections. In International Conference on Multimodal Interfaces and the Workshop on Machine Learning for Multimodal Interaction (ICMI-MLMI ’10), ACM, New York, NY, USA, 25:1-25:8. DOI:https://doi.org/10.1145/1891903.1891936",
      "doi": "10.1145/1891903.1891936"
    },
    {
      "text": "David Frohlich, Allan Kuchinsky, Celine Pering, Abbe Don, and Steven Ariss. 2002. Requirements for photoware. In Proceedings of the 2002 ACM conference on Computer supported cooperative work, ACM, 166–175. DOI:https://doi.org/10.1145/587078.587102",
      "doi": "10.1145/587078.587102"
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Elsevier, 139–183. DOI:https://doi.org/10.1016/S0166-4115(08)62386-9",
      "doi": ""
    },
    {
      "text": "Andrew F. Hayes and Klaus Krippendorff. 2007. Answering the Call for a Standard Reliability Measure for Coding Data. Communication Methods and Measures 1, 1 (April 2007), 77–89. DOI:https://doi.org/10.1080/19312450709336664",
      "doi": ""
    },
    {
      "text": "David C. Howell. 2012. 12.1 Error Rates. In Statistical methods for psychology. Cengage Learning.",
      "doi": ""
    },
    {
      "text": "Jasmine Jones and Mark S. Ackerman. 2018. Co-constructing Family Memory: Understanding the Intergenerational Practices of Passing on Family Stories. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18, ACM Press, Montreal QC, Canada, 1–13. DOI:https://doi.org/10.1145/3173574.3173998",
      "doi": ""
    },
    {
      "text": "Björn Þór Jónsson, Grímur Tómasson, Hlynur Sigurþórsson, Áslaug Eiríksdóttir, Laurent Amsaleg, and Marta Kristín Lárusdóttir. 2015. A Multi-Dimensional Data Model for Personal Photo Browsing. In MultiMedia Modeling (Lecture Notes in Computer Science), Springer, Cham, 345–356. DOI:https://doi.org/10.1007/978-3-319-14442-9_41",
      "doi": ""
    },
    {
      "text": "Emily Keightley and Michael Pickering. 2014. Technologies of memory: Practices of remembering in analogue and digital photography. new media & society 16, 4 (2014), 576–593. DOI:https://doi.org/10.1177/1461444814532062",
      "doi": ""
    },
    {
      "text": "David Kirk, Abigail Sellen, Carsten Rother, and Ken Wood. 2006. Understanding photowork. In Proceedings of the SIGCHI conference on Human Factors in computing systems, ACM, 761–770. DOI:https://doi.org/10.1145/1124772.1124885",
      "doi": "10.1145/1124772.1124885"
    },
    {
      "text": "Brian Levine, Eva Svoboda, Janine F. Hay, Gordon Winocur, and Morris Moscovitch. 2002. Aging and autobiographical memory: Dissociating episodic from semantic retrieval. Psychology and Aging 17, 4 (2002), 677–689. DOI:https://doi.org/10.1037/0882-7974.17.4.677",
      "doi": ""
    },
    {
      "text": "Amna Liaqat, Benett Axtell, and Cosmin Munteanu. 2021. Participatory Design for Intergenerational Culture Exchange in Immigrant Families: How Collaborative Narration and Creation Fosters Democratic Engagement. Proc. ACM Hum.-Comput. Interact. 5, CSCW1 (April 2021), 98:1-98:40. DOI:https://doi.org/10.1145/3449172",
      "doi": "10.1145/3449172"
    },
    {
      "text": "Siân E. Lindley. 2012. Before I forget: From personal memory to family history. Human–Computer Interaction 27, 1–2 (2012), 13–36. DOI:https://doi.org/10.1080/07370024.2012.656065",
      "doi": ""
    },
    {
      "text": "Siân Lindley and Andrew Monk. 2006. Designing Appropriate Affordances for Electronic Photo Sharing Media. In CHI ’06 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’06), ACM, New York, NY, USA, 1031–1036. DOI:https://doi.org/10.1145/1125451.1125648",
      "doi": ""
    },
    {
      "text": "Nora Mcdonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and Inter-rater Reliability in Qualitative Research: Norms and Guidelines for CSCW and HCI Practice. Proceedings of the ACM on Human-Computer Interaction (2019), 23. DOI:https://doi.org/10.1145/3359174",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Juan C. Melendez, Marta Torres, Rita Redondo, Teresa Mayordomo, and Alicia Sales. 2017. Effectiveness of follow-up reminiscence therapy on autobiographical memory in pathological ageing. International Journal of Psychology 52, 4 (2017), 283–290. DOI:https://doi.org/10.1002/ijop.12217",
      "doi": ""
    },
    {
      "text": "Maurice Mulvenna, Laura Doyle, Terence Wright, H. Zheng, Pamela Topping, Karl Boyle, and Suzanne Martin. 2011. Evaluation of card-based versus device-based reminiscing using photographic images. JCR 4, 1 (March 2011), 57–66.",
      "doi": ""
    },
    {
      "text": "Yuki Orii, Takayuki Nozawa, and Toshiyuki Kondo. 2009. Intelligent Photo Management System Enhancing Browsing Experience. In Symposium on Human Interface, Springer, 439–447. DOI:https://doi.org/10.1007/978-3-642-02559-4_48",
      "doi": "10.1007/978-3-642-02559-4_48"
    },
    {
      "text": "BILL RANDALL. 2012. 11 Beyond Healthy Aging: The Practice of Narrative Care in Gerontology. Adult education and health (2012).",
      "doi": ""
    },
    {
      "text": "Nelson A. Roque and Walter R. Boot. 2018. A new tool for assessing mobile device proficiency in older adults: the mobile device proficiency questionnaire. Journal of Applied Gerontology 37, 2 (2018), 131–156. DOI:https://doi.org/10.1177/0733464816642582",
      "doi": ""
    },
    {
      "text": "Kenneth J. Rothman. 1990. No adjustments are needed for multiple comparisons. Epidemiology (1990), 43–46.",
      "doi": ""
    },
    {
      "text": "Risto Sarvas and David A. Frohlich. 2011. From Snapshots to Social Media - The Changing Picture of Domestic Photography. Springer, London.",
      "doi": "10.5555/1972512"
    },
    {
      "text": "Risto Sarvas and David A. Frohlich. 2011. The Future of Domestic Photography. In From Snapshots to Social Media - The Changing Picture of Domestic Photography. Springer, London, 139–177.",
      "doi": "10.5555/1972512"
    },
    {
      "text": "Dave J. Saville. 1990. Multiple comparison procedures: the practical solution. The American Statistician 44, 2 (1990), 174–180. DOI:https://doi.org/10.1080/00031305.1990.10475712",
      "doi": ""
    },
    {
      "text": "Diane J. Schiano, Coreena P. Chen, and Ellen Isaacs. 2002. How teens take, view, share, and store photos. CSCW Interactive Poster (2002).",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Oliver L. Haimson, and Danielle Lottridge. 2019. How to do better with gender on surveys: a guide for HCI researchers. Interactions 26, 4 (2019), 62–65. DOI:https://doi.org/10.1145/3338283",
      "doi": "10.1145/3338283"
    },
    {
      "text": "Strategy Analytics. 2005. Camera Phone Sales Surge to 257 Million Units Worldwide in 2004. Strategy Analytics. Retrieved August 27, 2021 from https://www4.strategyanalytics.com/default.aspx?mod=pressreleaseviewer&a0=2354",
      "doi": ""
    },
    {
      "text": "Elizabeth Thiry and Mary Beth Rosson. 2012. Unearthing the family gems: design requirements for a digital reminiscing system for older adults. In CHI’12 Extended Abstracts on Human Factors in Computing Systems, ACM, 1715–1720. DOI:https://doi.org/10.1145/2212776.2223698",
      "doi": ""
    },
    {
      "text": "Steve Whittaker, Ofer Bergman, and Paul Clough. 2010. Easy on that trigger dad: a study of long term family photo retrieval. Personal and Ubiquitous Computing 14, 1 (2010), 31–43. DOI:https://doi.org/10.1007/s00779-009-0218-7",
      "doi": "10.1007/s00779-009-0218-7"
    },
    {
      "text": "Karen Willoughby, Mary Desrocher, Brian Levine, and Joanne Rovet. 2012. Episodic and Semantic Autobiographical Memory and Everyday Memory during Late Childhood and Early Adolescence. Frontiers in Psychology 3, (2012), 53. DOI:https://doi.org/10.3389/fpsyg.2012.00053",
      "doi": ""
    }
  ]
}