{
  "doi": "10.1145/3491102.3502064",
  "title": "Varv: Reprogrammable Interactive Software as a Declarative Data Structure",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2022,
  "badges": [],
  "abstract": "Most modern applications are immutable and turn-key despite the acknowledged benefits of empowering users to modify their software. Writing extensible software remains challenging, even for expert programmers. Reprogramming or extending existing software is often laborious or wholly blocked, requiring sophisticated knowledge of application architecture or setting up a development environment. We present Varv, a programming model representing reprogrammable interactive software as a declarative data structure. Varv defines interactive applications as a set of concepts that consist of a schema and actions. Applications in Varv support incremental modification, allowing users to reprogram through addition and selectively suppress, modify, or add behavior. Users can define high-level concepts, creating an abstraction layer and effectively a domain-specific language for their application domain, emphasizing reuse and modification. We demonstrate the reprogramming and collaboration capabilities of Varv in two case studies and illustrate how the event engine allows for extensive tooling support.",
  "tags": [
    "liveness",
    "real-time collaboration",
    "reprogramming",
    "declarative programming",
    "interactive software"
  ],
  "authors": [
    {
      "name": "Marcel Borowski",
      "institution": "Department of Computer Science, Aarhus University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260347",
      "orcid": "missing"
    },
    {
      "name": "Luke Murray",
      "institution": "CSAIL, MIT, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365176",
      "orcid": "missing"
    },
    {
      "name": "Rolf Bagge",
      "institution": "CAVI, Aarhus University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658655449",
      "orcid": "missing"
    },
    {
      "name": "Janus Bager Kristensen",
      "institution": "CAVI, Aarhus University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658658013",
      "orcid": "missing"
    },
    {
      "name": "Arvind Satyanarayan",
      "institution": "CSAIL, MIT, United States",
      "img": "/do/10.1145/contrib-81500663321/rel-imgonly/arvind-satyanarayan.jpg",
      "acmid": "81500663321",
      "orcid": "0000-0001-5564-635X"
    },
    {
      "name": "Clemens Nylandsted Klokmose",
      "institution": "Department of Computer Science, Aarhus University, Denmark",
      "img": "/do/10.1145/contrib-81350594070/rel-imgonly/clemensikon.jpg",
      "acmid": "81350594070",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Daniel J. Abadi, Don Carney, Ugur Çetintemel, Mitch Cherniack, Christian Convey, Sangdon Lee, Michael Stonebraker, Nesime Tatbul, and Stan Zdonik. 2003. Aurora: a new model and architecture for data stream management. The VLDB Journal—The International Journal on Very Large Data Bases 12, 2(2003), 120–139. https://doi.org/10.1007/s00778-003-0095-z",
      "doi": ""
    },
    {
      "text": "Felipe I. Anfurrutia, Oscar Díaz, and Salvador Trujillo. 2007. On Refining XML Artifacts. In Web Engineering(Lecture Notes in Computer Science), Luciano Baresi, Piero Fraternali, and Geert-Jan Houben (Eds.). Springer, Berlin, Heidelberg, 473–478. https://doi.org/10.1007/978-3-540-73597-7_39",
      "doi": ""
    },
    {
      "text": "Sven Apel and Christian Kästner. 2009. An Overview of Feature-Oriented Software Development.The Journal of Object Technology 8, 5 (2009). https://doi.org/10.5381/jot.2009.8.5.c5",
      "doi": ""
    },
    {
      "text": "Sven Apel, Christian Kastner, and Christian Lengauer. 2009. FEATUREHOUSE: Language-Independent, Automated Software Composition. In 2009 IEEE 31st International Conference on Software Engineering. 221–231. https://doi.org/10.1109/ICSE.2009.5070523",
      "doi": "10.1109/ICSE.2009.5070523"
    },
    {
      "text": "Sven Apel, Thomas Leich, Marko Rosenmüller, and Gunter Saake. 2005. FeatureC++: Feature-Oriented and Aspect-Oriented Programming in C. Technical Report.",
      "doi": ""
    },
    {
      "text": "Arvind Arasu, Brian Babcock, Shivnath Babu, John Cieslewicz, Mayur Datar, Keith Ito, Rajeev Motwani, Utkarsh Srivastava, and Jennifer Widom. 2004. STREAM: The Stanford Data Stream Management System. Technical Report 2004-20. Stanford InfoLab. http://ilpubs.stanford.edu:8090/641/",
      "doi": ""
    },
    {
      "text": "Antranig Basman, Clayton Lewis, and Colin Clark. 2018. The Open Authorial Principle: Supporting Networks of Authors in Creating Externalisable Designs. In Proceedings of the 2018 ACM SIGPLAN International Symposium on New Ideas, New Paradigms, and Reflections on Programming and Software (Boston, MA, USA) (Onward! 2018). Association for Computing Machinery, New York, NY, USA, 29–43. https://doi.org/10.1145/3276954.3276963",
      "doi": "10.1145/3276954.3276963"
    },
    {
      "text": "Don Batory, Jacob Neal Sarvela, and Axel Rauschmayer. 2004. Scaling Step-Wise Refinement. IEEE Transactions on Software Engineering 30, 6 (2004), 355–371. https://doi.org/10.1109/TSE.2004.23",
      "doi": "10.1109/TSE.2004.23"
    },
    {
      "text": "Michel Beaudouin-Lafon. 2000. Instrumental Interaction: An Interaction Model for Designing Post-WIMP User Interfaces. In Proceedings of the 18th international conference on Human factors in computing systems. https://doi.org/10.1145/332040.332473",
      "doi": "10.1145/332040.332473"
    },
    {
      "text": "Michel Beaudouin-Lafon and Wendy E. Mackay. 2000. Reification, Polymorphism and Reuse: Three Principles for Designing Visual Interfaces. In Proceedings of the working conference on advanced visual interfaces. https://doi.org/10.1145/345513.345267",
      "doi": "10.1145/345513.345267"
    },
    {
      "text": "Edward Benson, Amy X. Zhang, and David R. Karger. 2014. Spreadsheet Driven Web Applications. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology. ACM, Honolulu Hawaii USA, 97–106. https://doi.org/10.1145/2642918.2647387",
      "doi": "10.1145/2642918.2647387"
    },
    {
      "text": "Alan F. Blackwell, Carol Britton, Anna Cox, Thomas R. G. Green, Corin Gurr, Gada Kadoda, Maria S. Kutar, Martin Loomes, Chrystopher L. Nehaniv, Marian Petre, 2001. Cognitive Dimensions of Notations: Design Tools for Cognitive Technology. In International Conference on Cognitive Technology. Springer, 325–341. https://doi.org/10.1007/3-540-44617-6_31",
      "doi": ""
    },
    {
      "text": "Marcel Borowski, Janus Bager Kristensen, Rolf Bagge, and Clemens N. Klokmose. 2021. Codestrates v2: A Development Platform for Webstrates. Technical Report. Aarhus University. https://pure.au.dk/portal/en/publications/codestrates-v2-a-development-platform-for-webstrates(66e1d4d9-27da-4f6b-85b3-19b0993caf22).html",
      "doi": ""
    },
    {
      "text": "Mahil Carr. 1997. Prototyping and Software Development Approaches. (1997).",
      "doi": ""
    },
    {
      "text": "Stefano Ceri, Piero Fraternali, and Aldo Bongio. 2000. Web Modeling Language (WebML): A Modeling Language for Designing Web Sites. Computer Networks 33, 1-6 (June 2000), 137–157. https://doi.org/10.1016/S1389-1286(00)00040-2",
      "doi": "10.1016/S1389-1286%2800%2900040-2"
    },
    {
      "text": "Kerry Shih-Ping Chang and Brad A. Myers. 2014. Creating Interactive Web Data Applications with Spreadsheets. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology(UIST ’14). Association for Computing Machinery, New York, NY, USA, 87–96. https://doi.org/10.1145/2642918.2647371",
      "doi": "10.1145/2642918.2647371"
    },
    {
      "text": "Biplab Deka, Zifeng Huang, Chad Franzen, Joshua Hibschman, Daniel Afergan, Yang Li, Jeffrey Nichols, and Ranjitha Kumar. 2017. Rico: A Mobile App Dataset for Building Data-Driven Design Applications. In Proceedings of the 30th Annual Symposium on User Interface Software and Technology(UIST ’17). https://doi.org/10.1145/3126594.3126651",
      "doi": "10.1145/3126594.3126651"
    },
    {
      "text": "Biplab Deka, Zifeng Huang, and Ranjitha Kumar. 2016. ERICA: Interaction Mining Mobile Apps. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). ACM, New York, NY, USA, 767–776. https://doi.org/10.1145/2984511.2984581",
      "doi": "10.1145/2984511.2984581"
    },
    {
      "text": "Donghua Deng, Guigang Zhang, ZhiYuan Gong, Zonglin Guo, and Phillip C-y Sheu. 2008. Semantic Programming of Web-Enabled Database Applications. In 2008 IEEE International Workshop on Semantic Computing and Applications. 51–60. https://doi.org/10.1109/IWSCA.2008.24",
      "doi": ""
    },
    {
      "text": "Facebook Inc.2021. Virtual DOM and Internals – React. Retrieved November 25, 2021 from https://reactjs.org/docs/faq-internals.html",
      "doi": ""
    },
    {
      "text": "Mary Fernandez, Daniela Florescu, Alon Levy, and Dan Suciu. 2000. Declarative Specification of Web Sites with Strudel. (2000). https://doi.org/10.1007/s007780050082",
      "doi": ""
    },
    {
      "text": "Figma Inc.2021. Figma. Retrieved November 25, 2021 from https://www.figma.com",
      "doi": ""
    },
    {
      "text": "J. Nathan Foster, Michael B. Greenwald, Jonathan T. Moore, Benjamin C. Pierce, and Alan Schmitt. 2007. Combinators for Bidirectional Tree Transformations: A Linguistic Approach to the View-Update Problem. ACM Transactions on Programming Languages and Systems (TOPLAS) 29, 3(2007). https://doi.org/10.1145/1232420.1232424",
      "doi": "10.1145/1232420.1232424"
    },
    {
      "text": "Amy Rae Fox, Philip Guo, Clemens Nylandsted Klokmose, Peter Dalsgaard, Arvind Satyanarayan, Haijun Xia, and James D Hollan. 2020. Towards a Dynamic Multiscale Personal Information Space: Beyond Application and Document Centered Views of Information. In Conference Companion of the 4th International Conference on Art, Science, and Engineering of Programming. 136–143. https://doi.org/10.1145/3397537.3397542",
      "doi": "10.1145/3397537.3397542"
    },
    {
      "text": "Piero Fraternali and Paolo Paolini. 2000. Model-Driven Development of Web Applications: The AutoWeb System. ACM Transactions on Information Systems 28, 4 (2000). https://doi.org/10.1145/358108.358110",
      "doi": ""
    },
    {
      "text": "Google LLC. 2021. Blockly. Retrieved November 25, 2021 from https://developers.google.com/blockly",
      "doi": ""
    },
    {
      "text": "Mona Haraty, Joanna McGrenere, and Andrea Bunt. 2017. Online Customization Sharing Ecosystems: Components, Roles, and Motivations. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 2359–2371. https://doi.org/10.1145/2998181.2998289",
      "doi": "10.1145/2998181.2998289"
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Declarative Language Design for Interactive Visualization. IEEE Transactions on Visualization and Computer Graphics 16, 6 (Nov. 2010), 1149–1156. https://doi.org/10.1109/TVCG.2010.144",
      "doi": "10.1109/TVCG.2010.144"
    },
    {
      "text": "Martin Hofmann, Benjamin Pierce, and Daniel Wagner. 2011. Symmetric Lenses. ACM SIGPLAN Notices 46, 1 (2011), 371–384. https://doi.org/10.1145/1926385.1926428",
      "doi": "10.1145/1925844.1926428"
    },
    {
      "text": "Martin Hofmann, Benjamin Pierce, and Daniel Wagner. 2012. Edit Lenses. In Proceedings of the 39th annual ACM SIGPLAN-SIGACT symposium on Principles of programming languages. 495–508. https://doi.org/10.1145/2103656.2103715",
      "doi": ""
    },
    {
      "text": "Jim Hollan and Arvind Satyanarayan. 2018. Designing Cognitively Convivial Physics for Dynamic Visual Information Substrates. In CHI 2018 Workshop on Rethinking Interaction: From Instrumental Interaction to Human-Computer Partnerships. http://vis.csail.mit.edu/pubs/towards-cognitively-convivial-info-physics",
      "doi": ""
    },
    {
      "text": "Daniel Jackson. 2015. Towards a Theory of Conceptual Design for Software. In 2015 ACM International Symposium on New Ideas, New Paradigms, and Reflections on Programming and Software (Onward!) (Pittsburgh, PA, USA) (Onward! 2015). Association for Computing Machinery, New York, NY, USA, 282–296. https://doi.org/10.1145/2814228.2814248",
      "doi": "10.1145/2814228.2814248"
    },
    {
      "text": "Daniel Jackson. 2021. The Essence of Software: Why Concepts Matter for Great Design.Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Szymon Kaliski, Adam Wiggins, and James Lindenbaum. 2019. End-User Programming. Retrieved November 25, 2021 from https://www.inkandswitch.com/end-user-programming.html",
      "doi": ""
    },
    {
      "text": "Christian Kästner, Sven Apel, and Martin Kuhlemann. 2008. Granularity in Software Product Lines. In 2008 ACM/IEEE 30th International Conference on Software Engineering. 311–320. https://doi.org/10.1145/1368088.1368131",
      "doi": ""
    },
    {
      "text": "Christian Kästner, Thomas Thum, Gunter Saake, Janet Feigenspan, Thomas Leich, Fabian Wielgorz, and Sven Apel. 2009. FeatureIDE: A Tool Framework for Feature-Oriented Software Development. In 2009 IEEE 31st International Conference on Software Engineering. 611–614. https://doi.org/10.1109/ICSE.2009.5070568",
      "doi": ""
    },
    {
      "text": "Alan Kay and Adele Goldberg. 1977. Personal Dynamic Media. Computer 10, 3 (March 1977), 31–41. https://doi.org/10.1109/C-M.1977.217672",
      "doi": "10.1109/C-M.1977.217672"
    },
    {
      "text": "Gregor Kiczales, Erik Hilsdale, Jim Hugunin, Mik Kersten, Jeffrey Palm, and William G. Griswold. 2001. An Overview of AspectJ. In ECOOP 2001 — Object-Oriented Programming(Lecture Notes in Computer Science), Jørgen Lindskov Knudsen (Ed.). Springer, Berlin, Heidelberg, 327–354. https://doi.org/10.1007/3-540-45337-7_18",
      "doi": ""
    },
    {
      "text": "Eugen Kiss. 2021. 7GUIs. Retrieved November 25, 2021 from https://eugenkiss.github.io/7guis/",
      "doi": ""
    },
    {
      "text": "Martin Kleppmann. 2017. Designing Data-Intensive Applications: The Big Ideas Behind Reliable, Scalable, and Maintainable Systems (1st edition ed.). O’Reilly Media, Boston.",
      "doi": ""
    },
    {
      "text": "Clemens N. Klokmose, James R. Eagan, Siemen Baader, Wendy E. Mackay, and Michel Beaudouin-Lafon. 2015. Webstrates: Shareable Dynamic Media. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology. https://doi.org/10.1145/2807442.2807446",
      "doi": "10.1145/2807442.2807446"
    },
    {
      "text": "Amy J. Ko, Robin Abraham, Laura Beckwith, Alan Blackwell, Margaret Burnett, Martin Erwig, Chris Scaffidi, Joseph Lawrance, Henry Lieberman, Brad Myers, Mary Beth Rosson, Gregg Rothermel, Mary Shaw, and Susan Wiedenbeck. 2011. The State of the Art in End-User Software Engineering. Comput. Surveys 43, 3 (April 2011), 1–44. https://doi.org/10.1145/1922649.1922658",
      "doi": "10.1145/1922649.1922658"
    },
    {
      "text": "Butler Lampson. 2020. Hints and Principles for Computer System Design. (2020).",
      "doi": ""
    },
    {
      "text": "David Ledo, Steven Houben, Jo Vermeulen, Nicolai Marquardt, Lora Oehlberg, and Saul Greenberg. 2018. Evaluation Strategies for HCI Toolkit Research. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3173574.3173610",
      "doi": "10.1145/3173574.3173610"
    },
    {
      "text": "Geoffrey Litt, Peter van Hardenberg, and Orion Henry. 2021. Cambria: Schema Evolution in Distributed Systems with Edit Lenses. In Proceedings of the 8th Workshop on Principles and Practice of Consistency for Distributed Data. https://doi.org/10.1145/3447865.3457963",
      "doi": "10.1145/3447865.3457963"
    },
    {
      "text": "Geoffrey Litt and Daniel Jackson. 2020. Wildcard: Spreadsheet-Driven Customization of Web Applications. In Conference Companion of the 4th International Conference on Art, Science, and Engineering of Programming(Porto, Portugal) (<programming> ’20). Association for Computing Machinery, New York, NY, USA, 126–135. https://doi.org/10.1145/3397537.3397541",
      "doi": ""
    },
    {
      "text": "Geoffrey Litt, Daniel Jackson, Tyler Millis, and Jessica Quaye. 2020. End-User Software Customization by Direct Manipulation of Tabular Data. In Proceedings of the 2020 ACM SIGPLAN International Symposium on New Ideas, New Paradigms, and Reflections on Programming and Software (Virtual, USA) (Onward! 2020). Association for Computing Machinery, New York, NY, USA, 18–33. https://doi.org/10.1145/3426428.3426914",
      "doi": "10.1145/3426428.3426914"
    },
    {
      "text": "Geoffrey Litt, Peter van Hardenberg, and Orion Henry. 2020. Project Cambria: Translate your data with lenses. Retrieved November 25, 2021 from https://www.inkandswitch.com/cambria.html",
      "doi": ""
    },
    {
      "text": "Cristina Videira Lopes. 2020. Exercises in Programming Style(second edition ed.). CRC Press, Boca Raton.",
      "doi": ""
    },
    {
      "text": "Matt McCutchen, Shachar Itzhaky, and Daniel Jackson. 2016. Object Spreadsheets: A New Computational Model for End-User Development of Data-Centric Web Applications. In Proceedings of the 2016 ACM International Symposium on New Ideas, New Paradigms, and Reflections on Programming and Software. ACM, Amsterdam Netherlands, 112–127. https://doi.org/10.1145/2986012.2986018",
      "doi": "10.1145/2986012.2986018"
    },
    {
      "text": "Michael J. McGuffin and Christopher P. Fuhrman. 2020. Categories and Completeness of Visual Programming and Direct Manipulation. In Proceedings of the International Conference on Advanced Visual Interfaces (Salerno, Italy) (AVI ’20). Association for Computing Machinery, New York, NY, USA, Article 7. https://doi.org/10.1145/3399715.3399821",
      "doi": ""
    },
    {
      "text": "Douglas M. Mcllroy. 1968. Mass-Produced Software Components. Proceedings of the 1st International Conference on Software Engineering (1968), 88–98.",
      "doi": ""
    },
    {
      "text": "MDN Contributors. 2021. Array.prototype.map() - JavaScript | MDN. Retrieved November 25, 2021 from https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/map",
      "doi": ""
    },
    {
      "text": "MDN Contributors. 2021. Template Literals (Template Strings) - JavaScript | MDN. Retrieved November 25, 2021 from https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Template_literals",
      "doi": ""
    },
    {
      "text": "Giansalvatore Mecca, Paolo Atzeni, Alessandro Masci, Giuseppe Sindoni, and Paolo Merialdo. 1998. The Araneus Web-Based Management System. SIGMOD Rec. 27, 2 (jun 1998), 544–546. https://doi.org/10.1145/276305.276375",
      "doi": "10.1145/276305.276375"
    },
    {
      "text": "Midas Nouwens and Clemens Nylandsted Klokmose. 2021. A Survey of Digital Working Conditions of Danish Knowledge Workers. In Proceedings of 19th European Conference on Computer-Supported Cooperative Work. European Society for Socially Embedded Technologies (EUSSET). https://doi.org/10.18420/ecscw2021_n24",
      "doi": ""
    },
    {
      "text": "Observable, Inc.2021. Observable. Retrieved November 25, 2021 from https://observablehq.com",
      "doi": ""
    },
    {
      "text": "Yoshiki Ohshima, Aran Lunzer, Bert Freudenberg, and Ted Kaehler. 2013. KScript and KSWorld: A Time-Aware and Mostly Declarative Language and Interactive GUI Framework. In Proceedings of the 2013 ACM International Symposium on New Ideas, New Paradigms, and Reflections on Programming & Software. 117–134. https://doi.org/10.1145/2509578.2509590",
      "doi": "10.1145/2509578.2509590"
    },
    {
      "text": "Dan R. Olsen. 2007. Evaluating User Interface Systems Research. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (Newport, Rhode Island, USA) (UIST ’07). Association for Computing Machinery, New York, NY, USA, 251–258. https://doi.org/10.1145/1294211.1294256",
      "doi": "10.1145/1294211.1294256"
    },
    {
      "text": "OpenJS Foundation. 2021. Electron. Retrieved November 25, 2021 from https://www.electronjs.org",
      "doi": ""
    },
    {
      "text": "Santiago Perez De Rosso, Daniel Jackson, Maryam Archie, Czarina Lao, and Barry A. McNamara III. 2019. Declarative Assembly of Web Applications from Predefined Concepts. In Proceedings of the 2019 ACM SIGPLAN International Symposium on New Ideas, New Paradigms, and Reflections on Programming and Software (Athens, Greece) (Onward! 2019). Association for Computing Machinery, New York, NY, USA, 79–93. https://doi.org/10.1145/3359591.3359728",
      "doi": "10.1145/3359591.3359728"
    },
    {
      "text": "Felipe Pezoa, Juan L. Reutter, Fernando Suarez, Martín Ugarte, and Domagoj Vrgoč. 2016. Foundations of JSON Schema. In Proceedings of the 25th International Conference on World Wide Web (Montréal, Québec, Canada) (WWW ’16). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, CHE, 263–273. https://doi.org/10.1145/2872427.2883029",
      "doi": ""
    },
    {
      "text": "Ian Piumarta and Kimberly Rose. 2010. Points of View: A Tribute to Alan Kay. Viewpoints Research Institute, Glendale, Calif.",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan and Jeffrey Heer. 2014. Lyra: An Interactive Visualization Design Environment. Computer Graphics Forum 33, 3 (2014), 351–360. https://doi.org/10.1111/cgf.12391",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2017. Vega-Lite: A Grammar of Interactive Graphics. IEEE Transactions on Visualization and Computer Graphics 23, 1(2017), 341–350. https://doi.org/10.1109/TVCG.2016.2599030",
      "doi": "10.1109/TVCG.2016.2599030"
    },
    {
      "text": "Arvind Satyanarayan, Ryan Russell, Jane Hoffswell, and Jeffrey Heer. 2016. Reactive Vega: A Streaming Dataflow Architecture for Declarative Interactive Visualization. IEEE Transactions on Visualization and Computer Graphics 22, 1(2016), 659–668. https://doi.org/10.1109/TVCG.2015.2467091",
      "doi": "10.1109/TVCG.2015.2467091"
    },
    {
      "text": "Arvind Satyanarayan, Kanit Wongsuphasawat, and Jeffrey Heer. 2014. Declarative Interaction Design for Data Visualization. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (Honolulu, Hawaii, USA) (UIST ’14). Association for Computing Machinery, New York, NY, USA, 669–678. https://doi.org/10.1145/2642918.2647360",
      "doi": "10.1145/2642918.2647360"
    },
    {
      "text": "Kesler Tanner. 2019. Visual Design Tools in Support of Novice Creativity. Stanford University.",
      "doi": ""
    },
    {
      "text": "TodoMVC. 2021. TodoMVC. Retrieved November 25, 2021 from http://todomvc.com",
      "doi": ""
    },
    {
      "text": "Jacob VanderPlas, Brian Granger, Jeffrey Heer, Dominik Moritz, Kanit Wongsuphasawat, Arvind Satyanarayan, Eitan Lees, Ilia Timofeev, Ben Welsh, and Scott Sievert. 2018. Altair: Interactive Statistical Visualizations for Python. Journal of Open Source Software 3, 32 (Dec. 2018). https://doi.org/10.21105/joss.01057",
      "doi": ""
    },
    {
      "text": "Lea Verou, Amy X. Zhang, and David R. Karger. 2016. Mavo: Creating Interactive Data-Driven Web Applications by Authoring HTML. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 483–496. https://doi.org/10.1145/2984511.2984551",
      "doi": "10.1145/2984511.2984551"
    },
    {
      "text": "Kanit Wongsuphasawat, Dominik Moritz, Anushka Anand, Jock Mackinlay, Bill Howe, and Jeffrey Heer. 2016. Voyager: Exploratory Analysis via Faceted Browsing of Visualization Recommendations. IEEE Transactions on Visualization and Computer Graphics 22, 1 (Jan. 2016), 649–658. https://doi.org/10.1109/TVCG.2015.2467191",
      "doi": "10.1109/TVCG.2015.2467191"
    },
    {
      "text": "Jonathan Zong, Dhiraj Barnwal, Rupayan Neogy, and Arvind Satyanarayan. 2020. Lyra 2: Designing Interactive Visualizations by Demonstration. IEEE Transactions on Visualization and Computer Graphics 27, 2(2020), 304–314. https://doi.org/10.1109/TVCG.2020.3030367",
      "doi": ""
    }
  ]
}