{
  "doi": "10.1145/3491102.3517646",
  "title": "”It Matches My Worldview”: Examining Perceptions and Attitudes Around Fake Videos",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "We present a qualitative study with 36 diverse social media users in India to critically examine how low-resource communities engage with fake videos, including cheapfakes and AI-generated deepfakes. We find that most users are unaware of digitally manipulated fake videos and perceive videos to be fake only when they present inaccurate information. Few users who know about doctored videos expect them to be of poor quality and know nothing about sophisticated deepfakes. Moreover, most users lack the skills and willingness to spot fake videos and some were oblivious to the risks and harms of fake videos. Even when users know a video to be fake, they prefer to take no action and sometimes willingly share fake videos that favor their worldview. Drawing on our findings, we discuss design recommendations for social media platforms to curb the spread of fake videos.",
  "authors": [
    {
      "name": "Farhana Shahid",
      "institution": "Information Science, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659463299",
      "orcid": "0000-0003-3004-7099"
    },
    {
      "name": "Srujana Kamath",
      "institution": "Independent Researcher, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701258",
      "orcid": "missing"
    },
    {
      "name": "Annie Sidotam",
      "institution": "N. Godrej Foundation for Education, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660232916",
      "orcid": "missing"
    },
    {
      "name": "Vivian Jiang",
      "institution": "Computer Science, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239446",
      "orcid": "missing"
    },
    {
      "name": "Alexa Batino",
      "institution": "Computer Science, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235668",
      "orcid": "missing"
    },
    {
      "name": "Aditya Vashistha",
      "institution": "Cornell University, United States",
      "img": "/do/10.1145/contrib-81474703745/rel-imgonly/aditya-vashistha_2_orig.jpg",
      "acmid": "81474703745",
      "orcid": "0000-0001-5693-3326"
    }
  ],
  "references": [
    {
      "text": "Adobe. 2021. Adobe After Effects. Retrieved 2021-09-08 from https://www.adobe.com/products/aftereffects.html",
      "doi": ""
    },
    {
      "text": "Shruti Agarwal, Tarek El-Gaaly, Hany Farid, and Ser-Nam Lim. 2020. Detecting Deep-Fake Videos from Appearance and Behavior. CoRR abs/2004.14491(2020), 12 pages. https://arxiv.org/abs/2004.14491",
      "doi": ""
    },
    {
      "text": "Saifuddin Ahmed. 2021. Navigating the maze: Deepfakes, cognitive ability, and social media news skepticism. New Media & Society 0, 0 (2021), 1–22.",
      "doi": ""
    },
    {
      "text": "Saifuddin Ahmed. 2021. Who inadvertently shares deepfakes? Analyzing the role of political interest, cognitive ability, and social network size. Telematics and Informatics 57 (2021), 101508. https://doi.org/10.1016/j.tele.2020.101508",
      "doi": ""
    },
    {
      "text": "Syeda Zainab Akbar, Anmol Panda, Divyanshu Kukreti, Azhagu Meena, and Joyojeet Pal. 2021. Misinformation as a Window into Prejudice: COVID-19 and the Information Environment in India. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–28.",
      "doi": "10.1145/3432948"
    },
    {
      "text": "Yusuf Albayram, Mohammad Maifi Hasan Khan, and Michael Fagan. 2017. A Study on Designing Video Tutorials for Promoting Security Features: A Case Study in the Context of Two-Factor Authentication (2FA). International Journal of Human–Computer Interaction 33, 11(2017), 927–942.",
      "doi": ""
    },
    {
      "text": "Jussara Almeida. 2019. Misinformation Dissemination on the Web. In Companion Proceedings of The 2019 World Wide Web Conference (San Francisco, USA) (WWW ’19). Association for Computing Machinery, New York, NY, USA, 740.",
      "doi": ""
    },
    {
      "text": "Ahmer Arif, John J. Robinson, Stephanie A. Stanek, Elodie S. Fichet, Paul Townsend, Zena Worku, and Kate Starbird. 2017. A Closer Look at the Self-Correcting Crowd: Examining Corrections in Online Rumors. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 155–168.",
      "doi": "10.1145/2998181.2998294"
    },
    {
      "text": "Shakuntala Banaji, Ramnath Bhat, Anushi Agarwal, Nihal Passanha, and Mukti Sadhana Pravin. 2019. WhatsApp vigilantes: An exploration of citizen reception and circulation of WhatsApp misinformation linked to mob violence in India., 62 pages.",
      "doi": ""
    },
    {
      "text": "Arthur Asa Berger. 1989. Seeing Is Believing: An Introduction to Visual Communication. Mayfield Publishing Company, , 1240 Villa Street, Mountain View, CA 94041.",
      "doi": ""
    },
    {
      "text": "Alessandro Bessi, Fabio Petroni, Michela Del Vicario, Fabiana Zollo, Aris Anagnostopoulos, Antonio Scala, Guido Caldarelli, and Walter Quattrociocchi. 2015. Viral Misinformation: The Role of Homophily and Polarization. In Proceedings of the 24th International Conference on World Wide Web (Florence, Italy) (WWW ’15 Companion). Association for Computing Machinery, New York, NY, USA, 355–356.",
      "doi": "10.1145/2740908.2745939"
    },
    {
      "text": "Ananya Bhattacharya. 2017. India’s internet users have more faith in content that’s not in English. Retrieved 2021-09-07 from https://qz.com/india/972844/indias-internet-users-have-more-faith-in-content-thats-not-in-english-study-says/",
      "doi": ""
    },
    {
      "text": "Md Momen Bhuiyan, Michael Horning, Sang Won Lee, and Tanushree Mitra. 2021. NudgeCred: Supporting News Credibility Assessment on Social Media Through Nudges. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 427 (oct 2021), 30 pages.",
      "doi": "10.1145/3479571"
    },
    {
      "text": "Linda Birt, Suzanne Scott, Debbie Cavers, Christine Campbell, and Fiona Walter. 2016. Member Checking: A Tool to Enhance Trustworthiness or Merely a Nod to Validation?Qualitative Health Research 26, 13 (2016), 1802–1811.",
      "doi": ""
    },
    {
      "text": "Porismita Borah and Xizhu Xiao. 2018. The Importance of ‘Likes’: The Interplay of Message Framing, Source, and Social Endorsement on Credibility Perceptions of Health Information on Facebook. Journal of Health Communication 23, 4 (2018), 399–411.",
      "doi": ""
    },
    {
      "text": "Joel Breakstone, Mark Smith, Sam Wineburg, Amie Rapaport, Jill Carle, Marshall Garland, and Anna Saavedra. 2019. Students’ civic online reasoning: A national portrait., 49 pages.",
      "doi": ""
    },
    {
      "text": "Joel Breakstone, Mark Smith, Sam Wineburg, Amie Rapaport, Jill Carle, Marshall Garland, and Anna Saavedra. 2021. Students’ Civic Online Reasoning: A National Portrait. Educational Researcher 0, 0 (2021), 49.",
      "doi": ""
    },
    {
      "text": "Catherine Francis Brooks. 2021. Popular discourse around deepfakes and the interdisciplinary challenge of fake video distribution. Cyberpsychology, Behavior, and Social Networking 24, 3(2021), 159–163.",
      "doi": ""
    },
    {
      "text": "Matt Burgess. 2020. Deepfake porn is now mainstream. And major sites are cashing in. https://www.wired.co.uk/article/deepfake-porn-websites-videos-law",
      "doi": ""
    },
    {
      "text": "Joseph N Cappella, Hyun Suk Kim, and Dolores Albarracín. 2015. Selection and transmission processes for information in the emerging media environment: Psychological motives and message characteristics. Media psychology 18, 3 (2015), 396–424.",
      "doi": ""
    },
    {
      "text": "Facebook Help Center. 2020. What happens when I report something to Facebook? Does the person I report get notified?Retrieved 2021-09-08 from https://www.facebook.com/help/1037960630447342",
      "doi": ""
    },
    {
      "text": "Priyank Chandra and Joyojeet Pal. 2019. Rumors and Collective Sensemaking: Managing Ambiguity in an Informal Marketplace. Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": ""
    },
    {
      "text": "Apoorva Chauhan and Amanda Lee Hughes. 2020. Trustworthiness Perceptions of Social Media Resources Named after a Crisis Event. Proc. ACM Hum.-Comput. Interact. 4, CSCW1, Article 044 (2020), 23 pages.",
      "doi": "10.1145/3392849"
    },
    {
      "text": "Jay Chen, Michael Paik, and Kelly McCabe. 2014. Exploring Internet Security Perceptions and Practices in Urban Ghana. In 10th Symposium On Usable Privacy and Security (SOUPS 2014). USENIX Association, Menlo Park, CA, 129–142.",
      "doi": ""
    },
    {
      "text": "Xinran Chen and Sei-Ching Joanna Sin. 2013. ’Misinformation? What of It?’: Motivations and Individual Differences in Misinformation Sharing on Social Media. In Proceedings of the 76th ASIS&T Annual Meeting: Beyond the Cloud: Rethinking Information Boundaries (Montreal, Quebec, Canada) (ASIST ’13). American Society for Information Science, USA, Article 104, 4 pages.",
      "doi": ""
    },
    {
      "text": "Xinran Chen, Sei-Ching Joanna Sin, Yin-Leng Theng, and Chei Sian Lee. 2015. Why Do Social Media Users Share Misinformation?. In Proceedings of the 15th ACM/IEEE-CS Joint Conference on Digital Libraries (Knoxville, Tennessee, USA) (JCDL ’15). Association for Computing Machinery, New York, NY, USA, 111–114.",
      "doi": "10.1145/2756406.2756941"
    },
    {
      "text": "Tom Chivers. 2019. What’s next for psychology’s embattled field of social priming. Retrieved 2021-09-08 from https://www.nature.com/articles/d41586-019-03755-2",
      "doi": ""
    },
    {
      "text": "Amit Chowdhry. 2019. Study: Relevant Video Content Drives More Engagement And Revenue. Retrieved 2021-09-06 from https://www.forbes.com/sites/splunk/2021/09/01/why-you-should-still-care-about-malware-and-what-to-do-about-it-now/?sh=6357ab965394",
      "doi": ""
    },
    {
      "text": "Komal Chugh, Parul Gupta, Abhinav Dhall, and Ramanathan Subramanian. 2020. Not Made for Each Other- Audio-Visual Dissonance-Based Deepfake Detection and Localization. Association for Computing Machinery, New York, NY, USA, 439–447.",
      "doi": ""
    },
    {
      "text": "Justin D. Cochran and Stuart A. Napshin. 2021. Deepfakes: Awareness, Concerns, and Platform Accountability. Cyberpsychology, Behavior, and Social Networking 24, 3(2021), 164–172. https://doi.org/10.1089/cyber.2020.0100 arXiv:https://doi.org/10.1089/cyber.2020.0100PMID: 33760667.",
      "doi": ""
    },
    {
      "text": "John W. Creswell and Dana L. Miller. 2000. Determining Validity in Qualitative Inquiry. Theory Into Practice 39, 3 (2000), 124–130.",
      "doi": ""
    },
    {
      "text": "Sauvik Das, Adam D.I. Kramer, Laura A. Dabbish, and Jason I. Hong. 2014. Increasing Security Sensitivity With Social Proof: A Large-Scale Experimental Confirmation. In Proceedings of the 2014 ACM SIGSAC Conference on Computer and Communications Security (Scottsdale, Arizona, USA) (CCS ’14). Association for Computing Machinery, New York, NY, USA, 739–749. https://doi.org/10.1145/2660267.2660271",
      "doi": "10.1145/2660267.2660271"
    },
    {
      "text": "Sauvik Das, Adam D.I. Kramer, Laura A. Dabbish, and Jason I. Hong. 2015. The Role of Social Influence in Security Feature Adoption. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing(Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 1416–1426. https://doi.org/10.1145/2675133.2675225",
      "doi": "10.1145/2675133.2675225"
    },
    {
      "text": "Nicholas Diakopoulos and Deborah Johnson. 2021. Anticipating and addressing the ethical implications of deepfakes in the context of elections. New Media & Society 23, 7 (2021), 2072–2098.",
      "doi": ""
    },
    {
      "text": "Tom Dobber, Nadia Metoui, Damian Trilling, Natali Helberger, and Claes de Vreese. 2021. Do (Microtargeted) Deepfakes Have Real Effects on Political Attitudes?The International Journal of Press/Politics 26, 1 (2021), 69–91. https://doi.org/10.1177/1940161220944364 arXiv:https://doi.org/10.1177/1940161220944364",
      "doi": ""
    },
    {
      "text": "Jr Edson C Tandoc, Richard Ling, Oscar Westlund, Andrew Duffy, Debbie Goh, and Lim Zheng Wei. 2018. Audiences’ acts of authentication in the age of fake news: A conceptual framework. New Media & Society 20, 8 (2018), 2745–2763.",
      "doi": ""
    },
    {
      "text": "Gowhar Farooq. 2018. Politics of Fake News: How WhatsApp Became a Potent Propaganda Tool in India. Media Watch 9, 1 (2018), 106–117.",
      "doi": ""
    },
    {
      "text": "Christine Geeng, Savanna Yee, and Franziska Roesner. 2020. Fake News on Facebook and Twitter: Investigating How People (Don’t) Investigate. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376784"
    },
    {
      "text": "Natalie Gerhart and Anna Sidorova. 2017. The Effect of Network Characteristics on Online Identity Management Practices. Journal of Computer Information Systems 57, 3 (2017), 229–237.",
      "doi": ""
    },
    {
      "text": "Amira Ghenai. 2017. Health Misinformation in Search and Social Media. In Proceedings of the 2017 International Conference on Digital Health (London, United Kingdom) (DH ’17). Association for Computing Machinery, New York, NY, USA, 235–236.",
      "doi": "10.1145/3079452.3079483"
    },
    {
      "text": "Megan Graham and Jennifer Elias. 2021. How Google’s $150 billion advertising business works. Retrieved 2021-09-08 from https://www.cnbc.com/2021/05/18/how-does-google-make-money-advertising-business-breakdown-.html",
      "doi": ""
    },
    {
      "text": "Greg Guest, Kathleen M. MacQueen, and Emily E. Namey. 2012. Applied thematic analysis. SAGE, Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Parul Gupta, Komal Chugh, Abhinav Dhall, and Ramanathan Subramanian. 2020. The Eyes Know It: The eyes know it: FakeET- An Eye-tracking Database to Understand Deepfake Perception- An Eye-Tracking Database to Understand Deepfake Perception. In Proceedings of the 2020 International Conference on Multimodal Interaction (Virtual Event, Netherlands) (ICMI ’20). Association for Computing Machinery, New York, NY, USA, 519–527.",
      "doi": "10.1145/3382507.3418857"
    },
    {
      "text": "Md Mahfuzul Haque, Mohammad Yousuf, Ahmed Shatil Alam, Pratyasha Saha, Syed Ishtiaque Ahmed, and Naeemul Hassan. 2020. Combating Misinformation in Bangladesh: Roles and Responsibilities as Perceived by Journalists, Fact-Checkers, and Users. Proc. ACM Hum.-Comput. Interact. 4, CSCW2, Article 130 (oct 2020), 32 pages.",
      "doi": "10.1145/3415201"
    },
    {
      "text": "The Hindu. 2021. A week after election results, violence continues in Bengal. Retrieved 2021-09-08 from https://www.thehindu.com/news/national/other-states/west-bengal-violence-barrage-of-fake-videos-posts-surface-on-social-media/article34513532.ece",
      "doi": ""
    },
    {
      "text": "Rui Hou, Veronica Perez-Rosas, Stacy Loeb, and Rada Mihalcea. 2019. Towards Automatic Detection of Misinformation in Online Medical Videos. In 2019 International Conference on Multimodal Interaction (Suzhou, China) (ICMI ’19). Association for Computing Machinery, New York, NY, USA, 235–243.",
      "doi": ""
    },
    {
      "text": "Eslam Hussein, Prerna Juneja, and Tanushree Mitra. 2020. Measuring Misinformation in Video Search Platforms: An Audit Study on YouTube. Proc. ACM Hum.-Comput. Interact. 4, CSCW1, Article 048 (May 2020), 27 pages. https://doi.org/10.1145/3392854",
      "doi": "10.1145/3392854"
    },
    {
      "text": "Andrew Hutchinson. 2020. Facebook Launches New Education Campaign to Help People Detect Fake News. Retrieved 2021-09-07 from https://www.socialmediatoday.com/news/facebook-launches-new-education-campaign-to-help-people-detect-fake-news/580835/",
      "doi": ""
    },
    {
      "text": "Andrew Hutchinson. 2021. Twitter Agrees to New Indian Government Regulations, Despite Concerns About the Impacts on User Speech. Retrieved 2021-09-02 from https://www.socialmediatoday.com/news/twitter-agrees-to-new-indian-government-regulations-despite-concerns-about/603057/",
      "doi": ""
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology Probes: Inspiring Design for and with Families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Ft. Lauderdale, Florida, USA) (CHI ’03). Association for Computing Machinery, New York, NY, USA, 17–24.",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Farnaz Jahanbakhsh, Amy X. Zhang, Adam J. Berinsky, Gordon Pennycook, David G. Rand, and David R. Karger. 2021. Exploring Lightweight Interventions at Posting Time to Reduce the Sharing of Misinformation on Social Media. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 18(2021), 42 pages.",
      "doi": "10.1145/3449092"
    },
    {
      "text": "Maurice Jakesch, Moran Koren, Anna Evtushenko, and Mor Naaman. 2018. The Role of Source, Headline and Expressive Responding in Political News Evaluation. SSRN Electronic Journal 1, 1 (2018), 5 pages.",
      "doi": ""
    },
    {
      "text": "Jasser Jasser. 2019. Dynamics of Misinformation Cascades. In Companion Proceedings of The 2019 World Wide Web Conference (San Francisco, USA) (WWW ’19). Association for Computing Machinery, New York, NY, USA, 33–36.",
      "doi": ""
    },
    {
      "text": "Shan Jiang and Christo Wilson. 2018. Linguistic Signals under Misinformation and Fact-Checking: Evidence from User Comments on Social Media. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 82 (nov 2018), 23 pages.",
      "doi": "10.1145/3274351"
    },
    {
      "text": "Stamatis Karnouskos. 2020. Artificial Intelligence in Digital Media: The Era of Deepfakes. IEEE Transactions on Technology and Society 1, 3 (2020), 138–147. https://doi.org/10.1109/TTS.2020.3001312",
      "doi": ""
    },
    {
      "text": "Ali Khodabakhsh, Raghavendra Ramachandra, and Christoph Busch. 2019. Subjective Evaluation of Media Consumer Vulnerability to Fake Audiovisual Content. In 2019 Eleventh International Conference on Quality of Multimedia Experience (QoMEX). IEEE, Gjøvik, Norway, 1–6. https://doi.org/10.1109/QoMEX.2019.8743316",
      "doi": ""
    },
    {
      "text": "Ali Khodabakhsh, Raghavendra Ramachandra, and Christoph Busch. 2019. Subjective Evaluation of Media Consumer Vulnerability to Fake Audiovisual Content. In 2019 Eleventh International Conference on Quality of Multimedia Experience (QoMEX). IEEE, Manhattan, NY, 1–6. https://doi.org/10.1109/QoMEX.2019.8743316",
      "doi": ""
    },
    {
      "text": "Jan Kietzmann, Linda W. Lee, Ian P. McCarthy, and Tim C. Kietzmann. 2020. Deepfakes: Trick or treat?Business Horizons 63, 2 (2020), 135–146. https://doi.org/10.1016/j.bushor.2019.11.006 ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING.",
      "doi": ""
    },
    {
      "text": "Jan Kirchner and Christian Reuter. 2020. Countering Fake News: A Comparison of Possible Solutions Regarding User Acceptance and Effectiveness. Proc. ACM Hum.-Comput. Interact. 4, CSCW2, Article 140 (Oct. 2020), 27 pages.",
      "doi": "10.1145/3415211"
    },
    {
      "text": "Holly Korda and Zena Itani. 2013. Harnessing Social Media for Health Promotion and Behavior Change. Health Promotion Practice 14, 1 (2013), 15–23.",
      "doi": ""
    },
    {
      "text": "Pavel Korshunov and Sébastien Marcel. 2020. Deepfake detection: humans vs. machines. CoRR abs/2009.03155(2020), 6 pages. arxiv:2009.03155https://arxiv.org/abs/2009.03155",
      "doi": ""
    },
    {
      "text": "Nieman Lab. 2021. The focus of misinformation debates shifts south. https://www.niemanlab.org/2018/12/the-focus-of-misinformation-debates-shifts-south/.",
      "doi": ""
    },
    {
      "text": "Karen Labelo. 2019. India Is Teeming With ’Cheapfakes’, Deepfakes Could Make It Worse. Retrieved 2022-02-17 from https://www.boomlive.in/india-is-teeming-with-cheapfakes-deepfakes-could-make-it-worse/",
      "doi": ""
    },
    {
      "text": "Danielle Lottridge and Frank R. Bentley. 2018. Let’s Hate Together: How People Share News in Messaging, Social, and Public Networks. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": ""
    },
    {
      "text": "Miaomiao Luo, Yu Hao, Ming Tang, Mengzhen Shi, Fengjuan He, Yuanmao Xie, and Weigang Chen. 2020. Application of a social media platform as a patient reminder in the treatment of Helicobacter pylori. Helicobacter 25, 2 (2020), e12682.",
      "doi": ""
    },
    {
      "text": "Brandon Mader, Martin S. Banks, and Hany Farid. 2017. Identifying Computer-Generated Portraits: The Importance of Training and Incentives. Perception 46, 9 (2017), 1062–1076.",
      "doi": ""
    },
    {
      "text": "Megan Mahoney. 2020. Just the Stats: Why Should You Leverage Video Marketing. Retrieved 2021-09-06 from https://www.singlegrain.com/video-marketing/just-stats-science-video-engagement/",
      "doi": ""
    },
    {
      "text": "Marie-Helen Maras and Alex Alexandrou. 2019. Determining authenticity of video evidence in the age of artificial intelligence and in the wake of Deepfake videos. The International Journal of Evidence & Proof 23, 3 (2019), 255–262.",
      "doi": ""
    },
    {
      "text": "Alice E Marwick. 2018. Why do people share fake news? A sociotechnical model of media effects. Georgetown Law Technology Review 2, 2 (2018), 474–512.",
      "doi": ""
    },
    {
      "text": "Shruti Menon. 2020. Coronavirus: The human cost of fake news in India. Retrieved January 8, 2021 from https://www.bbc.com/news/world-asia-india-53165436",
      "doi": ""
    },
    {
      "text": "Miriam J. Metzger, Andrew J. Flanagin, and Ryan B. Medders. 2010. Social and Heuristic Approaches to Credibility Evaluation Online. Journal of Communication 60, 3 (08 2010), 413–439.",
      "doi": ""
    },
    {
      "text": "Robert B. Michael and Brooke O. Breaux. 2021. The relationship between political affiliation and beliefs about sources of ”fake news”. Cognitive Research: Principles and Implications 6 (2021), 15 pages. Issue 1.",
      "doi": ""
    },
    {
      "text": "Ananda Mitra. 2020. Short-Form Video Dominates Social Media In India. Retrieved 2021-09-08 from https://www.forbes.com/sites/anandamitra/2020/06/23/tiktok-short-form-video-dominates-social-media-in-india/?sh=30b9e49c6803",
      "doi": ""
    },
    {
      "text": "Trisha Mittal, Uttaran Bhattacharya, Rohan Chandra, Aniket Bera, and Dinesh Manocha. 2020. Emotions Don’t Lie: An Audio-Visual Deepfake Detection Method Using Affective Cues. Association for Computing Machinery, New York, NY, USA, 2823–2832.",
      "doi": ""
    },
    {
      "text": "Sina Mohseni, Fan Yang, Shiva Pentyala, Mengnan Du, Yi Liu, Nic Lupfer, Xia Hu, Shuiwang Ji, and Eric Ragan. 2020. Machine Learning Explanations to Prevent Overtrust in Fake News Detection. arxiv:2007.12358 [cs.IR]",
      "doi": ""
    },
    {
      "text": "UCL News. 2021. Young peoples’ rates of reporting online harassment and abuse are ‘shockingly low’. Retrieved January 2, 2022 from https://www.ucl.ac.uk/news/2021/dec/young-peoples-rates-reporting-online-harassment-and-abuse-are-shockingly-low",
      "doi": ""
    },
    {
      "text": "Chinasa T. Okolo, Srujana Kamath, Nicola Dell, and Aditya Vashistha. 2021. “It Cannot Do All of My Work”: Community Health Worker Perceptions of AI-Enabled Mobile Health Applications in Rural India. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 701, 20 pages.",
      "doi": "10.1145/3411764.3445420"
    },
    {
      "text": "Laura Hazard Owen. 2020. Crowds of regular people are as good at moderating fake news on Facebook as professional fact-checkers. Retrieved 2021-09-07 from https://www.niemanlab.org/2020/10/crowds-of-regular-people-are-as-good-at-moderating-fake-news-on-facebook-as-professional-fact-checkers/",
      "doi": ""
    },
    {
      "text": "Gordon Pennycook and David G. Rand. 2021. The Psychology of Fake News. Trends in Cognitive Sciences 25, 5 (May 2021), 388–402. https://doi.org/10.1016/j.tics.2021.02.007",
      "doi": ""
    },
    {
      "text": "Ivan Perov, Daiheng Gao, Nikolay Chervoniy, Kunlin Liu, Sugasa Marangonda, Chris Umé, Mr. Dpfks, Carl Shift Facenheim, Luis RP, Jian Jiang, Sheng Zhang, Pingyu Wu, Bo Zhou, and Weiming Zhang. 2020. DeepFaceLab: A simple, flexible and extensible face swapping framework. CoRR abs/2005.05535(2020), 10 pages.",
      "doi": ""
    },
    {
      "text": "Greg Philo. 2002. Seeing and Believing: The Influence of Television. Routledge, London. https://doi.org/10.4324/9780203136560",
      "doi": ""
    },
    {
      "text": "Peter Pirolli, Shiwali Mohan, Anusha Venkatakrishnan, Les Nelson, Michael Silva, and Aaron Springer. 2017. Implementation Intention and Reminder Effects on Behavior Change in a Mobile Health System: A Predictive Cognitive Model. Journal of Medical Internet Research 19, 11 (2017), e397.",
      "doi": ""
    },
    {
      "text": "Zachary Pope, Daheia Barr-Anderson, Beth Lewis, Mark Pereira, and Zan Gao. 2019. Use of Wearable Technology and Social Media to Improve Physical Activity and Dietary Behaviors among College Students: A 12-Week Randomized Pilot Study. International Journal of Environmental Research and Public Health 16, 19 (Sep 2019), 3579.",
      "doi": ""
    },
    {
      "text": "Jon Porter. 2020. WhatsApp says its forwarding limits have cut the spread of viral messages by 70 percent. Retrieved 2021-09-06 from https://www.theverge.com/2020/4/27/21238082/whatsapp-forward-message-limits-viral-misinformation-decline",
      "doi": ""
    },
    {
      "text": "Hua Qi, Qing Guo, Felix Juefei-Xu, Xiaofei Xie, Lei Ma, Wei Feng, Yang Liu, and Jianjun Zhao. 2020. DeepRhythm: Exposing DeepFakes with Attentional Visual Heartbeat Rhythms. Association for Computing Machinery, New York, NY, USA, 4318–4327.",
      "doi": ""
    },
    {
      "text": "Julio C. S. Reis, Philipe Melo, Kiran Garimella, Jussara M. Almeida, Dean Eckles, and Fabrício Benevenuto. 2020. A Dataset of Fact-Checked Images Shared on WhatsApp During the Brazilian and Indian Elections. Proceedings of the International AAAI Conference on Web and Social Media 14, 1 (2020), 903–908.",
      "doi": ""
    },
    {
      "text": "Niranjan Sahoo. 2020. How fake news is complicating India’s war against COVID-19. Retrieved 2021-09-08 from https://www.orfonline.org/expert-speak/how-fake-news-complicating-india-war-against-covid19-66052/",
      "doi": ""
    },
    {
      "text": "Emily Saltz, Claire R Leibowicz, and Claire Wardle. 2021. Encounters with Visual Misinformation and Labels Across Platforms: An Interview and Diary Study to Inform Ecosystem Approaches to Misinformation Interventions. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 340, 6 pages.",
      "doi": "10.1145/3411763.3451807"
    },
    {
      "text": "Sanam. 2020. Digital and Social Media Landscape in India. Retrieved 2021-09-08 from https://sannams4.com/digital-and-social-media-landscape-in-india/",
      "doi": ""
    },
    {
      "text": "Oscar Schwartz. 2018. You thought fake news was bad? Deep fakes are where truth goes to die. Retrieved 2021-09-08 from https://www.theguardian.com/technology/2018/nov/12/deep-fakes-fake-news-truth",
      "doi": ""
    },
    {
      "text": "Jieun Shin, Lian Jian, Kevin Driscoll, and François Bar. 2017. Political rumoring on Twitter during the 2012 US presidential election: Rumor diffusion and correction. New Media & Society 19, 8 (2017), 1214–1235.",
      "doi": ""
    },
    {
      "text": "Anu Shrestha and Francesca Spezzano. 2019. Online Misinformation: From the Deceiver to the Victim. In Proceedings of the 2019 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining(Vancouver, British Columbia, Canada) (ASONAM ’19). Association for Computing Machinery, New York, NY, USA, 847–850.",
      "doi": "10.1145/3341161.3343536"
    },
    {
      "text": "Manish Singh. 2019. Reliance Jio partners with Facebook to launch literacy program for first time internet users in India. Retrieved January 7, 2021 from https://social.techcrunch.com/2019/07/03/reliance-jio-facebook-digital-literacy-udaan-india/",
      "doi": ""
    },
    {
      "text": "Statista. 2021. Social media users in India. Retrieved 2021-09-09 from https://www.statista.com/forecasts/1145422/social-media-users-in-india",
      "doi": ""
    },
    {
      "text": "Alexa Stein, Norman Makoto Su, and Xinru Page. 2020. Learning through Videos: Uncovering Approaches to Educating People about Facebook Privacy., 5 pages.",
      "doi": ""
    },
    {
      "text": "David Sterrett, Dan Malato, Jennifer Benz, Liz Kantor, Trevor Tompson, Tom Rosenstiel, Jeff Sonderman, and Kevin Loker. 2019. Who Shared It?: Deciding What News to Trust on Social Media. Digital Journalism 7, 6 (July 2019), 783–801.",
      "doi": ""
    },
    {
      "text": "Sharifa Sultana and Susan R. Fussell. 2021. Dissemination, Situated Fact-Checking, and Social Effects of Misinformation among Rural Bangladeshi Villagers During the COVID-19 Pandemic. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 436 (oct 2021), 34 pages.",
      "doi": "10.1145/3479580"
    },
    {
      "text": "S Shyam Sundar, Maria D Molina, and Eugene Cho. 2021. Seeing Is Believing: Is Video Modality More Powerful in Spreading Fake News via Online Messaging Apps?, 29 pages.",
      "doi": ""
    },
    {
      "text": "Rashid Tahir, Brishna Batool, Hira Jamshed, Mahnoor Jameel, Mubashir Anwar, Faizan Ahmed, Muhammad Adeel Zaffar, and Muhammad Fareed Zaffar. 2021. Seeing is Believing: Exploring Perceptual Differences in DeepFake Videos. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 174, 16 pages.",
      "doi": "10.1145/3411764.3445699"
    },
    {
      "text": "Shalini Talwar, Amandeep Dhir, Puneet Kaur, Nida Zafar, and Melfi Alrasheedy. 2019. Why do people share fake news? Associations between the dark side of social media use and fake news sharing behavior. Journal of Retailing and Consumer Services 51 (2019), 72–82.",
      "doi": ""
    },
    {
      "text": "Lu Tang, Kayo Fujimoto, Muhammad Tuan Amith, Rachel Cunningham, Rebecca A Costantini, Felicia York, Grace Xiong, Julie A Boom, and Cui Tao. 2021. “Down the Rabbit Hole” of Vaccine Misinformation on YouTube: Network Exposure Study. Journal of Medical Internet Research 23, 1 (2021), e23262.",
      "doi": ""
    },
    {
      "text": "Saumya Tewari. 2020. India is sixth largest market in consumption of video ads: Report. Retrieved 2021-09-08 from https://www.livemint.com/industry/advertising/india-is-sixth-largest-market-in-consumption-of-video-ads-report-11582024457022.html",
      "doi": ""
    },
    {
      "text": "Russell Torres, Natalie Gerhart, and Arash Negahban. 2018. Epistemology in the Era of Fake News: An Exploration of Information Verification Behaviors among Social Networking Site Users. SIGMIS Database 49, 3 (jul 2018), 78–97.",
      "doi": "10.1145/3242734.3242740"
    },
    {
      "text": "Cristian Vaccari and Andrew Chadwick. 2020. Deepfakes and Disinformation: Exploring the Impact of Synthetic Political Video on Deception, Uncertainty, and Trust in News. Social Media + Society 6, 1 (2020), 13 pages. https://doi.org/10.1177/2056305120903408 arXiv:https://doi.org/10.1177/2056305120903408",
      "doi": ""
    },
    {
      "text": "Aditya Vashistha, Abhinav Garg, Richard Anderson, and Agha Ali Raza. 2019. Threats, Abuses, Flirting, and Blackmail: Gender Inequity in Social Media Voice Forums. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3290605.3300302"
    },
    {
      "text": "Fie Velghe. 2012. Deprivation, distance and connectivity: The adaptation of mobile phone use to a life in Wesbank, a post-apartheid township in South Africa. Discourse, Context & Media 1, 4 (2012), 203–216. https://doi.org/10.1016/j.dcm.2012.09.004",
      "doi": ""
    },
    {
      "text": "James Vincent. 2018. Why AI isn’t going to solve Facebook’s fake news problem. Retrieved 2021-09-08 from https://www.theverge.com/2018/4/5/17202886/facebook-fake-news-moderation-ai-challenges",
      "doi": ""
    },
    {
      "text": "Travis L. Wagner and Ashley Blewer. 2019. “The Word Real Is No Longer Real”: Deepfakes, Gender, and the Challenges of AI-Altered Video:. Open Information Science 3, 1 (2019), 32–46. https://doi.org/10.1515/opis-2019-0003",
      "doi": ""
    },
    {
      "text": "wombo. 2021. Ai powered lip sync app. Retrieved 2021-09-08 from https://www.wombo.ai/",
      "doi": ""
    },
    {
      "text": "Susan Wyche. 2019. Using Cultural Probes In New Contexts: Exploring the Benefits of Probes in HCI4D/ICTD. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing (Austin, TX, USA) (CSCW ’19). Association for Computing Machinery, New York, NY, USA, 423–427.",
      "doi": "10.1145/3311957.3359454"
    },
    {
      "text": "Aya Yadlin-Segal and Yael Oppenheim. 2021. Whose dystopia is it anyway? Deepfakes and social media regulation. Convergence 27, 1 (2021), 36–51.",
      "doi": ""
    },
    {
      "text": "Waheeb Yaqub, Otari Kakhidze, Morgan L. Brockman, Nasir Memon, and Sameer Patil. 2020. Effects of Credibility Indicators on Social Media News Sharing Intent. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": ""
    },
    {
      "text": "Brandy Zadrozny. 2021. On TikTok, audio gives new virality to misinformation. Retrieved 2021-09-09 from https://www.nbcnews.com/tech/tech-news/tiktok-audio-gives-new-virality-misinformation-rcna1393",
      "doi": ""
    }
  ]
}