{
  "doi": "10.1145/3491102.3501832",
  "title": "The social embeddedness of peer production: A comparative qualitative analysis of three Indian language Wikipedia editions",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Why do some peer production projects do a better job at engaging potential contributors than others? We address this question by comparing three Indian language Wikipedias, namely, Malayalam, Marathi, and Kannada. We found that although the three projects share goals, technological infrastructure, and a similar set of challenges, Malayalam Wikipedia’s community engages language speakers in contributing at a much higher rate than the others. Drawing from a grounded theory analysis of interviews with 18 community participants from the three projects, we found that experience with participatory governance and free/open-source software in the Malayalam community supported high engagement of contributors. Counterintuitively, we found that financial resources intended to increase participation in the Marathi and Kannada communities hindered the growth of these communities. Our findings underscore the importance of social and cultural context in the trajectories of peer production communities.",
  "authors": [
    {
      "name": "Sejal Khatri",
      "institution": "University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234856",
      "orcid": "missing"
    },
    {
      "name": "Aaron Shaw",
      "institution": "Communication Studies, Northwestern University, United States and Berkman Klein Center for Internet and Society, Harvard University, USA",
      "img": "/do/10.1145/contrib-81479644451/rel-imgonly/shaw_aaron-nu-headshot-2012-cropped2.jpg",
      "acmid": "81479644451",
      "orcid": "missing"
    },
    {
      "name": "Sayamindu Dasgupta",
      "institution": "School of Information and Library Science, University of North Carolina at Chapel Hill, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484641200",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Mako Hill",
      "institution": "Community Data Science Collective, University of Washington, United States and Berkman Klein Center for Internet and Society, Harvard University, United States",
      "img": "/do/10.1145/contrib-81539037856/rel-imgonly/mako_commlead_2014-280px.png",
      "acmid": "81539037856",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Camille E Acey, Siko Bouterse, Sucheta Ghoshal, Amanda Menking, Anasuya Sengupta, and Adele G Vrana. 2021. Decolonizing the Internet by Decolonizing Ourselves: Challenging Epistemic Injustice through Feminist Practice. Global Perspectives 2, 1 (2021).",
      "doi": ""
    },
    {
      "text": "Babasaheb Ambedkar. 2019. Castes in India: Their Mechanism, Genesis, and Development. In Dr. Babasaheb Ambedkar : Writings and Speeches. Vol. 1. Dr. Ambedkar Foundation, Ministry of Social Justice & Empowerment, Govt. of India, New Delhi, India.",
      "doi": ""
    },
    {
      "text": "Morgan G. Ames. 2019. The Charisma Machine: The Life, Death, and Legacy of One Laptop per Child. MIT Press, Cambridge Mass.",
      "doi": ""
    },
    {
      "text": "Satish Babu. 2011. FOSS as a Tool for Development: The Kerala Experience. In 2011 IEEE Global Humanitarian Technology Conference. IEEE, Seattle, WA, USA, 108–110. https://doi.org/10.1109/GHTC.2011.82",
      "doi": "10.1109/GHTC.2011.82"
    },
    {
      "text": "Martina Balestra, Coye Cheshire, Ofer Arazy, and Oded Nov. 2017. Investigating the Motivational Paths of Peer Production Newcomers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, New York, NY, USA, 6381–6385. https://doi.org/10.1145/3025453.3026057",
      "doi": "10.1145/3025453.3026057"
    },
    {
      "text": "Martina Balestra, Lior Zalmanson, Coye Cheshire, Ofer Arazy, and Oded Nov. 2017. It Was Fun, but Did It Last?: The Dynamic Interplay between Fun Motives and Contributors’ Activity in Peer Production. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (Dec. 2017), 1–13. https://doi.org/10.1145/3134656",
      "doi": "10.1145/3134656"
    },
    {
      "text": "Gerard Beenen, Kimberly Ling, Xiaoqing Wang, Klarissa Chang, Dan Frankowski, Paul Resnick, and Robert E. Kraut. 2004. Using Social Psychology to Motivate Contributions to Online Communities. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work. ACM, Chicago, Illinois, USA, 212–221. https://doi.org/10.1145/1031607.1031642",
      "doi": "10.1145/1031607.1031642"
    },
    {
      "text": "Yochai Benkler. 2002. Coase’s Penguin, or, Linux and ‘The Nature of the Firm’. The Yale Law Journal 112, 3 (Dec. 2002), 369. https://doi.org/10.2307/1562247",
      "doi": ""
    },
    {
      "text": "Yochai Benkler. 2006. The Wealth of Networks: How Social Production Transforms Markets and Freedom. Yale University Press, New Haven, CT.",
      "doi": "10.5555/1214507"
    },
    {
      "text": "Yochai Benkler. 2016. Peer Production and Cooperation. In Handbook on the Economics of the Internet, Johannes M. Bauer and Michael Latzer (Eds.). Edward Elgar, Cheltenham, UK, 91–119.",
      "doi": ""
    },
    {
      "text": "Yochai Benkler, Aaron Shaw, and Benjamin Mako Hill. 2015. Peer Production: A Form of Collective Intelligence. In Handbook of Collective Intelligence, Thomas W. Malone and Michael S. Bernstein (Eds.). MIT Press, Cambridge, MA, 175–204.",
      "doi": ""
    },
    {
      "text": "Laurent Besacier, Etienne Barnard, Alexey Karpov, and Tanja Schultz. 2014. Automatic Speech Recognition for Under-Resourced Languages: A Survey. Speech Communication 56(2014), 85–100.",
      "doi": "10.1016/j.specom.2013.07.008"
    },
    {
      "text": "Pushpak Bhattacharyya, Hema Murthy, Surangika Ranathunga, and Ranjiva Munasinghe. 2019. Indic Language Computing. Commun. ACM 62, 11 (2019), 70–75.",
      "doi": "10.1145/3343456"
    },
    {
      "text": "Susan L. Bryant, Andrea Forte, and Amy Bruckman. 2005. Becoming Wikipedian: Transformation of Participation in a Collaborative Online Encyclopedia. In Proceedings of the 2005 International ACM SIGGROUP Conference on Supporting Group Work(GROUP ’05). ACM, New York, NY, 1–10. https://doi.org/10.1145/1099203.1099205",
      "doi": "10.1145/1099203.1099205"
    },
    {
      "text": "Anita Say Chan. 2014. Networking Peripheries: Technological Futures and the Myth of Digital Universalism(illustrated edition ed.). The MIT Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Leslie Chan, Budd Hall, Florence Piron, Rajesh Tandon, and Wanósts’a7 Lorna Williams. 2020. Open Science Beyond Open Access: For and with Communities, A Step towards the Decolonization of Knowledge. (July 2020). https://doi.org/10.5281/ZENODO.3946773",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory. sage.",
      "doi": ""
    },
    {
      "text": "Partha Chatterjee. 1996. The Manifold Uses of Jati. In Region, Religion, Caste, Gender and Culture in Contemporary India, T. V. Sathyamurthy (Ed.). Number v. 3 in Social Change and Political Discourse in India. Oxford University Press, Delhi ; New York, 281–292.",
      "doi": ""
    },
    {
      "text": "Rahul De, Lewin Sivamala, Ravi A. Rao, Sharmila Chakravarty, Supriya Dey, and Uma Bharath. 2015. Economic Impact of Free and Open Source Software Usage in Government: Final Report. Technical Report.",
      "doi": ""
    },
    {
      "text": "Nicolas Ducheneaut. 2005. Socialization in an Open Source Software Community: A Socio-Technical Analysis. Computer Supported Cooperative Work (CSCW) 14, 4 (2005), 323–368. https://doi.org/10.1007/s10606-005-9000-1",
      "doi": "10.1007/s10606-005-9000-1"
    },
    {
      "text": "Bernard Enjolras. 2002. The commercialization of voluntary sport organizations in Norway. Nonprofit and voluntary sector quarterly 31, 3 (2002), 352–376.",
      "doi": ""
    },
    {
      "text": "Peter B. Evans. 1995. Embedded Autonomy: States and Industrial Transformation. Princeton University Press, Princeton, NJ.",
      "doi": "10.5555/526814"
    },
    {
      "text": "Heather Ford, Mark Graham, and Eric Meyer. 2015. Fact Factories: Wikipedia and the Power to Represent. Ph.D. Dissertation. University of Oxford.",
      "doi": ""
    },
    {
      "text": "Jana Gallus. 2016. Fostering Public Good Contributions with Symbolic Awards: A Large-Scale Natural Field Experiment at Wikipedia. Management Science 63, 12 (Sept. 2016), 3999–4015. https://doi.org/10.1287/mnsc.2016.2540",
      "doi": "10.1287/mnsc.2016.2540"
    },
    {
      "text": "Rishab Aiyer Ghosh. 2005. Understanding Free Software Developers: Understandings from the FLOSS Study. In Perspectives on Free and Open Source Software, Joseph Feller, Brian Fitzgerald, Scott A. Hissam, and Karim R. Lakhani (Eds.). MIT Press, Cambridge, MA, 23–36.",
      "doi": ""
    },
    {
      "text": "Sanjay Ghosh and Anirudha Joshi. 2014. Text Entry in Indian Languages on Mobile: User Perspectives. In Proceedings of the India HCI 2014 Conference on Human Computer Interaction - IHCI ’14. ACM Press, New Delhi, India, 55–63. https://doi.org/10.1145/2676702.2676710",
      "doi": "10.1145/2676702.2676710"
    },
    {
      "text": "Ruediger Glott, Rishab Ghosh, and Philipp Schmidt. 2010. Wikipedia Survey. Technical Report. UNU-MERIT, Maastricht, Netherlands.",
      "doi": ""
    },
    {
      "text": "Mark Granovetter. 1985. Economic Action and Social Structure: The Problem of Embeddedness. Amer. J. Sociology 91, 3 (Nov. 1985), 481–510. https://doi.org/10.1086/228311",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker, R. Stuart Geiger, Jonathan T. Morgan, and John Riedl. 2013. The Rise and Decline of an Open Collaboration System: How Wikipedia’s Reaction to Popularity Is Causing Its Decline. American Behavioral Scientist 57, 5 (May 2013), 664–688. https://doi.org/10.1177/0002764212469365",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker, Oliver Keyes, and Dario Taraborelli. 2013. Making Peripheral Participation Legitimate: Reader Engagement Experiments in Wikipedia. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work(CSCW ’13). ACM, New York, NY, USA, 849–860. https://doi.org/10.1145/2441776.2441872",
      "doi": "10.1145/2441776.2441872"
    },
    {
      "text": "Noriko Hara, Pnina Shachaf, and Khe Foon Hew. 2010. Cross-Cultural Analysis of the Wikipedia Community. Journal of the American Society for Information Science and Technology 61, 10 (2010), 2097–2108. https://doi.org/10.1002/asi.21373",
      "doi": ""
    },
    {
      "text": "Kieran Healy and Alan Schussman. 2003. The Ecology of Open-Source Software Development. (2003).",
      "doi": ""
    },
    {
      "text": "Brent Hecht and Darren Gergle. 2010. The Tower of Babel Meets Web 2.0: User-Generated Content and Its Applications in a Multilingual Context. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’10). ACM, Atlanta, Georgia, USA, 291–300. https://doi.org/10.1145/1753326.1753370",
      "doi": "10.1145/1753326.1753370"
    },
    {
      "text": "Molly G Hickman, Viral Pasad, Harsh Kamalesh Sanghavi, Jacob Thebault-Spieker, and Sang Won Lee. 2021. Understanding Wikipedia Practices Through Hindi, Urdu, and English Takes on an Evolving Regional Conflict. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–31.",
      "doi": "10.1145/3449108"
    },
    {
      "text": "Benjamin Mako Hill. 2013. Almost Wikipedia: What Eight Early Online Collaborative Encyclopedia Projects Reveal about the Mechanisms of Collective Action.In Essays on Volunteer Mobilization in Peer Production. Massachusetts Institute of Technology, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Benjamin Mako Hill and Aaron Shaw. 2013. The Wikipedia Gender Gap Revisited: Characterizing Survey Response Bias with Propensity Score Estimation. PLoS ONE 8, 6 (June 2013), e65782. https://doi.org/10.1371/journal.pone.0065782",
      "doi": ""
    },
    {
      "text": "Benjamin Mako Hill and Aaron Shaw. 2019. Studying Populations of Online Communities. In The Oxford Handbook of Networked Communication, Brooke Foucault Wellesand Sandra González-Bailón (Eds.). Oxford University Press, Oxford, UK, 173–193.",
      "doi": ""
    },
    {
      "text": "Benjamin Mako Hill and Aaron D. Shaw. 2020. The Most Important Laboratory for Social Scientific and Computing Research in History. In Wikipedia @ 20: Stories of an Incomplete Revolution, Joseph M. Jr. Reagle and Jackie L. Koerner (Eds.). MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Geert Hofstede. 1984. Culture’s Consequences: International Differences in Work-Related Values. SAGE.",
      "doi": ""
    },
    {
      "text": "Joan E. Hughes and Ravi Narayan. 2009. Collaboration and Learning with Wikis in Post-Secondary Classrooms. Journal of Interactive Online Learning 8, 1 (2009), 63–82.",
      "doi": ""
    },
    {
      "text": "Sohyeon Hwang and Jeremy D Foote. 2021. Why do people participate in small online communities?Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–25.",
      "doi": ""
    },
    {
      "text": "Sohyeon Hwang and Aaron Shaw. [n.d.]. Heterogeneous Practices in Collective Governance. ([n. d.]).",
      "doi": ""
    },
    {
      "text": "Kancha Ilaiah. 2006. Merit of Reservations. Economic and Political Weekly 41, 24 (2006), 2447–2449.",
      "doi": ""
    },
    {
      "text": "Aniket Jaaware. 2018. Practicing Caste: On Touching and Not Touching (first ed.). Fordham University Press. https://doi.org/10.5422/fordham/9780823282265.001.0001",
      "doi": ""
    },
    {
      "text": "Steven L. Johnson, Samer Faraj, and Srinivas Kudaravalli. 2014. Emergence of Power Laws in Online Communities: The Role of Social Mechanisms and Preferential Attachment.Management Information Systems Quarterly 38, 3 (2014), 795–808.",
      "doi": "10.25300/MISQ/2014/38.3.08"
    },
    {
      "text": "Gopal Kadekodi, Ravi Kanbur, and Vijayendra Rao. 2007. Governance and the’Karnataka Model of Development’. Economic and Political Weekly(2007).",
      "doi": ""
    },
    {
      "text": "Bhuvana Meenakshi Koteeswaran. 2021. Bridging the Gender Gap. (2021).",
      "doi": ""
    },
    {
      "text": "KPMG. 2017. Indian Languages –Defining India’s Internet. https://assets.kpmg/content/dam/kpmg/in/pdf/2017/04/Indian-languages-Defining-Indias-Internet.pdf.",
      "doi": ""
    },
    {
      "text": "Robert E. Kraut and Andrew T. Fiore. 2014. The Role of Founders in Building Online Groups. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing(CSCW ’14). ACM, Baltimore, Maryland, USA, 722–732. https://doi.org/10.1145/2531602.2531648",
      "doi": "10.1145/2531602.2531648"
    },
    {
      "text": "Robert E. Kraut, Paul Resnick, and Sara Kiesler. 2012. Building Successful Online Communities: Evidence-Based Social Design. MIT Press, Cambridge, MA.",
      "doi": "10.5555/2207798"
    },
    {
      "text": "G Gopa Kumar. 2003. Kerala: Stable Bipolar Alignment. Journal of Indian School of Political Economy 15, 1-2 (2003), 79–95.",
      "doi": ""
    },
    {
      "text": "John Kurien. 1995. The Kerala Model: Its Central Tendency and the Outlier. Social Scientist 23, 1/3 (1995), 70–90. https://doi.org/10.2307/3517892",
      "doi": ""
    },
    {
      "text": "Leantros Kyriakoullis and Panayiotis Zaphiris. 2016. Culture and HCI: A Review of Recent Cultural Studies in HCI and Social Networks. Universal Access in the Information Society 15, 4 (Nov. 2016), 629–642. https://doi.org/10.1007/s10209-015-0445-9",
      "doi": "10.1007/s10209-015-0445-9"
    },
    {
      "text": "Karim R. Lakhani and B. Wolf. 2005. Why Hackers Do What They Do: Understanding Motivation and Effort in Free/Open Source Software Projects. In Perspectives on Free and Open Source Software, Joseph Feller, Brian Fitzgerald, Scott A. Hissam, and Karim R. Lakhani (Eds.). MIT Press, 3–22.",
      "doi": ""
    },
    {
      "text": "Florian Lemmerich, Diego Sáez-Trumper, Robert West, and Leila Zia. 2019. Why the World Reads Wikipedia: Beyond English Speakers. In Proceedings of the Twelfth ACM International Conference on Web Search and Data Mining(WSDM ’19). ACM, New York, NY, USA, 618–626. https://doi.org/10.1145/3289600.3291021",
      "doi": "10.1145/3289600.3291021"
    },
    {
      "text": "GK Lieten. 2002. Human Development in Kerala: Structure and Agency in History. Economic and Political Weekly(2002).",
      "doi": ""
    },
    {
      "text": "Randall M. Livingstone. 2016. Population Automation: An Interview with Wikipedia Bot Pioneer Ram-Man. First Monday (Jan. 2016). https://doi.org/10.5210/fm.v21i1.6027",
      "doi": ""
    },
    {
      "text": "Maggie MacAulay and Rebecca Visser. 2016. Editing Diversity In: Reading Diversity Discourses on Wikipedia. Ada: A Journal of Gender, New Media, and Technology9 (May 2016). https://doi.org/10.7264/N36M3541",
      "doi": ""
    },
    {
      "text": "Laura March and Sayamindu Dasgupta. 2020. Wikipedia Edit-a-Thons as Sites of Public Pedagogy. Proc. ACM Hum.-Comput. Interact. 100:1–100:26, CSCW2(2020). https://doi.org/10.1145/3415171",
      "doi": "10.1145/3415171"
    },
    {
      "text": "Lousie Matsakis. 2019. Google Gives Wikimedia Millions—Plus Machine Learning Tools. Wired (Jan. 2019).",
      "doi": ""
    },
    {
      "text": "Mohamad Mehdi, Chitu Okoli, Mostafa Mesgari, Finn Årup Nielsen, and Arto Lanamäki. 2017. Excavating the Mother Lode of Human-Generated Text: A Systematic Review of Research That Uses the Wikipedia Corpus. Information Processing & Management 53, 2 (March 2017), 505–529. https://doi.org/10.1016/j.ipm.2016.07.003",
      "doi": "10.1016/j.ipm.2016.07.003"
    },
    {
      "text": "Amanda Menking and Ingrid Erickson. 2015. The Heart Work of Wikipedia: Gendered, Emotional Labor in the World’s Largest Online Encyclopedia. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, New York, NY, USA, 207–210. https://doi.org/10.1145/2702123.2702514",
      "doi": "10.1145/2702123.2702514"
    },
    {
      "text": "Amanda Menking, Ingrid Erickson, and Wanda Pratt. 2019. People Who Can Take It: How Women Wikipedians Negotiate and Navigate Safety. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, Glasgow, Scotland, UK, 472:1–472:14. https://doi.org/10.1145/3290605.3300702",
      "doi": "10.1145/3290605.3300702"
    },
    {
      "text": "Mostafa Mesgari, Chitu Okoli, Mohamad Mehdi, Finn Årup Nielsen, and Arto Lanamäki. 2015. “The Sum of All Human Knowledge”: A Systematic Review of Scholarly Research on the Content of Wikipedia: “The Sum of All Human Knowledge”: A Systematic Review of Scholarly Research on the Content of Wikipedia. Journal of the Association for Information Science and Technology 66, 2 (Feb. 2015), 219–245. https://doi.org/10.1002/asi.23172",
      "doi": "10.1002/asi.23172"
    },
    {
      "text": "Ministry of Home Affairs, Government of India. 2011. Census. Technical Report.",
      "doi": ""
    },
    {
      "text": "Ministry of Home Affairs, Government of India. 2011. State of Literacy. https://censusindia.gov.in/2011-prov-results/data_files/india/Final_PPT_2011_chapter6.pdf.",
      "doi": ""
    },
    {
      "text": "Marc Miquel-Ribé and David Laniado. 2018. Wikipedia Culture Gap: Quantifying Content Imbalances Across 40 Language Editions. Frontiers in Physics 6(2018). https://doi.org/10.3389/fphy.2018.00054",
      "doi": ""
    },
    {
      "text": "Marc Miquel-Ribé and David Laniado. 2019. Wikipedia Cultural Diversity Dataset: A Complete Cartography for 300 Language Editions. Proceedings of the International AAAI Conference on Web and Social Media 13 (July 2019), 620–629.",
      "doi": ""
    },
    {
      "text": "Aparna Mitra and Pooja Singh. 2007. Human Capital Attainment and Gender Empowerment: The Kerala Paradox*. Social Science Quarterly 88, 5 (2007), 1227–1242. https://doi.org/10.1111/j.1540-6237.2007.00500.x",
      "doi": ""
    },
    {
      "text": "Jonathan T. Morgan, Siko Bouterse, Heather Walls, and Sarah Stierch. 2013. Tea and Sympathy: Crafting Positive New User Experiences on Wikipedia. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work(CSCW ’13). ACM, New York, NY, USA, 839–848. https://doi.org/10.1145/2441776.2441871",
      "doi": "10.1145/2441776.2441871"
    },
    {
      "text": "Jonathan T. Morgan and Aaron Halfaker. 2018. Evaluating the Impact of the Wikipedia Teahouse on Newcomer Socialization and Retention. In Proceedings of the 14th International Symposium on Open Collaboration(OpenSym ’18). ACM, New York, NY, 20:1–20:7. https://doi.org/10.1145/3233391.3233544",
      "doi": "10.1145/3233391.3233544"
    },
    {
      "text": "Sneha Narayan, Jake Orlowitz, Jonathan Morgan, Benjamin Mako Hill, and Aaron Shaw. 2017. The Wikipedia Adventure: Field Evaluation of an Interactive Tutorial for New Users. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). ACM, New York, NY, USA, 1785–1799. https://doi.org/10.1145/2998181.2998307",
      "doi": "10.1145/2998181.2998307"
    },
    {
      "text": "Sabine Niederer and José van Dijck. 2010. Wisdom of the Crowd or Technicity of Content? Wikipedia as a Sociotechnical System. New Media & Society 12, 8 (Dec. 2010), 1368–1387. https://doi.org/10.1177/1461444810365297",
      "doi": ""
    },
    {
      "text": "Oded Nov. 2007. What Motivates Wikipedians?Commun. ACM 50, 11 (2007), 60–64. https://doi.org/10.1145/1297797.1297798",
      "doi": "10.1145/1297797.1297798"
    },
    {
      "text": "Jude Ntabathia. 2019. Categories of control and visibility in mapping infrastructures. In Proceedings of the Conference on Computing & Sustainable Societies - COMPASS 19. ACM Press, Accra, Ghana, 174–183. https://doi.org/10.1145/3314344.3332494",
      "doi": "10.1145/3314344.3332494"
    },
    {
      "text": "Chitu Okoli, Mohamad Mehdi, Mostafa Mesgari, Finn Årup Nielsen, and Arto Lanamäki. 2012. The People’s Encyclopedia under the Gaze of the Sages: A Systematic Review of Scholarly Research on Wikipedia. SKEMA Business School. http://dx.doi.org/10.2139/ssrn.2021326",
      "doi": ""
    },
    {
      "text": "Felipe Ortega. 2009. Wikipedia: A Quantitative Analysis. Ph.D. Dissertation. Universidad Rey Juan Carlos, Madrid, Spain.",
      "doi": ""
    },
    {
      "text": "Felipe Ortega and Jesus M. Gonzalez Barahona. 2007. Quantitative Analysis of the Wikipedia Community of Users. In Proceedings of the 2007 International Symposium on Wikis(WikiSym ’07). ACM, New York, NY, USA, 75–86. https://doi.org/10.1145/1296951.1296960",
      "doi": "10.1145/1296951.1296960"
    },
    {
      "text": "Katherine Panciera, Aaron Halfaker, and Loren Terveen. 2009. Wikipedians Are Born, Not Made: A Study of Power Editors on Wikipedia. In Proceedings of the ACM 2009 International Conference on Supporting Group Work(GROUP ’09). ACM, New York, NY, 51–60. https://doi.org/10.1145/1531674.1531682",
      "doi": "10.1145/1531674.1531682"
    },
    {
      "text": "Madhu S Paranjape and Madhu S. 2007. Uneven Distribution of Education in Maharashtra: Rural-Urban, Gender and Caste Inequalities. Economic and Political Weekly(2007).",
      "doi": ""
    },
    {
      "text": "Kamna Patel. 2017. What Is in a Name? How Caste Names Affect the Production of Situated Knowledge. Gender, Place & Culture 24, 7 (July 2017), 1011–1030. https://doi.org/10.1080/0966369X.2017.1372385",
      "doi": ""
    },
    {
      "text": "Ulrike Pfeil, Panayiotis Zaphiris, and Chee Siang Ang. 2006. Cultural Differences in Collaborative Authoring of Wikipedia. Journal of Computer-Mediated Communication 12, 1 (2006), 88–113. https://doi.org/10.1111/j.1083-6101.2006.00316.x",
      "doi": ""
    },
    {
      "text": "Karl Polanyi. 1958. The Economy as Instituted Process. In Trade and Market in the Early Empires, Karl Polanyi, Conrad M. Arensberg, and Harry W. Pearson (Eds.). Free Press, New York, NY, 243–270.",
      "doi": ""
    },
    {
      "text": "Jennifer Preece and Ben Shneiderman. 2009. The Reader-to-Leader Framework: Motivating Technology-Mediated Social Participation. AIS Transactions on Human-Computer Interaction 1, 1(2009), 13–32.",
      "doi": ""
    },
    {
      "text": "Morten Rask. 2008. The Reach and Richness of Wikipedia: Is Wikinomics Only for Rich Countries?First Monday (May 2008). https://doi.org/10.5210/fm.v13i6.2046",
      "doi": ""
    },
    {
      "text": "Joseph Reagle. 2010. Good Faith Collaboration: The Culture of Wikipedia. MIT Press, Cambridge, MA.",
      "doi": "10.5555/1869901"
    },
    {
      "text": "Shruti Rijhwani, Royal Sequiera, Monojit Choudhury, Kalika Bali, and Chandra Shekhar Maddila. 2017. Estimating Code-Switching on Twitter with a Novel Generalized Word-Level Language Detection Technique. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). Association for Computational Linguistics, Vancouver, Canada, 1971–1982. https://doi.org/10.18653/v1/P17-1180",
      "doi": ""
    },
    {
      "text": "Joachim Schroer and Guido Hertel. 2009. Voluntary Engagement in an Open Web-Based Encyclopedia: Wikipedians and Why They Do It. Media Psychology 12 (Jan. 2009), 96–120(25). https://doi.org/10.1080/15213260802669466",
      "doi": ""
    },
    {
      "text": "Charles M. Schweik and Robert C. English. 2012. Internet Success: A Study of Open-Source Software Commons. MIT Press, Cambridge, MA.",
      "doi": "10.5555/2339410"
    },
    {
      "text": "Amartya Sen. 1998. Mortality as an Indicator of Economic Success and Failure. The Economic Journal 108, 446 (Jan. 1998), 1–25. https://doi.org/10.1111/1468-0297.00270",
      "doi": ""
    },
    {
      "text": "Amartya Sen. 2013. The Argumentative Indian: Writings on Indian History, Culture and Identity. Farrar, Straus and Giroux, New York.",
      "doi": ""
    },
    {
      "text": "Olivier Serrat. 2017. The Five Whys Technique. In Knowledge Solutions: Tools, Methods, and Approaches to Drive Organizational Performance, Olivier Serrat (Ed.). Springer, Singapore, 307–310. https://doi.org/10.1007/978-981-10-0983-9_32",
      "doi": ""
    },
    {
      "text": "Aaron Shaw and Eszter Hargittai. 2018. The Pipeline of Online Participation Inequalities: The Case of Wikipedia Editing. Journal of Communication 68, 1 (Feb. 2018), 143–168. https://doi.org/10.1093/joc/jqx003",
      "doi": ""
    },
    {
      "text": "Richard M. Stallman. 2002. Free Software, Free Society: Selected Essays of Richard M. Stallman. Lulu. com, Morrisville.",
      "doi": ""
    },
    {
      "text": "M. Reza Talebinejad, Hossein Vahid Dastjerdi, and Ra’na Mahmoodi. 2012. Barriers to Technical Terms in Translation: Borrowings or Neologisms. Terminology 18, 2 (2012), 167–187. https://doi.org/10.1075/term.18.2.02tal",
      "doi": ""
    },
    {
      "text": "Nathan TeBlunthuis, Aaron Shaw, and Benjamin Mako Hill. 2018. Revisiting ”The Rise and Decline” in a Population of Peer Production Projects. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 355:1–355:7. https://doi.org/10.1145/3173574.3173929",
      "doi": "10.1145/3173574.3173929"
    },
    {
      "text": "Jennifer Thom-Santelli, Dan R. Cosley, and Geri Gay. 2009. What’s Mine Is Mine: Territoriality in Collaborative Authoring. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’09). ACM, New York, NY, USA, 1481–1484. https://doi.org/10.1145/1518701.1518925",
      "doi": "10.1145/1518701.1518925"
    },
    {
      "text": "Kentaro Toyama. 2015. Geek heresy: Rescuing social change from the cult of technology. PublicAffairs, New York, NY.",
      "doi": ""
    },
    {
      "text": "Jan E. Trost. 1986. Statistically Nonrepresentative Stratified Sampling: A Sampling Technique for Qualitative Studies. Qualitative Sociology 9, 1 (March 1986), 54–57. https://doi.org/10.1007/BF00988249",
      "doi": ""
    },
    {
      "text": "Ziko Van Dijk. 2009. Wikipedia and Lesser-Resourced Languages. Language Problems and Language Planning 33, 3 (2009), 234–250.",
      "doi": ""
    },
    {
      "text": "Georg von Krogh, Sebastian Spaeth, and Karim R. Lakhani. 2003. Community, Joining, and Specialization in Open Source Software Innovation: A Case Study. Research Policy 32, 7 (2003), 1217–1241. https://doi.org/10.1016/S0048-7333(03)00050-7",
      "doi": ""
    },
    {
      "text": "Max Weber. 2003. The Protestant Ethic and the Spirit of Capitalism. Dover Publications, Mineola, NY.",
      "doi": ""
    },
    {
      "text": "Olga Zagovora, Fabian Flöck, and Claudia Wagner. 2017. ”(Weitergeleitet von Journalistin)”: The Endered Presentation of Professions on Wikipedia. In Proceedings of the 2017 ACM on Web Science Conference (WebSci ’17). ACM, New York, NY, 83–92. https://doi.org/10.1145/3091478.3091488",
      "doi": "10.1145/3091478.3091488"
    },
    {
      "text": "Xiaoquan Zhang and Chong Wang. 2012. Network Positions and Contributions to Online Public Goods: The Case of Chinese Wikipedia. Journal of Management Information Systems 29, 2 (Oct. 2012), 11–40. https://doi.org/10.2753/MIS0742-1222290202",
      "doi": "10.2753/MIS0742-1222290202"
    },
    {
      "text": "Xiaoquan Michael Zhang and Feng Zhu. 2011. Group Size and Incentives to Contribute: A Natural Experiment at Chinese Wikipedia. American Economic Review 101, 4 (June 2011), 1601–1615. https://doi.org/10.1257/aer.101.4.1601",
      "doi": ""
    }
  ]
}