{
  "doi": "10.1145/3491102.3517499",
  "title": "Does Dynamically Drawn Text Improve Learning? Investigating the Effect of Text Presentation Styles in Video Learning",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2022,
  "badges": [],
  "abstract": "Dynamically drawn content (e.g., handwritten text) in learning videos is believed to improve users’ engagement and learning over static powerpoint-based ones. However, evidence from existing literature is inconclusive. With the emergence of Optical Head-Mounted Displays (OHMDs), recent work has shown that video learning can be adapted for on-the-go scenarios. To better understand the role of dynamic drawing, we decoupled dynamically drawn text into two factors (font style and motion of appearance) and studied their impact on learning performance under two usage scenarios (while seated with desktop and walking with OHMD). We found that although letter-traced text was more engaging for some users, most preferred learning with typeface text that displayed the entire word at once and achieved better recall (46.7% higher), regardless of the usage scenarios. Insights learned from the studies can better inform designers on how to present text in videos for ubiquitous access.",
  "tags": [
    "Video learning",
    "Heads-up computing",
    "Smart-glasses",
    "Dynamic drawing",
    "Text presentation styles",
    "OHMD",
    "Mobile HCI"
  ],
  "authors": [
    {
      "name": "Ashwin Ram",
      "institution": "Department of Computer Science, NUS-HCI Lab, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659691491",
      "orcid": "missing"
    },
    {
      "name": "Shengdong Zhao",
      "institution": "Department of Computer Science, NUS-HCI Lab, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416592901",
      "orcid": "0000-0001-7971-3107"
    }
  ],
  "references": [
    {
      "text": "Leon Barnard, Ji Soo Yi, Julie A. Jacko, and Andrew Sears. 2005. An Empirical Comparison of Use-in-Motion Evaluation Scenarios for Mobile Computing Devices. 62, 4 (April 2005), 487–520. https://doi.org/10.1016/j.ijhcs.2004.12.002",
      "doi": "10.1016/j.ijhcs.2004.12.002"
    },
    {
      "text": "Cynthia J. Brame. 2016. Effective Educational Videos: Principles and Guidelines for Maximizing Student Learning from Video Content. CBE—Life Sciences Education 15, 4 (2016), es6. https://doi.org/10.1187/cbe.16-03-0125",
      "doi": ""
    },
    {
      "text": "Kelly Caine. 2016. Local Standards for Sample Size at CHI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 981–992. https://doi.org/10.1145/2858036.2858498",
      "doi": "10.1145/2858036.2858498"
    },
    {
      "text": "Soon Hau Chua, Simon T. Perrault, Denys J. C. Matthies, and Shengdong Zhao. 2016. Positioning Glass: Investigating Display Positions of Monocular Optical See-Through Head-Mounted Display. In Proceedings of the Fourth International Symposium on Chinese CHI (San Jose, USA) (ChineseCHI2016). Association for Computing Machinery, New York, NY, USA, Article 1, 6 pages. https://doi.org/10.1145/2948708.2948713",
      "doi": "10.1145/2948708.2948713"
    },
    {
      "text": "Joke Coens, Ellen Degryse, Marie-Paul Senecaut, Jorge Cottyn, and Geraldine Clarebout. 2011. Listening to an educational podcast while walking or jogging: Can students really multitask?International Journal of Mobile and Blended Learning (IJMBL) 3, 3(2011), 23–33. https://doi.org/10.4018/jmbl.2011070102",
      "doi": "10.4018/jmbl.2011070102"
    },
    {
      "text": "Andrew Cross, Mydhili Bayyapunedi, Edward Cutrell, Anant Agarwal, and William Thies. 2013. TypeRighting: Combining the Benefits of Handwriting and Typeface in Online Educational Videos. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 793–796. https://doi.org/10.1145/2470654.2470766",
      "doi": "10.1145/2470654.2470766"
    },
    {
      "text": "Adobe After Effects 2021. Using the Detail-preserving Upscale effect. Adobe After Effects. Retrieved Decemeber 29, 2021 from https://helpx.adobe.com/after-effects/using/detail-preserving-upscale-effect.html#:~:text=The%20Detail%2Dpreserving%20Upscale%20effect%20is%20capable%20of%20scaling%20up,to%20digital%20cinema%20frame%20sizes.",
      "doi": ""
    },
    {
      "text": "Yehudit Judy Dori and John Belcher. 2005. How Does Technology-Enabled Active Learning Affect Undergraduate Students’ Understanding of Electromagnetism Concepts?Journal of the Learning Sciences 14, 2 (2005), 243–279. https://doi.org/10.1207/s15327809jls1402_3",
      "doi": ""
    },
    {
      "text": "Linnea C. Ehri. 2005. Learning to Read Words: Theory, Findings, and Issues. Scientific Studies of Reading 9, 2 (2005), 167–188. https://doi.org/10.1207/s1532799xssr0902_4",
      "doi": ""
    },
    {
      "text": "Lisa A. Elkin, Matthew Kay, James J. Higgins, and Jacob O. Wobbrock. 2021. An Aligned Rank Transform Procedure for Multifactor Contrast Tests. arxiv:2102.11824 [stat.ME]",
      "doi": ""
    },
    {
      "text": "James Farley, Evan Risko, and Alan Kingstone. 2013. Everyday attention and lecture retention: the effects of time, fidgeting, and mind wandering. Frontiers in Psychology 4 (2013), 619. https://doi.org/10.3389/fpsyg.2013.00619",
      "doi": ""
    },
    {
      "text": "Logan Fiorella and Richard E Mayer. 2016. Effects of observing the instructor draw diagrams on learning from multimedia messages.Journal of Educational Psychology 108, 4 (2016), 528–546. https://doi.org/doi: 10.1037/edu00000",
      "doi": ""
    },
    {
      "text": "Logan Fiorella, Andrew T Stull, Shelbi Kuhlmann, and Richard E Mayer. 2019. Instructor presence in video lectures: The role of dynamic drawings, eye contact, and instructor visibility.Journal of Educational Psychology 111, 7 (2019), 1162–1171. https://doi.org/10.1037/edu0000325",
      "doi": ""
    },
    {
      "text": "Logan Fiorella, Andrew T. Stull, Shelbi Kuhlmann, and Richard E. Mayer. 2020. Fostering generative learning from video lessons: Benefits of instructor-generated drawings and learner-generated explanations.Journal of Educational Psychology 112, 5 (2020), 895–906. https://doi.org/10.1037/edu0000408",
      "doi": ""
    },
    {
      "text": "J. L. Gabbard, J. E. Swan, and D. Hix. 2006. The Effects of Text Drawing Styles, Background Textures, and Natural Lighting on Text Legibility in Outdoor Augmented Reality. Presence 15, 1 (2006), 16–32. https://doi.org/10.1162/pres.2006.15.1.16",
      "doi": "10.1162/pres.2006.15.1.16"
    },
    {
      "text": "Joseph L. Gabbard, J. Edward Swan, Deborah Hix, Si-Jung Kim, and Greg Fitch. 2007. Active Text Drawing Styles for Outdoor Augmented Reality: A User-Based Study and Design Implications. In 2007 IEEE Virtual Reality Conference. 35–42. https://doi.org/10.1109/VR.2007.352461",
      "doi": ""
    },
    {
      "text": "Debjyoti Ghosh, Pin Sym Foong, Shengdong Zhao, Can Liu, Nuwan Janaka, and Vinitha Erusu. 2020. EYEditor: Towards On-the-Go Heads-Up Text Editing Using Voice and Manual Input. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376173",
      "doi": "10.1145/3313831.3376173"
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2005. The Bubble Cursor: Enhancing Target Acquisition by Dynamic Resizing of the Cursor’s Activation Area. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Portland, Oregon, USA) (CHI ’05). Association for Computing Machinery, New York, NY, USA, 281–290. https://doi.org/10.1145/1054972.1055012",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Philip J. Guo, Juho Kim, and Rob Rubin. 2014. How Video Production Affects Student Engagement: An Empirical Study of MOOC Videos. In Proceedings of the First ACM Conference on Learning @ Scale Conference (Atlanta, Georgia, USA) (L@S ’14). Association for Computing Machinery, New York, NY, USA, 41–50. https://doi.org/10.1145/2556325.2566239",
      "doi": "10.1145/2556325.2566239"
    },
    {
      "text": "Ewa Gustafsson, Sara Thomee, Anna Grimby-Ekman, and Mats Hagberg. 2017. Texting on mobile phones and musculoskeletal disorders in young adults: a five-year cohort study. Applied ergonomics 58(2017), 208–214. https://doi.org/10.1016/j.apergo.2016.06.012",
      "doi": ""
    },
    {
      "text": "Rebecca J. Hess, Jennifer S. Brach, Sara R. Piva, and Jessie M. VanSwearingen. 2010. Walking Skill Can Be Assessed in Older Adults: Validity of the Figure-of-8 Walk Test. Physical Therapy 90, 1 (01 2010), 89–99. https://doi.org/10.2522/ptj.20080121",
      "doi": ""
    },
    {
      "text": "Anne P Hillstrom and Yu-Chin Chai. 2006. Factors that guide or disrupt attentive visual processing. Computers in human behavior 22, 4 (2006), 648–656. https://doi.org/10.1016/j.chb.2005.12.003",
      "doi": ""
    },
    {
      "text": "E. Keuleers and M. Brysbaert. 2010. Wuggy: A multilingual pseudoword generator. Behavior Research Methods 42, 3 (2010), 627–633. https://doi.org/10.3758/BRM.42.3.627",
      "doi": ""
    },
    {
      "text": "Khan Academy 2020. 2018 in review: Annual Report. Khan Academy. Retrieved September 7, 2021 from https://blog.khanacademy.org/2018-in-review-annual-report/",
      "doi": ""
    },
    {
      "text": "Khan Academy 2020. Countercurrent multiplication in the kidney | Renal system physiology | NCLEX-RN | Khan Academy. Khan Academy. Retrieved August 26, 2021 from https://www.youtube.com/watch?v=Vqce2dtg45U&ab_channel=khanacademymedicine",
      "doi": ""
    },
    {
      "text": "Khan Academy 2020. Khan Academy. Khan Academy. Retrieved August 25, 2021 from http://www.khanacademy.org/",
      "doi": ""
    },
    {
      "text": "David R. Krathwohl. 2002. A Revision of Bloom’s Taxonomy: An Overview. Theory Into Practice 41, 4 (2002), 212–218. https://doi.org/10.1207/s15430421tip4104_2",
      "doi": ""
    },
    {
      "text": "Pin-Sung Ku, Yu-Chih Lin, Yi-Hao Peng, and Mike Y. Chen. 2019. PeriText: Utilizing Peripheral Vision for Reading Text on Augmented Reality Smart Glasses. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 630–635. https://doi.org/10.1109/VR.2019.8798065",
      "doi": ""
    },
    {
      "text": "Zhen Li, Joannes Chan, Joshua Walton, Hrvoje Benko, Daniel Wigdor, and Michael Glueck. 2021. Armstrong: An Empirical Examination of Pointing at Non-Dominant Arm-Anchored UIs in Virtual Reality. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 123, 14 pages. https://doi.org/10.1145/3411764.3445064",
      "doi": "10.1145/3411764.3445064"
    },
    {
      "text": "Manuela Macedonia and Thomas R. Knösche. 2011. Body in Mind: How Gestures Empower Foreign Language Learning. Mind, Brain, and Education 5, 4 (2011), 196–211. https://doi.org/10.1111/j.1751-228X.2011.01129.x",
      "doi": ""
    },
    {
      "text": "Yuki Matsuura, Tsutomu Terada, Tomohiro Aoki, Susumu Sonoda, Naoya Isoyama, and Masahiko Tsukamoto. 2019. Readability and Legibility of Fonts Considering Shakiness of Head Mounted Displays(ISWC ’19). Association for Computing Machinery, New York, NY, USA, 10 pages. https://doi.org/10.1145/3341163.3347748",
      "doi": "10.1145/3341163.3347748"
    },
    {
      "text": "Richard E. Mayer. 2002. Multimedia learning. Psychology of Learning and Motivation, Vol. 41. Academic Press, 85 – 139. https://doi.org/10.1016/S0079-7421(02)80005-6",
      "doi": ""
    },
    {
      "text": "Richard E. Mayer. 2005. Principles of Multimedia Learning Based on Social Cues : Personalization, Voice, and Image Principles. Cambridge University Press, 201–212. https://doi.org/10.1017/CBO9780511816819.014",
      "doi": ""
    },
    {
      "text": "Jennifer Momsen, Tammy Long, Sara Wyse, and Diane Ebert-May. 2010. Just the Facts? Introductory Undergraduate Biology Courses Focus on Low-Level Cognitive Skills. CBE life sciences education 9 (12 2010), 435–40. https://doi.org/10.1187/cbe.10-01-0001",
      "doi": ""
    },
    {
      "text": "M. R. Nassar, J. C. Helmers, and M. J. Frank. 2018. Chunking as a rational strategy for lossy data compression in visual working memory. Psychological review 125, 4 (2018), 486–511. https://doi.org/10.1037/rev0000101",
      "doi": ""
    },
    {
      "text": "Dennis Norris, Anne Cutler, James M. McQueen, and Sally Butterfield. 2006. Phonological and conceptual activation in speech comprehension. Cognitive Psychology 53, 2 (2006), 146–193. https://doi.org/10.1016/j.cogpsych.2006.03.001",
      "doi": ""
    },
    {
      "text": "Fred Paas, Alexander Renkl, and John Sweller. 2003. Cognitive Load Theory and Instructional Design: Recent Developments. Educational Psychologist 38, 1 (2003), 1–4. https://doi.org/10.1207/S15326985EP3801_1",
      "doi": ""
    },
    {
      "text": "Ashwin Ram and Shengdong Zhao. 2021. LSVP: Towards Effective On-the-Go Video Learning Using Optical Head-Mounted Displays. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 5, 1, Article 30 (March 2021), 27 pages. https://doi.org/10.1145/3448118",
      "doi": "10.1145/3448118"
    },
    {
      "text": "Rufat Rzayev, Paweł W. Woundefinedniak, Tilman Dingler, and Niels Henze. 2018. Reading on Smart Glasses: The Effect of Text Position, Presentation Type and Walking. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3173574.3173619",
      "doi": "10.1145/3173574.3173619"
    },
    {
      "text": "Clive Thompson. 2011. How Khan Academy is changing the rules of education. Retrieved August 25, 2021 from https://www.wired.com/2011/07/ff-khan/",
      "doi": ""
    },
    {
      "text": "Endel Tulving and Zena Pearlstone. 1966. Availability versus accessibility of information in memory for words. Journal of Verbal Learning and Verbal Behavior 5, 4 (1966), 381 – 391. https://doi.org/10.1016/S0022-5371(66)80048-8",
      "doi": ""
    },
    {
      "text": "Olive G. Turner. 1930. The Comparative Legibility and Speed of Manuscript and Cursive Handwriting. The Elementary School Journal 30, 10 (1930), 780–786. http://www.jstor.org/stable/996624",
      "doi": ""
    },
    {
      "text": "Adobe After Effects 2021. Apply Blur and Sharpen in After Effects. Adobe After Effects. Retrieved Decemeber 29, 2021 from https://helpx.adobe.com/after-effects/using/blur-sharpen-effects.html",
      "doi": ""
    },
    {
      "text": "Kristin Vadas, Nirmal Patel, Kent Lyons, Thad Starner, and Julie Jacko. 2006. Reading On-the-Go: A Comparison of Audio and Hand-Held Displays. In Proceedings of the 8th Conference on Human-Computer Interaction with Mobile Devices and Services(Helsinki, Finland) (MobileHCI ’06). Association for Computing Machinery, New York, NY, USA, 219–226. https://doi.org/10.1145/1152215.1152262",
      "doi": "10.1145/1152215.1152262"
    },
    {
      "text": "Bochkarev Vladimir, Shevlyakova Anna, and Solovyev Valery. 2012. Average word length dynamics as indicator of cultural changes in society. Social Evolution and History 14 (2012), 153–175.",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 143–146. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Xing-Dong Yang, Tovi Grossman, Pourang Irani, and George Fitzmaurice. 2011. TouchCuts and TouchZoom: Enhanced Target Selection for Touch Displays Using Finger Proximity Sensing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 2585–2594. https://doi.org/10.1145/1978942.1979319",
      "doi": "10.1145/1978942.1979319"
    },
    {
      "text": "Hui-Shyong Yeo, Xiao-Shen Phang, Steven J. Castellucci, Per Ola Kristensson, and Aaron Quigley. 2017. Investigating Tilt-Based Gesture Keyboard Entry for Single-Handed Text Entry on Large Devices. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4194–4202. https://doi.org/10.1145/3025453.3025520",
      "doi": "10.1145/3025453.3025520"
    },
    {
      "text": "Shengdong Zhao and Ravin Balakrishnan. 2004. Simple vs. Compound Mark Hierarchical Marking Menus. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (Santa Fe, NM, USA) (UIST ’04). Association for Computing Machinery, New York, NY, USA, 33–42. https://doi.org/10.1145/1029632.1029639",
      "doi": "10.1145/1029632.1029639"
    },
    {
      "text": "Yue Zhao, Tarmo Robal, Christoph Lofi, and Claudia Hauff. 2018. Stationary vs. Non-Stationary Mobile Learning in MOOCs. In Adjunct Publication of the 26th Conference on User Modeling, Adaptation and Personalization(UMAP ’18). Association for Computing Machinery, New York, NY, USA, 299–303. https://doi.org/10.1145/3213586.3225241",
      "doi": "10.1145/3213586.3225241"
    }
  ]
}