{
  "doi": "10.1145/3491102.3517661",
  "title": "Interpolating Happiness: Understanding the Intensity Gradations of Face Emojis Across Cultures",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "We frequently utilize face emojis to express emotions in digital communication. But how wholly and precisely do such pictographs sample the emotional spectrum, and are there gaps to be closed? Our research establishes emoji intensity scales for seven basic emotions: happiness, anger, disgust, sadness, shock, annoyance, and love. In our survey (N = 1195), participants worldwide assigned emotions and intensities to 68 face emojis. According to our results, certain feelings, such as happiness or shock, are visualized by manifold emojis covering a broad spectrum of intensities. Other feelings, such as anger, have limited and only very intense representative visualizations. We further emphasize that the cultural background influences emojis’ perception: for instance, linear-active cultures (e.g., UK, Germany) rate the intensity of such visualizations higher than multi-active (e.g., Brazil, Russia) or reactive cultures (e.g., Indonesia, Singapore). To summarize, our manuscript promotes future research on more expressive, culture-aware emoji design.",
  "authors": [
    {
      "name": "Andrey Krekhov",
      "institution": "COVIDAG, University of Duisburg-Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658760231",
      "orcid": "missing"
    },
    {
      "name": "Katharina Emmerich",
      "institution": "COVIDAG, University of Duisburg-Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81551044556",
      "orcid": "0000-0002-3198-6373"
    },
    {
      "name": "Johannes Fuchs",
      "institution": "University of Konstanz, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81487644783",
      "orcid": "missing"
    },
    {
      "name": "Jens Harald Krueger",
      "institution": "COVIDAG, University of Duisburg-Essen, Germany and School of Computing, University of Utah, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660595431",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "1881. Typographical Art. Puck 212 (Mar 1881), 65.",
      "doi": ""
    },
    {
      "text": "Sarah Alismail and Hengwei Zhang. 2018. The Use of Emoji in Electronic User Experience Questionnaire: An Exploratory Case Study. In Proceedings of the 51st Hawaii International Conference on System Sciences. 3366–3375.",
      "doi": ""
    },
    {
      "text": "Kate Allen, Ruth Marlow, Vanessa Edwards, Claire Parker, Lauren Rodgers, Obioha C Ukoumunne, Edward Chan Seem, Rachel Hayes, Anna Price, and Tamsin Ford. 2018. ‘How I Feel About My School’: The construction and validation of a measure of wellbeing at school for primary school children. Clinical Child Psychology and Psychiatry 23, 1 (2018), 25–41. https://doi.org/10.1177/1359104516687612 arXiv:https://doi.org/10.1177/1359104516687612PMID: 28135832.",
      "doi": ""
    },
    {
      "text": "Qiyu Bai, Qi Dan, Zhe Mu, and Maokun Yang. 2019. A Systematic Review of Emoji: Current Research and Future Perspectives. Frontiers in Psychology 10 (2019). https://doi.org/10.3389/fpsyg.2019.02221",
      "doi": ""
    },
    {
      "text": "Francesco Barbieri, Miguel Ballesteros, Francesco Ronzano, and Horacio Saggion. 2018. Multimodal Emoji Prediction. In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers). Association for Computational Linguistics, New Orleans, Louisiana, 679–686. https://doi.org/10.18653/v1/N18-2107",
      "doi": ""
    },
    {
      "text": "Francesco Barbieri, German Kruszewski, Francesco Ronzano, and Horacio Saggion. 2016. How cosmopolitan are emojis? Exploring emojis usage and meaning over different languages with distributional semantics. In Proceedings of the 24th ACM international conference on Multimedia. 531–535.",
      "doi": "10.1145/2964284.2967278"
    },
    {
      "text": "Lidia Bielinis. 2019. MY GRANDCHILDREN WOULD KNOW THAT… SENIORS INTERPRETING EMOTICONS. In SOCIETY. INTEGRATION. EDUCATION. Proceedings of the International Scientific Conference, Vol. 5. 26–41.",
      "doi": ""
    },
    {
      "text": "M. M. Bradley and P. J. Lang. 1994. Measuring emotion: the Self-Assessment Manikin and the Semantic Differential. Journal of behavior therapy and experimental psychiatry 25, 1(1994), 49–59. https://doi.org/10.1016/0005-7916(94)90063-9",
      "doi": "10.1016/0005-7916%2894%2990063-9"
    },
    {
      "text": "Spencer Cappallo, Thomas Mensink, and Cees G.M. Snoek. 2015. Image2Emoji: Zero-Shot Emoji Prediction for Visual Media. In Proceedings of the 23rd ACM International Conference on Multimedia (Brisbane, Australia) (MM ’15). Association for Computing Machinery, New York, NY, USA, 1311–1314. https://doi.org/10.1145/2733373.2806335",
      "doi": "10.1145/2733373.2806335"
    },
    {
      "text": "Spencer Cappallo, Thomas Mensink, and Cees G.M. Snoek. 2015. Query-by-Emoji Video Search. In Proceedings of the 23rd ACM International Conference on Multimedia (Brisbane, Australia) (MM ’15). Association for Computing Machinery, New York, NY, USA, 735–736. https://doi.org/10.1145/2733373.2807961",
      "doi": "10.1145/2733373.2807961"
    },
    {
      "text": "Spencer Cappallo, Stacey Svetlichnaya, Pierre Garrigues, Thomas Mensink, and Cees G. M. Snoek. 2019. New Modality: Emoji Challenges in Prediction, Anticipation, and Retrieval. IEEE Transactions on Multimedia 21, 2 (2019), 402–415. https://doi.org/10.1109/TMM.2018.2862363",
      "doi": "10.1109/TMM.2018.2862363"
    },
    {
      "text": "Nan-Chen Chen, Daniel Perry, Hidekazu Saegusa, and Cecilia Aragon. 2020. A Cross-Cultural Survey of Emoticon Research Before 2015. Human Centered Design and Engineering Technical Report (2020).",
      "doi": ""
    },
    {
      "text": "Zhenpeng Chen, Xuan Lu, Wei Ai, Huoran Li, Qiaozhu Mei, and Xuanzhe Liu. 2018. Through a gender lens: Learning usage patterns of emojis from large-scale android users. In Proceedings of the 2018 World Wide Web Conference. 763–772.",
      "doi": "10.1145/3178876.3186157"
    },
    {
      "text": "Herbert H Clark. 1996. Using language. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Henriette Cramer, Paloma de Juan, and Joel Tetreault. 2016. Sender-intended functions of emojis in US messaging. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services. 504–509.",
      "doi": "10.1145/2935334.2935370"
    },
    {
      "text": "Marcel Danesi. 2016. The semiotics of emoji: The rise of visual language in the age of the internet. Bloomsbury Publishing.",
      "doi": "10.5555/3126077"
    },
    {
      "text": "Paul Ekman. 1972. Universal and cultural differences in facial expression of emotion. In Nebraska symposium on motivation, Vol. 19. University of Nebraska Press, 207–284.",
      "doi": ""
    },
    {
      "text": "Paul Ekman. 1992. Are there basic emotions?(1992).",
      "doi": ""
    },
    {
      "text": "Paul Ekman. 1992. Facial expressions of emotion: New findings, new questions.",
      "doi": ""
    },
    {
      "text": "Abdallah El Ali, Torben Wallbaum, Merlin Wasmann, Wilko Heuten, and Susanne CJ Boll. 2017. Face2emoji: Using facial emotional expressions to filter emojis. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 1577–1584.",
      "doi": "10.1145/3027063.3053086"
    },
    {
      "text": "Dorothea Erharter and Elka Xharo. 2016. Developer-Guideline Usability von Apps für Seniorinnen und Senioren. Developer-Guideline Usability von Apps für Seniorinnen und Senioren. Entstanden im Rahmen des Projektes ”mobi. senior. A ”. Wien (2016).",
      "doi": ""
    },
    {
      "text": "Thorsten M. Erle, Karoline Schmid, Simon H. Goslar, and Jared D. Martin. 2021. Emojis as social information in digital communication. Emotion (2021), Advance online publication. https://doi.org/10.1037/emo0000992",
      "doi": ""
    },
    {
      "text": "Vyvyan Evans. 2017. The emoji code: How smiley faces, love hearts and thumbs up are changing the way we communicate. Michael O’Mara Books.",
      "doi": ""
    },
    {
      "text": "Jose A Gallud, Habib M Fardoun, Fernando Andres, and Nehme Safa. 2018. A study on how older people use emojis. In Proceedings of the XIX International Conference on Human Computer Interaction. 1–4.",
      "doi": "10.1145/3233824.3233861"
    },
    {
      "text": "Boting Gao and Doug P. VanderLaan. 2020. Cultural Influences on Perceptions of Emotions Depicted in Emojis. Cyberpsychology, Behavior, and Social Networking 23, 8(2020), 567–570. https://doi.org/10.1089/cyber.2020.0024",
      "doi": ""
    },
    {
      "text": "Andrzej Grzybowski and Konrad Kupidura-Majewski. 2019. What is color and how it is perceived?Clinics in Dermatology 37, 5 (2019), 392–401. https://doi.org/10.1016/j.clindermatol.2019.07.008 The Color of Skin.",
      "doi": ""
    },
    {
      "text": "Sharath Chandra Guntuku, Mingyang Li, Louis Tay, and Lyle H Ungar. 2019. Studying cultural differences in emoji usage across the east and the west. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 13. 226–235.",
      "doi": ""
    },
    {
      "text": "Edward T Hall. 1976. Beyond culture. Garden city. NY: Anchor (1976).",
      "doi": ""
    },
    {
      "text": "Tianran Hu, Han Guo, Hao Sun, Thuy-vy Nguyen, and Jiebo Luo. 2017. Spice up your chat: the intentions and sentiment effects of using emojis. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 11.",
      "doi": ""
    },
    {
      "text": "A. Illendula, K. Manohar, and M. Yedulla. 2018. Which Emoji Talks Best for My Picture?. In 2018 IEEE/WIC/ACM International Conference on Web Intelligence (WI). IEEE Computer Society, Los Alamitos, CA, USA, 514–519. https://doi.org/10.1109/WI.2018.00-44",
      "doi": ""
    },
    {
      "text": "Anurag Illendula and Amit Sheth. 2019. Multimodal emotion classification. In Companion Proceedings of The 2019 World Wide Web Conference. 439–449.",
      "doi": "10.1145/3308560.3316549"
    },
    {
      "text": "Rachael E Jack, Oliver GB Garrod, Hui Yu, Roberto Caldara, and Philippe G Schyns. 2012. Facial expressions of emotion are not culturally universal. Proceedings of the National Academy of Sciences 109, 19(2012), 7241–7244.",
      "doi": ""
    },
    {
      "text": "Ryan Kelly and Leon Watts. 2015. Characterising the inventive appropriation of emoji as relationally meaningful in mediated close personal relationships. Experiences of technology appropriation: Unanticipated users, usage, circumstances, and design 2(2015).",
      "doi": ""
    },
    {
      "text": "Sujay Khandekar, Joseph Higg, Yuanzhe Bian, Chae Won Ryu, Jerry O. Talton Iii, and Ranjitha Kumar. 2019. Opico: a study of emoji-first communication in a mobile social app. In Companion Proceedings of The 2019 World Wide Web Conference. 450–458.",
      "doi": "10.1145/3308560.3316547"
    },
    {
      "text": "Paul R Kleinginna and Anne M Kleinginna. 1981. A categorized list of emotion definitions, with suggestions for a consensual definition. Motivation and emotion 5, 4 (1981), 345–379.",
      "doi": ""
    },
    {
      "text": "Petra Kralj Novak, Jasmina Smailović, Borut Sluban, and Igor Mozetič. 2015. Sentiment of emojis. PloS one 10, 12 (2015), e0144296.",
      "doi": ""
    },
    {
      "text": "Richard Lewis. 2010. When cultures collide. Nicholas Brealey Publishing Boston, MA.",
      "doi": ""
    },
    {
      "text": "Mingyang Li, Sharath Guntuku, Vinit Jakhetiya, and Lyle Ungar. 2019. Exploring (Dis-)Similarities in Emoji-Emotion Association on Twitter and Weibo. In Companion Proceedings of The 2019 World Wide Web Conference (San Francisco, USA) (WWW ’19). Association for Computing Machinery, New York, NY, USA, 461–467. https://doi.org/10.1145/3308560.3316546",
      "doi": "10.1145/3308560"
    },
    {
      "text": "Nikola Ljubešić and Darja Fišer. 2016. A global analysis of emoji usage. In Proceedings of the 10th Web as Corpus Workshop. 82–89.",
      "doi": ""
    },
    {
      "text": "Xuan Lu, Wei Ai, Xuanzhe Liu, Qian Li, Ning Wang, Gang Huang, and Qiaozhu Mei. 2016. Learning from the ubiquitous language: an empirical analysis of emoji usage of smartphone users. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. 770–780.",
      "doi": "10.1145/2971648.2971724"
    },
    {
      "text": "Gretchen McCulloch and Lauren Gawne. 2018. Emoji grammar as beat gestures. In Proceedings of the 1st International Workshop on Emoji Understanding and Applications in Social Media, Standford [en línea]. Disponible en http://knoesis. org/resources/Emoji2018/Emoji2018_Papers/Paper13_Emoji2018.pdf [Consulta 11/12/2019].",
      "doi": ""
    },
    {
      "text": "Wulf-Uwe Meyer, Rainer Reisenzein, and Achim Schützwohl. 2001. Einführung in die Emotionspsychologie. Band I: Die Emotionstheorien von Watson, James und Schachter. Huber, Bern Göttingen, Bd 1, 2 (2001).",
      "doi": ""
    },
    {
      "text": "Hannah Miller, Daniel Kluver, Jacob Thebault-Spieker, Loren Terveen, and Brent Hecht. 2017. Understanding Emoji Ambiguity in Context: The Role of Text in Emoji-Related Miscommunication. In Proceedings of the 11th International Conference on Web and Social Media, ICWSM 2017. AAAI Press, 152–161.",
      "doi": ""
    },
    {
      "text": "Hannah Miller, Jacob Thebault-Spieker, Shuo Chang, Isaac Johnson, Loren Terveen, and Brent Hecht. 2016. “Blissfully Happy” or “Ready to Fight”: Varying Interpretations of Emoji. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 10.",
      "doi": ""
    },
    {
      "text": "Hannah Miller Hillberg, Zachary Levonian, Daniel Kluver, Loren Terveen, and Brent Hecht. 2018. What I See is What You Don’t Get: The Effects of (Not) Seeing Emoji Rendering Differences across Platforms. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–24.",
      "doi": "10.1145/3274393"
    },
    {
      "text": "Svenja Noichl, Nadine Bergner, and Ulrik Schroeder. 2017. Zielgruppengerechte App-Icons für Seniorinnen und Senioren. Bildungsräume 2017(2017).",
      "doi": ""
    },
    {
      "text": "Jaram Park, Vladimir Barash, Clay Fink, and Meeyoung Cha. 2013. Emoticon style: Interpreting differences in emoticons across cultures. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 7.",
      "doi": ""
    },
    {
      "text": "Henning Pohl, Christian Domin, and Michael Rohs. 2017. Beyond Just Text: Semantic Emoji Similarity Modeling to Support Expressive Communication 👫📲😃. ACM Trans. Comput.-Hum. Interact. 24, 1, Article 6 (March 2017), 42 pages. https://doi.org/10.1145/3039685",
      "doi": "10.1145/3039685"
    },
    {
      "text": "Marília Prada, David L. Rodrigues, Margarida V. Garrido, Diniz Lopes, Bernardo Cavalheiro, and Rui Gaspar. 2018. Motives, frequency and attitudes toward emoji and emoticon use. Telematics and Informatics 35, 7 (2018), 1925–1934. https://doi.org/10.1016/j.tele.2018.06.005",
      "doi": ""
    },
    {
      "text": "Monica A Riordan. 2017. Emojis as tools for emotion work: Communicating affect in text messages. Journal of Language and Social Psychology 36, 5 (2017), 549–567.",
      "doi": ""
    },
    {
      "text": "Giuseppe Riva. 2002. The sociocognitive psychology of computer-mediated communication: The present and future of technology-based interactions. Cyberpsychology & behavior 5, 6 (2002), 581–598.",
      "doi": ""
    },
    {
      "text": "Jessica Röhner, Astrid Schütz, and Astrid Schütz. 2012. Psychologie der Kommunikation. Springer.",
      "doi": ""
    },
    {
      "text": "James P Spradley and David W McCurdy. 2012. Conformity and conflict: Readings in cultural anthropology. Jill Potash.",
      "doi": ""
    },
    {
      "text": "Sandeep Suntwal, Sue Brown, and Laura Brandimarte. 2021. Pictographs, Ideograms, and Emojis (PIE): A Framework for Empirical Research Using Non-verbal Cues. In Proceedings of the 54th Hawaii International Conference on System Sciences. 6400–6409. https://doi.org/10.24251/HICSS.2021.771",
      "doi": ""
    },
    {
      "text": "Kohske Takahashi, Takanori Oishi, and Masaki Shimada. 2017. Is ☺ Smiling? Cross-Cultural Study on Recognition of Emoticon’s Emotion. Journal of Cross-Cultural Psychology 48, 10 (2017), 1578–1586. https://doi.org/10.1177/0022022117734372 arXiv:https://doi.org/10.1177/0022022117734372",
      "doi": ""
    },
    {
      "text": "Garreth W. Tigwell and David R. Flatla. 2016. Oh That’s What You Meant! Reducing Emoji Misunderstanding. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 859–866. https://doi.org/10.1145/2957265.2961844",
      "doi": "10.1145/2957265.2961844"
    },
    {
      "text": "Alexander Toet and Jan B.F. van Erp. 2019. The EmojiGrid as a Tool to Assess Experienced and Perceived Emotions. Psych 1, 1 (2019), 469–481. https://doi.org/10.3390/psych1010036",
      "doi": ""
    },
    {
      "text": "Sarah Theres Völkel, Daniel Buschek, Jelena Pranjic, and Heinrich Hussmann. 2019. Understanding emoji interpretation through user personality and message context. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services. 1–12.",
      "doi": "10.1145/3338286.3340114"
    },
    {
      "text": "Sanjaya Wijeratne, Lakshika Balasuriya, Amit Sheth, and Derek Doran. 2017. EmojiNet: An Open Service and API for Emoji Sense Discovery. In Proceedings of the 11th International AAAI Conference on Web and Social Media (Montréal, Canada) (ICWSM ’17). AAAI Press, Palo Alto, USA, 437–446. https://aaai.org/ocs/index.php/ICWSM/ICWSM17/paper/view/15551",
      "doi": ""
    },
    {
      "text": "Sanjaya Wijeratne, Lakshika Balasuriya, Amit Sheth, and Derek Doran. 2017. A Semantics-Based Measure of Emoji Similarity. In Proceedings of the International Conference on Web Intelligence (Leipzig, Germany) (WI ’17). Association for Computing Machinery, New York, NY, USA, 646–653. https://doi.org/10.1145/3106426.3106490",
      "doi": "10.1145/3106426.3106490"
    },
    {
      "text": "Sarah Wiseman and Sandy J. J. Gould. 2018. Repurposing Emoji for Personalised Communication: Why 🍕 Means “I Love You”. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3173574.3173726",
      "doi": "10.1145/3173574.3173726"
    },
    {
      "text": "Ian D. Wood and Sebastian Ruder. 2016. Emoji as Emotion Tags for Tweets. In Proceedings of the Emotion and Sentiment Analysis Workshop LREC 2016 (Portoroz, Slovenia) (LREC 2016). European Language Resources Association, 76–79.",
      "doi": ""
    },
    {
      "text": "Rui Zhou, Jasmine Hentschel, and Neha Kumar. 2017. Goodbye text, hello emoji: Mobile communication on WeChat in China. In Proceedings of the 2017 CHI conference on human factors in computing systems. 748–759.",
      "doi": "10.1145/3025453.3025800"
    }
  ]
}