{
  "doi": "10.1145/3491102.3501997",
  "title": "Understanding People’s Experience for Physical Activity Planning and Exploring the Impact of Historical Records on Plan Creation and Execution",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "Making and executing physical activity plans can help people improve their physical activity levels. However, little is known about how people make physical activity plans in everyday settings and how people can be assisted in creating more successful plans. In this paper, we developed and deployed a mobile app as a probe to investigate the in-the-wild physical activity planning experience for 28 days with 17 participants. Additionally, we explored the impact of presenting successful and unsuccessful planning records on participants’ planning behaviors. Based on interviews before, during, and after the deployment, we offer a description of what factors participants considered to fit their exercise plans into their existing routines, as well as factors leading to plan failures and dissatisfaction with planned physical activity. With access to historical records, participants derived insights to improve their plans, including trends in successes and failures. Based on those findings, we discuss the implications for better supporting people to make and execute physical activity plans, including suggestions for incorporating historical records into planning tools.",
  "authors": [
    {
      "name": "Kefan Xu",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240273",
      "orcid": "missing"
    },
    {
      "name": "Xinghui Yan",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659441760",
      "orcid": "missing"
    },
    {
      "name": "Mark W Newman",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406594629",
      "orcid": "0000-0001-7186-1383"
    }
  ],
  "references": [
    {
      "text": "Gregory D. Abowd and Elizabeth D. Mynatt. 2000. Charting past, present, and future research in ubiquitous computing. ACM Trans. Comput.-Hum. Interact. 7, 1 (March 2000), 29–58. https://doi.org/10.1145/344949.344988",
      "doi": "10.1145/344949.344988"
    },
    {
      "text": "Elena Agapie, Bonnie Chinh, Laura R. Pina, Diana Oviedo, Molly C. Welsh, Gary Hsieh, and Sean Munson. 2018. Crowdsourcing Exercise Plans Aligned with Expert Guidelines and Everyday Constraints. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–13. https://doi.org/10.1145/3173574.3173898",
      "doi": "10.1145/3173574.3173898"
    },
    {
      "text": "Elena Agapie, Lucas Colusso, Sean A. Munson, and Gary Hsieh. 2016. PlanSourcing: Generating Behavior Change Plans with Friends and Crowds. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, San Francisco California USA, 119–133. https://doi.org/10.1145/2818048.2819943",
      "doi": "10.1145/2818048.2819943"
    },
    {
      "text": "Icek Ajzen. 1991. The theory of planned behavior. Organizational Behavior and Human Decision Processes 50, 2 (1991), 179–211. https://doi.org/10.1016/0749-5978(91)90020-T",
      "doi": ""
    },
    {
      "text": "Deemah Alqahtani, Caroline Jay, and Markel Vigo. 2020. The Effect of Goal Moderation on the Achievement and Satisfaction of Physical Activity Goals. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 4 (Dec. 2020), 1–18. https://doi.org/10.1145/3432209",
      "doi": "10.1145/3432209"
    },
    {
      "text": "Nana Kwame Anokye, Paul Trueman, Colin Green, Toby G Pavey, and Rod S Taylor. 2012. Physical activity and health related quality of life. BMC public health 12, 1 (2012), 1–8.",
      "doi": ""
    },
    {
      "text": "Fredrika Åström, Jules Verkade, Thijs de Kleijn, and Armağan Karahanoğlu. 2021. Self-Tracking and Management of Physical Activity Fluctuations: An Investigation into Seasons. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–7. https://doi.org/10.1145/3411763.3451758",
      "doi": "10.1145/3411763.3451758"
    },
    {
      "text": "Austin S. Baldwin, Scott A. Baldwin, Valerie G. Loehr, Julie L. Kangas, and Georita M. Frierson. 2013. Elucidating satisfaction with physical activity: An examination of the day-to-day associations between experiences with physical activity and satisfaction during physical activity initiation. Psychology & Health 28, 12 (Dec. 2013), 1424–1441. https://doi.org/10.1080/08870446.2013.822078",
      "doi": ""
    },
    {
      "text": "Nikola Banovic, Tofi Buzali, Fanny Chevalier, Jennifer Mankoff, and Anind K. Dey. 2016. Modeling and Understanding Human Routine Behavior. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 248–260. https://doi.org/10.1145/2858036.2858557",
      "doi": "10.1145/2858036.2858557"
    },
    {
      "text": "Fred B. Bryant, Colette M. Smart, and Scott P. King. 2005. Using the Past to Enhance the Present: Boosting Happiness Through Positive Reminiscence. J Happiness Stud 6, 3 (Sept. 2005), 227–260. https://doi.org/10.1007/s10902-005-3889-4",
      "doi": ""
    },
    {
      "text": "Natasha Carraro and Patrick Gaudreau. 2013. Spontaneous and experimentally induced action planning and coping planning for physical activity: A meta-analysis. Psychology of Sport and Exercise 14, 2 (March 2013), 228–248. https://doi.org/10.1016/j.psychsport.2012.10.004",
      "doi": ""
    },
    {
      "text": "CDC. 2020. Overcoming Barriers to Physical Activity. https://www.cdc.gov/physicalactivity/basics/adding-pa/barriers.html",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Haining Zhu, Nathalie Henry Riche, and Dominikus Baur. 2017. Understanding self-reflection: how people reflect on personal data through visual data exploration. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare. ACM, Barcelona Spain, 173–182. https://doi.org/10.1145/3154862.3154881",
      "doi": "10.1145/3154862.3154881"
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding quantified-selfers’ practices in collecting and exploring personal data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Toronto Ontario Canada, 1143–1152. https://doi.org/10.1145/2556288.2557372",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Sunny Consolvo, Katherine Everitt, Ian Smith, and James A. Landay. 2006. Design requirements for technologies that encourage physical activity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Montréal Québec Canada, 457–466. https://doi.org/10.1145/1124772.1124840",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "C.D. Darker, D.P. French, F.F. Eves, and F.F. Sniehotta. 2010. An intervention to promote walking amongst the general population based on an ‘extended’ theory of planned behaviour: A waiting list randomised controlled trial. Psychology & Health 25, 1 (Jan. 2010), 71–88. https://doi.org/10.1080/08870440902893716",
      "doi": ""
    },
    {
      "text": "Scott Davidoff, Brian D. Ziebart, John Zimmerman, and Anind K. Dey. 2011. Learning patterns of pick-ups and drop-offs to support busy family coordination. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Vancouver BC Canada, 1175–1184. https://doi.org/10.1145/1978942.1979119",
      "doi": "10.1145/1978942.1979119"
    },
    {
      "text": "Scott Davidoff, John Zimmerman, and Anind K. Dey. 2010. How routine learners can support family coordination. In Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10. ACM Press, Atlanta, Georgia, USA, 2461. https://doi.org/10.1145/1753326.1753699",
      "doi": "10.1145/1753326.1753699"
    },
    {
      "text": "Emely de Vet, Anke Oenema, and Johannes Brug. 2011. More or better: Do the number and specificity of implementation intentions matter in increasing physical activity?Psychology of Sport and Exercise 12, 4 (July 2011), 471–477. https://doi.org/10.1016/j.psychsport.2011.02.008",
      "doi": ""
    },
    {
      "text": "Aysegül Dogangün, Michael Schwarz, Katharina Kloppenborg, and Robert Le. 2017. An Approach to Improve Physical Activity by Generating Individual Implementation Intentions. In Adjunct Publication of the 25th Conference on User Modeling, Adaptation and Personalization. ACM, Bratislava Slovakia, 370–375. https://doi.org/10.1145/3099023.3099101",
      "doi": "10.1145/3099023.3099101"
    },
    {
      "text": "Nathan Eagle and Alex Sandy Pentland. 2009. Eigenbehaviors: Identifying Structure in Routine. Behavioral Ecology and Sociobiology 63, 7 (2009), 1057–1066.",
      "doi": ""
    },
    {
      "text": "Chloe Fan, Jodi Forlizzi, and Anind Dey. 2012. Considerations for technology that support physical activity by older adults. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility - ASSETS ’12. ACM Press, Boulder, Colorado, USA, 33. https://doi.org/10.1145/2384916.2384923",
      "doi": "10.1145/2384916.2384923"
    },
    {
      "text": "Lena Fleig, Sarah Pomp, Linda Parschau, Milena Barz, Daniela Lange, Ralf Schwarzer, and Sonia Lippke. 2013. From intentions via planning and behavior to physical exercise habits. Psychology of Sport and Exercise 14, 5 (Sept. 2013), 632–639. https://doi.org/10.1016/j.psychsport.2013.03.006",
      "doi": ""
    },
    {
      "text": "Yuichi Fujiki. 2010. iPhone as a physical activity measurement platform. In CHI ’10 Extended Abstracts on Human Factors in Computing Systems. ACM, Atlanta Georgia USA, 4315–4320. https://doi.org/10.1145/1753846.1754146",
      "doi": ""
    },
    {
      "text": "Peter M. Gollwitzer. 1999. Implementation intentions: Strong effects of simple plans. American Psychologist 54, 7 (July 1999), 493–503. https://doi.org/10.1037/0003-066X.54.7.493 Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Peter M Gollwitzer, Frank Wieber, Andrea L Myers, Sean M McCrea, C Agnew, D Carlston, 2010. How to maximize implementation intention effects. Then a miracle occurs: Focusing on behavior in social psychological theory and research (2010), 137–161.",
      "doi": ""
    },
    {
      "text": "Daniel Harrison, Paul Marshall, Nadia Berthouze, and Jon Bird. 2014. Tracking physical activity: problems related to running longitudinal studies with commercial devices. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication. ACM, Seattle Washington, 699–702. https://doi.org/10.1145/2638728.2641320",
      "doi": "10.1145/2638728.2641320"
    },
    {
      "text": "Matthew K Hong, Udaya Lakshmi, Kimberly Do, Sampath Prahalad, Thomas Olson, Rosa I Arriaga, and Lauren Wilcox. 2020. Using Diaries to Probe the Illness Experiences of Adolescent Patients and Parental Caregivers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3313831.3376426"
    },
    {
      "text": "Brad R. Humphreys, Logan McLeod, and Jane E. Ruseski. 2014. Physical Activity and Health Outcomes: Evidence from Canada. Health Economics 23, 1 (2014), 33–54. https://doi.org/10.1002/hec.2900 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/hec.2900.",
      "doi": ""
    },
    {
      "text": "Ellen Isaacs, Artie Konrad, Alan Walendowski, Thomas Lennig, Victoria Hollis, and Steve Whittaker. 2013. Echoes from the past: how technology mediated reflection improves well-being. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Paris France, 1071–1080. https://doi.org/10.1145/2470654.2466137",
      "doi": "10.1145/2470654.2466137"
    },
    {
      "text": "Susan Joslyn and Jared LeClerc. 2013. Decisions With Uncertainty: The Glass Half Full. Curr Dir Psychol Sci 22, 4 (Aug. 2013), 308–315. https://doi.org/10.1177/0963721413481473 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Ravi Karkar, Jasmine Zia, Roger Vilardaga, Sonali R Mishra, James Fogarty, Sean A Munson, and Julie A Kientz. 2016. A framework for self-experimentation in personalized health. Journal of the American Medical Informatics Association 23, 3 (May 2016), 440–448. https://doi.org/10.1093/jamia/ocv150",
      "doi": ""
    },
    {
      "text": "Peter T. Katzmarzyk, I-Min Lee, Corby K. Martin, and Steven N. Blair. 2017. Epidemiology of Physical Activity and Exercise Training in the United States. Progress in Cardiovascular Diseases 60, 1 (July 2017), 3–10. https://doi.org/10.1016/j.pcad.2017.01.004",
      "doi": ""
    },
    {
      "text": "Predrag Klasnja, Shawna Smith, Nicholas J Seewald, Andy Lee, Kelly Hall, Brook Luers, Eric B Hekler, and Susan A Murphy. 2019. Efficacy of Contextually Tailored Suggestions for Physical Activity: A Micro-randomized Optimization Trial of HeartSteps. Annals of Behavioral Medicine 53, 6 (May 2019), 573–582. https://doi.org/10.1093/abm/kay067",
      "doi": ""
    },
    {
      "text": "Rafal Kocielnik, Fabrizio Maria Maggi, and Natalia Sidorova. 2013. Enabling self-reflection with LifelogExplorer: Generating simple views from complex data. In 2013 7th International Conference on Pervasive Computing Technologies for Healthcare and Workshops. IEEE, 184–191. https://doi.org/10.4108/icst.pervasivehealth.2013.251934",
      "doi": ""
    },
    {
      "text": "Jisoo Lee, Erin Walker, Winslow Burleson, Matthew Kay, Matthew Buman, and Eric B. Hekler. 2017. Self-Experimentation for Behavior Change: Design and Formative Evaluation of Two Approaches. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver Colorado USA, 6837–6849. https://doi.org/10.1145/3025453.3026038",
      "doi": "10.1145/3025453.3026038"
    },
    {
      "text": "Min Kyung Lee, Junsung Kim, Jodi Forlizzi, and Sara Kiesler. 2015. Personalization revisited: a reflective approach helps people better personalize health services and motivates them to increase physical activity. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp ’15. ACM Press, Osaka, Japan, 743–754. https://doi.org/10.1145/2750858.2807552",
      "doi": "10.1145/2750858.2807552"
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stage-based model of personal informatics systems. (2010), 10.",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind K. Dey, and Jodi Forlizzi. 2011. Understanding my data, myself: supporting self-reflection with ubicomp technologies. In Proceedings of the 13th international conference on Ubiquitous computing - UbiComp ’11. ACM Press, Beijing, China, 405. https://doi.org/10.1145/2030112.2030166",
      "doi": "10.1145/2030112.2030166"
    },
    {
      "text": "Ian Li, Anind K. Dey, and Jodi Forlizzi. 2012. Using context to reveal factors that affect physical activity. ACM Trans. Comput.-Hum. Interact. 19, 1 (March 2012), 1–21. https://doi.org/10.1145/2147783.2147790",
      "doi": "10.1145/2147783.2147790"
    },
    {
      "text": "Aleksandra Luszczynska. 2006. An implementation intentions intervention, the use of a planning strategy, and physical activity after myocardial infarction. Social Science & Medicine 62, 4 (Feb. 2006), 900–908. https://doi.org/10.1016/j.socscimed.2005.06.043",
      "doi": ""
    },
    {
      "text": "Aleksandra Luszczynska, Ralf Schwarzer, Sonia Lippke, and Magda Mazurkiewicz. 2011. Self-efficacy as a moderator of the planning–behaviour relationship in interventions designed to promote physical activity. Psychology & Health 26, 2 (Feb. 2011), 151–166. https://doi.org/10.1080/08870446.2011.531571",
      "doi": ""
    },
    {
      "text": "Chetan D Mistry, Shane N Sweet, Ryan E Rhodes, and Amy E Latimer-Cheung. 2015. Text2Plan: Exploring changes in the quantity and quality of action plans and physical activity in a. Psychology & health 30, 7 (2015), 839–856.",
      "doi": ""
    },
    {
      "text": "Wanda J. Orlikowski and JoAnne Yates. 2002. It’s about Time: Temporal Structuring in Organizations. Organization Science 13, 6 (2002), 684–700. http://www.jstor.org/stable/3086088 Publisher: INFORMS.",
      "doi": "10.1287/orsc.13.6.684.501"
    },
    {
      "text": "Scott A Paluska and Thomas L Schwenk. 2000. Physical Activity and Mental Health. Sports Med (2000), 14.",
      "doi": ""
    },
    {
      "text": "Gaurav Paruthi, Shriti Raj, Natalie Colabianchi, Predrag Klasnja, and Mark W. Newman. 2018. Finding the Sweet Spot(s): Understanding Context to Support Physical Activity Plans. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 1 (March 2018), 1–17. https://doi.org/10.1145/3191761",
      "doi": "10.1145/3264942"
    },
    {
      "text": "Katrina L Piercy, Richard P Troiano, Rachel M Ballard, Susan A Carlson, Janet E Fulton, Deborah A Galuska, Stephanie M George, and Richard D Olson. 2018. The physical activity guidelines for Americans. Jama 320, 19 (2018), 2020–2028.",
      "doi": ""
    },
    {
      "text": "Charlie Pinder, Jo Vermeulen, Adhi Wicaksono, Russell Beale, and Robert J. Hendley. 2016. If this, then habit: exploring context-aware implementation intentions on smartphones. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct. ACM, Florence Italy, 690–697. https://doi.org/10.1145/2957265.2961837",
      "doi": "10.1145/2957265.2961837"
    },
    {
      "text": "Kenneth E. Powell, Amanda E. Paluch, and Steven N. Blair. 2011. Physical Activity for Health: What Kind? How Much? How Intense? On Top of What?Annual Review of Public Health 32, 1 (2011), 349–365. https://doi.org/10.1146/annurev-publhealth-031210-101151 _eprint: https://doi.org/10.1146/annurev-publhealth-031210-101151.",
      "doi": ""
    },
    {
      "text": "Shriti Raj, Joyce M. Lee, Ashley Garrity, and Mark W. Newman. 2019. Clinical Data in Context: Towards Sensemaking Tools for Interpreting Personal Health Data. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 1 (March 2019), 1–20. https://doi.org/10.1145/3314409",
      "doi": "10.1145/3314409"
    },
    {
      "text": "Xipei Ren, Bin Yu, Yuan Lu, and Aarnout Brombacher. 2018. Exploring Cooperative Fitness Tracking to Encourage Physical Activity among Office Workers. Proc. ACM Hum.-Comput. Interact. 2, CSCW (Nov. 2018), 1–20. https://doi.org/10.1145/3274415",
      "doi": "10.1145/3274415"
    },
    {
      "text": "Johnny Saldaña. 2013. The coding manual for qualitative researchers (2nd ed ed.). SAGE, Los Angeles. OCLC: ocn796279115.",
      "doi": ""
    },
    {
      "text": "James F. Sallis and Melbourne F. Hovell. 1990. Determinants of Exercise Behavior. Exercise and Sport Sciences Reviews 18, 1 (Jan. 1990), 307–330. https://journals.lww.com/acsm-essr/citation/1990/01000/determinants_of_exercise_behavior.14.aspx",
      "doi": ""
    },
    {
      "text": "Nancy E. Sherwood and Robert W. Jeffery. 2000. The Behavioral Determinants of Exercise: Implications for Physical Activity Interventions. Annual Review of Nutrition 20, 1 (2000), 21–44. https://doi.org/10.1146/annurev.nutr.20.1.21 _eprint: https://doi.org/10.1146/annurev.nutr.20.1.21.",
      "doi": ""
    },
    {
      "text": "Aneesha Singh, Annina Klapper, Jinni Jia, Antonio Fidalgo, Ana Tajadura-Jiménez, Natalie Kanakam, Nadia Bianchi-Berthouze, and Amanda Williams. 2014. Motivating people with chronic pain to do physical activity: opportunities for technology design. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14. ACM Press, Toronto, Ontario, Canada, 2803–2812. https://doi.org/10.1145/2556288.2557268",
      "doi": "10.1145/2556288.2557268"
    },
    {
      "text": "Falko F. Sniehotta, Ralf Schwarzer, Urte Scholz, and Benjamin Schüz. 2005. Action planning and coping planning for long-term lifestyle change: theory and assessment. European Journal of Social Psychology 35, 4 (2005), 565–576. https://doi.org/10.1002/ejsp.258 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/ejsp.258.",
      "doi": ""
    },
    {
      "text": "S. Stanner. 2004. At Least Five a Week- a summary of the report from the Chief Medical Officer on physical activity. Nutr Bulletin 29, 4 (Dec. 2004), 350–352. https://doi.org/10.1111/j.1467-3010.2004.00455.x",
      "doi": ""
    },
    {
      "text": "Wanda C. Stutts. 2002. Physical Activity Determinants in Adults: Perceived Benefits, Barriers, and Self Efficacy. AAOHN Journal 50, 11 (Nov. 2002), 499–507. https://doi.org/10.1177/216507990205001106",
      "doi": ""
    },
    {
      "text": "Alice Thudt, Uta Hinrichs, Samuel Huron, and Sheelagh Carpendale. 2018. Self-Reflection and Personal Physicalization Construction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC Canada, 1–13. https://doi.org/10.1145/3173574.3173728",
      "doi": "10.1145/3173574.3173728"
    },
    {
      "text": "Alice Thudt, Bongshin Lee, Eun Kyoung Choe, and Sheelagh Carpendale. 2017. Expanding Research Methods for a Realistic Understanding of Personal Visualization. IEEE Computer Graphics and Applications 37, 2 (March 2017), 12–18. https://doi.org/10.1109/MCG.2017.23 Conference Name: IEEE Computer Graphics and Applications.",
      "doi": "10.1109/MCG.2017.23"
    },
    {
      "text": "X Tong, D Gromala, L Bartram, F Rajabiyazdi, and S Carpendale. 2015. Evaluating the Effectiveness of Three Physical Activity Visualizations — How People Perform vs. Perceive. personal visualization: exploring data in everyday life 1 (2015), 2015.",
      "doi": ""
    },
    {
      "text": "Emily N. Ussery, Janet E. Fulton, Deborah A. Galuska, Peter T. Katzmarzyk, and Susan A. Carlson. 2018. Joint Prevalence of Sitting Time and Leisure-Time Physical Activity Among US Adults, 2015-2016. JAMA 320, 19 (Nov. 2018), 2036. https://doi.org/10.1001/jama.2018.17797",
      "doi": ""
    },
    {
      "text": "Edwin A.J. van Hooft, Marise Ph. Born, Toon W. Taris, Henk van der Flier, and Roland W.B. Blonk. 2005. Bridging the gap between intentions and behavior: Implementation intentions, action control, and procrastination. Journal of Vocational Behavior 66, 2 (April 2005), 238–256. https://doi.org/10.1016/j.jvb.2004.10.003",
      "doi": ""
    },
    {
      "text": "Yunlong Wang, Ahmed Fadhil, and Harald Reiterer. 2018. Supporting Action Planning for Sedentary Behavior Change by Visualizing Personal Mobility Patterns on Smartphone. In Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare. ACM, New York NY USA, 396–401. https://doi.org/10.1145/3240925.3240962",
      "doi": "10.1145/3240925.3240962"
    },
    {
      "text": "Yunlong Wang, Laura M. König, and Harald Reiterer. 2021. A Smartphone App to Support Sedentary Behavior Change by Visualizing Personal Mobility Patterns and Action Planning (SedVis): Development and Pilot Study. JMIR Form Res 5, 1 (Jan. 2021), e15369. https://doi.org/10.2196/15369",
      "doi": ""
    },
    {
      "text": "Darren E.R. Warburton and Shannon S.D. Bredin. 2016. Reflections on Physical Activity and Health: What Should We Recommend?Canadian Journal of Cardiology 32, 4 (April 2016), 495–504. https://doi.org/10.1016/j.cjca.2016.01.024",
      "doi": ""
    },
    {
      "text": "Robert West and Susan Michie. 2020. A brief introduction to the COM-B Model of behaviour and the PRIME Theory of motivation. Qeios (April 2020). https://doi.org/10.32388/WW04E6.2",
      "doi": ""
    },
    {
      "text": "K.-s. Yip. 2006. Self-reflection in Reflective Practice: A Note of Caution. British Journal of Social Work 36, 5 (Feb. 2006), 777–788. https://doi.org/10.1093/bjsw/bch323",
      "doi": ""
    },
    {
      "text": "Jochen P. Ziegelmann, Sonia Lippke, and Ralf Schwarzer. 2006. Adoption and maintenance of physical activity: Planning interventions in young, middle-aged, and older adults. Psychology & Health 21, 2 (April 2006), 145–163. https://doi.org/10.1080/1476832050018891",
      "doi": ""
    }
  ]
}