{
  "doi": "10.1145/3491102.3501840",
  "title": "Making Space for Cultural Infrastructure: The Breakdown and Maintenance Work of Independent Movie Theaters During Crisis",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2022,
  "badges": [],
  "abstract": "Independent movie theaters (IMTs) are a part of the cultural infrastructure that offers shared spaces for patron communities to access, share, and engage with cultural artifacts. In light of the COVID-19 pandemic, IMTs were mandated to shut down, resulting in unanticipated infrastructural breakdown. Drawing insights from a preliminary survey and interviews with staff members from 18 IMTs in the U.S., this paper attends to how this breakdown disrupted art and community engagement within patron communities. We investigate the sociotechnical practices of maintaining cultural infrastructure through 1) collaborating with community partners and external stakeholders, 2) screening films through online virtual cinema platforms, and 3) retaining community members through online platforms. Our work highlights the tensions and invisible human labor in this maintenance work. Together, this work intends to foreground cultural infrastructure and discuss how HCI can support and contribute to the design and oft-invisible maintenance of cultural infrastructure.",
  "tags": [
    "symbolic meaning",
    "infrastructuring work",
    "cultural infrastructure",
    "COVID-19",
    "materiality",
    "cultural spaces",
    "Infrastructure"
  ],
  "authors": [
    {
      "name": "Sam Addison Ankenbauer",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659588393",
      "orcid": "missing"
    },
    {
      "name": "Alex Jiahong Lu",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/do/10.1145/contrib-99659277064/rel-imgonly/alex_headshot_3_sq.jpg",
      "acmid": "99659277064",
      "orcid": "0000-0002-0093-8176"
    }
  ],
  "references": [
    {
      "text": "Imas Agustina and Ruth Beilin. 2012. Community gardens: Space for interactions and adaptations. Procedia-social and Behavioral sciences 36 (2012), 439–448.",
      "doi": ""
    },
    {
      "text": "Sam A. Ankenbauer and Alex Jiahong Lu. 2020. Engaging Offline Communities Online Amid COVID-19: A Case Study of Independent Theaters. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing (Virtual Event, USA) (CSCW ’20 Companion). Association for Computing Machinery, New York, NY, USA, 209–213. https://doi.org/10.1145/3406865.3418323",
      "doi": ""
    },
    {
      "text": "Sam Addison Ankenbauer and Alex Jiahong Lu. 2021. Navigating the “Glimmer of Hope”: Challenges and Resilience among U.S. Older Adults in Seeking COVID-19 Vaccination. In Companion Publication of the 2021 Conference on Computer Supported Cooperative Work and Social Computing (Virtual Event, USA) (CSCW ’21). Association for Computing Machinery, New York, NY, USA, 10–13. https://doi.org/10.1145/3462204.3481768",
      "doi": ""
    },
    {
      "text": "Kwame Anthony Appiah. 1998. Race, culture, identity: Misunderstood connections. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Roger Baig, Ramon Roca, Felix Freitag, and Leandro Navarro. 2015. Guifi. net, a crowdsourced network infrastructure held in common. Computer Networks 90(2015), 150–165.",
      "doi": "10.1016/j.comnet.2015.07.009"
    },
    {
      "text": "H Russell Bernard, Amber Wutich, and Gery W Ryan. 2016. Analyzing qualitative data: Systematic approaches. SAGE publications.",
      "doi": ""
    },
    {
      "text": "Geoffrey Bowker. 1994. Information mythology: The world of/as information. Information acumen: The understanding and use of knowledge in modern business (1994), 231–247.",
      "doi": ""
    },
    {
      "text": "John R Bryson. 2007. Arts, dance, cultural infrastructure, and city regeneration: Knowledge, audience development, networks, and conventions, and the relocation of a Royal Ballet company from London to Birmingham. Norsk Geografisk Tidsskrift-Norwegian Journal of Geography 61, 3(2007), 98–110.",
      "doi": ""
    },
    {
      "text": "CDC. 2020. Older Adults Take Steps to Protect Yourself. (2020). https://www.cdc.gov/coronavirus/2019-ncov/need-extra-precautions/older-adults.html",
      "doi": ""
    },
    {
      "text": "Helen Chatterjee and Guy Noble. 2016. Museums, health and well-being. Routledge.",
      "doi": ""
    },
    {
      "text": "Luigina Ciolfi, Gabriela Avram, Laura Maye, Nick Dulake, Mark T. Marshall, Dick van Dijk, and Fiona McDermott. 2016. Articulating Co-Design in Museums: Reflections on Two Participatory Processes. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 13–25. https://doi.org/10.1145/2818048.2819967",
      "doi": "10.1145/2818048.2819967"
    },
    {
      "text": "LaPlaca Cohen. 2017. Culture Track ’17. (2017). https://2017study.culturetrack.com/",
      "doi": ""
    },
    {
      "text": "AEA Consulting. 2016. 2016 Cultural Infrastructure Index. (2016), 3.",
      "doi": ""
    },
    {
      "text": "Art House Convergence. [n.d.]. About Us, Art House Convergence. ([n. d.]). https://www.arthouseconvergence.org/index.php/about/",
      "doi": ""
    },
    {
      "text": "Patrick Corcoran. 2020. NATO Statement on Coronovirus and the Movie Theater Industry. (2020). Retrieved Sep 20, 2020 from https://www.natoonline.org/wp-content/uploads/2020/03/NATO-Statement-on-Coronavirus-and-the-Movie-Theater-Industry.pdf",
      "doi": ""
    },
    {
      "text": "W Cullen, G Gulati, and BD Kelly. 2020. Mental health in the COVID-19 pandemic. QJM: An International Journal of Medicine 113, 5 (2020), 311–312.",
      "doi": ""
    },
    {
      "text": "Michaelanne Dye. 2021. Un Grano de Arena: Infrastructural Care, Social Media Platforms, and the Venezuelan Humanitarian Crisis. 4, CSCW3 (2021).",
      "doi": ""
    },
    {
      "text": "Ryan Faughnder. 2020. During coronavirus closures, indie movie theaters turn to online ‘screenings’. Los Angeles Times (8 April 2020). Retrieved March 2, 2021 from https://www.latimes.com/entertainment-arts/business/story/2020-04-08/your-local-cinema-is-closed-because-of-coronavirus-heres-how-you-can-help-save-it",
      "doi": ""
    },
    {
      "text": "Barbara L Fredrickson and Marcial F Losada. 2005. Positive affect and the complex dynamics of human flourishing. American psychologist 60, 7 (2005), 678.",
      "doi": ""
    },
    {
      "text": "Hugo Fuks, Heloisa Moura, Debora Cardador, Katia Vega, Wallace Ugulino, and Marcos Barbato. 2012. Collaborative Museums: An Approach to Co-Design. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work(CSCW ’12). Association for Computing Machinery, New York, NY, USA, 681–684. https://doi.org/10.1145/2145204.2145307",
      "doi": "10.1145/2145204.2145307"
    },
    {
      "text": "Snehalkumar ’Neil’ S. Gaikwad. 2020. Beyond Boundaries: Towards Symbiotic Relationship Between Ecological Arts and Computational Thinking for Sustainability. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing (Virtual Event, USA) (CSCW ’20 Companion). Association for Computing Machinery, New York, NY, USA, 257–262. https://doi.org/10.1145/3406865.3418336",
      "doi": ""
    },
    {
      "text": "Rebecca E. Grinter, Paul M. Aoki, Margaret H. Szymanski, James D. Thornton, Allison Woodruff, and Amy Hurst. 2002. Revisiting the Visit: Understanding How Technology Can Shape the Museum Visit. In Proceedings of the 2002 ACM Conference on Computer Supported Cooperative Work (New Orleans, Louisiana, USA) (CSCW ’02). Association for Computing Machinery, New York, NY, USA, 146–155. https://doi.org/10.1145/587078.587100",
      "doi": "10.1145/587078.587100"
    },
    {
      "text": "Xinning Gui and Yunan Chen. 2019. Making Healthcare Infrastructure Work: Unpacking the Infrastructuring Work of Individuals. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300688",
      "doi": ""
    },
    {
      "text": "Steve Harrison and Paul Dourish. 1996. Re-Place-Ing Space: The Roles of Place and Space in Collaborative Systems. In Proceedings of the 1996 ACM Conference on Computer Supported Cooperative Work (Boston, Massachusetts, USA) (CSCW ’96). Association for Computing Machinery, New York, NY, USA, 67–76. https://doi.org/10.1145/240080.240193",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Yun Huang, Brian Dobreski, and Huichuan Xia. 2017. Human Library: Understanding Experience Sharing for Community Knowledge Building(CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1152–1165. https://doi.org/10.1145/2998181.2998312",
      "doi": "10.1145/2998181.2998312"
    },
    {
      "text": "Helena Karasti and Jeanette Blomberg. 2018. Studying Infrastructuring Ethnographically. 27, 2 (2018). https://doi.org/10.1007/s10606-017-9296-7",
      "doi": ""
    },
    {
      "text": "H. Karasti, V. Pipek, and G. Bowker. 2017. An Afterword to ‘Infrastructuring and Collaborative Design’. Computer Supported Cooperative Work (CSCW) 27 (2017), 267–289.",
      "doi": "10.1007/s10606-017-9305-x"
    },
    {
      "text": "Winesmith Keir and Anderson Suse. 2020. The Digital Future of Museums: Conversations and Provocations. https://doi.org/10.4324/9780429491573",
      "doi": ""
    },
    {
      "text": "Markos Konstantakis and George Caridakis. 2020. Adding Culture to UX: UX Research Methodologies and Applications in Cultural Heritage. J. Comput. Cult. Herit. 13, 1 (Feb. 2020). https://doi.org/10.1145/3354002",
      "doi": "10.1145/3354002"
    },
    {
      "text": "Charlotte P. Lee, Paul Dourish, and Gloria Mark. 2006. The Human Infrastructure of Cyberinfrastructure. Association for Computing Machinery, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Charlotte P Lee and Kjeld Schmidt. 2018. A bridge too far?: Critical remarks on the concept of “infrastructure” in computer-supported cooperative work and information systems. In Socio-Informatics. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Martina Low. 2016. The sociology of space: Materiality, social structures, and action. Palgrave MacMillan. xiv pages.",
      "doi": ""
    },
    {
      "text": "Teresa Macchia. 2014. Mediating an Invisible Relation: Formalizing the Exhibition as the Linking Artifact between Curators and Visitors. In Proceedings of the 13th Participatory Design Conference: Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium Papers, and Keynote Abstracts - Volume 2 (Windhoek, Namibia) (PDC ’14). Association for Computing Machinery, New York, NY, USA, 229–232. https://doi.org/10.1145/2662155.2662242",
      "doi": "10.1145/2662155.2662242"
    },
    {
      "text": "Laura Mandala. 2015. The Role of the Arts and Culture in the Future of Travel and Tourism. 132.",
      "doi": ""
    },
    {
      "text": "Michael Massimi, Jill P Dimond, and Christopher A Le Dantec. 2012. Finding a new normal: the role of technology in life disruptions. In Proceedings of the acm 2012 conference on computer supported cooperative work. 719–728.",
      "doi": "10.1145/2145204.2145314"
    },
    {
      "text": "Shannon Mattern. 2014. Library as infrastructure. Places Journal (2014).",
      "doi": ""
    },
    {
      "text": "Vincenzo Mighali, Giuseppe Del Fiore, Luigi Patrono, Luca Mainetti, Stefano Alletto, Giuseppe Serra, and Rita Cucchiara. 2015. Innovative IoT-Aware Services for a Smart Museum. In Proceedings of the 24th International Conference on World Wide Web. Association for Computing Machinery, New York, NY, USA, 547–550. https://doi.org/10.1145/2740908.2744711",
      "doi": "10.1145/2740908.2744711"
    },
    {
      "text": "The United Nations. 2020. Everyone Included: Social Impact of COVID-19. (2020). https://www.un.org/development/desa/dspd/everyone-included-covid-19.html",
      "doi": ""
    },
    {
      "text": "Pierre Nora. 1989. Between Memory and History: Les Lieux de Mémoire. Representations26(1989), 7–24. http://www.jstor.org/stable/2928520",
      "doi": ""
    },
    {
      "text": "Philadelphia Museum of Art. 2017. Health is Wealth Holistic Wellness, Philadelphia Assembled. (2017). Retrieved Oct 1, 2020 from http://phlassembled.net/sovereignty/events/health_is_wealth_holistic_wellness/",
      "doi": ""
    },
    {
      "text": "The Institute of Museum and Library Services. 2020. Public Libraries in the United States: Fiscal year 2017, Volume I.(2020), 6.",
      "doi": ""
    },
    {
      "text": "Jonathan Paquette. 2020. France and the restitution of cultural goods: the Sarr-Savoy report and its reception. Cultural Trends 29, 4 (2020), 302–316.",
      "doi": ""
    },
    {
      "text": "Ricardo Pocinho, Pedro Carrana, Cristovão Margarido, Rui Santos, Sandrina Milhano, Bruno Trindade, and Gisela Santos. 2020. The Use of Digital Educational Resources in the Process of Teaching and Learning in Pandemic by COVID-19. In Eighth International Conference on Technological Ecosystems for Enhancing Multiculturality. Association for Computing Machinery, New York, NY, USA, 810–816. https://doi.org/10.1145/3434780.3436589",
      "doi": "10.1145/3434780.3436589"
    },
    {
      "text": "David Ribes and Charlotte P. Lee. 2010. Sociotechnical Studies of Cyberinfrastructure and e-Research: Current Themes and Future Trajectories. Computer Supported Cooperative Work (CSCW) 19 (2010), 231–244.",
      "doi": "10.1007/s10606-010-9120-0"
    },
    {
      "text": "Kjeld Schmidt and Jørgen Bansler. 2016. Computational artifacts: interactive and collaborative computing as an integral feature of work practice. In COOP 2016: Proceedings of the 12th International Conference on the Design of Cooperative Systems, 23-27 May 2016, Trento, Italy. Springer, 21–38.",
      "doi": ""
    },
    {
      "text": "Zack Sharf. 2020. Dune, Matrix 4, and Every 2021 Warner Bros. Film to Debut on HBO Max and in Theaters at Same Time. (2020). https://www.indiewire.com/2020/12/dune-matrix-all-warner-bros-films-hbo-max-1234602168/",
      "doi": ""
    },
    {
      "text": "S. L. Star and K. Ruhleder. 1996. Steps Toward an Ecology of Infrastructure: Design and Access for Large Information Spaces. Inf. Syst. Res. 7(1996), 111–134.",
      "doi": "10.1287/isre.7.1.111"
    },
    {
      "text": "Jamie Stiehm. 2001. Senator Theatre on national list as endangered. (2001). https://www.baltimoresun.com/news/bs-xpm-2001-06-26-0106260011-story.html",
      "doi": ""
    },
    {
      "text": "Hussain Syed, Marén Schorch, Sam Ankenbauer, Sohaib Hassan, Konrad Meisner, Martin Stein, Sascha Skudelny, Helena Karasti, and Volkmar Pipek. 2021. Infrastructuring for organizational resilience: Experiences and perspectives for business continuity.",
      "doi": ""
    },
    {
      "text": "Zoe M Volenec, Joel O Abraham, Alexander D Becker, and Andy P Dobson. 2021. Public parks and the pandemic: How park usage has been affected by COVID-19 policies. PloS one 16, 5.",
      "doi": ""
    },
    {
      "text": "Dhaval Vyas and Tawanna Dillahunt. 2017. Everyday Resilience: Supporting Resilient Strategies among Low Socioeconomic Status Communities. 1, CSCW (2017).",
      "doi": "10.1145/3134740"
    },
    {
      "text": "Nancy Wood. 1994. Memory’s Remains: Les lieux de mémoire. History and memory 6, 1 (1994), 123–149.",
      "doi": ""
    },
    {
      "text": "Sophia Woodley and Tim Jones. 2017. Making Space for Culture. (2017).",
      "doi": ""
    },
    {
      "text": "Adam Worrall. 2010. Supporting Community-Building in Digital Libraries: A Pilot Study of Library Thing. In Proceedings of the 73rd ASIS&T Annual Meeting on Navigating Streams in an Information Ecosystem - Volume 47. American Society for Information Science, Article 142, 3 pages.",
      "doi": ""
    },
    {
      "text": "Volker Wulf, Volkmar Pipek, Markus Rohde, K Schmidt, G Stevens, and D Randall. 2015. Socio Informatics–A Practice-based Perspective.",
      "doi": ""
    }
  ]
}