{
  "doi": "10.1145/3491102.3517738",
  "title": "A Performance Evaluation of Nomon: A Flexible Interface for Noisy Single-Switch Users",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "Some individuals with motor impairments communicate using a single switch — such as a button click, air puff, or blink. Row-column scanning provides a method for choosing items arranged in a grid using a single switch. An alternative, Nomon, allows potential selections to be arranged arbitrarily rather than requiring a grid (as desired for gaming, drawing, etc.) — and provides an alternative probabilistic selection method. While past results suggest that Nomon may be faster and easier to use than row-column scanning, no work has yet quantified performance of the two methods over longer time periods or in tasks beyond writing. In this paper, we also develop and validate a webcam-based switch that allows a user without a motor impairment to approximate the response times of a motor-impaired single switch user; although the approximation is not a replacement for testing with single-switch users, it allows us to better initialize, calibrate, and evaluate our method. Over 10 sessions with the webcam switch, we found users typed faster and more easily with Nomon than with row-column scanning. The benefits of Nomon were even more pronounced in a picture-selection task. Evaluation and feedback from a motor-impaired switch user further supports the promise of Nomon.",
  "authors": [
    {
      "name": "Nicholas Ryan Bonaker",
      "institution": "LIDS, Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236186",
      "orcid": "missing"
    },
    {
      "name": "Emli-Mari Nel",
      "institution": "Averly, South Africa",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309511429",
      "orcid": "missing"
    },
    {
      "name": "Keith Vertanen",
      "institution": "Department of Computer Science, Michigan Technological University, United States",
      "img": "/do/10.1145/contrib-81413602297/rel-imgonly/keith_cs.png",
      "acmid": "81413602297",
      "orcid": "missing"
    },
    {
      "name": "Tamara Broderick",
      "institution": "LIDS, Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81493653583",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Minkyu Ahn and Sung Chan Jun. 2015. Performance variation in motor imagery brain–computer interface: A brief review. Journal of Neuroscience Methods 243 (2015), 103 – 110. https://doi.org/10.1016/j.jneumeth.2015.01.033",
      "doi": ""
    },
    {
      "text": "Jennifer Angelo. 1992. Comparison of three computer scanning modes as an interface method for persons with cerebral palsy. The American journal of occupational therapy 46, 3 (1992), 217–222. https://doi.org/10.5014/ajot.46.3.21",
      "doi": ""
    },
    {
      "text": "Jennifer Angelo. 2000. Factors affecting the use of a single switch with assistive technology devices.Journal of Rehabilitation Research & Development 37, 5(2000).",
      "doi": ""
    },
    {
      "text": "Melanie Baljko and Andrew Tam. 2006. Indirect Text Entry Using One or Two Keys. In Proceedings of the 8th International ACM SIGACCESS Conference on Computers and Accessibility (Portland, Oregon, USA) (Assets ’06). Association for Computing Machinery, New York, NY, USA, 18–25. https://doi.org/10.1145/1168987.1168992",
      "doi": "10.1145/1168987.1168992"
    },
    {
      "text": "Timothy C. Bell, John G. Cleary, and Ian H. Witten. 1990. Text Compression. Prentice Hall, NJ.",
      "doi": ""
    },
    {
      "text": "Tamara Broderick. 2009. Nomon: Efficient communication with a single switch. University of Cambridge. Cambridge, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Tamara Broderick and David J. C. MacKay. 2009. Fast and Flexible Selection with a Single Switch. PLoS ONE 4, 10 (2009).",
      "doi": ""
    },
    {
      "text": "Stanley F. Chen and Joshua T. Goodman. 1998. An Empirical Study of Smoothing Techniques for Language Modeling. Technical Report. Computer Science Group, Harvard University.",
      "doi": ""
    },
    {
      "text": "CoughDrop. Accessed September 2020. CoughDrop. https://coughdrop.zendesk.com/hc/en-us/articles/201366669-How-do-I-set-up-scanning-options-in-CoughDrop-",
      "doi": ""
    },
    {
      "text": "W Crochetiere, R Foulds, and R Sterne. 1974. Computer aided motor communication. In Proceedings of the 1974 Conference on Engineering Devices in Rehabilitation. 1–8.",
      "doi": ""
    },
    {
      "text": "Nicola Dell, Vidya Vaidyanathan, Indrani Medhi, Edward Cutrell, and William Thies. 2012. ”Yours is Better!”: Participant Response Bias in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 1321–1330. https://doi.org/10.1145/2207676.2208589",
      "doi": "10.1145/2207676.2208589"
    },
    {
      "text": "Eelke Folmer, Fangzhou Liu, and Barrie Ellis. 2011. Navigating a 3D Avatar Using a Single Switch. In Proceedings of the 6th International Conference on Foundations of Digital Games (Bordeaux, France) (FDG ’11). Association for Computing Machinery, New York, NY, USA, 154–160. https://doi.org/10.1145/2159365.2159386",
      "doi": "10.1145/2159365.2159386"
    },
    {
      "text": "Chris Gibbons and Erin Beneteau. 2010. Functional performance using eye control and single switch scanning by people with ALS. Perspectives on Augmentative and Alternative Communication 19, 3(2010), 64–69.",
      "doi": ""
    },
    {
      "text": "Scott T. Grafton. 2010. Unlocking communication with the nose. Proceedings of the National Academy of Sciences 107, 32, 13979–13980.",
      "doi": ""
    },
    {
      "text": "Kristen Grauman, Margrit Betke, Jonathan Lombardi, James Gips, and Gary R. Bradski. 2003. Communication via eye blinks and eyebrow raises: Video-based human-computer interfaces. Universal Access in the Information Society 2, 4 (2003), 359–373.",
      "doi": "10.1007/s10209-003-0062-x"
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. P. A. Hancock and N. Meshkati (Eds.) Human Mental Workload (1988).",
      "doi": ""
    },
    {
      "text": "Jeffery Higginbotham. 1995. Use of nondisabled subjects in AAC research: Confessions of a research infidel. Augmentative and Alternative Communication 11, 1 (1995), 2–5.",
      "doi": ""
    },
    {
      "text": "Sunjun Kim, Byungjoo Lee, and Antti Oulasvirta. 2018. Impact Activation Improves Rapid Button Pressing. Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3173574.3174145",
      "doi": "10.1145/3173574.3174145"
    },
    {
      "text": "Heidi H. Koester and Sajay Arthanat. 2018. The design, conduct, and reporting of research on text entry with alternative access interfaces: Recommendations from a systematic review. Technology and Disability 30 (2018), 83–95.",
      "doi": ""
    },
    {
      "text": "Heidi H. Koester and Simon P. Levine. 1994. Modeling the speed of text entry with a word prediction interface. IEEE transactions on rehabilitation engineering 2, 3, 177–187.",
      "doi": ""
    },
    {
      "text": "Heidi H. Koester and Simon P. Levine. 1996. Effect of a Word Prediction Feature on User Performance. Augmentative and Alternative Communication 12, 3 (1996), 155–168.",
      "doi": ""
    },
    {
      "text": "Heidi H. Koester and Jennifer Mankowski. 2015. Automatic Adjustment of Keyboard Settings Can Enhance Typing. Assistive Technology 27, 3 (2015), 136–146.",
      "doi": ""
    },
    {
      "text": "Heidi H. Koester and Richard C. Simpson. 2014. Method for enhancing text entry rate with single-switch scanning. Journal of Rehabilitation Research and Development 51, 6(2014), 995–1012.",
      "doi": ""
    },
    {
      "text": "Heidi H. Koester and Richard C. Simpson. 2017. Effectiveness and usability of Scanning Wizard software: a tool for enhancing switch scanning.Disability and Rehabilitation: Assistive Technology 14(2) (2017), 161–171.",
      "doi": ""
    },
    {
      "text": "Byungjoo Lee, Sunjun Kim, Antti Oulasvirta, Jong-In Lee, and Eunji Park. 2018. Moving Target Selection: A Cue Integration Model. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173804",
      "doi": ""
    },
    {
      "text": "Byungjoo Lee and Antti Oulasvirta. 2016. Modelling Error Rates in Temporal Pointing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1857–1868. https://doi.org/10.1145/2858036.2858143",
      "doi": "10.1145/2858036.2858143"
    },
    {
      "text": "Injung Lee, Hyunchul Kim, and Byungjoo Lee. 2021. Automated Playtesting with a Cognitive Model of Sensorimotor Coordination. Association for Computing Machinery, New York, NY, USA, 4920–4929. https://doi.org/10.1145/3474085.3475429",
      "doi": ""
    },
    {
      "text": "Gregory Lesher, Bryan Moulton, and D. Jeffery Higginbotham. 1998. Techniques for augmenting scanning communication. Augmentative and Alternative Communication 14, 2 (1998), 81–101. https://doi.org/10.1080/07434619812331278236 arXiv:https://doi.org/10.1080/07434619812331278236",
      "doi": ""
    },
    {
      "text": "Gregory Lesher, Bryan Moulton, and D Jeffery Higginbotham. 1998. Techniques for augmenting scanning communication. Augmentative and Alternative Communication 14, 2 (1998), 81–101.",
      "doi": ""
    },
    {
      "text": "Brian Leung and Tom Chau. 2014. Autonomic responses to correct outcomes and interaction errors during single-switch scanning among children with severe spastic quadriplegic cerebral palsy. Journal of neuroengineering and rehabilitation 11, 1(2014), 34.",
      "doi": ""
    },
    {
      "text": "Yanran Li, Hui Su, Xiaoyu Shen, Wenjie Li, Ziqiang Cao, and Shuzi Niu. 2017. DailyDialog: A Manually Labelled Multi-turn Dialogue Dataset. In Proceedings of The 8th International Joint Conference on Natural Language Processing (IJCNLP 2017).",
      "doi": ""
    },
    {
      "text": "Sebastián Aced López, Fulvio Corno, and Luigi De Russis. 2015. Can We Make Dynamic, Accessible and Fun One-Switch Video Games?. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. 421–422.",
      "doi": "10.1145/2700648.2811333"
    },
    {
      "text": "Sebastián Aced López, Fulvio Corno, and Luigi De Russis. 2015. Gnomon: Enabling dynamic one-switch games for children with severe motor disabilities. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. 995–1000.",
      "doi": "10.1145/2702613.2732802"
    },
    {
      "text": "Sebastián Aced López, Fulvio Corno, and Luigi De Russis. 2015. Playable one-switch video games for children with severe motor disabilities based on GNomon. In 2015 7th International Conference on Intelligent Technologies for Interactive Entertainment (INTETAIN). IEEE, 176–185.",
      "doi": ""
    },
    {
      "text": "Sebastián Aced López, Fulvio Corno, and Luigi De Russis. 2016. Clocks, bars and balls: Design and evaluation of alternative gnomon widgets for children with disabilities. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 1654–1660.",
      "doi": "10.1145/2851581.2892373"
    },
    {
      "text": "Sebastián Aced López, Fulvio Corno, and Luigi De Russis. 2017. Design and development of one-switch video games for children with severe motor disabilities. ACM Transactions on Accessible Computing (TACCESS) 10, 4 (2017), 1–42.",
      "doi": "10.1145/3085957"
    },
    {
      "text": "David J. C. MacKay and Chris J. Ball. 2006. Dasher’s One-button Dynamic Mode – Theory and Preliminary Results. Technical Report. Cavendish Laboratory, University of Cambridge.",
      "doi": ""
    },
    {
      "text": "David J. C. MacKay, Chris J. Ball, and Mick Donegan. 2004. Efficient communication with one or two buttons. In Maximum Entropy and Bayesian Methods(AIP Conference Proceedings, Vol. 735). 207–218.",
      "doi": ""
    },
    {
      "text": "I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase Sets for Evaluating Text Entry Techniques. In Extended Abstracts on Human Factors in Computing Systems (Ft. Lauderdale, Florida, USA) (CHI EA ’03). ACM, New York, NY, USA, 754–755. https://doi.org/10.1145/765891.765971",
      "doi": ""
    },
    {
      "text": "Robert Mankowski, Richard C. Simpson, and Heidi H. Koester. 2013. Validating a model of row–column scanning. Disability and Rehabilitation: Assistive Technology 8, 3 (2013), 321–329.",
      "doi": ""
    },
    {
      "text": "Robert C. Moore and William Lewis. 2010. Intelligent Selection of Language Model Training Data. In Proceedings of the ACL 2010 Conference Short Papers (Uppsala, Sweden) (ACLShort ’10). Association for Computational Linguistics, Stroudsburg, PA, USA, 220–224. http://dl.acm.org/citation.cfm?id=1858842.1858883",
      "doi": ""
    },
    {
      "text": "Gernot R. Müller-Putz, Christoph Pokorny, Daniela S. Klobassa, and Petar Horki. 2013. A single-switch BCI based on passive and imagined movements: toward restoring communication in minimally conscious patients. International journal of neural systems 23, 02 (2013), 1250037.",
      "doi": ""
    },
    {
      "text": "Emli-Mari Nel, Per Ola Kristensson, and David J. C. MacKay. 2019. Ticker: An Adaptive Single-Switch Text Entry Method for Visually Impaired Users. IEEE Transactions on Pattern Analysis and Machine Intelligence 41, 11(2019), 2756–2769.",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Sunjun Kim, and Byungjoo Lee. 2018. Neuromechanics of a Button Press. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174082",
      "doi": "10.1145/3173574.3174082"
    },
    {
      "text": "Adam Pauls and Dan Klein. 2011. Faster and Smaller N-gram Language Models. In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies - Volume 1 (Portland, Oregon) (HLT ’11). Association for Computational Linguistics, Stroudsburg, PA, USA, 258–267. http://dl.acm.org/citation.cfm?id=2002472.2002506",
      "doi": ""
    },
    {
      "text": "Alec Radford, Jeffrey Wu, Rewon Child, David Luan, Dario Amodei, and Ilya Sutskever. 2018. Language Models are Unsupervised Multitask Learners. (2018). https://d4mucfpksywv.cloudfront.net/better-language-models/language-models.pdf",
      "doi": ""
    },
    {
      "text": "Brian Roark, Russell Beckley, Chris Gibbons, and Melanie Fried-Oken. 2013. Huffman scanning: Using language models within fixed-grid keyboard emulation. Computer Speech & Language 27, 6 (2013), 1212 – 1234. https://doi.org/10.1016/j.csl.2012.10.006 Special Issue on Speech and Language Processing for Assistive Technology.",
      "doi": ""
    },
    {
      "text": "Brian Roark, Melanie Fried-Oken, and Chris Gibbons. 2015. Huffman and linear scanning methods with statistical language models. Augmentative and Alternative Communication 31, 1 (2015), 37–50.",
      "doi": ""
    },
    {
      "text": "Daniel Rough, Keith Vertanen, and Per Ola Kristensson. 2014. An Evaluation of Dasher with a High-Performance Language Model as a Gaze Communication Method. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces (Como, Italy) (AVI ’14). ACM, New York, NY, USA, 169–176.",
      "doi": "10.1145/2598153.2598157"
    },
    {
      "text": "Saltillo. Accessed September 2020. NovaChat. https://saltillo.com/support/article/scanning-patterns",
      "doi": ""
    },
    {
      "text": "Claude Shannon. 1948. A Mathematical Theory of Communication. Bell System Technical Journal 27 (July, October 1948), 379–423, 623–656.",
      "doi": ""
    },
    {
      "text": "Richard C. Simpson, Heidi H. Koester, and Ed LoPresti. 2006. Evaluation of an adaptive row/column scanning system. Technology and disability 18, 3 (2006), 127–138.",
      "doi": ""
    },
    {
      "text": "Richard C. Simpson, Heidi H. Koester, and Ed LoPresti. 2007. Selecting an Appropriate Scan Rate: The.65 Rule. Assistive Technology 19(2007), 51–58.",
      "doi": ""
    },
    {
      "text": "Richard C. Simpson, Robert Mankowski, and Heidi H. Koester. 2011. Modeling one-switch row-column scanning with errors and error correction methods. The open rehabilitation journal 4, 1 (2011).",
      "doi": ""
    },
    {
      "text": "Talk To Me Technologies. Accessed September 2020. Proloquo2go. https://www.talktometechnologies.com/pages/proloquo2go",
      "doi": ""
    },
    {
      "text": "Smartbox Assistive Technology. Accessed September 2020. Grid 3. https://thinksmartbox.com/product/grid-3/",
      "doi": ""
    },
    {
      "text": "Keith Trnka, John McCaw, Debra Yarrington, Kathleen F. McCoy, and Christopher Pennington. 2009. User Interaction with Word Prediction: The Effects of Prediction Quality. ACM Transactions on Accessible Computing 1, 17:1–17:34. Issue 3.",
      "doi": "10.1145/1497302.1497307"
    },
    {
      "text": "Outi Tuisku, Päivi Majaranta, Poika Isokoski, and Kari-Jouko Räihä. 2008. Now Dasher! Dash away! Longitudinal study of fast text entry by Eye Gaze. In ETRA ’08: Proceedings of the 2008 symposium on Eye tracking research & applications (Savannah, Georgia). 19–26.",
      "doi": ""
    },
    {
      "text": "Horabail Venkatagiri. 1999. Efficient keyboard layouts for sequential access in augmentative and alternative communication. Augmentative and Alternative Communication 15, 2 (1999), 126–134.",
      "doi": ""
    },
    {
      "text": "Keith Vertanen, Dylan Gaines, Crystal Fletcher, Alex M. Stanage, Robbie Watling, and Per Ola Kristensson. 2019. VelociWatch: Designing and Evaluating a Virtual Keyboard for the Input of Challenging Text. In CHI ’19: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Glasgow, Scotland).",
      "doi": "10.1145/3290605.3300821"
    },
    {
      "text": "Keith Vertanen and Per Ola Kristensson. 2011. The Imagination of Crowds: Conversational AAC Language Modeling using Crowdsourcing and Large Data Sources. In Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP). ACL, 700–711.",
      "doi": ""
    },
    {
      "text": "Tonio Wandmacher, Jean-Yves Antoine, Franck Poirier, and Jean-Paul Départe. 2008. SIBYLLE, An Assistive Communication System Adapting to the Context and Its User. ACM Transactions on Accessible Computing 1, Article 6, 6:1–6:30 pages. Issue 1.",
      "doi": ""
    },
    {
      "text": "David J. Ward, Alan F. Blackwell, and David J. C. MacKay. 2000. Dasher - a Data Entry Interface using Continuous Gestures and Language Models. ACM Press, 129–137.",
      "doi": ""
    },
    {
      "text": "Johanna Wellnitz. 2020. Person [svg]. OpenMoji. https://openmoji.org/data/color/svg/1F9D1.svg.",
      "doi": ""
    },
    {
      "text": "John H. Williamson, Melissa Quek, Iulia Popescu, Andrew Ramsay, and Roderick Murray-Smith. 2020. Efficient human-machine control with asymmetric marginal reliability input devices. Plos one 15, 6 (2020), e0233603.",
      "doi": ""
    },
    {
      "text": "Bei Yuan, Eelke Folmer, and Frederick C. Harris. 2011. Game accessibility: a survey. Universal Access in the information Society 10, 1 (2011), 81–100.",
      "doi": ""
    }
  ]
}