{
  "doi": "10.1145/3491102.3517535",
  "title": "More than Bedtime and the Bedroom: Sleep Management as a Collaborative Work for the Family",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "Sleep is a vital health issue. Continued sleep deficiency can increase the chance of stroke, cardiovascular disease, obesity, and diabetes. Previous studies have investigated sleep as an individual activity performed within bedrooms at night. In this study with twenty parents of young children, we identify sleep as a complex experience entangled with social dynamics between family members. For example, children's sleep means not just time for children to rest, but time for self-care for parents. This paper's contributions are twofold. First, we show how the boundaries that define sleep in terms of time (at night), space (in bedrooms), and unit of analysis (individual-focused) limit designers' opportunities to tackle the deeper sleep issues of families. Second, we suggest \"division of labor\" as an important but rarely discussed design concept to enhance family sleep, and as a design theme for home technologies that address issues emerging from social dynamics between householders.",
  "authors": [
    {
      "name": "Ji Youn Shin",
      "institution": "Department of Media and Information, Michigan State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659433370",
      "orcid": "missing"
    },
    {
      "name": "Wei Peng",
      "institution": "Department of Media and Information, Michigan State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442605192",
      "orcid": "0000-0003-1576-4532"
    },
    {
      "name": "Hee Rin Lee",
      "institution": "Department of Media and Information, Michigan State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659524243",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Saeed Abdullah, Mark Matthews, Elizabeth L Murnane, Geri Gay, and Tanzeem Choudhury. 2014. Towards circadian computing: “ early to bed and early to rise” makes some of us unhealthy and sleep deprived. In Proceedings of the 2014 ACM international joint conference on pervasive and ubiquitous computing, 673–684.",
      "doi": "10.1145/2632048.2632100"
    },
    {
      "text": "Melissa Aji, Christopher Gordon, Dorian Peters, Delwyn Bartlett, Rafael A Calvo, Khushnood Naqshbandi, and Nick Glozier. 2019. Exploring user needs and preferences for mobile apps for sleep disturbance: mixed methods study. JMIR mental health 6, 5: e13895.",
      "doi": ""
    },
    {
      "text": "Melissa Aji, Christopher Gordon, Elizabeth Stratton, Rafael A Calvo, Delwyn Bartlett, Ronald Grunstein, and Nick Glozier. 2021. Framework for the Design Engineering and Clinical Implementation and Evaluation of mHealth Apps for Sleep Disturbance: Systematic Review. Journal of medical Internet research 23, 2: e24607.",
      "doi": ""
    },
    {
      "text": "Dzmitry Aliakseyeu, Jia Du, Elly Zwartkruis-Pelgrim, and Sriram Subramanian. 2011. Exploring interaction strategies in the context of sleep. In IFIP Conference on Human-Computer Interaction, 19–36.",
      "doi": ""
    },
    {
      "text": "Bruce M Altevogt and Harvey R Colten. 2006. Sleep disorders and sleep deprivation: an unmet public health problem.",
      "doi": ""
    },
    {
      "text": "Kimberly A Babson, Danielle E Ramo, Lisa Baldini, Ryan Vandrey, and Marcel O Bonn-Miller. 2015. Mobile app-delivered cognitive behavioral therapy for insomnia: feasibility and initial efficacy among veterans with cannabis use disorders. JMIR research protocols 4, 3: e87.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. In Proceedings of the SIGCHI conference on human factors in computing systems, 675–684.",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Kelly Glazer Baron, Jennifer Duffecy, Kathryn Reid, Mark Begale, and Lauren Caccamo. 2018. Technology-assisted behavioral intervention to extend sleep duration: development and design of the sleep bunny mobile app. JMIR mental health 5, 1: e3.",
      "doi": ""
    },
    {
      "text": "Jared S Bauer, Sunny Consolvo, Benjamin Greenstein, Jonathan Schooler, Eric Wu, Nathaniel F Watson, and Julie Kientz. 2012. ShutEye: encouraging awareness of healthy sleep recommendations with a mobile, peripheral display. In Proceedings of the SIGCHI conference on Human factors in computing systems, 1401–1410.",
      "doi": "10.1145/2207676.2208600"
    },
    {
      "text": "Genevieve Bell, Mark Blythe, and Phoebe Sengers. 2005. Making by making strange: Defamiliarization and the design of domestic technologies. ACM Transactions on Computer-Human Interaction 12, 2: 149–173. https://doi.org/10.1145/1067860.1067862",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Genevieve Bell and Paul Dourish. 2007. Yesterday's tomorrows: notes on ubiquitous computing's dominant vision. Personal and ubiquitous computing 11, 2: 133–143.",
      "doi": ""
    },
    {
      "text": "Genevieve Bell and Paul Dourish. 2007. Back to the shed: gendered visions of technology and domesticity. Personal and Ubiquitous Computing 11, 5: 373–381.",
      "doi": "10.5555/1265387.1265397"
    },
    {
      "text": "Genevieve Bell and Joseph Kaye. 2002. Designing Technology for Domestic Spaces: A Kitchen Manifesto. Gastronomica 2, 2: 46–62. https://doi.org/10.1525/gfc.2002.2.2.46",
      "doi": ""
    },
    {
      "text": "Anne-Jorunn Berg. 1995. A gendered socio-technical construction: the smart house. Information Technology and Society: A Reader, Sage, London: 74–89.",
      "doi": ""
    },
    {
      "text": "Sushanth Bhat, Ambra Ferraris, Divya Gupta, Mona Mozafarian, Vincent A DeBari, Neola Gushway-Henry, Satish P Gowda, Peter G Polos, Mitchell Rubinstein, and Huzaifa Seidu. 2015. Is there a clinical role for smartphone sleep apps? Comparison of sleep cycle detection by a smartphone application to polysomnography. Journal of Clinical Sleep Medicine 11, 7: 709–715.",
      "doi": ""
    },
    {
      "text": "Jomara Binda, Chien Wen Yuan, Natalie Cope, Hyehyun Park, Eun Kyoung Choe, and John M Carroll. 2018. Supporting effective sharing of health information among intergenerational family members. In Proceedings of the 12th eai international conference on pervasive computing technologies for healthcare, 148–157.",
      "doi": "10.1145/3240925.3240936"
    },
    {
      "text": "Susanne Bødker and Erik Grönvall. 2013. Calendars: Time coordination and overview in families and beyond. In ECSCW 2013: Proceedings of the 13th European Conference on Computer Supported Cooperative Work, 21-25 September 2013, Paphos, Cyprus, 63–81.",
      "doi": ""
    },
    {
      "text": "Julie Boesen, Jennifer A Rode, and Clara Mancini. 2010. The domestic panopticon: location tracking in families. In Proceedings of the 12th ACM international conference on Ubiquitous computing, 65–74.",
      "doi": "10.1145/1864349.1864382"
    },
    {
      "text": "Alan Borning and Michael Muller. 2012. Next steps for value sensitive design. In Proceedings of the SIGCHI conference on human factors in computing systems, 1125–1134.",
      "doi": "10.1145/2207676.2208560"
    },
    {
      "text": "Murray Bowen. 1993. Family therapy in clinical practice. Jason Aronson.",
      "doi": ""
    },
    {
      "text": "Barry Brown, Alex S Taylor, Shahram Izadi, Abigail Sellen, Joseph Jofish'Kaye, and Rachel Eardley. 2007. Locating family values: A field trial of the Whereabouts Clock. In International Conference on Ubiquitous Computing, 354–371.",
      "doi": ""
    },
    {
      "text": "Colleen E Carney, Jack D Edinger, Björn Meyer, Linda Lindman, and Tai Istre. 2006. Daily activities and sleep quality in college students. Chronobiology international 23, 3: 623–637.",
      "doi": ""
    },
    {
      "text": "Meng-Ying Chan, Yi-Hsuan Lin, Long-Fei Lin, Ting-Wei Lin, Wei-Che Hsu, Chia-yu Chang, Rui Liu, Ko-Yu Chang, Min-hua Lin, and Jane Yung-jen Hsu. 2017. WAKEY: Assisting Parent-child Communication for Better Morning Routines. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing: 2287–2299. https://doi.org/10.1145/2998181.2998233",
      "doi": "10.1145/2998181.2998233"
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory. Sage.",
      "doi": ""
    },
    {
      "text": "Anna Cherenshchykova and Andrew D. Miller. 2019. Family-based sleep technologies: Opportunities and challenges. Conference on Human Factors in Computing Systems - Proceedings: 1–6. https://doi.org/10.1145/3290607.3312907",
      "doi": ""
    },
    {
      "text": "Anna Cherenshchykova and Andrew D Miller. 2020. Sociotechnical Design Opportunities for Pervasive Family Sleep Technologies. In Proceedings of the 14th EAI International Conference on Pervasive Computing Technologies for Healthcare, 11–20.",
      "doi": "10.1145/3421937.3421979"
    },
    {
      "text": "Evan D Chinoy, Joseph A Cuellar, Kirbie E Huwa, Jason T Jameson, Catherine H Watson, Sara C Bessman, Dale A Hirsch, Adam D Cooper, Sean P A Drummond, and Rachel R Markwald. 2021. Performance of seven consumer sleep-tracking devices compared with polysomnography. Sleep 44, 5: zsaa291.",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Sunny Consolvo, Nathaniel F Watson, and Julie A Kientz. 2011. Opportunities for computing technologies to support healthy sleep behaviors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3053–3062.",
      "doi": "10.1145/1978942.1979395"
    },
    {
      "text": "Eun Kyoung Choe, Julie A Kientz, Sajanee Halko, Amanda Fonville, Dawn Sakaguchi, and Nathaniel F Watson. 2010. Opportunities for computing to support healthy sleep behavior. In CHI’10 Extended Abstracts on Human Factors in Computing Systems. 3661–3666.",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Matthew Kay, Wanda Pratt, and Julie A Kientz. 2015. SleepTight: Low-burden, self-monitoring technology for capturing and reflecting on sleep behaviors. UbiComp 2015 - Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing: 121–132. https://doi.org/10.1145/2750858.2804266",
      "doi": "10.1145/2750858.2804266"
    },
    {
      "text": "Yong K Choi, George Demiris, Shih-Yin Lin, Sarah J Iribarren, Carol A Landis, Hilaire J Thompson, Susan M McCurry, Margaret M Heitkemper, and Teresa M Ward. 2018. Smartphone applications to support sleep self-management: review and evaluation. Journal of Clinical Sleep Medicine 14, 10: 1783–1790.",
      "doi": ""
    },
    {
      "text": "Adele E Clarke. 2007. Situational analysis. The Blackwell Encyclopedia of Sociology: 1–2.",
      "doi": ""
    },
    {
      "text": "Ruth Schwartz Cowan. 1983. More work for mother. basic books.",
      "doi": ""
    },
    {
      "text": "Catherine D'Ignazio, Alexis Hope, Becky Michelson, Robyn Churchill, and Ethan Zuckerman. 2016. A Feminist HCI Approach to Designing Postpartum Technologies: “ When I first saw a breast pump I was wondering if it was a joke.” In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 2612–2622.",
      "doi": "10.1145/2858036.2858460"
    },
    {
      "text": "Ronald E Dahl and Mona El-Sheikh. 2007. Considering sleep in a family context: Introduction to the special issue. Journal of Family Psychology 21, 1: 1.",
      "doi": ""
    },
    {
      "text": "Scott Davidoff, Brian D Ziebart, John Zimmerman, and Anind K Dey. 2011. Learning patterns of pick-ups and drop-offs to support busy family coordination. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1175–1184.",
      "doi": "10.1145/1978942.1979119"
    },
    {
      "text": "Scott Davidoff, John Zimmerman, and Anind K Dey. 2010. How routine learners can support family coordination. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2461–2470.",
      "doi": "10.1145/1753326.1753699"
    },
    {
      "text": "Helen S Driver and Sheila R Taylor. 2000. Exercise and sleep. Sleep medicine reviews 4, 4: 387–402.",
      "doi": ""
    },
    {
      "text": "Jordan Eschler. 2015. Shared Calendars for Home Health Management. 1277–1288.",
      "doi": ""
    },
    {
      "text": "Edita Fino, Giuseppe Plazzi, Marco Filardi, Michele Marzocchi, Fabio Pizza, Stefano Vandi, and Michela Mazzetti. 2020. (Not so) Smart sleep tracking through the phone: Findings from a polysomnography study testing the reliability of four sleep applications. Journal of sleep research 29, 1: e12935.",
      "doi": ""
    },
    {
      "text": "Jodi Forlizzi. 2007. How robotic products become social products: an ethnographic study of cleaning in the home. In 2007 2nd ACM/IEEE International Conference on Human-Robot Interaction (HRI), 129–136.",
      "doi": "10.1145/1228716.1228734"
    },
    {
      "text": "Jodi Forlizzi and Carl DiSalvo. 2006. Service robots in the domestic environment: a study of the roomba vacuum in the home. In Proceedings of the 1st ACM SIGCHI/SIGART conference on Human-robot interaction, 258–265.",
      "doi": "10.1145/1121241.1121286"
    },
    {
      "text": "Andrea Grimes, Desney Tan, and Dan Morris. 2009. Toward technologies that support family reflections on health. In Proceedings of the ACM 2009 international conference on Supporting group work, 311–320.",
      "doi": "10.1145/1531674.1531721"
    },
    {
      "text": "Elise Guillodo, Christophe Lemey, Mathieu Simonnet, Michel Walter, Enrique Baca-García, Vincent Masetti, Sorin Moga, Mark Larsen, HUGOPSY Network, and Juliette Ropars. 2020. Clinical applications of mobile health wearable–based sleep monitoring: systematic review. JMIR mHealth and uHealth 8, 4: e10733.",
      "doi": ""
    },
    {
      "text": "Max Hirshkowitz, Kaitlyn Whiton, Steven M Albert, Cathy Alessi, Oliviero Bruni, Lydia DonCarlos, Nancy Hazen, John Herman, Eliot S Katz, and Leila Kheirandish-Gozal. 2015. National Sleep Foundation's sleep time duration recommendations: methodology and results summary. Sleep health 1, 1: 40–43.",
      "doi": ""
    },
    {
      "text": "Bree E Holtz, Katharine M Murray, Denise D Hershey, Joshua Richman, Julie K Dunneback, Arpita Vyas, and Michael A Wood. 2019. The design and development of MyT1DHero: A mobile app for adolescents with type 1 diabetes and their parents. Journal of Telemedicine and Telecare 25, 3: 172–180.",
      "doi": ""
    },
    {
      "text": "Matthew K Hong, Udaya Lakshmi, Kimberly Do, Sampath Prahalad, Thomas Olson, Rosa I Arriaga, and Lauren Wilcox. 2020. Using Diaries to Probe the Illness Experiences of Adolescent Patients and Parental Caregivers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, 1–16.",
      "doi": "10.1145/3313831.3376426"
    },
    {
      "text": "Corine Horsch, Willem-Paul Brinkman, Rogier van Eijk, and Mark Neerincx. 2012. Towards the usage of persuasive strategies in a virtual sleep coach. In The 26th BCS Conference on Human Computer Interaction 26, 1–4.",
      "doi": ""
    },
    {
      "text": "Corine Horsch, Sandor Spruit, Jaap Lancee, Rogier van Eijk, Robbert Jan Beun, Mark Neerincx, and Willem-Paul Brinkman. 2017. Reminders make people adhere better to a self-help sleep intervention. Health and technology 7, 2: 173–188.",
      "doi": ""
    },
    {
      "text": "Dorothy Howard and Lilly Irani. 2019. Ways of Knowing When Research Subjects Care. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1–16.",
      "doi": "10.1145/3290605.3300327"
    },
    {
      "text": "Jack E James, Álfgeir Logi Kristjánsson, and Inga Dóra Sigfúsdóttir. 2011. Adolescent substance use, sleep, and academic achievement: evidence of harm due to caffeine. Journal of adolescence 34, 4: 665–673.",
      "doi": ""
    },
    {
      "text": "Tom Jenkins. 2017. Living apart, together: Cohousing as a site for ICT design. DIS 2017 - Proceedings of the 2017 ACM Conference on Designing Interactive Systems 1: 1039–1051. https://doi.org/10.1145/3064663.3064751",
      "doi": "10.1145/3064663.3064751"
    },
    {
      "text": "Matthew Kay, Eun Kyoung Choe, Jesse Shepherd, Benjamin Greenstein, Nathaniel Watson, Sunny Consolvo, and Julie A Kientz. 2012. Lullaby: a capture & access system for understanding the sleep environment. In Proceedings of the 2012 ACM conference on ubiquitous computing, 226–234.",
      "doi": "10.1145/2370216.2370253"
    },
    {
      "text": "Sharon Keenan and Max Hirshkowitz. 2011. Monitoring and staging human sleep. Principles and practice of sleep medicine 5: 1602–1609.",
      "doi": ""
    },
    {
      "text": "Sunyoung Kim, Julie A Kientz, Shwetak N Patel, and Gregory D Abowd. 2008. Are you sleeping? Sharing portrayed sleeping status within a social network. In Proceedings of the 2008 ACM conference on computer supported cooperative work, 619–628.",
      "doi": ""
    },
    {
      "text": "Ping-Ru T Ko, Julie A Kientz, Eun Kyoung Choe, Matthew Kay, Carol A Landis, and Nathaniel F Watson. 2015. Consumer sleep technologies: a review of the landscape. Journal of clinical sleep medicine 11, 12: 1455–1461.",
      "doi": ""
    },
    {
      "text": "Erin Koffel, Eric Kuhn, Napoleon Petsoulis, Christopher R Erbes, Samantha Anders, Julia E Hoffman, Josef I Ruzek, and Melissa A Polusny. 2018. A randomized controlled pilot study of CBT-I Coach: feasibility, acceptability, and potential impact of a mobile phone application for patients in cognitive behavioral therapy for insomnia. Health Informatics Journal 24, 1: 3–13.",
      "doi": ""
    },
    {
      "text": "Eric Kuhn, Brandon J Weiss, Katherine L Taylor, Julia E Hoffman, Kelly M Ramsey, Rachel Manber, Philip Gehrman, Jill J Crowley, Josef I Ruzek, and Mickey Trockel. 2016. CBT-I coach: a description and clinician perceptions of a mobile app for cognitive behavioral therapy for insomnia. Journal of clinical sleep medicine 12, 4: 597–606.",
      "doi": ""
    },
    {
      "text": "Brian M Landry, Jeffrey S Pierce, and Charles L Isbell. 2004. Supporting routine decision-making with a next-generation alarm clock. Personal and Ubiquitous Computing 8, 3–4: 154–160.",
      "doi": "10.1007/s00779-004-0274-y"
    },
    {
      "text": "Bruno Latour. 2005. Reassembling the social: An introduction to actor-network-theory. Oxford university press.",
      "doi": ""
    },
    {
      "text": "Bori Lee, Chirag Murthy, Austin S. Lee, Manya Krishnaswamy, and Hannah Rosenfeld. 2017. Iyagi. 603–608. https://doi.org/10.1145/3024969.3025076",
      "doi": ""
    },
    {
      "text": "Hee Rin Lee and Laurel D Riek. 2018. Reframing Assistive Robots to Promote Successful Aging. ACM Transactions on Human-Robot Interaction 7, 1: 1–23. https://doi.org/10.1145/3203303",
      "doi": "10.1145/3203303"
    },
    {
      "text": "Hee Rin Lee and Selma Šabanović. 2013. Weiser's dream in the korean home: Collaborative study of domestic roles, relationships, and ideal technologies. UbiComp 2013 - Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing: 637–646. https://doi.org/10.1145/2493432.2493499",
      "doi": "10.1145/2493432.2493499"
    },
    {
      "text": "Hee Rin Lee, Selma Šabanović, and Sonya S Kwak. 2017. Collaborative Map Making: A Reflexive Method for Understanding Matters of Concern in Design Research. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), 5678–5689. https://doi.org/10.1145/3025453.3025535",
      "doi": "10.1145/3025453.3025535"
    },
    {
      "text": "Hee Rin Lee, Haodan Tan, and Selma Šabanović. 2016. That robot is not for me: Addressing stereotypes of aging in assistive robot design. In 2016 25th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN), 312–317.",
      "doi": "10.1109/ROMAN.2016.7745148"
    },
    {
      "text": "Gilly Leshed, Maria Håkansson, and Joseph'Jofish’ Kaye. 2014. “ Our life is the farm and farming is our life” home-work coordination in organic farm families. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, 487–498.",
      "doi": ""
    },
    {
      "text": "Qingyang Li, Clara Caldeira, Daniel A Epstein, and Yunan Chen. 2020. Supporting caring among intergenerational family members through family fitness tracking. In Proceedings of the 14th EAI International Conference on Pervasive Computing Technologies for Healthcare, 1–10.",
      "doi": "10.1145/3421937.3422018"
    },
    {
      "text": "Wanyu Liu, Bernd Ploderer, and Thuong Hoang. 2015. In bed with technology: challenges and opportunities for sleep tracking. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, 142–151.",
      "doi": "10.1145/2838739.2838742"
    },
    {
      "text": "Yong Liu, Janet B Croft, Anne G Wheaton, Geraldine S Perry, Daniel P Chapman, Tara W Strine, Lela R McKnight-Eily, and Letitia Presley-Cantrell. 2013. Association between perceived insufficient sleep, frequent mental distress, obesity and chronic diseases among US adults, 2009 behavioral risk factor surveillance system. BMC public health 13, 1: 1–8.",
      "doi": ""
    },
    {
      "text": "Yong Liu, Anne G Wheaton, Daniel P Chapman, and Janet B Croft. 2013. Sleep duration and chronic diseases among US adults age 45 years and older: evidence from the 2010 Behavioral Risk Factor Surveillance System. Sleep 36, 10: 1421–1427.",
      "doi": ""
    },
    {
      "text": "Annemarie I Luik, Pedro Farias Machado, and Colin A Espie. 2018. Delivering digital cognitive behavioral therapy for insomnia at scale: does using a wearable device to estimate sleep influence therapy? NPJ digital medicine 1, 1: 1–6.",
      "doi": ""
    },
    {
      "text": "Kai Lukoff, Taoxi Li, Yuan Zhuang, and Brian Y Lim. 2018. TableChat: mobile food journaling to facilitate family support for healthy eating. Proceedings of the ACM on Human-Computer Interaction 2, CSCW: 1–28.",
      "doi": "10.1145/3274383"
    },
    {
      "text": "Kai Lukoff, Carol Moser, and Sarita Schoenebeck. 2017. Gender norms and attitudes about childcare activities presented on father blogs. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 4966–4971.",
      "doi": "10.1145/3025453.3025767"
    },
    {
      "text": "Goran Medic, Micheline Wille, and Michiel E H Hemels. 2017. Short-and long-term health consequences of sleep disruption. Nature and science of sleep 9: 151.",
      "doi": ""
    },
    {
      "text": "Anne Marie Meijer and Godfried L H van den Wittenboer. 2007. Contribution of infants’ sleep and crying to marital relationship of first-time parent couples in the 1st year after childbirth. Journal of Family Psychology 21, 1: 49.",
      "doi": ""
    },
    {
      "text": "Lisa J. Meltzer and Jodi A. Mindell. 2007. Relationship between child sleep disturbances and maternal sleep, mood, and parenting stress: A pilot study. Journal of Family Psychology 21, 1: 67–73. https://doi.org/10.1037/0893-3200.21.1.67",
      "doi": ""
    },
    {
      "text": "Lisa J Meltzer and Hawley E Montgomery-Downs. 2011. Sleep in the family. Pediatric Clinics 58, 3: 765–774.",
      "doi": ""
    },
    {
      "text": "Sarah Mennicken and Elaine M Huang. 2012. Hacking the natural habitat: An in-the-wild study of smart homes, their development, and the people who live in them. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 7319 LNCS, June: 143–160. https://doi.org/10.1007/978-3-642-31205-2{\\_}10",
      "doi": ""
    },
    {
      "text": "Katherine E Miller, Eric Kuhn, Jason E Owen, Katherine Taylor, S Yu Jessica, Brandon J Weiss, Jill J Crowley, and Mickey Trockel. 2017. Clinician perceptions related to the use of the CBT-I coach mobile app. Behavioral sleep medicine.",
      "doi": ""
    },
    {
      "text": "Jun-Ki Min, Afsaneh Doryab, Jason Wiese, Shahriyar Amini, John Zimmerman, and Jason I Hong. 2014. Toss'n’turn: smartphone as sleep and sleep quality detector. In Proceedings of the SIGCHI conference on human factors in computing systems, 477–486.",
      "doi": "10.1145/2556288.2557220"
    },
    {
      "text": "Carman Neustaedter and A J Bernheim Brush. 2006. “ LINC-ing” the family: the participatory design of an inkable family calendar. In Proceedings of the SIGCHI conference on Human Factors in computing systems, 141–150.",
      "doi": "10.1145/1124772.1124796"
    },
    {
      "text": "Carman Neustaedter, A J Bernheim Brush, and Saul Greenberg. 2009. The calendar is crucial: Coordination and awareness through the family calendar. ACM Transactions on Computer-Human Interaction (TOCHI) 16, 1: 1–48.",
      "doi": "10.1145/1502800.1502806"
    },
    {
      "text": "Frans J. Oort, Gerard A. Kerkhof, Anne M. Meijer, Susan M. Bögels, and Julia F. Dewald. 2010. The influence of sleep quality, sleep duration and sleepiness on school performance in children and adolescents: A meta-analytic review. Sleep Medicine Reviews 14, 3: 179–189. https://doi.org/10.1016/j.smrv.2009.10.004",
      "doi": ""
    },
    {
      "text": "Kursat F Ozenc, James P Brommer, Bong-keum Jeong, Nina Shih, Karen Au, and John Zimmerman. 2007. Reverse alarm clock: a research through design example of designing for the self. Proceedings of the 2007 conference on Designing pleasurable products and interfaces, August: 392–406. https://doi.org/10.1145/1314161.1314196",
      "doi": "10.1145/1314161.1314196"
    },
    {
      "text": "Leysia Palen and Amanda Hughes. 2007. When home base is not a place: parents’ use of mobile telephones. Personal and Ubiquitous Computing 11, 5: 339–348.",
      "doi": "10.1007/s00779-006-0078-3"
    },
    {
      "text": "Laura R Pina, Sang-wha Sien, Teresa Ward, Jason C Yip, Sean A Munson, James Fogarty, and Julie A Kientz. 2017. From Personal Informatics to Family Informatics: Understanding Family Practices around Health Monitoring. 2300–2315.",
      "doi": ""
    },
    {
      "text": "Laura Pina, Sang-Wha Sien, Clarissa Song, Teresa M Ward, James Fogarty, Sean A Munson, and Julie A Kientz. 2020. DreamCatcher: Exploring How Parents and School-Age Children Can Track and Review Sleep Information Together. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1: 1–25.",
      "doi": "10.1145/3392882"
    },
    {
      "text": "Catherine Plaisant, Aaron Clamage, Hilary Browne Hutchinson, Benjamin B. Bederson, and Allison Druin. 2006. Shared family calendars: Promoting symmetry and accessibility. ACM Transactions on Computer-Human Interaction 13, 3: 313–346. https://doi.org/10.1145/1183456.1183458",
      "doi": "10.1145/1183456.1183458"
    },
    {
      "text": "Ruth Ravichandran, Sang-Wha Sien, Shwetak N Patel, Julie A Kientz, and Laura R Pina. 2017. Making sense of sleep sensors: How sleep sensing technologies support and undermine sleep health. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 6864–6875.",
      "doi": "10.1145/3025453.3025557"
    },
    {
      "text": "David L Reed and William P Sacco. 2016. Measuring sleep efficiency: what should the denominator be? Journal of clinical sleep medicine 12, 2: 263–266.",
      "doi": ""
    },
    {
      "text": "Jennifer A Rode. 2010. The roles that make the domestic work. In Proceedings of the 2010 ACM conference on Computer supported cooperative work, 381–390.",
      "doi": "10.1145/1718918.1718984"
    },
    {
      "text": "Jennifer A Rode. 2011. A theoretical agenda for feminist HCI. Interacting with Computers 23, 5: 393–400.",
      "doi": "10.1016/j.intcom.2011.04.005"
    },
    {
      "text": "Jennifer A Rode, Eleanor F Toye, and Alan F Blackwell. 2004. The fuzzy felt ethnography—understanding the programming patterns of domestic appliances. Personal and Ubiquitous Computing 8, 3–4: 161–176.",
      "doi": "10.1007/s00779-004-0272-0"
    },
    {
      "text": "Herman Saksono, Carmen Castaneda-sceppa, Jessica Hoffman, Vivien Morris, Magy Seif El-nasr, and Andrea G Parker. 2020. Storywell: Designing for Family Fitness App Motivation by Using Social Rewards and Reflection. CHI Conference on Human Factors in Computing Systems Proceedings (CHI 2020): 1–13. https://doi.org/10.1145/3313831.3376686",
      "doi": "10.1145/3313831.3376686"
    },
    {
      "text": "Jomara Sandbulte, Eun Kyoung Choe, and John M Carroll. 2020. Towards family‐centered health technologies that support distributed families on sustainable healthy practices together. Proceedings of the Association for Information Science and Technology 57, 1: e274.",
      "doi": ""
    },
    {
      "text": "Chris Schaefbauer, Danish Kahn, Amy Le, Garrett Sczechowski, and Katie Siek. 2015. Snack buddy: Supporting healthy snacking in low socioeconomic status families. CSCW 2015 - Proceedings of the 2015 ACM International Conference on Computer-Supported Cooperative Work and Social Computing: 1045–1057. https://doi.org/10.1145/2675133.2675180",
      "doi": "10.1145/2675133.2675180"
    },
    {
      "text": "Albrecht Schmidt. 2006. Network alarm clock (the 3ad international design competition). Personal and Ubiquitous Computing 10, 2–3: 191–192.",
      "doi": "10.1007/s00779-005-0022-y"
    },
    {
      "text": "Ji Youn Shin, Dima Chaar, Catherine Davis, Sung Won Choi, and Hee Rin Lee. 2021. Every Cloud Has a Silver Lining: Exploring Experiential Knowledge and Assets of Family Caregivers. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2: 1–25.",
      "doi": "10.1145/3479560"
    },
    {
      "text": "Ji Youn Shin and Bree E Holtz. 2019. Towards Better Transitions for Children with Diabetes: User Experiences on a Mobile Health App. In Proceedings of the 18th ACM International Conference on Interaction Design and Children, 623–628.",
      "doi": "10.1145/3311927.3325319"
    },
    {
      "text": "Ji Youn Shin, Jacob Kedroske, Rebecca Vue, Sankaran Roshun, Dima Chaar, Tracey Churay, and Sung Won Choi. 2018. Design Considerations for Family- Centered Health Management: Preliminary Findings with Pediatric BMT Patients. 593–598.",
      "doi": ""
    },
    {
      "text": "Ji Youn Shin, Minjin Rheu, Jina Huh-Yoo, and Wei Peng. 2021. Designing Technologies to Support Parent-Child Relationships: A Review of Current Findings and Suggestions for Future Directions. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2: 1–31.",
      "doi": "10.1145/3479585"
    },
    {
      "text": "Jong Cheol Shin, Julia Kim, and Diana Grigsby-Toussaint. 2017. Mobile phone interventions for sleep disorders and sleep quality: systematic review. JMIR mHealth and uHealth 5, 9: e131.",
      "doi": ""
    },
    {
      "text": "Bruno M C Silva, Joel J P C Rodrigues, Isabel de la Torre Díez, Miguel López-Coronado, and Kashif Saleem. 2015. Mobile-health: A review of current state in 2015. Journal of biomedical informatics 56: 265–272.",
      "doi": "10.1016/j.jbi.2015.06.003"
    },
    {
      "text": "Arlene Smaldone, Judy C Honig, and Mary W Byrne. 2007. Sleepless in America: inadequate sleep and relationships to health and well-being of our nation's children. Pediatrics 119, Supplement 1: S29–S37.",
      "doi": ""
    },
    {
      "text": "Timothy Sohn, Lorikeet Lee, Stephanie Zhang, David Dearman, and Khai Truong. 2012. An examination of how households share and coordinate the completion of errands. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, 729–738.",
      "doi": "10.1145/2145204.2145315"
    },
    {
      "text": "Tobias Sonne, Jörg Müller, Paul Marshall, Carsten Obel, and Kaj Grønbæk. 2016. Changing Family Practices with Assistive Technology: MOBERO Improves Morning and Bedtime Routines for Children with ADHD. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16: 152–164. https://doi.org/10.1145/2858036.2858157",
      "doi": "10.1145/2858036.2858157"
    },
    {
      "text": "Susan Leigh Star and Anselm Strauss. 1999. Layers of silence, arenas of voice: The ecology of visible and invisible work. Computer supported cooperative work (CSCW) 8, 1–2: 9–30.",
      "doi": ""
    },
    {
      "text": "The Centers for Disease Control and Prevention's (CDC) Morbidity and Mortality Weekly Report. 1 in 3 adults don't get enough sleep: A good night's sleep is critical for good health. Retrieved from https://www.cdc.gov/media/releases/2016/p0215-enough-sleep.html",
      "doi": ""
    },
    {
      "text": "Peter Tolmie, Andy Crabtree, Tom Rodden, Chris Greenhalgh, and Steve Benford. 2007. Making the home network at home: Digital housekeeping. ECSCW 2007 - Proceedings of the 10th European Conference on Computer Supported Cooperative Work, September: 331–350. https://doi.org/10.1007/978-1-84800-031-5_18",
      "doi": ""
    },
    {
      "text": "Kelly B Wagman and Lisa Parks. 2021. Beyond the Command: Feminist STS Research and Critical Issues for the Design of Social Machines. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1: 1–20.",
      "doi": "10.1145/3449175"
    }
  ]
}