{
  "doi": "10.1145/3491102.3502011",
  "title": "Designing for Relational Maintenance: New Directions for AAC Research",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "AAC research has traditionally focused on input speed, leaving higher-level communication goals such as relational maintenance under-explored. Through semi-structured interviews with AAC users with motor and speech impairments and their primary family caregivers, we offer a nuanced understanding of AAC’s roles in maintaining close relationships. Our inductive analysis reveals emerging themes including how AAC users and their partners share the physical and mental workload to overcome communication barriers in complex situations. Our deductive application of the Relational Maintenance Strategies framework exposes the efforts made and the challenges encountered in managing social engagements, providing mutual support, and decoding implicit expressions. From these insights, we propose novel research directions for better supporting maintenance strategies and social purposes of communication, including notably mediating relational tensions, leveraging empowerment and identity, and supporting interactions for social closeness and etiquette, which we hope will motivate discussion in HCI communities on expanding AAC research space.",
  "authors": [
    {
      "name": "Jiamin Dai",
      "institution": "School of Information Studies, McGill University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659506110",
      "orcid": "missing"
    },
    {
      "name": "Karyn Moffatt",
      "institution": "School of Information Studies, McGill University, Canada",
      "img": "/do/10.1145/contrib-81100235288/rel-imgonly/karyn.jpg",
      "acmid": "81100235288",
      "orcid": "missing"
    },
    {
      "name": "Jinglan Lin",
      "institution": "Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659451452",
      "orcid": "missing"
    },
    {
      "name": "Khai Truong",
      "institution": "Computer Science, University of Toronto, Canada",
      "img": "/do/10.1145/contrib-81339532748/rel-imgonly/81339532748.jpg",
      "acmid": "81339532748",
      "orcid": "0000-0003-0774-5964"
    }
  ],
  "references": [
    {
      "text": "American Speech-Language-Hearing Association. 2021. Augmentative and Alternative Communication. Retrieved December 6, 2021 from https://www.asha.org/practice-portal/professional-issues/augmentative-and-alternative-communication/",
      "doi": ""
    },
    {
      "text": "Laura J. Ball, Susan Fager, and Melanie Fried-Oken. 2012. Augmentative and alternative communication for people with progressive neuromuscular disease. Physical Medicine and Rehabilitation Clinics of North America 23 (8 2012), 689–699. Issue 3. https://doi.org/10.1016/j.pmr.2012.06.003",
      "doi": ""
    },
    {
      "text": "Scott Bateman, Regan L. Mandryk, Tadeusz Stach, and Carl Gutwin. 2011. Target Assistance for Subtly Balancing Competitive Play. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2355–2364. https://doi.org/10.1145/1978942.1979287",
      "doi": "10.1145/1978942.1979287"
    },
    {
      "text": "Erin Beneteau. 2020. Who Are You Asking?: Qualitative Methods for Involving AAC Users as Primary Research Participants. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, 1–13. https://doi.org/10.1145/3313831.3376883",
      "doi": "10.1145/3313831.3376883"
    },
    {
      "text": "Cynthia L. Bennett, Erin Brady, and Stacy M. Branham. 2018. Interdependence as a frame for assistive technology research and design. ASSETS 2018 - 20th International ACM SIGACCESS Conference on Computers and Accessibility, 161–173. https://doi.org/10.1145/3234695.3236348",
      "doi": "10.1145/3234695.3236348"
    },
    {
      "text": "Jeffrey R. Blum and Jeremy R. Cooperstock. 2016. Expressing Human State via Parameterized Haptic Feedback for Mobile Remote Implicit Communication. Proceedings of the 7th Augmented Human International Conference 2016, 1–2. https://doi.org/10.1145/2875194.2875225",
      "doi": ""
    },
    {
      "text": "Pauline Boss and Barbara A Couden. 2002. Ambiguous loss from chronic physical illness: Clinical interventions with individuals, couples, and families. Journal of clinical psychology 58, 11 (2002), 1351–1360. https://doi.org/10.1002/jclp.10083",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3 (1 2006), 77–101. Issue 2. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Daniel J Canary, Laura Stafford, Kimberley S Hause, and Lisa A Wallace. 1993. An Inductive Analysis of Relational Maintenance Strategies: Comparisons Among Lovers, Relatives, Friends, and Others. Communication Research Reports 10 (1993), 5–14. Issue 1.",
      "doi": ""
    },
    {
      "text": "Jessica Caron and Janice Light. 2015. “My world has expanded even though I’m stuck at home”: Experiences of individuals with amyotrophic lateral sclerosis who use augmentative and alternative communication and social media. American Journal of Speech-Language Pathology 24 (11 2015), 680–695. Issue 4. https://doi.org/10.1044/2015_AJSLP-15-0010",
      "doi": ""
    },
    {
      "text": "Jessica Caron and Janice Light. 2016. ”Social Media has Opened a World of Open communication:” Experiences of Adults with Cerebral Palsy who use Augmentative and Alternative Communication and Social Media. AAC: Augmentative and Alternative Communication 32 (1 2016), 25–40. Issue 1. https://doi.org/10.3109/07434618.2015.1052887",
      "doi": ""
    },
    {
      "text": "Raymond C.K. Chan. 2000. How does spinal cord injury affect marital relationship? A story from both sides of the couple. Disability and Rehabilitation 22 (2000), 764–775. Issue 17. https://doi.org/10.1080/09638280050200269",
      "doi": ""
    },
    {
      "text": "Raymond C.K. Chan, PWH Lee, and F Lieh-Mak. 2000. Coping with spinal cord injury: personal and marital adjustment in the Hong Kong Chinese setting. Spinal Cord 38(2000), 687–696. https://doi.org/10.1038/sj.sc.3101085",
      "doi": ""
    },
    {
      "text": "Jiamin Dai and Karyn Moffatt. 2020. Making Space for Social Sharing: Insights from a Community-Based Social Group for People with Dementia. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, 1–13. https://doi.org/10.1145/3313831.3376133",
      "doi": "10.1145/3313831.3376133"
    },
    {
      "text": "Jiamin Dai and Karyn Moffatt. 2021. Surfacing the Voices of People with Dementia: Strategies for Effective Inclusion of Proxy Stakeholders in Qualitative Research. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–13. https://doi.org/10.1145/3411764.3445756",
      "doi": "10.1145/3411764.3445756"
    },
    {
      "text": "Kathryn Dindia. 2002. Definitions and Perspectives on Relational Maintenance Communication. In Maintaining relationships through communication: Relational, contextual, and cultural variations. 1–28. https://doi.org/10.4324/9781410606990-1",
      "doi": ""
    },
    {
      "text": "Robert Douglas Ferguson, Michael Massimi, Emily Anne Crist, and Karyn Anne Moffatt. 2014. Craving, Creating, and Constructing Comfort: Insights and Opportunities for Technology in Hospice. Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing, 1479–1490. https://doi.org/10.1145/2531602.2531631",
      "doi": "10.1145/2531602.2531631"
    },
    {
      "text": "Alexander Fiannaca, Ann Paradiso, Mira Shah, and Meredith Ringel Morris. 2017. AACrobat: Using mobile devices to lower communication barriers and provide autonomy with Gaze-based AAC. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW, 683–695. https://doi.org/10.1145/2998181.2998215",
      "doi": "10.1145/2998181.2998215"
    },
    {
      "text": "Alexander J. Fiannaca, Ann Paradiso, Jon Campbell, and Meredith Ringel Morris. 2018. Voicesetting: Voice authoring UIs for improved expressivity in augmentative communication. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 1–12. https://doi.org/10.1145/3173574.3173857",
      "doi": "10.1145/3173574.3173857"
    },
    {
      "text": "Claire Freeman, Bernadette Cassidy, and E Jean C Hay-Smith. 2017. Couple’s experiences of relationship maintenance and intimacy in acute spinal cord injury rehabilitation: an interpretative phenomenological analysis. Sexuality and Disability 35, 4 (2017), 433–444. https://doi.org/10.1007/s11195-017-9496-6",
      "doi": ""
    },
    {
      "text": "Carli Friedman. 2019. Family members of people with disabilities’ explicit and implicit disability attitudes.Rehabilitation psychology 64, 2 (2019), 203–211. https://doi.org/10.1037/rep0000265",
      "doi": ""
    },
    {
      "text": "Bhavya Ghai and Klaus Mueller. 2021. Fluent: An AI Augmented Writing Tool for People who Stutter. ASSETS 2021 - 23rd International ACM SIGACCESS Conference on Computers and Accessibility, 1–8. https://doi.org/10.1145/3441852.3471211",
      "doi": "10.1145/3441852.3471211"
    },
    {
      "text": "Megan Hofmann, Devva Kasnitz, Jennifer Mankoff, and Cynthia L. Bennett. 2020. Living Disability Theory: Reflections on Access, Research, and Design. ASSETS 2020 - 22nd International ACM SIGACCESS Conference on Computers and Accessibility, 1–13. https://doi.org/10.1145/3373625.3416996",
      "doi": "10.1145/3373625.3416996"
    },
    {
      "text": "Yun Huang, Ying Tang, and Yang Wang. 2015. Emotion Map: A Location-Based Mobile Social System for Improving Emotion Awareness and Regulation. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, 130–142. https://doi.org/10.1145/2675133.2675173",
      "doi": "10.1145/2675133.2675173"
    },
    {
      "text": "Chi-Shin Hwang, Ho-Hsiu Weng, Li-Fen Wang, Chon-Haw Tsai, and Hao-Teng Chang. 2014. An eye-tracking assistive device improves the quality of life for ALS patients and reduces the caregivers’ burden. Journal of motor behavior 46, 4 (2014), 233–238. https://doi.org/10.1080/00222895.2014.891970",
      "doi": ""
    },
    {
      "text": "Susan Hwang, Adrian L. Jessup Schneider, Daniel Clarke, Alexander Macintosh, Lauren Switzer, Darcy Fehlings, and T.C. Nicholas Graham. 2017. How Game Balancing Affects Play: Player Adaptation in an Exergame for Children with Cerebral Palsy. Proceedings of the 2017 Conference on Designing Interactive Systems, 699–710. https://doi.org/10.1145/3064663.3064664",
      "doi": "10.1145/3064663.3064664"
    },
    {
      "text": "Alon Ilsar and Gail Kenning. 2020. Inclusive Improvisation through Sound and Movement Mapping: From DMI to ADMI. ASSETS 2020 - 22nd International ACM SIGACCESS Conference on Computers and Accessibility, 1–8. https://doi.org/10.1145/3373625.3416988",
      "doi": "10.1145/3373625.3416988"
    },
    {
      "text": "Karin Joubert and J. Bornman. 2012. Motor neuron disease: The impact of decreased speech intelligibility on marital communication. South African Family Practice 54 (2012), 332–338. Issue 4. https://doi.org/10.1080/20786204.2012.10874245",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Anhong Guo, and Meredith Ringel Morris. 2020. Sense and Accessibility. ASSETS 2020 - 22nd International ACM SIGACCESS Conference on Computers and Accessibility, 1–14. https://doi.org/10.1145/3373625.3416990",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Meredith Ringel Morris, Ann Paradiso, and Jon Campbell. 2017. ”At times avuncular and cantankerous, with the reflexes of a mongoose”: Understanding self-expression through augmentative and alternative communication devices. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW, 1166–1179. https://doi.org/10.1145/2998181.2998284",
      "doi": "10.1145/2998181.2998284"
    },
    {
      "text": "D. Karana-Zebari, M. B. De Leon, and C. Z. Kalpakjian. 2011. Predictors of marital longevity after new spinal cord injury. Spinal Cord 49 (1 2011), 120–124. Issue 1. https://doi.org/10.1038/sc.2010.63",
      "doi": ""
    },
    {
      "text": "Chris Klein. 2017. Communication and developing relationships for people who use augmentative and alternative communication. Assistive Technology Outcomes & Benefits 11, Summer (2017), 58–65.",
      "doi": ""
    },
    {
      "text": "Hong Li, Pradthana Jarusriboonchai, Heiko Müller, Emmi Harjuniemi, and Jonna Häkkilä. 2020. Emotional Communication between Remote Couples: Exploring the Design of Wearable Ambient Displays. Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society, 1–5. https://doi.org/10.1145/3419249.3420139",
      "doi": "10.1145/3419249.3420139"
    },
    {
      "text": "Janice Light. 1988. Interaction Involving Individuals using Augmentative and Alternative Communication Systems: State of the Art and Future Directions. Augmentative and Alternative Communication 4 (1988), 66–82. Issue 2. https://doi.org/10.1080/07434618812331274657",
      "doi": ""
    },
    {
      "text": "Janice Light. 1989. Toward a Definition of Communicative Competence for Individuals Using Augmentative and Alternative Communication Systems. Augmentative and Alternative Communication 5 (1989), 137–144. Issue 2. https://doi.org/10.1080/07434618912331275126",
      "doi": ""
    },
    {
      "text": "Janice Light and David McNaughton. 2014. Communicative competence for individuals who require augmentative and alternative communication: A new definition for a new era of communication?AAC: Augmentative and Alternative Communication 30 (3 2014), 1–18. Issue 1. https://doi.org/10.3109/07434618.2014.885080",
      "doi": ""
    },
    {
      "text": "Lili Liu, Antonio Miguel Cruz, and Adriana Maria Rios Rincon. 2019. Technology acceptance, adoption, and usability: Arriving at consistent terminologies and measurement approaches. In Everyday Technologies in Healthcare. CRC Press, 319–338.",
      "doi": ""
    },
    {
      "text": "Emma MacGregor, Matthew Beaubien, Kate Sellen, Kowoon Jang, Molly McGovern, Chieng Luphuyong, Mariam Albess, and Victoria Weng. 2020. Ethical Considerations for HCI Research on End of Life: Time Moving. CHI’20 Workshop, HCI at End of Life & Beyond, 65–70.",
      "doi": ""
    },
    {
      "text": "Päivi Majaranta, Ulla-Kaija Ahola, and Oleg Špakov. 2009. Fast gaze typing with an adjustable dwell time. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 357–360. https://doi.org/10.1145/1518701.1518758",
      "doi": "10.1145/1518701.1518758"
    },
    {
      "text": "Miechelle Mckelvey, David L. Evans, Norimune Kawai, and David Beukelman. 2012. Communication styles of persons with ALS as recounted by surviving partners. AAC: Augmentative and Alternative Communication 28 (12 2012), 232–242. Issue 4. https://doi.org/10.3109/07434618.2012.737023",
      "doi": ""
    },
    {
      "text": "David McNaughton, Janice Light, David R Beukelman, Chris Klein, Dana Nieder, and Godfrey Nazareth. 2019. Building capacity in AAC: A person-centred approach to supporting participation by people with complex communication needs. Augmentative and Alternative Communication 35, 1 (2019), 56–68. https://doi.org/10.1080/07434618.2018.1556731",
      "doi": ""
    },
    {
      "text": "David C Myers. 2003. Close relationships and quality of life. Well-being: Foundations of hedonic psychology (2003), 374–391.",
      "doi": ""
    },
    {
      "text": "Timothy Neate, Abi Roper, Stephanie Wilson, and Jane Marshall. 2019. Empowering expression for users with aphasia through constrained creativity. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1–12. https://doi.org/10.1145/3290605.3300615",
      "doi": "10.1145/3290605.3300615"
    },
    {
      "text": "Mmachi God’sglory Obiorah, Anne Marie Piper, and Michael Horn. 2021. Designing AACs for people with aphasia dining in restaurants. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–14. https://doi.org/10.1145/3411764.3445280",
      "doi": "10.1145/3411764.3445280"
    },
    {
      "text": "Diogo Pedrosa, Maria Da Graça Pimentel, Amy Wright, and Khai N. Truong. 2015. Filteryedping: Design challenges and user performance of dwell-free eye typing. ACM Transactions on Accessible Computing 6 (3 2015), 1–37. Issue 1. https://doi.org/10.1145/2724728",
      "doi": ""
    },
    {
      "text": "Özge Raudanjoki, Çağlar Genç, Kuisma Hurtig, and Jonna Häkkilä. 2020. ShadowSparrow: An Ambient Display for Information Visualization and Notification. 19th International Conference on Mobile and Ubiquitous Multimedia, 351–353. https://doi.org/10.1145/3428361.3431197",
      "doi": ""
    },
    {
      "text": "Kari-Jouko Räihä and Saila Ovaska. 2012. An Exploratory Study of Eye Typing Fundamentals:Dwell Time, Text Entry Rate, Errors, and Workload. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3001–3010. https://doi.org/10.1145/2207676.2208711",
      "doi": "10.1145/2207676.2208711"
    },
    {
      "text": "Elaine Schembri Lia and Angela Abela. 2020. The couple relationship when the female partner has an acquired physical disability. The History of the Family 25, 2 (2020), 265–286. https://doi.org/10.1080/1081602X.2019.1663549",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara, Nayeri Jacobo, Wanda Pratt, and Jacob O. Wobbrock. 2020. Design for social accessibility method cards: Engaging users and reflecting on social scenarios for accessible design. ACM Transactions on Accessible Computing 12 (1 2020), 1–33. Issue 4. https://doi.org/10.1145/3369903",
      "doi": "10.1145/3369903"
    },
    {
      "text": "Kristen Shinohara and Jacob O. Wobbrock. 2016. Self-conscious or self-confident? A diary study conceptualizing the social accessibility of assistive technology. ACM Transactions on Accessible Computing 8 (1 2016), 1–31. Issue 2. https://doi.org/10.1145/2827857",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara, Jacob O. Wobbrock, and Wanda Pratt. 2018. Incorporating social factors in accessible design. ASSETS 2018 - 20th International ACM SIGACCESS Conference on Computers and Accessibility, 149–160. https://doi.org/10.1145/3234695.3236346",
      "doi": "10.1145/3234695.3236346"
    },
    {
      "text": "Irina Shklovski, Louise Barkhuus, Nis Bornoe, and Joseph Jofish Kaye. 2015. Friendship maintenance in the digital age: Applying a relational lens to online social interaction. Proceedings of the 2015 ACM International Conference on Computer-Supported Cooperative Work and Social Computing, 1477–1487. https://doi.org/10.1145/2675133.2675294",
      "doi": "10.1145/2675133.2675294"
    },
    {
      "text": "Kiley Sobel, Alexander Fiannaca, Jon Campbell, Harish Kulkarni, Ann Paradiso, Edward Cutrell, and Meredith Ringel Morris. 2017. Exploring the design space of AAC awareness displays. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 2890–2903. https://doi.org/10.1145/3025453.3025610",
      "doi": "10.1145/3025453.3025610"
    },
    {
      "text": "Carla Tamburro, Timothy Neate, Abi Roper, and Stephanie Wilson. 2020. Accessible Creativity with a Comic Spin. ASSETS 2020 - 22nd International ACM SIGACCESS Conference on Computers and Accessibility, 1–11. https://doi.org/10.1145/3373625.3417012",
      "doi": "10.1145/3373625.3417012"
    },
    {
      "text": "Michelle C.S. Therrien. 2019. Perspectives and experiences of adults who use AAC on making and keeping friends. AAC: Augmentative and Alternative Communication 35 (2019), 205–216. Issue 3. https://doi.org/10.1080/07434618.2019.1599065",
      "doi": ""
    },
    {
      "text": "Stephanie Valencia, Michal Luria, Amy Pavel, Jefrey P. Bigham, and Henny Admoni. 2021. Co-designing socially assistive sidekicks for motion-based AAC. ACM/IEEE International Conference on Human-Robot Interaction, 24–33. https://doi.org/10.1145/3434073.3444646",
      "doi": "10.1145/3434073.3444646"
    },
    {
      "text": "Stephanie Valencia, Mark Steidl, Michael Rivera, Cynthia Bennett, Jeffrey Bigham, and Henny Admoni. 2021. Aided Nonverbal Communication through Physical Expressive Objects. ASSETS 2021 - 23rd International ACM SIGACCESS Conference on Computers and Accessibility, 1–11. https://doi.org/10.1145/3441852.3471228",
      "doi": "10.1145/3441852.3471228"
    },
    {
      "text": "Jessica Vitak. 2014. Facebook makes the heart grow fonder: Relationship maintenance strategies among geographically dispersed and communication-restricted connections. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW, 842–853. https://doi.org/10.1145/2531602.2531726",
      "doi": "10.1145/2531602.2531726"
    },
    {
      "text": "Mike Wu, Jeremy Birnholtz, Brian Richards, Ronald Baecker, and Mike Massimi. 2008. Collaborating to Remember: A Distributed Cognition Account of Families Coping with Memory Impairments. Proceedings of the 2008 CHI Conference on Human Factors in Computing Systems, 825–834. https://doi.org/10.1145/1357054.1357186",
      "doi": "10.1145/1357054.1357186"
    }
  ]
}