{
  "doi": "10.1145/3491102.3517540",
  "title": "How AI-Based Training Affected the Performance of Professional Go Players",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2022,
  "badges": [],
  "abstract": "In this study, we analyzed how the performance of professional Go players has changed since the advent of AlphaGo, the first artificial intelligence (AI) application to defeat a human world Go champion. We interviewed and surveyed professional Go players and found that AI has been actively introduced into the Go training process since the advent of AlphaGo. The significant impact of AI-based training was confirmed in a subsequent analysis of 6,292 games in Korean Go tournaments and Elo rating data of 1,362 Go players worldwide. Overall, the tendency of players to make moves similar to those recommended by AI has sharply increased since 2017. The degree to which players’ expected win rates fluctuate during a game has also decreased significantly since 2017. We also found that AI-based training has provided more benefits to senior players and allowed them to achieve Elo ratings higher than those of junior players.",
  "tags": [
    "Artificial Intelligence",
    "game of Go",
    "neural network",
    "deep learning",
    "AlphaGo"
  ],
  "authors": [
    {
      "name": "Jimoon Kang",
      "institution": "Department of Computer Science, Yonsei University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660232879",
      "orcid": "missing"
    },
    {
      "name": "June Seop Yoon",
      "institution": "Department of Computer Science, Yonsei University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238087",
      "orcid": "missing"
    },
    {
      "name": "Byungjoo Lee",
      "institution": "Department of Computer Science, Yonsei University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659503945",
      "orcid": "0000-0003-0341-448X"
    }
  ],
  "references": [
    {
      "text": "Steven Borowiec and Tracey Lien. 2016. AlphaGo beats human Go champ in milestone for artificial intelligence. Los Angeles Times 12(2016).",
      "doi": ""
    },
    {
      "text": "Bruno Bouzy and Tristan Cazenave. 2001. Computer Go: an AI oriented survey. Artificial Intelligence 132, 1 (2001), 39–103.",
      "doi": "10.1016/S0004-3702%2801%2900127-8"
    },
    {
      "text": "Cameron B. Browne, Edward Powley, Daniel Whitehouse, Simon M. Lucas, Peter I. Cowling, Philipp Rohlfshagen, Stephen Tavener, Diego Perez, Spyridon Samothrakis, and Simon Colton. 2012. A Survey of Monte Carlo Tree Search Methods. IEEE Transactions on Computational Intelligence and AI in Games 4, 1(2012), 1–43. https://doi.org/10.1109/TCIAIG.2012.2186810",
      "doi": ""
    },
    {
      "text": "Jacques Bughin, Jeongmin Seong, James Manyika, Michael Chui, and Raoul Joshi. 2018. Notes from the AI frontier: Modeling the impact of AI on the world economy. McKinsey Global Institute(2018).",
      "doi": ""
    },
    {
      "text": "Tristan Cazenave. 2021. Improving Model and Search for Computer Go. arXiv preprint arXiv:2102.03467(2021).",
      "doi": ""
    },
    {
      "text": "Sukwoong Choi, Namil Kim, and Junsik Kim. 2021. Strategic Choices with Artificial Intelligence. In Academy of Management Proceedings, Vol. 2021. Academy of Management Briarcliff Manor, NY 10510, 14125.",
      "doi": ""
    },
    {
      "text": "William S Cleveland, Eric Grosse, and William M Shyu. 2017. Local regression models. In Statistical models in S. Routledge, 309–376.",
      "doi": ""
    },
    {
      "text": "Mark Coeckelbergh. 2020. AI ethics. MIT Press.",
      "doi": ""
    },
    {
      "text": "Rémi Coulom. 2007. Computing “elo ratings” of move patterns in the game of go. ICGA journal 30, 4 (2007), 198–208.",
      "doi": ""
    },
    {
      "text": "Kate Crawford, Meredith Whittaker, Madeleine Clare Elish, Solon Barocas, Aaron Plasek, and Kadija Ferryman. 2016. The AI Now Report. The Social and Economic Implications of Artificial Intelligence Technologies in the Near-Term(2016).",
      "doi": ""
    },
    {
      "text": "Melissa DeJonckheere and Lisa M Vaughn. 2019. Semistructured interviewing in primary care research: a balance of relationship and rigour. Family Medicine and Community Health 7, 2 (2019).",
      "doi": ""
    },
    {
      "text": "Attila Egri-Nagy and Antti Törmänen. 2020. The Game Is Not over Yet—Go in the Post-AlphaGo Era. Philosophies 5, 4 (2020), 37.",
      "doi": ""
    },
    {
      "text": "Special Eurobarometer. 2012. Public attitudes towards robots. European Commission (2012).",
      "doi": ""
    },
    {
      "text": "Elizabeth Gibney. 2016. Google AI algorithm masters ancient game of Go. Nature News 529, 7587 (2016), 445.",
      "doi": ""
    },
    {
      "text": "Patrick Haggard and Baruch Eitam. 2015. The sense of agency. Social Cognition and Social Ne.",
      "doi": ""
    },
    {
      "text": "Michael S Harré, Terence Bossomaier, A Gillett, and A Snyder. 2011. The aggregate complexity of decisions in the game of Go. The European Physical Journal B 80, 4 (2011), 555–563.",
      "doi": ""
    },
    {
      "text": "Chris Hattersley, Dave Hembrough, Kaseem Khan, Andy Picken, James Rumbold, and Tom Maden-Wilkinson. 2019. Managing the transition into retirement for elite athletes. Professional strength & conditioning53 (2019), 11–16.",
      "doi": ""
    },
    {
      "text": "Anton Kalén, Ezequiel Rey, Alejandro Sal de Rellán-Guerra, and Carlos Lago-Peñas. 2019. Are soccer players older now than before? aging trends and market value in the last three decades of the UEFA champions league. Frontiers in psychology 10 (2019), 76.",
      "doi": ""
    },
    {
      "text": "Spyros Makridakis. 2017. The forthcoming Artificial Intelligence (AI) revolution: Its impact on society and firms. Futures 90(2017), 46–60.",
      "doi": ""
    },
    {
      "text": "Sewook Oh and Young joo Kim. 2016. Robots advancing: how much they threaten human jobs. Media issue 2, 2 (2016), 6–10.",
      "doi": ""
    },
    {
      "text": "Choe Sang-Hun. 2016. Google’s computer program beats Lee Sedol in Go tournament. New York Times (2016).",
      "doi": ""
    },
    {
      "text": "David Silver, Aja Huang, Chris J Maddison, Arthur Guez, Laurent Sifre, George Van Den Driessche, Julian Schrittwieser, Ioannis Antonoglou, Veda Panneershelvam, Marc Lanctot, 2016. Mastering the game of Go with deep neural networks and tree search. nature 529, 7587 (2016), 484–489.",
      "doi": ""
    },
    {
      "text": "David Silver, Julian Schrittwieser, Karen Simonyan, Ioannis Antonoglou, Aja Huang, Arthur Guez, Thomas Hubert, Lucas Baker, Matthew Lai, Adrian Bolton, 2017. Mastering the game of go without human knowledge. nature 550, 7676 (2017), 354–359.",
      "doi": ""
    },
    {
      "text": "Stefan Steinerberger. 2015. On the number of positions in chess without promotion. International Journal of Game Theory 44, 3 (2015), 761–767.",
      "doi": "10.1007/s00182-014-0453-7"
    },
    {
      "text": "Anthony Strittmatter, Uwe Sunde, and Dainis Zegners. 2020. Life cycle patterns of cognitive performance over the long run. Proceedings of the National Academy of Sciences 117, 44(2020), 27255–27261.",
      "doi": ""
    },
    {
      "text": "John Tromp. 2016. The number of legal go positions. In International Conference on Computers and Games. Springer, 183–190.",
      "doi": ""
    },
    {
      "text": "Nemanja Vaci, Bartosz Gula, and Merim Bilalić. 2015. Is age really cruel to experts? Compensatory effects of activity.Psychology and Aging 30, 4 (2015), 740.",
      "doi": ""
    },
    {
      "text": "Erik Van Der Werf. 2004. AI techniques for the game of Go. Citeseer.",
      "doi": ""
    },
    {
      "text": "David J Wu. 2019. Accelerating self-play learning in go. arXiv preprint arXiv:1902.10565(2019).",
      "doi": ""
    },
    {
      "text": "Paul Wylleman, Dorothee Alfermann, and David Lavallee. 2004. Career transitions in sport: European perspectives. Psychology of sport and exercise 5, 1 (2004), 7–20.",
      "doi": ""
    },
    {
      "text": "Mark Zastrow. 2016. South Korea trumpets $860-million AI fund after AlphaGo’shock’. Nature News (2016).",
      "doi": ""
    },
    {
      "text": "Mark Zastrow. 2016. Why South Korea is the world’s biggest investor in research. Nature News 534, 7605 (2016), 20.",
      "doi": ""
    },
    {
      "text": "Yuan Zhou. 2018. Rethinking Opening Strategy: AlphaGo’s Impact on Pro Play. CreateSpace 1, 36 (2018), 212.",
      "doi": ""
    }
  ]
}