{
  "doi": "10.1145/3491102.3517549",
  "title": "Overcoming Legacy Bias: Re-Designing Gesture Interactions in Virtual Reality With a San Community in Namibia",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "Recent improvements in hand-tracking technologies support novel applications and developments of gesture interactions in virtual reality (VR). Current implementations are mostly convention-based, originating in a Western technological context, thereby creating a legacy bias in gesture interaction implementations. With expanding application contexts and growing user groups and contexts, the design and selection of gestures need to be diversified. In this paper we present an exploration of natural gestures, followed by their implementation in a VR application and co-design of new gestures with a marginalized San community in Namibia. This study contributes to the still scarce empirical work in user-driven gesture design research, aiming to reduce legacy bias, on a methodological and technical level as well as through engaging non-WEIRD participants. Our findings confirm the applicability of our method, combined with Partner and Priming suggested by Morris et al., to the design of gestures inspired by natural interactions. We also consider the implementation of user-designed gestures to be necessary to asses usability, usefulness and technical issues in VR. Furthermore, the research directly advances the HCI agenda for diversity, through an ongoing research and design partnership with an indigenous community in Southern Africa, thereby challenging systemic bias and promoting design for the pluriverse.",
  "authors": [
    {
      "name": "Emilie Maria Nybo Arendttorp",
      "institution": "Architecture, Design and Media Technology, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238675",
      "orcid": "0000-0002-0184-4550"
    },
    {
      "name": "Kasper Rodil",
      "institution": "Architecture, Design & Media Technology, Aalborg University, Denmark",
      "img": "/do/10.1145/contrib-81488671893/rel-imgonly/img_2262retouched.jpg",
      "acmid": "81488671893",
      "orcid": "0000-0002-6737-7342"
    },
    {
      "name": "Heike Winschiers-Theophilus",
      "institution": "Faculty of Computer Science, Namibia University of Science and Technology, Namibia",
      "img": "/do/10.1145/contrib-81508688910/rel-imgonly/nustnpportrait.jpg",
      "acmid": "81508688910",
      "orcid": "0000-0002-9752-3398"
    },
    {
      "name": "Christof Magoath",
      "institution": "Independent Researcher, Namibia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240093",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Muhammad Sadi Adamu. 2020. Adopting an African Standpoint in HCI4D: A Provocation. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3382833",
      "doi": "10.1145/3334480.3382833"
    },
    {
      "text": "Roland Aigner, Daniel Wigdor, Hrvoje Benko, Michael Haller, David Lindbauer, Alexandra Ion, Shengdong Zhao, and JTKV Koh. 2012. Understanding mid-air hand gestures: A study of human preferences in usage of gesture types for hci. Microsoft Research TechReport MSR-TR-2012-111 2 (2012), 30.",
      "doi": ""
    },
    {
      "text": "Niina Arvila, Anabel Fischer, Pietari Keskinen, and Marko Nieminen. 2018. Mobile Weather Services for Maasai Farmers: Socio-Cultural Factors Influencing the Adoption of Technology. In Proceedings of the Second African Conference for Human Computer Interaction: Thriving Communities (Windhoek, Namibia) (AfriCHI ’18). Association for Computing Machinery, New York, NY, USA, Article 4, 11 pages. https://doi.org/10.1145/3283458.3283466",
      "doi": "10.1145/3283458.3283466"
    },
    {
      "text": "Ceylan Beşevli, Oğuz Turan Buruk, Merve Erkaya, and Oğuzhan Özcan. 2018. Investigating the Effects of Legacy Bias: User Elicited Gestures from the End Users Perspective. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems (Hong Kong, China) (DIS ’18 Companion). Association for Computing Machinery, New York, NY, USA, 277–281. https://doi.org/10.1145/3197391.3205449",
      "doi": "10.1145/3197391.3205449"
    },
    {
      "text": "Arda Bilgen, Aftab Nasir, and Julia Schöneberg. 2021. Why positionalities matter: reflections on power, hierarchy, and knowledges in “development” research. Canadian Journal of Development Studies/Revue canadienne d’études du développement 42, 4 (2021), 1–18.",
      "doi": ""
    },
    {
      "text": "Mark Billinghurst and Bill Buxton. 2011. Gesture based interaction. Haptic input 24(2011), 1–35.",
      "doi": ""
    },
    {
      "text": "Doug Bowman, Chadwick Wingrave, Joshua Campbell, and Vinh Ly. 2001. Using pinch gloves (tm) for both natural and abstract interaction techniques in virtual environments.",
      "doi": ""
    },
    {
      "text": "Margot Brereton, Paul Roe, Ronald Schroeter, and Anita Lee Hong. 2014. Beyond Ethnography: Engagement and Reciprocity as Foundations for Design Research out Here. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1183–1186. https://doi.org/10.1145/2556288.2557374",
      "doi": "10.1145/2556288.2557374"
    },
    {
      "text": "Edwin Chan, Teddy Seyed, Wolfgang Stuerzlinger, Xing-Dong Yang, and Frank Maurer. 2016. User Elicitation on Single-Hand Microgestures. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 3403–3414. https://doi.org/10.1145/2858036.2858589",
      "doi": "10.1145/2858036.2858589"
    },
    {
      "text": "Li-Chieh Chen, Yun-Maw Cheng, Po-Ying Chu, and Frode Eika Sandnes. 2016. The Common Characteristics of User-Defined and Mid-Air Gestures for Rotating 3D Digital Contents. In Universal Access in Human-Computer Interaction. Interaction Techniques and Environments, Margherita Antona and Constantine Stephanidis (Eds.). Springer International Publishing, Cham, 15–22.",
      "doi": ""
    },
    {
      "text": "Nana Kesewaa Dankwa and Claude Draude. 2021. Setting Diversity at the Core of HCI. In Universal Access in Human-Computer Interaction. Design Methods and User Experience, Margherita Antona and Constantine Stephanidis (Eds.). Springer International Publishing, Cham, 39–52.",
      "doi": ""
    },
    {
      "text": "Tilman Dingler, Rufat Rzayev, Alireza Sahami Shirazi, and Niels Henze. 2018. Designing Consistent Gestures Across Device Types: Eliciting RSVP Controls for Phone, Watch, and Glasses. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173993",
      "doi": "10.1145/3173574.3173993"
    },
    {
      "text": "Sheena Erete, Aarti Israni, and Tawanna Dillahunt. 2018. An intersectional approach to designing in the margins. Interactions 25, 3 (2018), 66–69.",
      "doi": "10.1145/3194349"
    },
    {
      "text": "Sheena Erete, Yolanda A Rankin, and Jakita O Thomas. 2021. I can’t breathe: Reflections from black women in CSCW and HCI. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–23.",
      "doi": "10.1145/3432933"
    },
    {
      "text": "Arturo Escobar. 2015. Transiciones: a space for research and design for transitions to the pluriverse. Design Philosophy Papers 13, 1 (2015), 13–23.",
      "doi": ""
    },
    {
      "text": "Kileni Fernando, Tertu Fernandu, Simpson Kapembe, Kamati Isay, and Japeni Hoffeni. 2018. A Contemporary Expression of the Namibian San Communities’ Past and Present Sufferings Staged as an Interactive Digital Life Performance. In Digitisation of Culture: Namibian and International Perspectives. Springer, Singapore, 205–221.",
      "doi": ""
    },
    {
      "text": "International Work Group for Indigenous Affairs. 2019. Indigenous World 2019: Namibia. https://www.iwgia.org/en/namibia/3506-iw2019-namibia Last accessed 04 June, 2021.",
      "doi": ""
    },
    {
      "text": "William Gaver. 2012. What Should We Expect from Research through Design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 937–946. https://doi.org/10.1145/2207676.2208538",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Naska Goagoses, Heike Winschiers-Theophilus, and Tariq Zaman. 2019. Community protocols for researchers: using sketches to communicate interaction guidelines. Ai & Society 35, 3 (2019), 675–687.",
      "doi": "10.1007/s00146-019-00914-x"
    },
    {
      "text": "Saul Greenberg, Sheelagh Carpendale, Nicolai Marquardt, and Bill Buxton. 2011. Sketching user experiences: The workbook. Elsevier, Massachusetts, MA, USA.",
      "doi": "10.5555/2208198"
    },
    {
      "text": "Christina N Harrington. 2020. The forgotten margins: what is community-based participatory health design telling us?Interactions 27, 3 (2020), 24–29.",
      "doi": "10.1145/3386381"
    },
    {
      "text": "Joseph Henrich, Steven J Heine, and Ara Norenzayan. 2010. The weirdest people in the world?Behavioral and brain sciences 33, 2-3 (2010), 61–83.",
      "doi": ""
    },
    {
      "text": "South African San Institute. 2017. SAN CODE OF RESEARCH ETHICS. TRUST. http://trust-project.eu/wp-content/uploads/2017/03/San-Code-of-RESEARCH-Ethics-Booklet-final.pdfLast accessed 17-3-2022.",
      "doi": ""
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial Computing: A Lens on Design and Development. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1311–1320. https://doi.org/10.1145/1753326.1753522",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Hessam Jahani-Fariman. 2017. Developing a User-Defined Interface for In-Vehicle Mid-Air Gestural Interactions. In Proceedings of the 22nd International Conference on Intelligent User Interfaces Companion(Limassol, Cyprus) (IUI ’17 Companion). Association for Computing Machinery, New York, NY, USA, 165–168. https://doi.org/10.1145/3030024.3038277",
      "doi": "10.1145/3030024.3038277"
    },
    {
      "text": "Jason Jerald. 2015. The VR Book: Human-Centered Design for Virtual Reality. Morgan and Claypool Publishers.",
      "doi": "10.1145/2792790"
    },
    {
      "text": "David M Kaplan. 2009. Readings in the Philosophy of Technology. Rowman & Littlefield Publishers, 4501 Forbes Boulevard, Maryland.",
      "doi": ""
    },
    {
      "text": "Gereon Koch Kapuire, Heike Winschiers-Theophilus, and Edwin Blake. 2015. An insider perspective on community gains: A subjective account of a Namibian rural communities perception of a long-term participatory design project. International Journal of Human-Computer Studies 74 (2015), 124–143.",
      "doi": "10.1016/j.ijhcs.2014.10.004"
    },
    {
      "text": "Maria Kauhondamwa, Heike Winschiers-Theophilus, Simson Kapembe, Hiskia Costa, Jan Guxab, Isay Kamati, and Helena Afrikaner. 2018. Co-Creating Personal Augmented Reality Accessories to Enhance Social Well-Being of Urban San Youth. In Proceedings of the Second African Conference for Human Computer Interaction: Thriving Communities (Windhoek, Namibia) (AfriCHI ’18). Association for Computing Machinery, New York, NY, USA, Article 10, 10 pages. https://doi.org/10.1145/3283458.3283480",
      "doi": "10.1145/3283458.3283480"
    },
    {
      "text": "Peter Kaulbach, Helena Afrikaner, Brit Stichel, and Heike Winschiers-Theophilus. 2021. Crafting Communication Protocols with a San Community in Namibia. In 3rd African Human-Computer Interaction Conference: Inclusiveness and Empowerment(Maputo, Mozambique) (AfriCHI 2021). Association for Computing Machinery, New York, NY, USA, 170–173. https://doi.org/10.1145/3448696.3448747",
      "doi": "10.1145/3448696.3448747"
    },
    {
      "text": "Mathias Kölsch, Andrew C Beall, and Matthew Turk. 2003. The postural comfort zone for reaching gestures. In Proceedings of the human factors and ergonomics society annual meeting, Vol. 47(4). SAGE Publications Sage CA: Los Angeles, CA, SAGE Publications, Los Angeles, LA, USA, 787–791.",
      "doi": ""
    },
    {
      "text": "Anne Köpsel and Nikola Bubalo. 2015. Benefiting from legacy bias. interactions 22, 5 (2015), 44–47.",
      "doi": ""
    },
    {
      "text": "Philip Kortum. 2008. HCI beyond the GUI: Design for haptic, speech, olfactory, and other nontraditional interfaces. Elsevier, Massachusetts, MA, USA.",
      "doi": ""
    },
    {
      "text": "Shaimaa Lazem, Danilo Giglitto, Makuochi Samuel Nkwo, Hafeni Mthoko, Jessica Upani, and Anicia Peters. 2021. Challenges and paradoxes in decolonising HCI: A critical discussion. Computer Supported Cooperative Work (CSCW)(2021), 1–38.",
      "doi": ""
    },
    {
      "text": "Jaime Lien, Nicholas Gillian, M Emre Karagozler, Patrick Amihood, Carsten Schwesig, Erik Olson, Hakim Raja, and Ivan Poupyrev. 2016. Soli: Ubiquitous gesture sensing with millimeter wave radar. ACM Transactions on Graphics (TOG) 35, 4 (2016), 1–19.",
      "doi": "10.1145/2897824.2925953"
    },
    {
      "text": "Samantha Merritt and Shaowen Bardzell. 2011. Postcolonial Language and Culture Theory for HCI4D. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI EA ’11). Association for Computing Machinery, New York, NY, USA, 1675–1680. https://doi.org/10.1145/1979742.1979827",
      "doi": "10.1145/1979742.1979827"
    },
    {
      "text": "Microsoft. 2019. HoloLens 2. https://www.microsoft.com/en-us/hololens Accessed 05 June, 2021.",
      "doi": ""
    },
    {
      "text": "Queeneth Mkabela. 2005. Using the Afrocentric method in researching indigenous African culture. The qualitative report 10, 1 (2005), 178–190.",
      "doi": ""
    },
    {
      "text": "Queeneth Mkabela. 2005. Using the Afrocentric method in researching indigenous African culture. The qualitative report 10, 1 (2005), 178–190.",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Andreea Danielescu, Steven Drucker, Danyel Fisher, Bongshin Lee, MC Schraefel, and Jacob O Wobbrock. 2014. Reducing legacy bias in gesture elicitation studies. interactions 21, 3 (2014), 40–45.",
      "doi": "10.1145/2591689"
    },
    {
      "text": "Meredith Ringel Morris, Jacob O. Wobbrock, and Andrew D. Wilson. 2010. Understanding Users’ Preferences for Surface Gestures. In Proceedings of Graphics Interface 2010 (Ottawa, Ontario, Canada) (GI ’10). Canadian Information Processing Society, CAN, 261–268.",
      "doi": "10.5555/1839214.1839260"
    },
    {
      "text": "Sarah Muser. 2015. Gestures in Human-Computer-Interaction. Ludwig-Maximilians-University of Munich, Munich.",
      "doi": ""
    },
    {
      "text": "Myron Krueger. 1985. Videoplace (1985). https://www.youtube.com/watch?v=d4DUIeXSEpk&t=163s Accessed 05 June, 2021.",
      "doi": ""
    },
    {
      "text": "Casey Newton. 2021. MARK IN THE METAVERSE: Facebook’s CEO on why the social network is becoming ‘a metaverse company. The Verge. https://www.theverge.com/22588022/mark-zuckerberg-facebook-ceo-metaverse-interviewAccessed: 2021-12-17.",
      "doi": ""
    },
    {
      "text": "Tao Ni, Doug A Bowman, Chris North, and Ryan P McMahan. 2011. Design and evaluation of freehand menu selection interfaces using tilt and pinch gestures. International Journal of Human-Computer Studies 69, 9 (2011), 551–562.",
      "doi": "10.1016/j.ijhcs.2011.05.001"
    },
    {
      "text": "Don Norman. 2013. The design of everyday things: Revised and expanded edition. Basic books, 250 West 57th Street, 15th Floor, New York.",
      "doi": ""
    },
    {
      "text": "Donald A Norman. 2010. Natural user interfaces are not natural. interactions 17, 3 (2010), 6–10.",
      "doi": ""
    },
    {
      "text": "Chris North, Tim Dwyer, Bongshin Lee, Danyel Fisher, Petra Isenberg, George Robertson, and Kori Inkpen. 2009. Understanding Multi-touch Manipulation for Surface Computing. In Human-Computer Interaction – INTERACT 2009, Tom Gross, Jan Gulliksen, Paula Kotzé, Lars Oestreicher, Philippe Palanque, Raquel Oliveira Prates, and Marco Winckler (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 236–249.",
      "doi": "10.1007/978-3-642-03658-3_31"
    },
    {
      "text": "Oculus. 2020. Oculus: All-in-One, One-for-All. https://www.oculus.com/quest-2/ Last accessed 04 June, 2021.",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela D.R. Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376392",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Francisco R Ortega, Alain Galvan, Katherine Tarre, Armando Barreto, Naphtali Rishe, Jonathan Bernal, Ruben Balcazar, and Jason-Lee Thomas. 2017. Gesture elicitation for 3D travel via multi-touch and mid-Air systems for procedurally generated pseudo-universe. In 2017 IEEE symposium on 3D User Interfaces (3DUI). IEEE, 144–153.",
      "doi": ""
    },
    {
      "text": "Anicia N. Peters, Heike Winschiers-Theophilus, Kagonya Awori, Nicola J. Bidwell, Edwin Blake, Arun Kumar, and Shilumbe Chivuno-Kuria. 2014. Collaborating with Communities in Africa: A Hitchhikers Guide. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI EA ’14). Association for Computing Machinery, New York, NY, USA, 1969–1974. https://doi.org/10.1145/2559206.2581313",
      "doi": ""
    },
    {
      "text": "Kasper Rodil, Martin Kamp Larsen, Mikkel Laursen, Tobias Frost Andersen, Weronika Korbutt, and Heike Winschiers-Theophilus. 2020. A Demonstration of an Interactive Virtual Reality Prototype for Exploring the Cultural Heritage of Southern African Rock Art. In 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services (Oldenburg, Germany) (MobileHCI ’20). Association for Computing Machinery, New York, NY, USA, Article 26, 5 pages. https://doi.org/10.1145/3406324.3410536",
      "doi": "10.1145/3406324.3410536"
    },
    {
      "text": "Kasper Rodil, Donovan Maasz, and Heike Winschiers-Theophilus. 2020. Moving Virtual Reality out of Its Comfort Zone and Into the African Kalahari Desert Field: Experiences From Technological Co-Exploration With an Indigenous San Community in Namibia. In 26th ACM Symposium on Virtual Reality Software and Technology (Virtual Event, Canada) (VRST ’20). Association for Computing Machinery, New York, NY, USA, Article 5, 10 pages. https://doi.org/10.1145/3385956.3418955",
      "doi": "10.1145/3385956.3418955"
    },
    {
      "text": "Kasper Rodil, Heike Winschiers-Theophilus, Kasper L. Jensen, and Matthias Rehm. 2012. Homestead Creator: A Tool for Indigenous Designers. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design(Copenhagen, Denmark) (NordiCHI ’12). Association for Computing Machinery, New York, NY, USA, 627–630. https://doi.org/10.1145/2399016.2399111",
      "doi": "10.1145/2399016.2399111"
    },
    {
      "text": "Yvonne Rogers and Gary Marsden. 2013. Does he take sugar? Moving beyond the rhetoric of compassion. interactions 20, 4 (2013), 48–57.",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers, Helen Sharp, and Jenny Preece. 2011. Interaction design: beyond human-computer interaction. John Wiley & Sons, West Sussex,United Kingdom.",
      "doi": "10.5555/2031622"
    },
    {
      "text": "Luciana A. S. Romani, Daniel Y. T. Chino, Letricia P. S. Avalhais, Willian D. Oliveira, Renata R. V. Gonçalves, Caetano Traina, and Agma J. M. Traina. 2013. Involving Users in the Gestural Language Definition Process for the NInA Framework. In Proceedings of the 12th Brazilian Symposium on Human Factors in Computing Systems (Manaus, Brazil) (IHC ’13). Brazilian Computer Society, Porto Alegre, BRA, 280–283.",
      "doi": ""
    },
    {
      "text": "Holonautic Sidequest. 2020. Hand Physics Lab. https://sidequestvr.com/app/750/hand-physics-lab Last accessed 12 January, 2021.",
      "doi": ""
    },
    {
      "text": "Narendra Singh. 2019. How to design Virtual Reality menus that do not suck. Medium. https://uxdesign.cc/how-to-design-virtual-reality-menus-that-do-not-suck-9c06eb1df865Last accessed 17-3-2022.",
      "doi": ""
    },
    {
      "text": "Rachel Charlotte Smith, Heike Winschiers-Theophilus, Daria Loi, Rogério Abreu de Paula, Asnath Paula Kambunga, Marly Muudeni Samuel, and Tariq Zaman. 2021. Decolonizing Design Practices: Towards Pluriversality. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411763.3441334",
      "doi": ""
    },
    {
      "text": "Ivan Stevanovic. 2019. 30 Virtual Reality Statistics for 2020. https://kommandotech.com/statistics/virtual-reality-statistics/",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 2002. Located accountabilities in technology production. Scandinavian journal of information systems 14, 2 (2002), 7.",
      "doi": "10.5555/782686.782694"
    },
    {
      "text": "Sharifa Sultana, François Guimbretière, Phoebe Sengers, and Nicola Dell. 2018. Design Within a Patriarchal Society: Opportunities and Challenges in Designing for Rural Women in Bangladesh. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi-org.zorac.aub.aau.dk/10.1145/3173574.3174110",
      "doi": "10.1145/3173574.3174110"
    },
    {
      "text": "Leyla Tavernaro-Haidarian. 2018. A relational model of public discourse: The African philosophy of Ubuntu. Routledge.",
      "doi": ""
    },
    {
      "text": "Alex S. Taylor. 2011. Out There. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 685–694. https://doi.org/10.1145/1978942.1979042",
      "doi": ""
    },
    {
      "text": "Unity Technologies. 2005. Unity. https://unity.com Last accessed 06 June, 2021.",
      "doi": ""
    },
    {
      "text": "Manos Tsakiris and Patrick Haggard. 2005. The rubber hand illusion revisited: visuotactile integration and self-attribution.Journal of Experimental Psychology: Human Perception and Performance 31, 1(2005), 80.",
      "doi": ""
    },
    {
      "text": "Alessandro Valli. 2008. The design of natural interaction. Multimedia Tools and Applications 38, 3 (2008), 295–305.",
      "doi": "10.1007/s11042-007-0190-z"
    },
    {
      "text": "Panagiotis Vogiatzidakis and Panayiotis Koutsabasis. 2018. Gesture elicitation studies for mid-air interaction: A review. Multimodal Technologies and Interaction 2, 4 (2018), 65.",
      "doi": ""
    },
    {
      "text": "Andrew D. Wilson. 2006. Robust Computer Vision-Based Detection of Pinching for One and Two-Handed Gesture Input. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (Montreux, Switzerland) (UIST ’06). Association for Computing Machinery, New York, NY, USA, 255–258. https://doi.org/10.1145/1166253.1166292",
      "doi": "10.1145/1166253.1166292"
    },
    {
      "text": "Heike Winschiers-Theophilus, Nicola J Bidwell, and Edwin Blake. 2012. Altering participation through interactions and reflections in design. CoDesign 8, 2-3 (2012), 163–182.",
      "doi": ""
    },
    {
      "text": "Heike Winschiers-Theophilus, Tariq Zaman, and Colin Stanley. 2019. A classification of cultural engagements in community technology design: introducing a transcultural approach. Ai & Society 34, 3 (2019), 419–435.",
      "doi": "10.1007/s00146-017-0739-y"
    },
    {
      "text": "Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. 2009. User-Defined Gestures for Surface Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 1083–1092. https://doi.org/10.1145/1518701.1518866",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Marisol Wong-Villacres, Arkadeep Kumar, Aditya Vishwanath, Naveena Karusala, Betsy DiSalvo, and Neha Kumar. 2018. Designing for Intersections. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 45–58. https://doi.org/10.1145/3196709.3196794",
      "doi": "10.1145/3196709.3196794"
    },
    {
      "text": "Adam Grant Worrallo. 2020. A multiple optical tracking based approach for enhancing hand-based interaction in virtual reality simulations.",
      "doi": ""
    },
    {
      "text": "Huiyue Wu, Weizhou Luo, Neng Pan, Shenghuan Nan, Yanyi Deng, Shengqian Fu, and Liuqingqing Yang. 2019. Understanding freehand gestures: a study of freehand gestural interaction for immersive VR shopping applications. Human-centric Computing and Information Sciences 9, 1 (2019), 1–26.",
      "doi": "10.1186/s13673-019-0204-7"
    },
    {
      "text": "Yukang Yan, Chun Yu, Xiaojuan Ma, Xin Yi, Ke Sun, and Yuanchun Shi. 2018. VirtualGrasp: Leveraging Experience of Interacting with Physical Objects to Facilitate Digital Object Retrieval. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173652",
      "doi": ""
    },
    {
      "text": "Run Yu and Doug A Bowman. 2018. Force push: Exploring expressive gesture-to-force mappings for remote object manipulation in virtual reality. Frontiers in ICT 5(2018), 25.",
      "doi": ""
    },
    {
      "text": "John Zimmerman and Jodi Forlizzi. 2014. Research Through Design in HCI. In Ways of Knowing in HCI, Judith S. Olson and Wendy A. Kellogg (Eds.). Springer New York, New York, NY, 167–189. https://doi.org/10.1007/978-1-4939-0378-8_8",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Erik Stolterman, and Jodi Forlizzi. 2010. An Analysis and Critique of Research through Design: Towards a Formalization of a Research Approach. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (Aarhus, Denmark) (DIS ’10). Association for Computing Machinery, New York, NY, USA, 310–319. https://doi.org/10.1145/1858171.1858228",
      "doi": "10.1145/1858171.1858228"
    }
  ]
}