{
  "doi": "10.1145/3491102.3517616",
  "title": "Because I’m Restricted, 2 – 4 PM Unable to See Messages: Exploring Users’ Perceptions and Likely Practices around Exposing Attention Management Use on IM Online Status",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "Attention-management tools can restrict online communication, but may cause collateral damage to their users’ fulfillment of communication expectations. This paper explores the idea of integrating attention management into instant messaging (IM), by 1) disclosing restriction status via an online status indicator (OSI) to manage contacts’ expectations, and 2) imposing communication limits to reduce communication distraction. We used a speed-dating design method to allow 43 participants to rapidly compare 48 types of OSI restriction in various conversational contexts. We identified two “tug-of-wars” that take place when attention management is integrated into IM apps: one between fulfilling one’s contacts’ expectations and protecting one’s own attention, and the other, between protecting one’s privacy and asserting the justifiability of using communication restrictions. We also highlighted the participants’ desire to be diplomatic for sustaining their positive images and maintaining relational connectedness. Finally, we provide design recommendations for integrating attention management into IM apps.",
  "authors": [
    {
      "name": "Yu-Ling Chou",
      "institution": "Department of Chinese Literature, National Tsing Hua University, Taiwan and Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/do/10.1145/contrib-99659903909/rel-imgonly/002.png",
      "acmid": "99659903909",
      "orcid": "0000-0002-6023-1631"
    },
    {
      "name": "Yu-Ling Chien",
      "institution": "Degree Program of E-Learning, National Chiao Tung University, Taiwan and Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659468974",
      "orcid": "missing"
    },
    {
      "name": "Yu-Hsin Lin",
      "institution": "National Taiwan University, Taiwan and Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/do/10.1145/contrib-99659680927/rel-imgonly/ethanlin__3_.jpg",
      "acmid": "99659680927",
      "orcid": "0000-0003-4384-7191"
    },
    {
      "name": "Kung-Pai Lin",
      "institution": "Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan and Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659903565",
      "orcid": "missing"
    },
    {
      "name": "Faye Shih",
      "institution": "Bryn Mawr College, United States and Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659887065",
      "orcid": "0000-0003-1058-9683"
    },
    {
      "name": "Yung-Ju Chang",
      "institution": "Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan and Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548019794",
      "orcid": "0000-0001-6956-3459"
    }
  ],
  "references": [
    {
      "text": "2021. iOS 15 brings powerful new features to stay connected, focus, explore, and more. https://www.apple.com/newsroom/2021/06/ios-15-brings-powerful-new-features-to-stay-connected-focus-explore-and-more/",
      "doi": ""
    },
    {
      "text": "Elena Agapie, Daniel Avrahami, and Jennifer Marlow. 2016. Staying the Course: System-Driven Lapse Management for Supporting Behavior Change. Association for Computing Machinery, New York, NY, USA, 1072–1083. https://doi.org/10.1145/2858036.2858142",
      "doi": ""
    },
    {
      "text": "Ahlam Alghamdi, Aryn C. Karpinski, Andrew Lepp, and Jacob Barkley. 2020. Online and face-to-face classroom multitasking and academic performance: Moderated mediation with self-efficacy for self-regulated learning and gender. Computers in Human Behavior 102 (2020), 214–222. https://doi.org/10.1016/j.chb.2019.08.018",
      "doi": "10.1016/j.chb.2019.08.018"
    },
    {
      "text": "Amazon. 2021. Amazon Lex Conversational AI for Chatbots. https://aws.amazon.com/tw/lex/",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300233",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Apple. 2021. Set Do Not Disturb on iPhone - Apple Support. https://support.apple.com/guide/iphone/set-do-not-disturb-iph5c3f5b77b/ios",
      "doi": ""
    },
    {
      "text": "Elizabeth Bales, Kevin A. Li, and William Griwsold. 2011. CoupleVIBE: Mobile Implicit Communication to Improve Awareness for (Long-Distance) Couples. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (Hangzhou, China) (CSCW ’11). Association for Computing Machinery, New York, NY, USA, 65–74. https://doi.org/10.1145/1958824.1958835",
      "doi": "10.1145/1958824.1958835"
    },
    {
      "text": "Louise Barkhuus, Barry Brown, Marek Bell, Scott Sherwood, Malcolm Hall, and Matthew Chalmers. 2008. From awareness to repartee: sharing location within social groups. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’08). Association for Computing Machinery, Florence, Italy, 497–506. https://doi.org/10.1145/1357054.1357134",
      "doi": "10.1145/1357054.1357134"
    },
    {
      "text": "James ”Bo” Begole, Nicholas E. Matsakis, and John C. Tang. 2004. Lilsys: Sensing Unavailability. In Proceedings of the 2004 ACM conference on Computer supported cooperative work(CSCW ’04). Association for Computing Machinery, Chicago, Illinois, USA, 511–514. https://doi.org/10.1145/1031607.1031691",
      "doi": "10.1145/1031607.1031691"
    },
    {
      "text": "James ”Bo” Begole, John C. Tang, and Rosco Hill. 2003. Rhythm Modeling, Visualizations and Applications. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (Vancouver, Canada) (UIST ’03). Association for Computing Machinery, New York, NY, USA, 11–20. https://doi.org/10.1145/964696.964698",
      "doi": "10.1145/964696.964698"
    },
    {
      "text": "James ”Bo” Begole, John C. Tang, Randall B. Smith, and Nicole Yankelovich. 2002. Work rhythms: analyzing visualizations of awareness histories of distributed groups. In Proceedings of the 2002 ACM conference on Computer supported cooperative work(CSCW ’02). Association for Computing Machinery, New York, NY, USA, 334–343. https://doi.org/10.1145/587078.587125",
      "doi": "10.1145/587078.587125"
    },
    {
      "text": "Jeremy Birnholtz, Lindsay Reynolds, Madeline E Smith, and Jeff Hancock. 2013. “Everyone Has to Do It:” A joint action approach to managing social inattention. Computers in Human Behavior 29, 6 (2013), 2230–2238.",
      "doi": "10.1016/j.chb.2013.05.004"
    },
    {
      "text": "Judith Borghouts, Duncan P. Brumby, and Anna L. Cox. 2020. TimeToFocus: Feedback on Interruption Durations Discourages Distractions and Shortens Interruptions. ACM Trans. Comput.-Hum. Interact. 27, 5, Article 32 (Aug. 2020), 31 pages. https://doi.org/10.1145/3396044",
      "doi": "10.1145/3396044"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3 (01 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "J. Broadbent and W.L. Poon. 2015. Self-regulated learning strategies & academic achievement in online higher education learning environments: A systematic review. The Internet and Higher Education 27 (2015), 1–13. https://doi.org/10.1016/j.iheduc.2015.04.007",
      "doi": ""
    },
    {
      "text": "Andreas Buchenscheit, Bastian Könings, Andreas Neubert, Florian Schaub, Matthias Schneider, and Frank Kargl. 2014. Privacy Implications of Presence Sharing in Mobile Messaging Applications. In Proceedings of the 13th International Conference on Mobile and Ubiquitous Multimedia(MUM ’14). ACM, New York, NY, USA, 20–29. https://doi.org/10.1145/2677972.2677980",
      "doi": "10.1145/2677972.2677980"
    },
    {
      "text": "Bram P. Buunk and Wilmar B. Schaufeli. 1999. Reciprocity in Interpersonal Relationships: An Evolutionary Perspective on Its Importance for Health and Well-being. European Review of Social Psychology 10, 1 (1999), 259–291. https://doi.org/10.1080/14792779943000080 arXiv:https://doi.org/10.1080/14792779943000080",
      "doi": ""
    },
    {
      "text": "L. Mark Carrier, Larry D. Rosen, Nancy A. Cheever, and Alex F. Lim. 2015. Causes, effects, and practicalities of everyday multitasking. Developmental Review 35(2015), 64–78. https://doi.org/10.1016/j.dr.2014.12.005 Special Issue: Living in the “Net” Generation: Multitasking, Learning, and Development.",
      "doi": ""
    },
    {
      "text": "Marta E Cecchinato, Anna L Cox, and Jon Bird. 2015. Working 9-5? Professional differences in email and boundary management practices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 3989–3998.",
      "doi": ""
    },
    {
      "text": "Yung-Ju Chang and John C. Tang. 2015. Investigating Mobile Users’ Ringer Mode Usage and Attentiveness and Responsiveness to Communication. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’15). Association for Computing Machinery, New York, NY, USA, 6–15. https://doi.org/10.1145/2785830.2785852",
      "doi": "10.1145/2785830.2785852"
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory. sage.",
      "doi": ""
    },
    {
      "text": "Yi-Shyuan Chiang, Ruei-Che Chang, Yi-Lin Chuang, Shih-Ya Chou, Hao-Ping Lee, I-Ju Lin, Jian-Hua Jiang Chen, and Yung-Ju Chang. 2020. Exploring the design space of user-system communication for smart-home routine assistants. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376501"
    },
    {
      "text": "Yu-Ling Chien, Ting-Wei Wu, and Yung-Ju Chang. 2019. Exploring the Design of Availability Status in Mobile IM Messaging with User Enactments. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei, Taiwan) (MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, Article 61, 6 pages. https://doi.org/10.1145/3338286.3344409",
      "doi": "10.1145/3338286.3344409"
    },
    {
      "text": "Hyunsung Cho, Jinyoung Oh, Juho Kim, and Sung-Ju Lee. 2020. I Share, You Care: Private Status Sharing and Sender-Controlled Notifications in Mobile Instant Messaging. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1 (May 2020), 034:1–034:25. https://doi.org/10.1145/3392839",
      "doi": "10.1145/3406865.3418571"
    },
    {
      "text": "Karen Church and Rodrigo de Oliveira. 2013. What’s up with Whatsapp? Comparing Mobile Instant Messaging Behaviors with Traditional SMS. In Proceedings of the 15th International Conference on Human-Computer Interaction with Mobile Devices and Services (Munich, Germany) (MobileHCI ’13). Association for Computing Machinery, New York, NY, USA, 352–361. https://doi.org/10.1145/2493190.2493225",
      "doi": "10.1145/2493190.2493225"
    },
    {
      "text": "Camille Cobb, Lucy Simko, Tadayoshi Kohno, and Alexis Hiniker. 2020. User Experiences with Online Status Indicators. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376240",
      "doi": "10.1145/3313831.3376240"
    },
    {
      "text": "Sunny Consolvo, Ian E. Smith, Tara Matthews, Anthony LaMarca, Jason Tabert, and Pauline Powledge. 2005. Location disclosure to social relations: why, when, & what people want to share. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’05). Association for Computing Machinery, New York, NY, USA, 81–90. https://doi.org/10.1145/1054972.1054985",
      "doi": "10.1145/1054972.1054985"
    },
    {
      "text": "Di Cui. 2016. Beyond “connected presence”: Multimedia mobile instant messaging in close relationship management. Mobile Media & Communication 4, 1 (2016), 19–36.",
      "doi": ""
    },
    {
      "text": "Laura Dabbish, Gloria Mark, and Víctor M. González. 2011. Why Do i Keep Interrupting Myself? Environment, Habit and Self-Interruption. Association for Computing Machinery, New York, NY, USA, 3127–3130. https://doi.org/10.1145/1978942.1979405",
      "doi": ""
    },
    {
      "text": "Scott Davidoff, Min Kyung Lee, Anind K Dey, and John Zimmerman. 2007. Rapidly exploring application design through speed dating. In International Conference on Ubiquitous Computing. Springer, 429–446.",
      "doi": ""
    },
    {
      "text": "Edward S. De Guzman, Margaret Yau, Anthony Gagliano, Austin Park, and Anind K. Dey. 2004. Exploring the Design and Use of Peripheral Displays of Awareness Information. In CHI ’04 Extended Abstracts on Human Factors in Computing Systems (Vienna, Austria) (CHI EA ’04). Association for Computing Machinery, New York, NY, USA, 1247–1250. https://doi.org/10.1145/985921.986035",
      "doi": ""
    },
    {
      "text": "Tilman Dingler and Martin Pielot. 2015. I’ll be there for you: Quantifying Attentiveness towards Mobile Messaging. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’15). Association for Computing Machinery, Copenhagen, Denmark, 1–5. https://doi.org/10.1145/2785830.2785840",
      "doi": "10.1145/2785830.2785840"
    },
    {
      "text": "Discord. 2021. Changing Online Status - Discord support. https://support.discord.com/hc/en-us/articles/227779547-Changing-Online-Status",
      "doi": ""
    },
    {
      "text": "Alexander J. Dontre. 2021. The influence of technology on academic distraction: A review. Human Behavior and Emerging Technologies 3, 3 (2021), 379–390. https://doi.org/10.1002/hbe2.229 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/hbe2.229",
      "doi": ""
    },
    {
      "text": "Facebook. 2021. What is Active Status and how does it work? - Messenger Help. https://www.facebook.com/help/messenger-app/321774648351848/?helpref=related",
      "doi": ""
    },
    {
      "text": "Freedom.to. 2021. Freedom - Block Websites, Apps, and the Internet. https://freedom.to/",
      "doi": ""
    },
    {
      "text": "Google. 2021. Dialogflow Google Cloud. https://cloud.google.com/dialogflow",
      "doi": ""
    },
    {
      "text": "Google. 2021. Limit interruptions with Do Not Disturb on Android - Android Help. https://support.google.com/android/answer/9069335?hl=en",
      "doi": ""
    },
    {
      "text": "Nitesh Goyal and Susan R Fussell. 2017. Intelligent interruption management using electro dermal activity based physiological sensor for collaborative sensemaking. Proceedings of the ACM on interactive, mobile, wearable and ubiquitous technologies 1, 3 (2017), 1–21.",
      "doi": "10.1145/3130917"
    },
    {
      "text": "Carla F. Griggio, Midas Nouwens, Joanna McGrenere, and Wendy E. Mackay. 2019. Augmenting Couples’ Communication with ",
      "doi": ""
    },
    {
      "text": "Jeffrey A. Hall and Nancy K. Baym. 2012. Calling and texting (too much): Mobile maintenance expectations, (over)dependence, entrapment, and friendship satisfaction. New Media & Society 14, 2 (2012), 316–331. https://doi.org/10.1177/1461444811415047 arXiv:https://doi.org/10.1177/1461444811415047",
      "doi": ""
    },
    {
      "text": "Jeff Hancock, Jeremy Birnholtz, Natalya Bazarova, Jamie Guillory, Josh Perlin, and Barrett Amos. 2009. Butler lies: awareness, deception and design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 517–526.",
      "doi": "10.1145/1518701.1518782"
    },
    {
      "text": "Juan David Hincapié-Ramos, Stephen Voida, and Gloria Mark. 2011. A design space analysis of availability-sharing systems. In Proceedings of the 24th annual ACM symposium on User interface software and technology(UIST ’11). Association for Computing Machinery, Santa Barbara, California, USA, 85–96. https://doi.org/10.1145/2047196.2047207",
      "doi": "10.1145/2047196.2047207"
    },
    {
      "text": "Wilhelm Hofmann, Roy F Baumeister, Georg Förster, and Kathleen D Vohs. 2012. Everyday temptations: an experience sampling study of desire, conflict, and self-control.Journal of personality and social psychology 102, 6(2012), 1318. https://doi.org/10.1037/a0026545",
      "doi": ""
    },
    {
      "text": "Eric Horvitz, Paul Koch, Carl Kadie, and Andy Jacobs. 2002. Coordinate: Probabilistic Forecasting of Presence and Availability. In Proceedings of the Eighteenth Conference on Uncertainty and Artificial Intelligence, Edmonton, Alberta.(proceedings of the eighteenth conference on uncertainty and artificial intelligence, edmonton, alberta. ed.). Morgan Kaufmann, 224–233. https://www.microsoft.com/en-us/research/publication/coordinate-probabilistic-forecasting-presence-availability/",
      "doi": ""
    },
    {
      "text": "Roberto Hoyle, O. H. Oberlin, Srijita Das, Apu Kapadia, Adam J. Lee, and Kami Vaniea. 2017. Was my message read?: Privacy and Signaling on Facebook Messenger. (2017). https://vaniea.com/papers/chi2017.pdf",
      "doi": ""
    },
    {
      "text": "Yifeng Hu, Jacqueline Fowler Wood, Vivian Smith, and Nalova Westbrook. 2017. Friendships through Im: Examining the Relationship between Instant Messaging and Intimacy. Journal of Computer-Mediated Communication 10, 1 (07 2017). https://doi.org/10.1111/j.1083-6101.2004.tb00231.x JCMC10111.",
      "doi": ""
    },
    {
      "text": "IBM. 2021. Watson Assistant: Intelligent virtual agent. https://www.ibm.com/cloud/watson-assistant",
      "doi": ""
    },
    {
      "text": "AppFinca Inc.2021. Green Focus. https://flora.appfinca.com/en/",
      "doi": ""
    },
    {
      "text": "Jing Jin and Laura A. Dabbish. 2009. Self-Interruption on the Computer: A Typology of Discretionary Task Interleaving. Association for Computing Machinery, New York, NY, USA, 1799–1808. https://doi.org/10.1145/1518701.1518979",
      "doi": ""
    },
    {
      "text": "Yoram M Kalman, Gilad Ravid, and Daphne R Raban Sheizaf Rafaeli. 2007. Are you still waiting for an answer? The Chronemics of Asynchronous Written CMC. In Chais Conference on Instructional Technologies Research, Raanana, Israel.",
      "doi": ""
    },
    {
      "text": "Ioanna Katidioti, Jelmer P. Borst, Marieke K. van Vugt, and Niels A. Taatgen. 2016. Interrupt me: External interruptions are less disruptive than self-interruptions. Computers in Human Behavior 63 (2016), 906–915. https://doi.org/10.1016/j.chb.2016.06.037",
      "doi": "10.1016/j.chb.2016.06.037"
    },
    {
      "text": "Sara Kiesler, Jane Siegel, and Timothy W. McGuire. 1984. Social psychological aspects of computer-mediated communication.American Psychologist 39, 10 (1984), 1123–1134. https://doi.org/10.1037/0003-066X.39.10.1123",
      "doi": ""
    },
    {
      "text": "Inyeop Kim, Hwarang Goh, Nematjon Narziev, Youngtae Noh, and Uichin Lee. 2020. Understanding User Contexts and Coping Strategies for Context-Aware Phone Distraction Management System Design. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 4, Article 134 (Dec. 2020), 33 pages. https://doi.org/10.1145/3432213",
      "doi": "10.1145/3432213"
    },
    {
      "text": "Jaejeung Kim, Chiwoo Cho, and Uichin Lee. 2017. Technology Supported Behavior Restriction for Mitigating Self-Interruptions in Multi-Device Environments. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3, Article 64 (Sept. 2017), 21 pages. https://doi.org/10.1145/3130932",
      "doi": "10.1145/3130932"
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Eun Kyoung Choe, Bongshin Lee, KwonHyun Kim, and Jinwook Seo. 2016. TimeAware: Leveraging Framing Effects to Enhance Personal Productivity. Association for Computing Machinery, New York, NY, USA, 272–283. https://doi.org/10.1145/2858036.2858428",
      "doi": ""
    },
    {
      "text": "Lorenz Cuno Klopfenstein, Saverio Delpriori, Silvia Malatini, and Alessandro Bogliolo. 2017. The rise of bots: A survey of conversational interfaces, patterns, and paradigms. In Proceedings of the 2017 conference on designing interactive systems. 555–565.",
      "doi": "10.1145/3064663.3064672"
    },
    {
      "text": "Johannes Knittel, Alireza Sahami Shirazi, Niels Henze, and Albrecht Schmidt. 2013. Utilizing contextual information for mobile communication. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. 1371–1376.",
      "doi": ""
    },
    {
      "text": "Minsam Ko, Seungwoo Choi, Koji Yatani, and Uichin Lee. 2016. Lock n’ LoL: Group-Based Limiting Assistance App to Mitigate Smartphone Distractions in Group Activities. Association for Computing Machinery, New York, NY, USA, 998–1010. https://doi.org/10.1145/2858036.2858568",
      "doi": ""
    },
    {
      "text": "Geza Kovacs, Drew Mylander Gregory, Zilin Ma, Zhengxuan Wu, Golrokh Emami, Jacob Ray, and Michael S. Bernstein. 2019. Conservation of Procrastination: Do Productivity Interventions Save Time Or Just Redistribute It?Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300560",
      "doi": "10.1145/3290605.3300560"
    },
    {
      "text": "Geza Kovacs, Zhengxuan Wu, and Michael S. Bernstein. 2018. Rotating Online Behavior Change Interventions Increases Effectiveness But Also Increases Attrition. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 95 (Nov. 2018), 25 pages. https://doi.org/10.1145/3274364",
      "doi": "10.1145/3274364"
    },
    {
      "text": "Geza Kovacs, Zhengxuan Wu, and Michael S. Bernstein. 2021. Not Now, Ask Later: Users Weaken Their Behavior Change Regimen Over Time, But Expect To Re-Strengthen It Imminently. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 229, 14 pages. https://doi.org/10.1145/3411764.3445695",
      "doi": "10.1145/3411764.3445695"
    },
    {
      "text": "Hao-Ping Lee, Kuan-Yin Chen, Chih-Heng Lin, Chia-Yu Chen, Yu-Lin Chung, Yung-Ju Chang, and Chien-Ru Sun. 2019. Does Who Matter? Studying the Impact of Relationship Characteristics on Receptivity to Mobile IM Messages. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, Glasgow, Scotland Uk, 1–12. https://doi.org/10.1145/3290605.3300756",
      "doi": "10.1145/3290605.3300756"
    },
    {
      "text": "Hao-Ping Lee, Kuan-Yin Chen, Chih-Heng Lin, Chia-Yu Chen, Yu-Lin Chung, Yung-Ju Chang, and Chien-Ru Sun. 2019. Does Who Matter? Studying the Impact of Relationship Characteristics on Receptivity to Mobile IM Messages. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300756",
      "doi": "10.1145/3290605.3300756"
    },
    {
      "text": "Christian Licoppe. 2004. ‘Connected’ Presence: The Emergence of a New Repertoire for Managing Social Relationships in a Changing Communication Technoscape. Environment and Planning D: Society and Space 22, 1 (2004), 135–156. https://doi.org/10.1068/d323t arXiv:https://doi.org/10.1068/d323t",
      "doi": ""
    },
    {
      "text": "Brian Y Lim, Oliver Brdiczka, and Victoria Bellotti. 2010. Show me a good time: using content to provide activity awareness to collaborators with activityspotter. In Proceedings of the 16th ACM international conference on Supporting group work. 263–272.",
      "doi": "10.1145/1880071.1880115"
    },
    {
      "text": "V. Lim and D. Chen. 2012. Cyberloafing at the workplace: gain or drain on work?Behaviour & Information Technology 31 (2012), 343 – 353.",
      "doi": ""
    },
    {
      "text": "Tzu-Chieh Lin, Yu-Shao Su, Emily Helen Yang, Yun Han Chen, Hao-Ping Lee, and Yung-Ju Chang. 2021. “Put It on the Top, I’Ll Read It Later”: Investigating Users’ Desired Display Order for Smartphone Notifications. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445384",
      "doi": ""
    },
    {
      "text": "Telegram FZ LLC. 2021. Q: Who can see me ’online’? - Telegram FAQ. https://telegram.org/faq#q-who-can-see-me-39online-39",
      "doi": ""
    },
    {
      "text": "WhatsApp LLC. 2021. About last seen and online - WhatsApp. https://faq.whatsapp.com/general/chats/about-last-seen-and-online",
      "doi": ""
    },
    {
      "text": "James Lynden and Teis Rasmussen. 2017. Exploring the impact of ’read receipts’ in Mobile Instant Messaging. Tidsskrift for Medier, Erkendelse og Formidling 5, 1 (mar. 2017). https://tidsskrift.dk/mef-journal/article/view/28781",
      "doi": ""
    },
    {
      "text": "Ulrik Lyngs, Kai Lukoff, Petr Slovak, Reuben Binns, Adam Slack, Michael Inzlicht, Max Van Kleek, and Nigel Shadbolt. 2019. Self-Control in Cyberspace: Applying Dual Systems Theory to a Review of Digital Self-Control Tools. Association for Computing Machinery, New York, NY, USA, 1–18. https://doi.org/10.1145/3290605.3300361",
      "doi": "10.1145/3290605.3300361"
    },
    {
      "text": "Ulrik Lyngs, Kai Lukoff, Petr Slovak, William Seymour, Helena Webb, Marina Jirotka, Jun Zhao, Max Van Kleek, and Nigel Shadbolt. 2020. ’I Just Want to Hack Myself to Not Get Distracted’: Evaluating Design Interventions for Self-Control on Facebook. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376672",
      "doi": "10.1145/3313831.3376672"
    },
    {
      "text": "Gloria Mark, Mary Czerwinski, and Shamsi T. Iqbal. 2018. Effects of Individual Differences in Blocking Workplace Distractions. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173666",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Shamsi Iqbal, Mary Czerwinski, and Paul Johns. 2015. Focused, Aroused, but so Distractible: Temporal Perspectives on Multitasking and Communications. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 903–916. https://doi.org/10.1145/2675133.2675221",
      "doi": "10.1145/2675133.2675221"
    },
    {
      "text": "Gloria Mark, Shamsi T. Iqbal, Mary Czerwinski, Paul Johns, Akane Sano, and Yuliya Lutchyn. 2016. Email Duration, Batching and Self-Interruption: Patterns of Email Use on Productivity and Stress. Association for Computing Machinery, New York, NY, USA, 1717–1728. https://doi.org/10.1145/2858036.2858262",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Yiran Wang, and Melissa Niiya. 2014. Stress and Multitasking in Everyday College Life: An Empirical Study of Online Activity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 41–50. https://doi.org/10.1145/2556288.2557361",
      "doi": "10.1145/2556288.2557361"
    },
    {
      "text": "Melissa Mazmanian and Ingrid Erickson. 2014. The product of availability: understanding the economic underpinnings of constant connectivity. In Proceedings of the SIGCHI conference on human factors in computing systems. 763–772.",
      "doi": "10.1145/2556288.2557381"
    },
    {
      "text": "microsoft azure. 2021. Language Understanding (LUIS). https://www.luis.ai/",
      "doi": ""
    },
    {
      "text": "MobileSoft. 2021. AppBlock - Stay Focused. https://www.appblock.app/",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta. 2008. Designing Mobile Awareness Cues. In Proceedings of the 10th International Conference on Human Computer Interaction with Mobile Devices and Services (Amsterdam, The Netherlands) (MobileHCI ’08). Association for Computing Machinery, New York, NY, USA, 43–52. https://doi.org/10.1145/1409240.1409246",
      "doi": "10.1145/1409240.1409246"
    },
    {
      "text": "Antti Oulasvirta, Renaud Petit, Mika Raento, and Sauli Tiitta. 2007. Interpreting and Acting on Mobile Awareness Cues. Hum.-Comput. Interact. 22, 1 (May 2007), 97–135.",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Tye Rattenbury, Lingyi Ma, and Eeva Raita. 2012. Habits make smartphone use more pervasive. Personal and Ubiquitous Computing 16, 1 (01 Jan 2012), 105–114. https://doi.org/10.1007/s00779-011-0412-2",
      "doi": ""
    },
    {
      "text": "Rocco Palumbo, Rosalba Manna, and Mauro Cavallone. 2020. Beware of side effects on quality! Investigating the implications of home working on work-life balance in educational services. The TQM Journal (2020).",
      "doi": ""
    },
    {
      "text": "Sameer Patil and Jennifer Lai. 2005. Who gets to know what when: configuring privacy permissions in an awareness application. In Proceedings of the SIGCHI conference on Human factors in computing systems. 101–110.",
      "doi": "10.1145/1054972.1054987"
    },
    {
      "text": "Donald J. Patterson, Christopher Baker, Xianghua Ding, Samuel J. Kaufman, Kah Liu, and Andrew Zaldivar. 2008. Online everywhere: evolving mobile instant messaging practices. In Proceedings of the 10th international conference on Ubiquitous computing(UbiComp ’08). Association for Computing Machinery, Seoul, Korea, 64–73. https://doi.org/10.1145/1409635.1409645",
      "doi": "10.1145/1409635.1409645"
    },
    {
      "text": "Martin Pielot, Rodrigo de Oliveira, Haewoon Kwak, and Nuria Oliver. 2014. Didn’t you see my message? predicting attentiveness to mobile instant messages. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, Toronto, Ontario, Canada, 3319–3328. https://doi.org/10.1145/2556288.2556973",
      "doi": "10.1145/2556288.2556973"
    },
    {
      "text": "Martin Pielot and Luz Rello. 2017. Productive, Anxious, Lonely: 24 Hours without Push Notifications. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (Vienna, Austria) (MobileHCI ’17). Association for Computing Machinery, New York, NY, USA, Article 11, 11 pages. https://doi.org/10.1145/3098279.3098526",
      "doi": "10.1145/3098279.3098526"
    },
    {
      "text": "Stuart Reeves. 2012. Envisioning ubiquitous computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1573–1582.",
      "doi": "10.1145/2207676.2208278"
    },
    {
      "text": "Lindsay Reynolds, Madeline E Smith, Jeremy P Birnholtz, and Jeff T Hancock. 2013. Butler lies from both sides: Actions and perceptions of unavailability management in texting. In Proceedings of the 2013 conference on Computer supported cooperative work. 769–778.",
      "doi": "10.1145/2441776.2441862"
    },
    {
      "text": "John Robinson, Sarah Burch, Sonia Talwar, Meg O’Shea, and Mike Walsh. 2011. Envisioning sustainability: Recent progress in the use of participatory backcasting approaches for sustainability research. Technological Forecasting and Social Change 78, 5 (2011), 756–768.",
      "doi": ""
    },
    {
      "text": "Alan M Rubin. 2009. Uses-and-gratifications perspective on media effects. In Media effects. Routledge, 181–200.",
      "doi": ""
    },
    {
      "text": "Seekrtech. 2021. Stay focused, be present. https://www.forestapp.cc/",
      "doi": ""
    },
    {
      "text": "Irina Shklovski, Louise Barkhuus, Nis Bornoe, and Joseph’Jofish’ Kaye. 2015. Friendship maintenance in the digital age: Applying a relational lens to online social interaction. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 1477–1487.",
      "doi": "10.1145/2675133.2675294"
    },
    {
      "text": "Anna Spagnolli and Luciano Gamberini. 2007. Interacting via SMS: Practices of social closeness and reciprocation. British Journal of Social Psychology 46, 2 (2007), 343–364. https://doi.org/10.1348/014466606X120482 arXiv:https://bpspsychub.onlinelibrary.wiley.com/doi/pdf/10.1348/014466606X120482",
      "doi": ""
    },
    {
      "text": "Amanda Spink, Minsoo Park, Bernard J. Jansen, and Jan Pedersen. 2006. Multitasking during Web search sessions. Information Processing & Management 42, 1 (2006), 264–275. https://doi.org/10.1016/j.ipm.2004.10.004 Formal Methods for Information Retrieval.",
      "doi": "10.5555/1138797.1710820"
    },
    {
      "text": "Aaron Springer and Steve Whittaker. 2019. Progressive disclosure: empirically motivated approaches to designing effective transparency. In Proceedings of the 24th International Conference on Intelligent User Interfaces(IUI ’19). Association for Computing Machinery, New York, NY, USA, 107–120. https://doi.org/10.1145/3301275.3302322",
      "doi": "10.1145/3301275.3302322"
    },
    {
      "text": "John C. Tang, Henry Chen, Angela Chin, Alex Hehmeyer, John Suciu, Jim Palmer, and Eran Shtiegman. 2013. Current perspectives on awareness information to support real-time communication. In 2013 International Conference on Collaboration Technologies and Systems (CTS). 245–252. https://doi.org/10.1109/CTS.2013.6567237",
      "doi": ""
    },
    {
      "text": "RescueTime Team. 2021. RescueTime. https://www.rescuetime.com/",
      "doi": ""
    },
    {
      "text": "Vincent W.-S. Tseng, Matthew L. Lee, Laurent Denoue, and Daniel Avrahami. 2019. Overcoming Distractions during Transitions from Break to Work Using a Conversational Website-Blocking System. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300697",
      "doi": ""
    },
    {
      "text": "Liam D. Turner, Stuart M. Allen, and Roger M. Whitaker. 2015. Push or Delay? Decomposing Smartphone Notification Response Behaviour. In Human Behavior Understanding(Lecture Notes in Computer Science), Albert Ali Salah, Ben J.A. Kröse, and Diane J. Cook (Eds.). Springer International Publishing, Cham, 69–83. https://doi.org/10.1007/978-3-319-24195-1_6",
      "doi": "10.1007/978-3-319-24195-1_6"
    },
    {
      "text": "Liam D. Turner, Stuart M. Allen, and Roger M. Whitaker. 2017. Reachable but not receptive: Enhancing smartphone interruptibility prediction by modelling the extent of user engagement with notifications. Pervasive and Mobile Computing 40 (Sept. 2017), 480–494. https://doi.org/10.1016/j.pmcj.2017.01.011",
      "doi": "10.1016/j.pmcj.2017.01.011"
    },
    {
      "text": "Jessica Vitak, Julia Crouse, and Robert LaRose. 2011. Personal Internet use at work: Understanding cyberslacking. Computers in Human Behavior 27, 5 (2011), 1751–1759. https://doi.org/10.1016/j.chb.2011.03.002 2009 Fifth International Conference on Intelligent Computing.",
      "doi": ""
    },
    {
      "text": "Joseph B Walther and Lisa C Tidwell. 1995. Nonverbal cues in computer-mediated communication, and the effect of chronemics on relational communication. Journal of Organizational Computing and Electronic Commerce 5, 4(1995), 355–378.",
      "doi": ""
    },
    {
      "text": "Minou Weijs-Perrée, Jasper van de Koevering, Rianne Appel-Meulenbroek, and Theo Arentze. 2019. Analysing user preferences for co-working space characteristics. Building Research & Information 47, 5 (2019), 534–548. https://doi.org/10.1080/09613218.2018.1463750 arXiv:https://doi.org/10.1080/09613218.2018.1463750",
      "doi": ""
    },
    {
      "text": "Ting-Wei Wu, Yu-Ling Chien, Hao-Ping Lee, and Yung-Ju Chang. 2021. IM Receptivity and Presentation-Type Preferences among Users of a Mobile App with Automated Receptivity-Status Adjustment. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 640, 14 pages. https://doi.org/10.1145/3411764.3445209",
      "doi": "10.1145/3411764.3445209"
    },
    {
      "text": "Manuela Züger, Christopher Corley, André N. Meyer, Boyang Li, Thomas Fritz, David Shepherd, Vinay Augustine, Patrick Francis, Nicholas Kraft, and Will Snipes. 2017. Reducing Interruptions at Work: A Large-Scale Field Study of FlowLight. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, Denver, Colorado, USA, 61–72. https://doi.org/10.1145/3025453.3025662",
      "doi": "10.1145/3025453.3025662"
    }
  ]
}