{
  "doi": "10.1145/3491102.3517788",
  "title": "Constrained Life in a Multifarious Environment - A Closer Look at the Lives of Autistic College Students",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "For many students, attending college is a dramatic but necessary change. To gain a better understanding of experiences that are unique to autistic college students, we conducted a mixed-method study with 20 students (10 autistic and 10 neurotypical). We collected physiological, contextual, experience, and environmental data from their natural environment using Fitbit and smartphones. We found that stress patterns, emotional states, and physical states are similar for both groups. Our autistic participants prioritized academic success over everything else, often intentionally confining their movements among academic, resident, and work locations to engage themselves with academic work as much as possible. They had a small number of friends, always preferring quality over quantity and sometimes regarding friends as close as family members. To maintain a better social life, they extensively used social media. They slept more than neurotypical participants per day; however, they experienced lower sleep quality.",
  "authors": [
    {
      "name": "Shameem Ahmed",
      "institution": "Computer Science, Western Washington University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100287210",
      "orcid": "missing"
    },
    {
      "name": "Md Monsur Hossain",
      "institution": "Flexport Inc., United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233375",
      "orcid": "missing"
    },
    {
      "name": "Cody Pragner",
      "institution": "Computer Science, Western Washington University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236916",
      "orcid": "missing"
    },
    {
      "name": "Mitch Kimball",
      "institution": "Expeditors, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236626",
      "orcid": "missing"
    },
    {
      "name": "Ashima Shrivastava",
      "institution": "Pantheon, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236179",
      "orcid": "missing"
    },
    {
      "name": "Joseph Gildner",
      "institution": "VMWare, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240282",
      "orcid": "missing"
    },
    {
      "name": "Sean McCulloch",
      "institution": "Allen Institute for Brain Science, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235116",
      "orcid": "missing"
    },
    {
      "name": "Moushumi Sharmin",
      "institution": "Computer Science, Western Washington University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100283602",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ariane Buescher, Zuleyha Cidav, Martin Knapp, and David Mandell. 2014. Costs of autism spectrum disorders in the United Kingdom and the United States. JAMA Pediatrics 168, 8: 721–728. https://doi.org/10.1001/jamapediatrics.2014.210",
      "doi": ""
    },
    {
      "text": "Scott Jackson, Logan Hart, and Fred Volkmar. 2018. Preface: Special Issue—College Experiences for Students with Autism Spectrum Disorder. Journal of Autism and Developmental Disorders 48, 3: 639–642. https://doi.org/10.1007/s10803-018-3463-7",
      "doi": ""
    },
    {
      "text": "Lynn Newman, Mary Wagner, Anne-Marie Knockey, Camille Marder, Katherine Nagle, Debra Shaver, Xin Wei, Renee Cameto, Elidia Contreras, Kate Ferguson, Sarah Greene, and Meredith Schwarting. 2011. The post-high school outcomes of young adults with disabilities up to 8 years after high school. A report from the National Longitudinal Transition Study- 2 (MLTS2).",
      "doi": ""
    },
    {
      "text": "Anastasia H. Anderson, Mark Carter, and Jennifer Stephenson. 2018. Perspectives of University Students with Autism Spectrum Disorder. Journal of Autism and Developmental Disorders 48, 3: 651–665. https://doi.org/10.1007/s10803-017-3257-3",
      "doi": ""
    },
    {
      "text": "Scott L. J. Jackson, Logan Hart, Jane Brown, and Fred Volkmar. 2018. Brief Report: Self-Reported Academic, Social, and Mental Health Experiences of Post-Secondary Students with Autism Spectrum Disorder. Journal of Autism and Developmental Disorders 48, 3: 643–650. http://doi.org/10.1007/s10803-017-3315-x",
      "doi": ""
    },
    {
      "text": "Moushumi Sharmin, Md Monsur Hossain, Abir Saha, Maitraye Das, Margot Maxwell, and Shameem Ahmed. 2018. From Research to Practice: Informing the Design of Autism Support Smart Technology. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. http://doi.org/10.1145/3173574.3173676",
      "doi": "10.1145/3173574.3173676"
    },
    {
      "text": "CDC USA. 2021. Data & Statistics on Autism Spectrum Disorder. Retrieved from https://www.cdc.gov/ncbddd/autism/data.html",
      "doi": ""
    },
    {
      "text": "Danielle Kosecki. 2018. REM, Light, Deep: How Much of Each Stage of Sleep Are You Getting? https://blog.fitbit.com/sleep-stages-explained/",
      "doi": ""
    },
    {
      "text": "Nicholas Gelbar, Isaac Smith, and Brian Reichow. 2014. Systematic Review of Articles Describing Experience and Supports of Individuals with Autism Enrolled in College and University Programs. Journal of autism and developmental disorders 44, 10: 2593–2601. http://doi.org/10.1007/s10803-014-2135-5",
      "doi": ""
    },
    {
      "text": "Anastasia Anderson, Jennifer Stephenson, and Mark Carter. 2017. A systematic literature review of the experiences and supports of students with autism spectrum disorder in post-secondary education. Research in Autism Spectrum Disorders 39: 33–53. http://doi.org/10.1016/J.RASD.2017.04.002",
      "doi": ""
    },
    {
      "text": "Jennifer Sarrett. 2018. Autism and Accommodations in Higher Education: Insights from the Autism Community. Journal of Autism and Developmental Disorders 48, 3: 679–693. https://doi.org/10.1007/s10803-017-3353-4",
      "doi": ""
    },
    {
      "text": "Rebecca Lucas and Alana James. 2018. An Evaluation of Specialist Mentoring for University Students with Autism Spectrum Disorders and Mental Health Conditions. Journal of Autism and Developmental Disorders 48, 3: 694–707. https://doi.org/10.1007/s10803-017-3303-1",
      "doi": ""
    },
    {
      "text": "Rebecca Elias and Susan W. White. 2018. Autism Goes to College: Understanding the Needs of a Student Population on the Rise. Journal of Autism and Developmental Disorders 48, 3: 732–746. https://doi.org/10.1007/s10803-017-3075-7",
      "doi": ""
    },
    {
      "text": "Amy Accardo, S. Jay Kuder, and John Woodruff. 2018. Accommodations and support services preferred by college students with autism spectrum disorder. Autism. https://doi.org/10.1177/1362361318760490",
      "doi": ""
    },
    {
      "text": "Abdul Kawsar Tushar, Iffat Jahan Antara, Dipto Das, Priyank Chandra, Tanjir Rashid Soron, Md Munirul Haque, Sheikh Iqbal Ahamed, and Syed Ishtiaque Ahmed. 2020. We Need More Power to Stand Up: Designing to Combat Stigmatization of the Caregivers of Children with Autism in Urban Bangladesh. In Proceedings of the International Conference on Information and Communication Technologies and Development: 1-12.",
      "doi": "10.1145/3392561.3394643"
    },
    {
      "text": "Danielle DeNigris, Patricia Brooks, Rita Obeid, Maria Alarcon, Christina Shane-Simpson, and Kristen Gillespie-Lynch. 2018. Bullying and Identity Development: Insights from Autistic and Non-autistic College Students. Journal of Autism and Developmental Disorders 48, 3: 666–678. http://doi.org/10.1007/s10803-017-3383-y",
      "doi": ""
    },
    {
      "text": "Stephanie Pinder-Amaker. 2014. Identifying the Unmet Needs of College Students on the Autism Spectrum. Harvard Review of Psychiatry 22, 2: 125–137. http://doi.org/10.1097/HRP.0000000000000032",
      "doi": ""
    },
    {
      "text": "Devon White, Ashleigh Hillier, Alice Frye, and Emily Makrez. 2016. College Students' Knowledge and Attitudes Towards Students on the Autism Spectrum. Journal of Autism and Developmental Disorders: 1–7. http://doi.org/10.1007/s10803-016-2818-1",
      "doi": ""
    },
    {
      "text": "Ken Gobbo and Solvegi Shmulsky. 2014. Faculty Experience With College Students With Autism Spectrum Disorders: A Qualitative Study of Challenges and Solutions. Focus on Autism and Other Developmental Disabilities 29, 1: 13–22. https://doi.org/10.1177/1088357613504989",
      "doi": ""
    },
    {
      "text": "Hui Zheng and Vivian Genaro Motti. 2018. Assisting Students with Intellectual and Developmental Disabilities in Inclusive Education with Smartwatches. Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems: 1–12. https://doi.org/10.1145/3173574.3173924",
      "doi": ""
    },
    {
      "text": "Will Simm, Maria Ferrario, Adrian Gradinar, Marcia Smith, Stephen Forshaw, Ian Smith, and Jon Whittle. 2016. Anxiety and Autism: Towards Personalized Digital Health. Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems: 1270–1281. https://doi.org/10.1145/2858036.2858259",
      "doi": ""
    },
    {
      "text": "Victor Dibia. 2016. FOQUS: A smartwatch application for individuals with ADHD and mental health challenges. Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS): 311–312. https://doi.org/10.1145/2982142.2982207",
      "doi": "10.1145/2982142.2982207"
    },
    {
      "text": "Hui Zheng and Vivian Motti. 2017. Wearable Life: A Wrist-Worn Application to Assist Students in Special Education. In International Conference on Universal Access in Human-Computer Interaction: 259–276.",
      "doi": ""
    },
    {
      "text": "Hui Zheng and Vivian Motti. 2017. WeLi: A Smartwatch Application to Assist Students with Intellectual and Developmental Disabilities. Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility: 355–356.",
      "doi": "10.1145/3132525.3134770"
    },
    {
      "text": "Moushumi Sharmin, Theodore Weber, Hillol Sarker, Nazir Saleheen, Santosh Kumar, Shameem Ahmed, and Mustafa Al' Alabsi. 2017. Opportunities and Challenges in Designing Participant-Centric Smoking Cessation System. IEEE 41st Annual Computer Software and Applications Conference (COMPSAC). https://doi.org/10.1109/COMPSAC.2017.184",
      "doi": ""
    },
    {
      "text": "Angela Khor, Kylie Gray, Sophie Reid, and Glenn Melvin. 2014. Feasibility and validity of ecological momentary assessment in adolescents with high-functioning autism and Asperger's disorder. Journal of adolescence, 37(1), 37-46.",
      "doi": ""
    },
    {
      "text": "Björn Rasch and Jan Born. 2013. About sleep's role in memory. Physiological Reviews. 93.2: 681-766.",
      "doi": ""
    },
    {
      "text": "Esther Yuet Ying Lau, Mark Wong, Kristy Lau, Florence Hui, and Chia Tseng. 2015. Rapid-eye-movement-sleep (REM) associated enhancement of working memory performance after a daytime nap. PLoS ONE 10, 5: 1–16. https://doi.org/10.1371/journal.pone.0125752",
      "doi": ""
    },
    {
      "text": "Shema Tariq and Jenny Woodman. 2010. Using mixed methods in health research. Journal of the Royal Society of Medicine Short Reports 4, 4: 1–8. https://doi.org/10.1177/2042533313479197",
      "doi": ""
    },
    {
      "text": "Michael Fetters, Leslie Curry, and John Creswell. 2013. Achieving integration in mixed methods designs - Principles and practices. Health Services Research 48, 6 PART2: 2134–2156. https://doi.org/10.1111/1475-6773.12117",
      "doi": ""
    },
    {
      "text": "John Creswell and J. David Creswell. 2018. Research Design: Qualitative, Quantitative, and Mixed Methods Approaches. SAGE Publications, Fifth edition.",
      "doi": ""
    },
    {
      "text": "Haruka Minami, Danielle McCarthy, Douglas Jorenby, and Timothy Baker. 2011. An ecological momentary assessment analysis of relations among coping, affect and smoking during a quit attempt. Addiction 106 (3): 641–650.",
      "doi": ""
    },
    {
      "text": "Hillol Sarker, Moushumi Sharmin, Amin Ahsan Ali, Md Mahbubur Rahman, Rummana Bari, Syed Monowar Hossain, and Santosh Kumar. 2014. Assessing the availability of users to engage in just-in-time intervention in the natural environment. Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing: 909-920.",
      "doi": "10.1145/2632048.2636082"
    },
    {
      "text": "Samuel Odom, Lana Collet-Klingenberg, Sally Rogers, and Deborah Hatton. 2010. Evidence-Based Practices in Interventions for Children and Youth with Autism Spectrum Disorders. Preventing School Failure: Alternative Education for Children and Youth 54, 4: 275–282. https://doi.org/10.1080/10459881003785506",
      "doi": ""
    },
    {
      "text": "Connie Wong, Samuel L. Odom, Kara A. Hume, Ann W. Cox, Angel Fettig, Suzanne Kucharczyk, Matthew E. Brock, Joshua B. Plavnick, Veronica P. Fleury, and Tia R. Schultz. 2015. Evidence-Based Practices for Children, Youth, and Young Adults with Autism Spectrum Disorder: A Comprehensive Review. Journal of Autism and Developmental Disorders 45, 7: 1951–1966. https://doi.org/10.1007/s10803-014-2351-z",
      "doi": ""
    },
    {
      "text": "Francesco Cirillo. 2006. The Pomodoro technique (the Pomodoro). Agile Processes in Software Engineering and 54, 2.",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and inter-rater reliability in qualitative research: Norms and guidelines for CSCW and HCI practice. Proceedings of the ACM on Human-Computer Interaction, 3(CSCW), pp.1-23",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Barney G. Glaser, Anselm L. Strauss, and Elizabeth Strutzel. 1968. The discovery of grounded theory; strategies for qualitative research. Nursing research, 17(4), p.364.",
      "doi": ""
    },
    {
      "text": "Edward F Pace-Schott. 2011. REM sleep and dreaming: 8-20. New York: Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Lorcan Kenny, Caroline Hattersley, Bonnie Molins, Carole Buckley, Carol Povey, and Elizabeth Pellicano. 2016. Which terms should be used to describe autism? Perspectives from the UK autism community. Autism, 20(4), pp.442-462.",
      "doi": ""
    },
    {
      "text": "Ullrich Wagner, Steffen Gais, Hilde Haider, and Jan Born. 2004. Sleep inspires insight. Nature 427, no. 6972: 352-355.",
      "doi": ""
    },
    {
      "text": "Fitbit. 2022. What should I know about sleep stages? https://help.fitbit.com/articles/en_US/Help_article/2163",
      "doi": ""
    },
    {
      "text": "ATLAS.ti. 2022. The Qualitative Data Analysis & Research Software, https://atlasti.com/",
      "doi": ""
    },
    {
      "text": "Marieke WM Kuiper, Elisabeth WM Verhoeven, and Hilde M. Geurts. 2017. Heart rate variability predicts inhibitory control in adults with autism spectrum disorders. Biological Psychology, 128, pp.141-152.",
      "doi": ""
    },
    {
      "text": "Edward F. Pace-Schott and J. Allan Hobson. 2002. The neurobiology of sleep: genetics, cellular physiology and subcortical networks. Nature Reviews Neuroscience 3.8: 591.",
      "doi": ""
    },
    {
      "text": "Jun Lu, David Sherman, Marshall Devor, and Clifford B. Saper. 2006. A putative flip–flop switch for control of REM sleep. Nature, 441.7093: 589.",
      "doi": ""
    },
    {
      "text": "David Trembath, Carmela Germano, Graeme Johanson, and Cheryl Dissanayake. 2012. The experience of anxiety in young adults with autism spectrum disorders. Focus on Autism and Other Developmental Disabilities 27 (4): 213–224.",
      "doi": ""
    },
    {
      "text": "Bethany Morgan, Fatuma Nageye, Gabriele Masi, and Samuele Cortese. 2020. Sleep in adults with Autism Spectrum Disorder: a systematic review and meta-analysis of subjective and objective studies. Sleep Medicine 65: 113–120. https://doi.org/10.1016/j.sleep.2019.07.019",
      "doi": ""
    },
    {
      "text": "Marie K. Deserno, Denny Borsboom, Sander Begeer, Joost A. Agelink van Rentergem, Kawita Mataw, and Hilde M. Geurts. 2019. Sleep determines quality of life in autistic adults: A longitudinal study. Autism Research 12, 5: 794–801. https://doi.org/10.1002/aur.2103",
      "doi": ""
    },
    {
      "text": "Z. Beattie, A. Pantelopoulos, A. Ghoreyshi, Y. Oyang, A. Statan, and C. Heneghan. 2017. Estimation of sleep stages using cardiac and accelerometer data from a wrist-worn device. Sleep 40.",
      "doi": ""
    },
    {
      "text": "Pura Ballester, María José Martínez, Auxiliadora Javaloyes, María-del-Mar Inda, Noemí Fernández, Pilar Gázquez, Víctor Aguilar, Agustín Pérez, Luís Hernández, Amanda L. Richdale, and Ana M. Peiró. 2019. Sleep problems in adults with autism spectrum disorder and intellectual disability. Autism Research 12, 1: 66–79. https://doi.org/10.1002/aur.2000",
      "doi": ""
    },
    {
      "text": "Dougal Julian Hare, Steven Jones, and Kate Evershed. 2006. A comparative study of circadian rhythm functioning and sleep in people with Asperger syndrome. Autism 10, 6: 565–575. https://doi.org/10.1177/1362361306068509",
      "doi": ""
    },
    {
      "text": "Dezhi Fang, Fred Hohman, Peter Polack, Hillol Sarker, Minsuk Kahng, Moushumi Sharmin, Mustafa al'Absi, and Duen Horng Chau. 2017. mHealth visual discovery dashboard. Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers: 237-240. 2017.",
      "doi": "10.1145/3123024.3123170"
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2000. Self-determination theory and the facilitation of intrinsic motivation, social development, and wellbeing. American psychologist 55(1): 68–78.",
      "doi": ""
    },
    {
      "text": "Susan W. White, Grace Lee Simmons, Katherine O. Gotham, Caitlin M. Conner, Isaac C. Smith, Kelly B. Beck, and Carla A. Mazefsky. 2018. Psychosocial treatments targeting anxiety and depression in adolescents and adults on the autism spectrum: Review of the latest research and recommended future directions. Current psychiatry reports 20(10): 1-10",
      "doi": ""
    },
    {
      "text": "Michelle Kiep, Annelies A. Spek, and Lisette Hoeben. 2015. Mindfulness-based therapy in adults with an autism spectrum disorder: Do treatment effects last? Mindfulness, 6(3), 637-644.",
      "doi": ""
    },
    {
      "text": "Moushumi Sharmin, Andrew Raij, David Epstien, Inbal Nahum-Shani, J. Gayle Beck, Sudip Vhaduri, Kenzie Preston, and Santosh Kumar. 2015. Visualization of time-series sensor data to inform the design of just-in-time adaptive stress interventions. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing: 505-516).",
      "doi": "10.1145/2750858.2807537"
    },
    {
      "text": "Federica Laricchia. 2022. Number of active users of Fitbit from 2012 to 2020. https://www.statista.com/statistics/472600/fitbit-active-users/",
      "doi": ""
    },
    {
      "text": "Lisa Damour. 2020. Under pressure: Confronting the epidemic of stress and anxiety in girls. Ballantine Books.",
      "doi": ""
    },
    {
      "text": "Batya Friedman, David G. Hendry, and Alan Borning. 2017. A survey of value sensitive design methods. Foundations and Trends in Human-Computer Interaction 11 (2): 63-125.",
      "doi": ""
    },
    {
      "text": "Annuska Zolyomi, Anne Spencer Ross, Arpita Bhattacharya, Lauren Milne, and Sean Munson. 2017. Value sensitive design for neurodiverse teams in higher education. Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility: 353-354.",
      "doi": "10.1145/3132525.3134787"
    },
    {
      "text": "Annuska Zolyomi, Anne Spencer Ross, Arpita Bhattacharya, Lauren Milne, and Sean Munson. 2018. Values, Identity, and Social Translucence: Neurodiverse Student Teams in Higher Education. Proceedings of the 2018 chi conference on human factors in computing systems, pp. 1-13. 2018.",
      "doi": "10.1145/3173574.3174073"
    },
    {
      "text": "Ru Ying Cai, Amanda L. Richdale, Cheryl Dissanayake, and Mirko Uljarević. 2019. Resting heart rate variability, emotion regulation, psychological wellbeing and autism symptomatology in adults with and without autism. International Journal of Psychophysiology, 137, pp.54-62.",
      "doi": ""
    },
    {
      "text": "Rinku Thapa, Gail A. Alvares, Tooba A. Zaidi, Emma E. Thomas, Ian B. Hickie, Shin H. Park, and Adam J. Guastella. 2019. Reduced heart rate variability in adults with autism spectrum disorder. Autism Research, 12(6), pp.922-930.",
      "doi": ""
    },
    {
      "text": "Karen Hovsepian, Mustafa Al'Absi, Emre Ertin, Thomas Kamarck, Motohiro Nakajima, and Santosh Kumar. 2015. cStress: towards a gold standard for continuous stress assessment in the mobile environment. Proceedings of the ACM international joint conference on pervasive and ubiquitous computing: 493-504.",
      "doi": "10.1145/2750858.2807526"
    },
    {
      "text": "Kurt Plarre, Andrew Raij, Syed Monowar Hossain, Amin Ahsan Ali, Motohiro Nakajima, Mustafa Al'Absi, Emre Ertin, Thomas Kamarck, Santosh Kumar, Marcia Scott, Daniel Siewiorek, Asim Smailagic, Lorentz E. Wittmers. 2011. Continuous inference of psychological stress from sensory measurements collected in the natural environment. Proceedings of the 10th ACM/IEEE international conference on information processing in sensor networks: 97-108.",
      "doi": ""
    },
    {
      "text": "American Heart Association. 2021. Stress and Heart Health. https://www.heart.org/en/healthy-living/healthy-lifestyle/stress-management/stress-and-heart-health#:∼:text=A%20stressful%20situation%20sets%20off,%22fight%20or%20flight%22%20response.",
      "doi": ""
    },
    {
      "text": "Valérie Van Hees, Tinneke Moyson, and Herbert Roeyers. 2015. Higher Education Experiences of Students with Autism Spectrum Disorder: Challenges, Benefits and Support Needs. Journal of Autism and Developmental Disorders 45, 6: 1673–1688.",
      "doi": ""
    },
    {
      "text": "Alison Nuske, Fiona Rillotta, Michelle Bellon, and Amanda Richdale. 2019. Transition to Higher Education for Students With Autism: A Systematic Literature Review. Journal of Diversity in Higher Education 12, 3: 280–295. https://doi.org/10.1037/dhe0000108",
      "doi": ""
    },
    {
      "text": "Jane D. McLeod, Emily Meanwell, and Amelia Hawbaker. 2019. The Experiences of College Students on the Autism Spectrum: A Comparison to Their Neurotypical Peers. Journal of Autism and Developmental Disorders 49, 6: 2320–2336. https://doi.org/10.1007/s10803-019-03910-8",
      "doi": ""
    },
    {
      "text": "Jane D. McLeod, Amelia Hawbaker, and Emily Meanwell. 2020. The health of college students on the autism spectrum as compared to their neurotypical peers. Autism: 2320–2336. https://doi.org/10.1177/1362361320926070",
      "doi": ""
    },
    {
      "text": "Renee R. Dijkhuis, Tim Ziermans, Sophie van Rijn, Wouter Staal, and Hanna Swaab.2019. Emotional Arousal During Social Stress in Young Adults With Autism: Insights From Heart Rate, Heart Rate Variability and Self-Report. Journal of autism and developmental disorders, 49(6), pp.2524-2535.",
      "doi": ""
    },
    {
      "text": "Bernard CK Choi, Anita WP Pak, and Jerome CL Cho. 2007. Daily step goal of 10,000 steps: a literature review. Clinical and Investigative Medicine: E146-E151.",
      "doi": ""
    },
    {
      "text": "Johnny Saldaña. 2015. The coding manual for qualitative researchers. Sage.",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet M. Corbin. 1997. Grounded theory in practice. Sage.",
      "doi": ""
    },
    {
      "text": "Terumi Umematsu, Akane Sano, Sara Taylor, and Rosalind Picard. 2019. Improving Students' Daily Life Stress Forecasting using LSTM Neural Networks. 1-4. https://doi.org/10.1109/BHI.2019.8834624",
      "doi": ""
    },
    {
      "text": "Richard E. Frye, Sarah Vassall, Gurjot Kaur, Christina Lewis, Mohammand Karim, and Daniel Rossignol. 2019. Emerging biomarkers in autism spectrum disorder: a systematic review. Annals of translational medicine: 7(23).",
      "doi": ""
    },
    {
      "text": "Jim Sinclair. 2012. Don't Mourn for Us. Autonomy, the Critical Journal of Interdisciplinary Autism Studies, 1(1).",
      "doi": ""
    },
    {
      "text": "Jessica Navedo, Amelia Espiritu-Santo, and Shameem Ahmed. 2019. Strength-based ICT design supporting individuals with autism. The 21st International ACM SIGACCESS Conference on Computers and Accessibility: 560-562.",
      "doi": "10.1145/3308561.3354637"
    }
  ]
}