{
  "doi": "10.1145/3491102.3517484",
  "title": "Personalization Trade-offs in Designing a Dialogue-based Information System for Support-Seeking of Sexual Violence Survivors",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "The lack of reliable, personalized information often complicates sexual violence survivors’ support-seeking. Recently, there is an emerging approach to conversational information systems for support-seeking of sexual violence survivors, featuring personalization with wide availability and anonymity. However, a single best solution might not exist as sexual violence survivors have different needs and purposes in seeking support channels. To better envision conversational support-seeking systems for sexual violence survivors, we explore personalization trade-offs in designing such information systems. We implement a high-fidelity prototype dialogue-based information system through four design workshop sessions with three professional caregivers and interviewed with four self-identified survivors using our prototype. We then identify two forms of personalization trade-offs for conversational support-seeking systems: (1) specificity and sensitivity in understanding users and (2) relevancy and inclusiveness in providing information. To handle these trade-offs, we propose a reversed approach that starts from designing information and inclusive tailoring that considers unspecified needs, respectively.",
  "authors": [
    {
      "name": "Hyeok Kim",
      "institution": "Computer Science, Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234405",
      "orcid": "missing"
    },
    {
      "name": "Youjin Hwang",
      "institution": "Human-Computer Interaction+Design Lab., Seoul National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659317845",
      "orcid": "missing"
    },
    {
      "name": "Jieun Lee",
      "institution": "Human-Computer Interaction+Design Lab., Seoul National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237338",
      "orcid": "missing"
    },
    {
      "name": "Youngjin Kwon",
      "institution": "Human-Computer Interaction+Design Lab., Seoul National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659441963",
      "orcid": "missing"
    },
    {
      "name": "Yujin Park",
      "institution": "Human-Computer Interaction+Design Lab., Seoul National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526877",
      "orcid": "missing"
    },
    {
      "name": "Joonhwan Lee",
      "institution": "Human-Computer Interaction+Design Lab., Seoul National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502746040",
      "orcid": "0000-0002-3115-4024"
    }
  ],
  "references": [
    {
      "text": "Syed Ishtiaque Ahmed, Steven J Jackson, Nova Ahmed, Hasan Shahid Ferdous, Md Rashidujjaman Rifat, ASM Rizvi, Shamir Ahmed, and Rifat Sabbir Mansur. 2014. Protibadi: A platform for fighting sexual harassment in urban Bangladesh. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM New York, NY, USA, 2695–2704. https://doi.org/10.1145/2556288.2557376",
      "doi": "10.1145/2556288.2557376"
    },
    {
      "text": "Yuna Ahn, Yilin Zhang, Yujin Park, and Joonhwan Lee. 2020. A Chatbot Solution to Chat App Problems: Envisioning a Chatbot Counseling System for Teenage Victims of Online Sexual Exploitation. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. ACM New York, NY, USA, 1–7. https://doi.org/10.1145/3334480.3383070",
      "doi": "10.1145/3334480.3383070"
    },
    {
      "text": "Irwin Altman, Anne Vinsel, and Barbara B. Brown. 1981. Dialectic Conceptions In Social Psychology: An Application To Social Penetration And Privacy Regulation. Advances in Experimental Social Psychology, Vol. 14. Academic Press, 107–160. https://doi.org/10.1016/S0065-2601(08)60371-8",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi, Oliver L Haimson, Munmun De Choudhury, and Andrea Forte. 2018. Social support, reciprocity, and anonymity in responses to sexual abuse disclosures on social media. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 5(2018), 1–35. https://doi.org/10.1145/3234942",
      "doi": "10.1145/3234942"
    },
    {
      "text": "Nazanin Andalibi, Oliver L Haimson, Munmun De Choudhury, and Andrea Forte. 2016. Understanding social media disclosures of sexual abuse through the lenses of support seeking and anonymity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 3906–3918. https://doi.org/10.1145/2858036.2858096",
      "doi": "10.1145/2858036.2858096"
    },
    {
      "text": "Teresa M Au, Benjamin D Dickstein, Jonathan S Comer, Kristalyn Salters-Pedneault, and Brett T Litz. 2013. Co-occurring posttraumatic stress and depression symptoms after sexual assault: a latent profile analysis. Journal of Affective Disorders 149, 1-3 (2013), 209–216. https://doi.org/10.1016/j.jad.2013.01.026",
      "doi": ""
    },
    {
      "text": "Tobias Bauer, Emre Devrim, Misha Glazunov, William Lopez Jaramillo, Balaganesh Mohan, and Gerasimos Spanakis. 2019. #MeTooMaastricht: Building a chatbot to assist survivors of sexual harassment. arxiv:1909.02809 [cs.CL] arXiv:1909.02809. Retrieved from https://arxiv.org/abs/1909.02809.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Gerhard Brewka, Thomas Eiter, and Mirosław Truszczyński. 2011. Answer Set Programming at a Glance. Commun. ACM 54, 12 (Dec. 2011), 92–103. https://doi.org/10.1145/2043174.2043195",
      "doi": "10.1145/2043174.2043195"
    },
    {
      "text": "Bureau of Justice Statistics, U.S. Department of Justice. 2013. Female Victims of Sexual Violence, 1994-2010. Report. NCJ 240655.",
      "doi": ""
    },
    {
      "text": "M Audrey Burnam, Judith A Stein, Jacqueline M Golding, Judith M Siegel, Susan B Sorenson, Alan B Forsythe, and Cynthia A Telles. 1988. Sexual assault and mental disorders in a community population.Journal of Consulting and Clinical Psychology 56, 6(1988), 843. https://doi.org/10.1037/0022-006X.56.6.843",
      "doi": ""
    },
    {
      "text": "Davide Calvaresi, Jean-Paul Calbimonte, Enrico Siboni, Stefan Eggenschwiler, Gaetano Manzo, Roger Hilfiker, and Michael Schumacher. 2021. EREBOTS: Privacy-Compliant Agent-Based Platform for Multi-Scenario Personalized Health-Assistant Chatbots. Electronics 10, 6 (2021). https://doi.org/10.3390/electronics10060666",
      "doi": ""
    },
    {
      "text": "Jacquelyn C Campbell. 2002. Health consequences of intimate partner violence. The Lancet 359, 9314 (2002), 1331–1336. https://doi.org/10.1016/S0140-6736(02)08336-8",
      "doi": ""
    },
    {
      "text": "Lauren Bennett Cattaneo, Heidi LM DeLoveh, and Janine M Zweig. 2008. Sexual assault within intimate partner violence: Impact on helpseeking in a national sample. Journal of Prevention & Intervention in the Community 36, 1-2(2008), 137–153. https://doi.org/10.1080/10852350802022415",
      "doi": ""
    },
    {
      "text": "Ana Paula Chaves and Marco Aurélio Gerosa. 2019. How should my chatbot interact? A survey on human-chatbot interaction design. CoRR abs/1904.02743(2019). arxiv:1904.02743http://arxiv.org/abs/1904.02743",
      "doi": ""
    },
    {
      "text": "Haley Clark 2010. ’What Is the Justice System Willing to Offer?’: Understanding Sexual Assault Victim/Survivors’ Criminal Justice Needs. Family Matters85(2010), 28–37.",
      "doi": ""
    },
    {
      "text": "Carolyn E Cutrona. 1990. Stress and social support–In search of optimal matching. Journal of social and clinical Psychology 9, 1 (1990), 3–14. https://doi.org/10.1521/jscp.1990.9.1.3",
      "doi": ""
    },
    {
      "text": "Robert C Davis, Ellen Brickman, and Timothy Baker. 1991. Supportive and unsupportive responses of others to rape victims: Effects on concurrent victim adjustment. American Journal of Community Psychology 19, 3 (1991), 443–451. https://doi.org/10.1007/BF00938035",
      "doi": ""
    },
    {
      "text": "Jon Doyle. 1979. A truth maintenance system. Artificial intelligence 12, 3 (1979), 231–272. https://doi.org/10.1016/0004-3702(79)90008-0",
      "doi": ""
    },
    {
      "text": "Diana M Elliott and John Briere. 1995. Posttraumatic stress associated with delayed recall of sexual abuse: A general population study. Journal of Traumatic Stress 8, 4 (1995), 629–647. https://doi.org/10.1007/BF02102892",
      "doi": ""
    },
    {
      "text": "Patricia L Fanflik and National District Attorneys Association. 2007. Victim responses to sexual assault: Counter intuitive or simply adaptive. Report. National Criminal Justice Reference Service (NCJRS).",
      "doi": ""
    },
    {
      "text": "Janet L Fanslow and Elizabeth M Robinson. 2010. Help-seeking behaviors and reasons for help seeking reported by a representative sample of women victims of intimate partner violence in New Zealand. Journal of Interpersonal Violence 25, 5 (2010), 929–951. https://doi.org/10.1177/0886260509336963",
      "doi": ""
    },
    {
      "text": "Kathleen Kara Fitzpatrick, Alison Darcy, and Molly Vierhile. 2017. Delivering cognitive behavior therapy to young adults with symptoms of depression and anxiety using a fully automated conversational agent (Woebot): a randomized controlled trial. JMIR Mental Health 4, 2 (2017), e19. https://doi.org/10.2196/mental.7785",
      "doi": ""
    },
    {
      "text": "Asbjørn Følstad, Cecilie Bertinussen Nordheim, and Cato Alexander Bjørkli. 2018. What makes users trust a chatbot for customer service? An exploratory interview study. In International Conference on Internet Science(INSCI 2018). INSCI, 194–208. https://doi.org/10.1007/978-3-030-01437-7_16",
      "doi": ""
    },
    {
      "text": "Center for Sex Offender Management. 2018. Advancing a victim-centered approach to supervising sex offenders: A toolkit for practitioners. CSOM. https://cepp.com/wp-content/uploads/2020/01/20-Probation-Toolkit-English-.pdf",
      "doi": ""
    },
    {
      "text": "Office for Victims of Crime. 2011. SART Toolkit: Resources for Sexual Assault Response Teams. https://www.ncjrs.gov/ovc_archives/sartkit/focus/heal-print.html",
      "doi": ""
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2018. “A Stalker’s Paradise” How Intimate Partner Abusers Exploit Technology. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174241",
      "doi": "10.1145/3173574.3174241"
    },
    {
      "text": "Gabriela Philippines. 2017. Gabbie. Software. https://www.facebook.com/gabbiebygabriela/ Philippines, Used January 2019.",
      "doi": ""
    },
    {
      "text": "Timnit Gebru, Jamie Morgenstern, Briana Vecchione, Jennifer Wortman Vaughan, Hanna Wallach, Hal Daumé III au2, and Kate Crawford. 2020. Datasheets for Datasets. arxiv:1803.09010 [cs.DB] https://arxiv.org/abs/1803.09010",
      "doi": ""
    },
    {
      "text": "David H Gustafson, Robert Hawkins, Fiona McTavish, Suzanne Pingree, Wei Chih Chen, Kanittha Volrathongchai, William Stengle, James A Stewart, and Ronald C Serlin. 2008. Internet-based interactive support for cancer patients: are integrated systems better?Journal of Communication 58, 2 (2008), 238–257. https://doi.org/10.1111/j.1460-2466.2008.00383.x",
      "doi": ""
    },
    {
      "text": "Kris R Henning and Lisa M Klesges. 2002. Utilization of counseling and supportive services by female victims of domestic abuse. Violence and Victims 17, 5 (2002), 623–636. https://doi.org/10.1891/vivi.17.5.623.33714",
      "doi": ""
    },
    {
      "text": "Michael Hicks, Jonathan T Moore, and Scott Nettles. 2001. Dynamic software updating. ACM SIGPLAN Notices 36, 5 (2001), 13–23. https://doi.org/10.1145/381694.378798",
      "doi": "10.1145/381694.378798"
    },
    {
      "text": "Good Hood. 2019. Hello Cass. Software. https://hellocass.com.au/ Good Hood, Melbourne, Australia. Used December 2020.",
      "doi": ""
    },
    {
      "text": "Becky Inkster, Shubhankar Sarda, and Vinod Subramanian. 2018. An empathy-driven, conversational artificial intelligence agent (Wysa) for digital mental well-being: real-world data evaluation mixed-methods study. JMIR mHealth and uHealth 6, 11 (2018), e12106. https://doi.org/10.2196/12106",
      "doi": ""
    },
    {
      "text": "Jinsook Kim. 2018. After the disclosures: a year of #sexual_violence_in_the_film_industry in South Korea. Feminist Media Studies 18, 3 (2018), 505–508. https://doi.org/10.1080/14680777.2018.1456168",
      "doi": ""
    },
    {
      "text": "Mary Koss. 2020. Sexual Assualt Victims Want Services Tailored to Their Needs. https://www.filesforprogress.org/memos/sexual-assault-victims-want-services-tailored-to-needs.pdf",
      "doi": ""
    },
    {
      "text": "Christopher P Krebs, Christine H Lindquist, Tara D Warner, Bonnie S Fisher, Sandra L Martin, and James M Childers. 2011. Comparing sexual assault prevalence estimates obtained with direct and indirect questioning techniques. Violence Against Women 17, 2 (2011), 219–235. https://doi.org/10.1177/1077801210397743",
      "doi": ""
    },
    {
      "text": "Chris Lam. 2011. Linguistic politeness in student-team emails: Its impact on trust between leaders and members. IEEE Transactions on Professional Communication 54, 4(2011), 360–375. https://doi.org/10.1109/TPC.2011.2172669",
      "doi": ""
    },
    {
      "text": "TK Logan, Lucy Evans, Erin Stevenson, and Carol E Jordan. 2005. Barriers to services for rural and urban survivors of rape. Journal of Interpersonal Violence 20, 5 (2005), 591–616. https://doi.org/10.1177/0886260504272899",
      "doi": ""
    },
    {
      "text": "Wookjae Maeng and Joonhwan Lee. 2021. Designing a Chatbot for Survivors of Sexual Violence: Exploratory Study for Hybrid Approach Combining Rule-Based Chatbot and ML-Based Chatbot. Association for Computing Machinery, 160–166.",
      "doi": ""
    },
    {
      "text": "Tara Matthews, Kathleen O’Leary, Anna Turner, Manya Sleeper, Jill Palzkill Woelfer, Martin Shelton, Cori Manthorne, Elizabeth F Churchill, and Sunny Consolvo. 2017. Stories from survivors: Privacy & security practices when coping with intimate partner abuse. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM New York, NY, USA, 2189–2201. https://doi.org/10.1145/3025453.3025875",
      "doi": "10.1145/3025453.3025875"
    },
    {
      "text": "Drew M McDermott. 2000. The 1998 AI planning systems competition. AI magazine 21, 2 (2000), 35–35.",
      "doi": ""
    },
    {
      "text": "Golden Millar, Lana Stermac, and Mary Addison. 2002. Immediate and delayed treatment seeking among adult sexual assault victims. Women & health 35, 1 (2002), 53–64. https://doi.org/10.1300/J013v35n01_04",
      "doi": ""
    },
    {
      "text": "Heo Min-sook. 2017. You Don’t Look like a Victim: A Critical Review on the Investigation Procedure of the False Allegation of Sexual Assault and the Myth of Victimhood. Journal of Korean Women’s Studies 33, 3 (2017), 1–31. https://www.dbpia.co.kr/Journal/articleDetail?nodeId=NODE07248207",
      "doi": ""
    },
    {
      "text": "Margaret Mitchell, Simone Wu, Andrew Zaldivar, Parker Barnes, Lucy Vasserman, Ben Hutchinson, Elena Spitzer, Inioluwa Deborah Raji, and Timnit Gebru. 2019. Model Cards for Model Reporting. In Proceedings of the Conference on Fairness, Accountability, and Transparency(FAT* ’19). Association for Computing Machinery, 220–229. https://doi.org/10.1145/3287560.3287596",
      "doi": "10.1145/3287560.3287596"
    },
    {
      "text": "David A Morand and Rosalie J Ocker. 2003. Politeness theory and computer-mediated communication: A sociolinguistic approach to analyzing relational messages. In Proceedings of the 36th Annual Hawaii International Conference on System Sciences(HICSS 2003). IEEE, New York, NY, USA, 10. https://doi.org/10.1109/HICSS.2003.1173660",
      "doi": ""
    },
    {
      "text": "Mustafa Naseem, Fouzia Younas, and Maryam Mustafa. 2020. Designing Digital Safe Spaces for Peer Support and Connectivity in Patriarchal Contexts. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–24. https://doi.org/10.1145/3415217",
      "doi": "10.1145/3415217"
    },
    {
      "text": "Palace Inc.2018. Spot. Software. https://talktospot.com Palace Inc., San Francisco, CA, USA. Used January 2019.",
      "doi": ""
    },
    {
      "text": "Hyanghee Park and Joonhwan Lee. 2020. Can a Conversational Agent Lower Sexual Violence Victims’ Burden of Self-Disclosure?. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. ACM New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3383050",
      "doi": "10.1145/3334480.3383050"
    },
    {
      "text": "Hyanghee Park and Joonhwan Lee. 2021. Designing a Conversational Agent for Sexual Assault Survivors: Defining Burden of Self-Disclosure and Envisioning Survivor-Centered Solutions. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 634, 17 pages. https://doi.org/10.1145/3411764.3445133",
      "doi": "10.1145/3411764.3445133"
    },
    {
      "text": "Jens Pederson. 2015. War and peace in codesign. CoDesign 12, 3 (2015), 171–184. https://doi.org/10.1080/15710882.2015.1112813",
      "doi": ""
    },
    {
      "text": "K Peffers, Tuure Tuunanen, Charles E Gengler, Matti Rossi, Wendy Hui, Ville Virtanen, and Johanna Bragge. 2006. The design science research process: A model for producing and presenting information systems research. In Proceedings of the First International Conference on Design Science Research in Information Systems and Technology(DESRIST 2006). AIS, Atlanta, GA, USA, 83–106.",
      "doi": ""
    },
    {
      "text": "Antonia Quadara. 2008. Responding to young people disclosing sexual assault: A resource for schools. Report. Australian Institute of Family Studies.",
      "doi": ""
    },
    {
      "text": "Afsaneh Razi, Karla Badillo-Urquiola, and Pamela J Wisniewski. 2020. Let’s Talk about Sext: How Adolescents Seek Support and Advice about Their Online Sexual Experiences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376400",
      "doi": "10.1145/3313831.3376400"
    },
    {
      "text": "Jan Salisbury, Angela B Ginorio, Helen Remick, and Donna M Stringer. 1986. Counseling victims of sexual harassment. Psychotherapy: Theory, Research, Practice, Training 23, 2 (1986), 316–324. https://doi.org/10.1037/h0085616",
      "doi": ""
    },
    {
      "text": "Judith M Siegel, Jacqueline M Golding, Judith A Stein, M Audrey Burnam, and Susan B Sorenson. 1990. Reactions to sexual assault: A community study. Journal of Interpersonal Violence 5, 2 (1990), 229–246. https://doi.org/10.1177/088626090005002007",
      "doi": ""
    },
    {
      "text": "Julia Skinner and Melissa Gross. 2017. The ISSAS model: Understanding the information needs of sexual assault survivors on college campuses. College & Research Libraries 78, 1 (2017), 23–34. https://doi.org/10.5860/crl.78.1.23",
      "doi": ""
    },
    {
      "text": "Statista. 2020. Number of monthly active users of KakaoTalk in South Korea from 2nd quarter of 2015 to 1st quarter of 2020. https://www.statista.com/statistics/746249/south-korea-kakaotalk-monthly-active-users/.",
      "doi": ""
    },
    {
      "text": "Luis Tavara. 2006. Sexual violence. Best Practice & Research Clinical Obstetrics & Gynaecology 20, 3(2006), 395–408. https://doi.org/10.1016/j.bpobgyn.2006.01.011",
      "doi": ""
    },
    {
      "text": "Sarah E Ullman and Henrietta H Filipas. 2001. Correlates of formal and informal support seeking in sexual assault victims. Journal of Interpersonal Violence 16, 10 (2001), 1028–1047. https://doi.org/10.1177/088626001016010004",
      "doi": ""
    },
    {
      "text": "Sarah E. Ullman and Stephanie M. Townsend. 2007. Barriers to Working With Sexual Assault Survivors: A Qualitative Study of Rape Crisis Center Workers. Violence Against Women 13, 4 (2007), 412–443. https://doi.org/10.1177/1077801207299191",
      "doi": ""
    },
    {
      "text": "Alastair van Heerden, Xolani Ntinga, and Khanya Vilakazi. 2017. The potential of conversational agents to provide a rapid HIV counseling and testing services. In 2017 International Conference on the Frontiers and Advances in Data Science (FADS). 80–85. https://doi.org/10.1109/FADS.2017.8253198",
      "doi": ""
    },
    {
      "text": "Hollida Wakefield and Ralph Underwager. 1992. Recovered memories of alleged sexual abuse: Lawsuits against parents. Behavioral Sciences & the Law 10, 4 (1992), 483–507. https://doi.org/10.1002/bsl.2370100406",
      "doi": ""
    },
    {
      "text": "Wendy A Walsh, Victoria L Banyard, Mary M Moynihan, Sally Ward, and Ellen S Cohn. 2010. Disclosure and service use on a college campus after an unwanted sexual experience. Journal of Trauma & Dissociation 11, 2 (2010), 134–151. https://doi.org/10.1080/15299730903502912",
      "doi": ""
    },
    {
      "text": "Haolin Wang, Qingpeng Zhang, Mary Ip, and Joseph Tak Fai Lau. 2018. Social Media–based Conversational Agents for Health Management and Interventions. Computer 51, 8 (2018), 26–33. https://doi.org/10.1109/MC.2018.3191249",
      "doi": "10.1109/MC.2018.3191249"
    },
    {
      "text": "National Sex Offender Public Website. 2019. Questions and Answers. Retrieved August 4, 2019 from https://www.nsopw.gov/SafetyAndEducation/QuestionsAndAnswers.",
      "doi": ""
    },
    {
      "text": "Nancy Weinberg, John D Schmale, Janet Uken, and Keith Wessel. 1995. Computer-mediated support groups. Social Work with Groups 17, 4 (1995), 43–54. https://doi.org/10.1300/J009v17n04_04",
      "doi": ""
    },
    {
      "text": "Lynn Westbrook. 2007. Digital information support for domestic violence victims. Journal of the American Society for Information Science and Technology 58, 3 (2007), 420–432. https://doi.org/10.1002/asi.20520",
      "doi": "10.5555/1228983.1228995"
    },
    {
      "text": "Jennifer Zamora. 2017. I’m Sorry, Dave, I’m Afraid I Can’t Do That: Chatbot Perception and Expectations. In Proceedings of the 5th International Conference on Human Agent Interaction(HAI ’17). Association for Computing Machinery, 253–260. https://doi.org/10.1145/3125739.3125766",
      "doi": "10.1145/3125739.3125766"
    },
    {
      "text": "Jun Zhang, Mark S Ackerman, Lada Adamic, and Kevin Kyung Nam. 2007. QuME: a mechanism to support expertise finding in online help-seeking communities. In Proceedings of the ACM symposium on User interface software and technology(UIST ’07). ACM, New York, NY, USA, 111–114. https://doi.org/10.1145/1294211.1294230",
      "doi": "10.1145/1294211.1294230"
    }
  ]
}