{
  "doi": "10.1145/3491102.3501877",
  "title": "Exploring Technical Reasoning in Digital Tool Use",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The Technical Reasoning hypothesis in cognitive neuroscience posits that humans engage in physical tool use by reasoning about mechanical interactions among objects. By modeling the use of objects as tools based on their abstract properties, this theory explains how tools can be re-purposed beyond their assigned function. This paper assesses the relevance of Technical Reasoning to digital tool use. We conducted an experiment with 16 participants that forced them to re-purpose commands to complete a text layout task. We analyzed self-reported scores of creative personality and experience with text editing, and found a significant association between re-purposing performance and creativity, but not with experience. Our results suggest that while most participants engaged in Technical Reasoning to re-purpose digital tools, some experienced “functional fixedness.” This work contributes Technical Reasoning as a theoretical model for the design of digital tools.",
  "tags": [
    "tool re-purposing",
    "technical reasoning",
    "human tool use"
  ],
  "authors": [
    {
      "name": "Miguel A. Renom",
      "institution": "LISN, Université Paris-Saclay, CNRS, Inria, France",
      "img": "/do/10.1145/contrib-99659526442/rel-imgonly/acm_profile_photo.png",
      "acmid": "99659526442",
      "orcid": "0000-0003-0987-9376"
    },
    {
      "name": "Baptiste Caramiaux",
      "institution": "Sorbonne Université, CNRS, ISIR, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81461646439",
      "orcid": "0000-0002-4590-106X"
    },
    {
      "name": "Michel Beaudouin-Lafon",
      "institution": "LISN, Université Paris-Saclay, CNRS, Inria, France",
      "img": "/do/10.1145/contrib-81100644686/rel-imgonly/mbl-120x120.jpg",
      "acmid": "81100644686",
      "orcid": "0000-0002-2905-9810"
    }
  ],
  "references": [
    {
      "text": "John R. Anderson. 1976. Language, Memory, and Thought. Psychology Press, New York, NY, USA. https://doi.org/10.4324/9780203780954",
      "doi": ""
    },
    {
      "text": "John R. Anderson. 1983. The Architecture of Cognition. Psychology Press, New York, NY, USA. https://doi.org/10.4324/9781315799438",
      "doi": "10.5555/538901"
    },
    {
      "text": "Michel Beaudouin-Lafon. 2000. Instrumental Interaction: An Interaction Model for Designing Post-WIMP User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (The Hague, The Netherlands) (CHI ’00). Association for Computing Machinery, New York, NY, USA, 446–453. https://doi.org/10.1145/332040.332473",
      "doi": "10.1145/332040.332473"
    },
    {
      "text": "Michel Beaudouin-Lafon and Wendy E. Mackay. 2000. Reification, Polymorphism and Reuse: Three Principles for Designing Visual Interfaces. In Proceedings of the Working Conference on Advanced Visual Interfaces (Palermo, Italy) (AVI ’00). Association for Computing Machinery, New York, NY, USA, 102–109. https://doi.org/10.1145/345513.345267",
      "doi": "10.1145/345513.345267"
    },
    {
      "text": "Pascal Béguin and Pierre Rabardel. 2000. Designing for Instrument-mediated Activity. Scandinavian Journal of Information Systems 12, 1 (2000), 1. https://aisel.aisnet.org/sjis/vol12/iss1/1",
      "doi": ""
    },
    {
      "text": "François Bérard and Amélie Rochet-Capellan. 2015. The Transfer of Learning as HCI Similarity: Towards an Objective Assessment of the Sensory-Motor Basis of Naturalness. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Crossings, Seoul, Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1315–1324. https://doi.org/10.1145/2702123.2702359",
      "doi": "10.1145/2702123.2702359"
    },
    {
      "text": "Joanna Bergström, Aske Mottelson, Andreea Muresan, and Kasper Hornbæk. 2019. Tool Extension in Human-Computer Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300798",
      "doi": "10.1145/3290605.3300798"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic Analysis. APA Handbook of Research Methods in Psychology 2 (2012), 57–71. https://doi.org/10.1037/13620-004",
      "doi": ""
    },
    {
      "text": "Laurel J. Buxbaum and Solène Kalénine. 2010. Action Knowledge, Visuomotor Activation, and Embodiment in the Two Action Systems. Annals of the New York Academy of Sciences 1191, 1 (2010), 201–218. https://doi.org/10.1111/j.1749-6632.2010.05447.x",
      "doi": ""
    },
    {
      "text": "Susanne Bødker. 1987. Through the Interface – a Human Activity Approach to User Interface Design. DAIMI Report Series 16, 224 (Apr. 1987), 190. https://doi.org/10.7146/dpb.v16i224.7586",
      "doi": ""
    },
    {
      "text": "Susanne Bødker. 1997. Computers in Mediated Human Activity. Mind, Culture, and Activity 4, 3 (1997), 149–158. https://doi.org/10.1207/s15327884mca0403_2",
      "doi": ""
    },
    {
      "text": "Lucilla Cardinali, Francesca Frassinetti, Claudio Brozzoli, Christian Urquizar, Alice C Roy, and Alessandro Farnè. 2009. Tool-use Induces Morphological Updating of The Body Schema. Current biology 19, 12 (2009), R478–R479. https://doi.org/10.1016/j.cub.2009.05.009",
      "doi": ""
    },
    {
      "text": "John M. Carroll and Mary Beth Rosson. 1987. Paradox of the Active User. MIT Press, Cambridge, MA, USA, 80–111.",
      "doi": ""
    },
    {
      "text": "Marianela Ciolfi Felice, Nolwenn Maudet, Wendy E. Mackay, and Michel Beaudouin-Lafon. 2016. Beyond Snapping: Persistent, Tweakable Alignment and Distribution with StickyLines. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology(Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 133–144. https://doi.org/10.1145/2984511.2984577",
      "doi": "10.1145/2984511.2984577"
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, Joey Scarr, and Sylvain Malacria. 2014. Supporting Novice to Expert Transitions in User Interfaces. ACM Comput. Surv. 47, 2, Article 31 (11 2014), 36 pages. https://doi.org/10.1145/2659796",
      "doi": "10.1145/2659796"
    },
    {
      "text": "Tim Coughlan and Peter Johnson. 2009. Understanding Productive, Structural and Longitudinal Interactions in the Design of Tools for Creative Activities. In Proceedings of the Seventh ACM Conference on Creativity and Cognition (Berkeley, California, USA) (C&C ’09). Association for Computing Machinery, New York, NY, USA, 155–164. https://doi.org/10.1145/1640233.1640258",
      "doi": "10.1145/1640233.1640258"
    },
    {
      "text": "Alan Dix. 2007. Designing for Appropriation. In Proceedings of HCI 2007 The 21st British HCI Group Annual Conference University of Lancaster, UK 21. British Computer Society, London, UK, 1–4. https://doi.org/10.14236/ewic/HCI2007.53",
      "doi": ""
    },
    {
      "text": "Thomas A Domencich and Daniel McFadden. 1975. Urban Travel Demand: A Behavioral Analysis. North-Holland Publishing Company, New York, NY, USA. http://www.worldcat.org/oclc/915919185",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2003. The Appropriation of Interactive Technologies: Some Lessons from Placeless Documents. Computer Supported Cooperative Work (CSCW) 12, 4 (2003), 465–490. https://doi.org/10.1023/A:1026149119426",
      "doi": "10.1023/A%3A1026149119426"
    },
    {
      "text": "Karl Duncker and Lynne S Lees. 1945. On Problem-solving. Psychological Monographs 58, 5 (1945), i. https://doi.org/10.1037/h0093599",
      "doi": ""
    },
    {
      "text": "K Anders Ericsson, Ralf T Krampe, and Clemens Tesch-Römer. 1993. The Role of Deliberate Practice in the Acquisition of Expert Performance. Psychological review 100, 3 (1993), 363–406. https://doi.org/10.1037/0033-295X.100.3.363",
      "doi": ""
    },
    {
      "text": "Paul M Fitts and Michael I Posner. 1967. Human Performance. Brooks/Cole, Michigan, USA.",
      "doi": ""
    },
    {
      "text": "William W. Gaver. 1991. Technology Affordances. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (New Orleans, Louisiana, USA) (CHI ’91). Association for Computing Machinery, New York, NY, USA, 79–84. https://doi.org/10.1145/108844.108856",
      "doi": "10.1145/108844.108856"
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a Resource for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Ft. Lauderdale, Florida, USA) (CHI ’03). Association for Computing Machinery, New York, NY, USA, 233–240. https://doi.org/10.1145/642611.642653",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "J J Gibson. 1986. The Ecological Approach to Visual Perception. Psychology Press, New York, NY, USA. https://doi.org/10.4324/9780203767764",
      "doi": ""
    },
    {
      "text": "Lewis R. Goldberg, John A. Johnson, Herbert W. Eber, Robert Hogan, Michael C. Ashton, C. Robert Cloninger, and Harrison G. Gough. 2006. The International Personality Item Pool and the Future of Public-domain Personality Measures. Journal of Research in Personality 40, 1 (2006), 84–96. https://doi.org/10.1016/j.jrp.2005.08.007 Proceedings of the 2005 Meeting of the Association of Research in Personality.",
      "doi": ""
    },
    {
      "text": "Han L. Han, Miguel A. Renom, Wendy E. Mackay, and Michel Beaudouin-Lafon. 2020. Textlets: Supporting Constraints and Consistency in Text Documents. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376804",
      "doi": "10.1145/3313831.3376804"
    },
    {
      "text": "Robert R. Hoffman. 1989. A Survey of Methods for Eliciting the Knowledge of Experts. SIGART Bull. 1, 108 (April 1989), 19–27. https://doi.org/10.1145/63266.63269",
      "doi": "10.1145/63266.63269"
    },
    {
      "text": "Robert J.K. Jacob, Audrey Girouard, Leanne M. Hirshfield, Michael S. Horn, Orit Shaer, Erin Treacy Solovey, and Jamie Zigelbaum. 2008. Reality-Based Interaction: A Framework for Post-WIMP Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 201–210. https://doi.org/10.1145/1357054.1357089",
      "doi": "10.1145/1357054.1357089"
    },
    {
      "text": "Victor Kaptelinin and Bonnie Nardi. 2012. Affordances in HCI: Toward a Mediated Action Perspective. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 967–976. https://doi.org/10.1145/2207676.2208541",
      "doi": "10.1145/2207676.2208541"
    },
    {
      "text": "Michael Karlesky and Katherine Isbister. 2016. Understanding Fidget Widgets: Exploring the Design Space of Embodied Self-Regulation. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (Gothenburg, Sweden) (NordiCHI ’16). Association for Computing Machinery, New York, NY, USA, Article 38, 10 pages. https://doi.org/10.1145/2971485.2971557",
      "doi": "10.1145/2971485.2971557"
    },
    {
      "text": "Aleksei N. Leontiev. 1978. Activity, Consciousness, and Personality. Prentice-Hall, Englewood Cliffs, UK.",
      "doi": ""
    },
    {
      "text": "Wendy E. Mackay. 1990. Users and Customizable Software: A Co-Adaptive Phenomenon. Ph.D. Dissertation. Massachusetts Institute of Technology, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "N.R.F. Maier. 1931. Reasoning in Humans. II. The Solution of a Problem and its Appearance in Consciousness. Journal of Comparative Psychology 12, 2 (1931), 181–194. https://doi.org/10.1037/h0071361",
      "doi": ""
    },
    {
      "text": "Joanna McGrenere. 2002. The Design and Evaluation of Multiple Interfaces: A Solution for Complex Software. Ph.D. Dissertation. The University of Toronto, Toronto, Ontario, Canada.",
      "doi": ""
    },
    {
      "text": "Uran Oh and Leah Findlater. 2013. The Challenges and Potential of End-User Gesture Customization. Association for Computing Machinery, New York, NY, USA, 1129–1138. https://doi.org/10.1145/2470654.2466145",
      "doi": ""
    },
    {
      "text": "Kenton P. O’Hara and Stephen J. Payne. 1999. Planning and the User Interface: The Effects of Lockout Time and Error Recovery Cost. International Journal of Human-Computer Studies 50, 1 (1999), 41–59. https://doi.org/10.1006/ijhc.1998.0234",
      "doi": "10.1006/ijhc.1998.0234"
    },
    {
      "text": "François Osiurak. 2014. What Neuropsychology Tells us About Human Tool Use? The Four Constraints Theory (4CT): Mechanics, Space, Time, and Effort.Neuropsychology Review 24, 2 (2014), 88–115. https://doi.org/10.1007/s11065-014-9260-y",
      "doi": ""
    },
    {
      "text": "François Osiurak and Arnaud Badets. 2016. Tool Use and Affordance: Manipulation-based Versus Reasoning-based Approaches. Psychological Review 123, 5 (2016), 534–568. https://doi.org/10.1037/rev0000027",
      "doi": ""
    },
    {
      "text": "François Osiurak, Christophe Jarry, Philippe Allain, Ghislaine Aubin, Frédérique Etcharry-Bouyx, Isabelle Richard, Isabelle Bernard, and Didier Le Gall. 2009. Unusual Use of Objects After Unilateral Brain Damage. The Technical Reasoning Model. Cortex 45, 6 (2009), 769–783. https://doi.org/10.1016/j.cortex.2008.06.013",
      "doi": ""
    },
    {
      "text": "François Osiurak, Christophe Jarry, and Didier Le Gall. 2010. Grasping the Affordances, Understanding The Reasoning: Toward a Dialectical Theory of Human Tool Use. Psychological Review 117, 2 (2010), 517. https://doi.org/10.1037/a0019004",
      "doi": ""
    },
    {
      "text": "John Rieman, Clayton Lewis, Richard M. Young, and Peter G. Polson. 1994. Why is a Raven like a Writing Desk? Lessons in Interface Consistency and Analogical Reasoning from Two Cognitive Architectures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, Massachusetts, USA) (CHI ’94). Association for Computing Machinery, New York, NY, USA, 438–444. https://doi.org/10.1145/191666.191816",
      "doi": ""
    },
    {
      "text": "Mark K. Singley and John R. Anderson. 1987. A Keystroke Analysis of Learning and Transfer in Text Editing. Human–Computer Interaction 3, 3 (1987), 223–274. https://doi.org/10.1207/s15327051hci0303_2",
      "doi": "10.1207/s15327051hci0303_2"
    },
    {
      "text": "Robert St Amant and Thomas E. Horton. 2008. Revisiting The Definition of Animal Tool Use. Animal Behaviour 75, 4 (2008), 1199–1208. https://doi.org/10.1016/j.anbehav.2007.09.028",
      "doi": ""
    },
    {
      "text": "Marc Vass, John M. Carroll, and Clifford A. Shaffer. 2002. Supporting Creativity in Problem Solving Environments. In Proceedings of the 4th Conference on Creativity & Cognition (Loughborough, UK) (C&C ’02). Association for Computing Machinery, New York, NY, USA, 31–37. https://doi.org/10.1145/581710.581717",
      "doi": "10.1145/581710.581717"
    },
    {
      "text": "Jennifer Wiley. 1998. Expertise as Mental Set: The Effects of Domain Knowledge in Creative Problem Solving. Memory & Cognition 26, 4 (1998), 716–730. https://doi.org/10.3758/BF03211392",
      "doi": ""
    }
  ]
}