{
  "doi": "10.1145/3491102.3517624",
  "title": "“So Close, yet So Far”: Exploring Sexual-minority Women’s Relationship-building via Online Dating in China",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "Sexual-minority women (SMWs) in China are often subject to strong stigmatization and tend to have limited opportunities to connect with other SMWs in offline contexts. Although dating apps help them connect and seek social support, little is known about SMWs’ practices of self-disclosure and connection-building through those apps. To address this gap, we interviewed 43 SMW dating-app users in China. We found that these SMWs developed distinctive self-disclosure strategies, such as posting non-facial photos and implicitly disclosing their whereabouts by blending location information into photos that only those in the know could understand, to avoid interference from aggressive acquaintances and other risks of unintentional disclosure of their SMW identities. Moreover, they used dating apps not only to recognize other SMWs offline and build relationships with them, but to exchange emotional support in the process of SMW identity development. Our findings have design implications for supporting SMWs and improving their online dating experiences.",
  "authors": [
    {
      "name": "Yichao Cui",
      "institution": "Cornell Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239321",
      "orcid": "0000-0003-4018-6316"
    },
    {
      "name": "Naomi Yamashita",
      "institution": "Kyoto University, Japan",
      "img": "/do/10.1145/contrib-81309484665/rel-imgonly/photo2.png",
      "acmid": "81309484665",
      "orcid": "0000-0003-0643-6262"
    },
    {
      "name": "Mingjie Liu",
      "institution": "The University of Texas at Austin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659545126",
      "orcid": "missing"
    },
    {
      "name": "Yi-Chieh Lee",
      "institution": "National Yang Ming Chiao Tung University, Taiwan",
      "img": "/do/10.1145/contrib-87958662957/rel-imgonly/citations.jpeg",
      "acmid": "87958662957",
      "orcid": "0000-0002-5484-6066"
    }
  ],
  "references": [
    {
      "text": "2019. Many LGBT people in China forced into illegal ’conversion therapy’: groups. https://www.reuters.com/article/us-china-lgbt-health-idUSKBN1XV113",
      "doi": ""
    },
    {
      "text": "Amy Adamczyk and Yen-hsin Alice Cheng. 2015. Explaining attitudes about homosexuality in Confucian and non-Confucian nations: Is there a ‘cultural’influence?Social Science Research 51 (2015), 276–289.",
      "doi": ""
    },
    {
      "text": "Kashif Ahmad, Konstantin Pogorelov, Michael Riegler, Olga Ostroukhova, Pål Halvorsen, Nicola Conci, and Rozenn Dahyot. 2019. Automatic detection of passable roads after floods in remote sensed and social media data. Signal Processing: Image Communication 74 (2019), 110–118.",
      "doi": "10.1016/j.image.2019.02.002"
    },
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018. Responding to sensitive disclosures on social media: A decision-making framework. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 6(2018), 1–29.",
      "doi": "10.1145/3234942"
    },
    {
      "text": "Nazanin Andalibi, Oliver L Haimson, Munmun De Choudhury, and Andrea Forte. 2018. Social support, reciprocity, and anonymity in responses to sexual abuse disclosures on social media. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 5(2018), 1–35.",
      "doi": "10.1145/3234942"
    },
    {
      "text": "John Balzano. 2007. Toward a Gay-Friendly China: Legal Implications of Transition for Gays and Lesbians. Law & Sexuality: Rev. Lesbian, Gay, Bisexual & Transgender Legal Issues 16 (2007), 1.",
      "doi": ""
    },
    {
      "text": "Courtney Blackwell, Jeremy Birnholtz, and Charles Abbott. 2015. Seeing and being seen: Co-situation and impression formation using Grindr, a location-aware gay dating app. New Media & Society 17, 7 (2015), 1117–1136. https://doi.org/10.1177/1461444814521595 arXiv:https://doi.org/10.1177/1461444814521595",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jean Hardy, Tawfiq Ammari, Tiffany Veinot, Cliff Lampe, and Sarita Schoenebeck. 2016. LGBT parents and social media: Advocacy, privacy, and disclosure during shifting social movements. In Proceedings of the 2016 CHI conference on human factors in computing systems. 610–622.",
      "doi": "10.1145/2858036.2858342"
    },
    {
      "text": "Francois B Botha, Amanda L Shamblaw, and David JA Dozois. 2017. Reducing the stigma of depression among Asian students: A social norm approach. Journal of Cross-Cultural Psychology 48, 1 (2017), 113–131.",
      "doi": ""
    },
    {
      "text": "Talha Burki. 2017. Health and rights challenges for China’s LGBT community. The Lancet 389, 10076 (2017), 1286.",
      "doi": ""
    },
    {
      "text": "Jonathan Capehart. 2019. The internal challenges facing the LGBT movement. https://www.washingtonpost.com/blogs/post-partisan/wp/2015/02/09/the-internal-challenges-facing-the-lgbt-movement/",
      "doi": ""
    },
    {
      "text": "Matthew Carrasco and Andruid Kerne. 2018. Queer Visibility: Supporting LGBT+ Selective Visibility on Social Media. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173824",
      "doi": "10.1145/3173574.3173824"
    },
    {
      "text": "NATIONAL LGBT HEALTH EDUCATION CENTER. 2019. SUPPORTING THE HEALTH OF SEXUAL MINORITY WOMEN. https://www.lgbtqiahealtheducation.org/wp-content/uploads/2019/06/TFI-52_Heath-of-Sexual-Minority-Women-Brief_Final_web.pdf.",
      "doi": ""
    },
    {
      "text": "Lik Sam Chan. 2016. How sociocultural context matters in self-presentation: A comparison of US and Chinese profiles on Jack’d, a mobile dating app for men who have sex with men. International Journal of Communication 10 (2016), 20.",
      "doi": ""
    },
    {
      "text": "Lik Sam Chan. 2021. The Politics of Dating Apps: Gender, Sexuality, and Emergent Publics in Urban China. MIT Press.",
      "doi": ""
    },
    {
      "text": "Susanne YP Choi and Ming Luo. 2016. Performative family: Homosexuality, marriage and intergenerational dynamics in China. The British Journal of Sociology 67, 2 (2016), 260–280.",
      "doi": ""
    },
    {
      "text": "Jean Chong. 2017. A brief perspective on the LBT movement in China. https://outrightinternational.org/content/brief-perspective-lbt-movement-china",
      "doi": ""
    },
    {
      "text": "Pizza Ka-Yee Chow and Sheung-Tak Cheng. 2010. Shame, internalized heterosexism, lesbian identity, and coming out to others: A comparative study of lesbians in mainland China and Hong Kong.Journal of counseling psychology 57, 1 (Jan 2010), 92–104. https://doi.org/10.1037/a0017930",
      "doi": ""
    },
    {
      "text": "Camille Cobb and Tadayoshi Kohno. 2017. How public is my private life? Privacy in online dating. In Proceedings of the 26th International Conference on World Wide Web. 1231–1240.",
      "doi": "10.1145/3038912.3052592"
    },
    {
      "text": "Edmond J Coleman and Wah-Shan Chou. 2013. Tongzhi: Politics of same-sex eroticism in Chinese societies. Routledge.",
      "doi": ""
    },
    {
      "text": "Vishnupriya Das. 2019. Designing Queer Connection: An Ethnography of Dating App Production in Urban India. In Ethnographic Praxis in Industry Conference Proceedings, Vol. 2019. Wiley Online Library, 384–397.",
      "doi": ""
    },
    {
      "text": "Joseph Nicholas DeFilippis. 2016. “What about the rest of us?” An overview of LGBT poverty issues and a call to action. Journal of Progressive Human Services 27, 3 (2016), 143–174.",
      "doi": ""
    },
    {
      "text": "Michael A DeVito, Ashley Marie Walker, and Jeremy Birnholtz. 2018. ’Too Gay for Facebook’ Presenting LGBTQ+ Identity Throughout the Personal Social Media Ecosystem. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–23.",
      "doi": "10.1145/3274313"
    },
    {
      "text": "Stefanie Duguay. 2016. “He has a way gayer Facebook than I do”: Investigating sexual identity disclosure and context collapse on a social networking site. New media & society 18, 6 (2016), 891–907.",
      "doi": ""
    },
    {
      "text": "Stefanie Duguay. 2017. Identity modulation in networked publics: Queer women’s participation and representation on Tinder, Instagram, and Vine. Ph.D. Dissertation. Queensland University of Technology.",
      "doi": ""
    },
    {
      "text": "Stefanie Duguay. 2019. “There’s no one new around you”: Queer women’s experiences of scarcity in geospatial partner-seeking on Tinder. In The Geographies of Digital Sexuality. Springer, 93–114.",
      "doi": ""
    },
    {
      "text": "Stefanie Duguay, Jean Burgess, and Nicolas Suzor. 2020. Queer women’s experiences of patchwork platform governance on Tinder, Instagram, and Vine. Convergence 26, 2 (2020), 237–252.",
      "doi": ""
    },
    {
      "text": "Lindsay Ferris and Stefanie Duguay. 2020. Tinder’s lesbian digital imaginary: Investigating (im) permeable boundaries of sexual identity on a popular dating app. New Media & Society 22, 3 (2020), 489–506.",
      "doi": ""
    },
    {
      "text": "Jesse Fox and Rachel Ralston. 2016. Queer identity online: Informal learning and teaching experiences of LGBTQ individuals on social media. Computers in Human Behavior 65 (2016), 635–642.",
      "doi": ""
    },
    {
      "text": "Jesse Fox and Katie M Warber. 2015. Queer identity management and political self-expression on social networking sites: A co-cultural approach to the spiral of silence. Journal of Communication 65, 1 (2015), 79–100.",
      "doi": ""
    },
    {
      "text": "Erving Goffman 1978. The presentation of self in everyday life. Vol. 21. Harmondsworth London.",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2015. Disclosure, Stress, and Support During Gender Transition on Facebook. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing(Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 1176–1190. https://doi.org/10.1145/2675133.2675152",
      "doi": "10.1145/2675133.2675152"
    },
    {
      "text": "Oliver L Haimson, Jed R Brubaker, Lynn Dombrowski, and Gillian R Hayes. 2016. Digital footprints and changing networks during online identity transitions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 2895–2907.",
      "doi": "10.1145/2858036.2858136"
    },
    {
      "text": "Oliver L Haimson, Justin Buss, Zu Weinger, Denny L Starks, Dykee Gorrell, and Briar Sweetbriar Baron. 2020. Trans Time: Safety, Privacy, and Content Warnings on a Transgender-Specific Social Media Site. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–27.",
      "doi": "10.1145/3415195"
    },
    {
      "text": "Jean Hardy and Silvia Lindtner. 2017. Constructing a desiring user: Discourse, rurality, and design in location-based social networks. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 13–25.",
      "doi": "10.1145/2998181.2998347"
    },
    {
      "text": "Pamela Heller. 2009. Challenges facing LGBT asylum-seekers: The role of social work in correcting oppressive immigration processes. Journal of Gay & Lesbian Social Services 21, 2-3 (2009), 294–308.",
      "doi": ""
    },
    {
      "text": "Timothy Hildebrandt. 2012. Development and division: The effect of transnational linkages and local politics on LGBT activism in China. Journal of Contemporary China 21, 77 (2012), 845–862.",
      "doi": ""
    },
    {
      "text": "Timothy Hildebrandt. 2019. The one-child policy, elder care, and LGB Chinese: A social policy explanation for family pressure. Journal of homosexuality 66, 5 (2019), 590–608.",
      "doi": ""
    },
    {
      "text": "Zheping Huang. [n.d.]. Only 5% of China’s LGBT citizens have come out of the Closet. https://qz.com/687880/only-5-of-chinas-lgbt-citizens-have-come-out-of-the-closet/",
      "doi": ""
    },
    {
      "text": "Quanbao Jiang, Ying Li, and Jesús J Sánchez-Barricarte. 2016. Fertility intention, son preference, and second childbirth: survey findings from Shaanxi Province of China. Social Indicators Research 125, 3 (2016), 935–953.",
      "doi": ""
    },
    {
      "text": "Rodney H Jones. 2005. ‘You show me yours, I’ll show you mine’: The negotiation of shifts from textual to visual modes in computer-mediated interaction among gay men. Visual Communication 4, 1 (2005), 69–92.",
      "doi": ""
    },
    {
      "text": "Chow S Lam, Hector Tsang, Fong Chan, and Patrick W Corrigan. 2006. Chinese and American perspectives on stigma. Rehabilitation Education 20, 4 (2006), 269–279.",
      "doi": ""
    },
    {
      "text": "Carolyn Lauckner, Natalia Truszczynski, Danielle Lambert, Varsha Kottamasu, Saher Meherally, Anne Marie Schipani-McLaughlin, Erica Taylor, and Nathan Hansen. 2019. “Catfishing,” cyberbullying, and coercion: An exploration of the risks associated with dating app use among rural sexual minority males. Journal of Gay & Lesbian Mental Health 23, 3 (2019), 289–306.",
      "doi": ""
    },
    {
      "text": "Erick Laurent. 2005. Sexuality and human rights: an Asian perspective. Journal of Homosexuality 48, 3-4 (2005), 163–225.",
      "doi": ""
    },
    {
      "text": "Ming Li. 2017. Social Networks and Lesbians’ Mental Health: A Study of a Lesbian Community in Northeast China. The Chinese University of Hong Kong (Hong Kong).",
      "doi": ""
    },
    {
      "text": "Christian Licoppe, Carole Anne Rivière, and Julien Morel. 2016. Grindr casual hook-ups as interactional achievements. New Media & Society 18, 11 (2016), 2540–2558.",
      "doi": ""
    },
    {
      "text": "Min Liu. 2013. Two gay men seeking two lesbians: An analysis of Xinghun (formality marriage) ads on China’s Tianya. cn. Sexuality & Culture 17, 3 (2013), 494–511.",
      "doi": ""
    },
    {
      "text": "Tingting Liu. 2017. LESDO: Emerging digital infrastructures of community-based care for female queer subjects. Feminist Media Studies 17, 2 (2017), 301–305.",
      "doi": ""
    },
    {
      "text": "Milena Ribeiro Lopes and Carl Vogel. 2017. Women’s perspective on using Tinder: A user study of gender dynamics in a mobile device application. In Proceedings of the 35th ACM International Conference on the Design of Communication. 1–10.",
      "doi": "10.1145/3121113.3121220"
    },
    {
      "text": "Leanna Lucero. 2017. Safe spaces in online places: Social media and LGBTQ youth. Multicultural Education Review 9, 2 (2017), 117–128.",
      "doi": ""
    },
    {
      "text": "Weishan Miao and Lik Sam Chan. 2021. Domesticating Gay Apps: An Intersectional Analysis of the Use of Blued Among Chinese Gay Men. Journal of Computer-Mediated Communication 26, 1 (2021), 38–53.",
      "doi": ""
    },
    {
      "text": "Toby Miles-Johnson and Yurong Wang. 2018. ‘Hidden identities’: perceptions of sexual identity in Beijing. The British journal of sociology 69, 2 (2018), 323–351.",
      "doi": ""
    },
    {
      "text": "Joyce YM Nip. 2004. The relationship between online and offline communities: The case of the Queer Sisters. Media, Culture & Society 26, 3 (2004), 409–428.",
      "doi": ""
    },
    {
      "text": "Fayika Farhat Nova, Michael Ann DeVito, Pratyasha Saha, Kazi Shohanur Rashid, Shashwata Roy Turzo, Sadia Afrin, and Shion Guha. 2021. ”Facebook Promotes More Harassment” Social Media Ecosystem, Skill and Marginalized Hijra Identity in Bangladesh. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–35.",
      "doi": ""
    },
    {
      "text": "Kathleen O’Leary, Stephen M Schueller, Jacob O Wobbrock, and Wanda Pratt. 2018. “Suddenly, we got to become therapists for each other” Designing Peer Support Chats for Mental Health. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3173574.3173905"
    },
    {
      "text": "United Nations Development Programme. 2016. Being LGBTI in China: A National Survey on Social Attitudes Towards Sexual Orientation, Gender Identity and Gender Expression.",
      "doi": ""
    },
    {
      "text": "Julia R. Fernandez. 2021. “Being Yourself” Online: Supporting Authenticity for LGBTQ+ Social Media Users. In Companion Publication of the 2021 Conference on Computer Supported Cooperative Work and Social Computing. 249–252.",
      "doi": ""
    },
    {
      "text": "ZhengJia Ren, Catherine Q Howe, and Wei Zhang. 2019. Maintaining “mianzi” and “lizi”: Understanding the reasons for formality marriages between gay men and lesbians in China. Transcultural psychiatry 56, 1 (2019), 213–232.",
      "doi": ""
    },
    {
      "text": "Timothy Rich, Andi Dahmer, and Isabel Eliassen. 2020. Historical Views of Homosexuality: Asia. In Oxford Research Encyclopedia of Politics.",
      "doi": ""
    },
    {
      "text": "Kenneth Roth. 2015. LGBT: Moving towards equality. Online Article. January 23 (2015), P1.",
      "doi": ""
    },
    {
      "text": "Koustuv Saha, Sang Chan Kim, Manikanta D Reddy, Albert J Carter, Eva Sharma, Oliver L Haimson, and Munmun De Choudhury. 2019. The language of LGBTQ+ minority stress experiences on social media. Proceedings of the ACM on human-computer interaction 3, CSCW(2019), 1–22.",
      "doi": "10.1145/3361108"
    },
    {
      "text": "Morgan Klaus Scheuerman, Stacy M Branham, and Foad Hamidi. 2018. Safe spaces and safe places: Unpacking technology-mediated experiences of safety and harm with transgender people. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–27.",
      "doi": "10.1145/3274424"
    },
    {
      "text": "Timmy Shen. 2020. Top 5 CHINESE LGBT apps in 2017 · TechNode. https://technode.com/2017/10/27/top-5-chinese-lgbt-apps-in-2017/",
      "doi": ""
    },
    {
      "text": "Denise Tse-Shang Tang. 2017. All I get is an emoji: dating on lesbian mobile phone app Butterfly. Media, Culture & Society 39, 6 (2017), 816–832.",
      "doi": ""
    },
    {
      "text": "Jonathan Tcheng. 2017. ” Have You Considered Your Parents’ Happiness?”: Conversion Therapy Against LGBT People in China. Human Rights Watch.",
      "doi": ""
    },
    {
      "text": "Harry C Triandis. 2018. Individualism and collectivism. Routledge.",
      "doi": ""
    },
    {
      "text": "Richard R Troiden. 1988. Homosexual identity development. Journal of adolescent health care 9, 2 (1988), 105–113.",
      "doi": ""
    },
    {
      "text": "UNDP USAID. 2014. Being LGBT in Asia. The Thailand Country Report Bangkok. United Nations Development Programme UNDP Asia-Pacific Regional Centre(2014).",
      "doi": ""
    },
    {
      "text": "Dennis Wang, Yi-Chieh Lee, and Wai-Tat Fu. 2019. ” I Love the Feeling of Being on Stage, but I Become Greedy” Exploring the Impact of Monetary Incentives on Live Streamers’ Social Interactions and Streaming Content. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–24.",
      "doi": "10.1145/3359194"
    },
    {
      "text": "Shuaishuai Wang. 2020. Live streaming, intimate situations, and the circulation of same-sex affect: Monetizing affective encounters on Blued. Sexualities 23, 5-6 (2020), 934–950.",
      "doi": ""
    },
    {
      "text": "Shuaishuai Wang 2019. Living with censorship: The political economy and cultural politics of Chinese gay dating apps. Ph.D. Dissertation. Universiteit van Amsterdam.",
      "doi": ""
    },
    {
      "text": "Yuanyuan Wang, Zhishan Hu, Ke Peng, Joanne Rechdan, Yuan Yang, Lijuan Wu, Ying Xin, Jiahui Lin, Zhizhou Duan, Xuequan Zhu, 2020. Mapping out a spectrum of the Chinese public’s discrimination toward the LGBT community: results from a national survey. BMC Public Health 20(2020), 1–10.",
      "doi": ""
    },
    {
      "text": "Yuanyuan Wang, Zhishan Hu, Ke Peng, Ying Xin, Yuan Yang, Jack Drescher, and Runsen Chen. 2019. Discrimination against LGBT populations in China. The Lancet Public Health 4, 9 (2019), e440–e441.",
      "doi": ""
    },
    {
      "text": "Cai Wilkinson, Paula Gerber, Baden Offord, and Anthony J Langlois. 2017. LGBT Rights in Southeast Asia: One Step Forward, Two Steps Back?IAFOR Journal of Asian Studies 3, 1 (2017), 5–17.",
      "doi": ""
    },
    {
      "text": "Shangwei Wu and Janelle Ward. 2020. Looking for “interesting people”: Chinese gay men’s exploration of relationship development on dating apps. Mobile Media & Communication 8, 3 (2020), 342–359.",
      "doi": ""
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, Takashi Kudo, Eiji Aramaki, and Kazuki Hattori. 2017. Changing moods: How manual tracking by family caregivers improves caring and family communication. In Proceedings of the 2017 chi conference on human factors in computing systems. 158–169.",
      "doi": "10.1145/3025453.3025843"
    }
  ]
}