{
  "doi": "10.1145/3491102.3517723",
  "title": "Exploring Spatial UI Transition Mechanisms with Head-Worn Augmented Reality",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "Imagine in the future people comfortably wear augmented reality (AR) displays all day, how do we design interfaces that adapt to the contextual changes as people move around? In current operating systems, the majority of AR content defaults to staying at a fixed location until being manually moved by the users. However, this approach puts the burden of user interface (UI) transition solely on users. In this paper, we first ran a bodystorming design workshop to capture the limitations of existing manual UI transition approaches in spatially diverse tasks. Then we addressed these limitations by designing and evaluating three UI transition mechanisms with different levels of automation and controllability (low-effort manual, semi-automated, fully-automated). Furthermore, we simulated imperfect contextual awareness by introducing prediction errors with different costs to correct them. Our results provide valuable lessons about the trade-offs between UI automation levels, controllability, user agency, and the impact of prediction errors.",
  "authors": [
    {
      "name": "Feiyu Lu",
      "institution": "Department of Computer Science, Virginia Tech, United States",
      "img": "/do/10.1145/contrib-99659095812/rel-imgonly/profile_feiyu.jpeg",
      "acmid": "99659095812",
      "orcid": "0000-0002-3403-2970"
    },
    {
      "name": "Yan Xu",
      "institution": "Reality Labs Research, Meta, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659909148",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ohoud Alharbi, Wolfgang Stuerzlinger, and Felix Putze. 2020. The Effects of Predictive Features of Mobile Keyboards on Text Entry Speed and Errors. Proc. ACM Hum.-Comput. Interact. 4, ISS, Article 183 (nov 2020), 16 pages. https://doi.org/10.1145/3427311",
      "doi": "10.1145/3427311"
    },
    {
      "text": "Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2014. User Adaptation to a Faulty Unistroke-Based Text Entry Technique by Switching to an Alternative Gesture Set. In Proceedings of Graphics Interface 2014 (Montreal, Quebec, Canada) (GI ’14). Canadian Information Processing Society, CAN, 183–192.",
      "doi": "10.5555/2619648.2619679"
    },
    {
      "text": "Ronald T. Azuma. 1997. A Survey of Augmented Reality. Presence: Teleoperators and Virtual Environments 6, 4 (08 1997), 355–385. https://doi.org/10.1162/pres.1997.6.4.355",
      "doi": "10.1162/pres.1997.6.4.355"
    },
    {
      "text": "Marc Baloup, Thomas Pietrzak, and Géry Casiez. 2019. RayCursor: A 3D Pointing Facilitation Technique Based on Raycasting. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300331",
      "doi": "10.1145/3290605.3300331"
    },
    {
      "text": "Aaron Bangor, Philip T. Kortum, and James T. Miller. 2008. An Empirical Evaluation of the System Usability Scale. International Journal of Human–Computer Interaction 24, 6(2008), 574–594. https://doi.org/10.1080/10447310802205776",
      "doi": ""
    },
    {
      "text": "Doug A Bowman, Cheryl Stinson, Eric D Ragan, Siroberto Scerbo, Tobias Höllerer, Cha Lee, Ryan P McMahan, and Regis Kopper. 2012. Evaluating effectiveness in virtual environments with MR simulation. In Interservice/Industry Training, Simulation, and Education Conference, Vol. 4. 44.",
      "doi": ""
    },
    {
      "text": "G. E. P. Box and D. R. Cox. 1964. An Analysis of Transformations. Journal of the Royal Statistical Society: Series B (Methodological) 26, 2(1964), 211–243. https://doi.org/10.1111/j.2517-6161.1964.tb00553.x",
      "doi": ""
    },
    {
      "text": "Robert Bridle, Eric McCreath, 2005. Predictive menu selection on a mobile phone. In Workshop W7 on mining spatio-temporal data, Portugal. Citeseer.",
      "doi": ""
    },
    {
      "text": "Alan Bryman and Duncan Cramer. 2009. Quantitative data analysis with SPSS 14, 15 & 16: A guide for social scientists.Routledge/Taylor & Francis Group.",
      "doi": ""
    },
    {
      "text": "Daniel Buschek, Benjamin Bisinger, and Florian Alt. 2018. ResearchIME: A Mobile Keyboard Application for Studying Free Typing Behaviour in the Wild. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173829",
      "doi": "10.1145/3173574.3173829"
    },
    {
      "text": "Cen Chen, Chilin Fu, Xu Hu, Xiaolu Zhang, Jun Zhou, Xiaolong Li, and Forrest Sheng Bao. 2019. Reinforcement Learning for User Intent Prediction in Customer Service Bots. In Proceedings of the 42nd International ACM SIGIR Conference on Research and Development in Information Retrieval (Paris, France) (SIGIR’19). Association for Computing Machinery, New York, NY, USA, 1265–1268. https://doi.org/10.1145/3331184.3331370",
      "doi": "10.1145/3331184.3331370"
    },
    {
      "text": "Yifei Cheng, Yukang Yan, Xin Yi, Yuanchun Shi, and David Lindlbauer. 2021. SemanticAdapt: Optimization-Based Adaptation of Mixed Reality Layouts Leveraging Virtual-Physical Semantic Connections. In The 34th Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’21). Association for Computing Machinery, New York, NY, USA, 282–297. https://doi.org/10.1145/3472749.3474750",
      "doi": "10.1145/3472749.3474750"
    },
    {
      "text": "Lucia A Cherep, Alex F Lim, Jonathan W Kelly, Devi Acharya, Alfredo Velasco, Emanuel Bustamante, Alec G Ostrander, and Stephen B Gilbert. 2020. Spatial cognitive implications of teleporting through virtual environments.Journal of Experimental Psychology: Applied 26, 3 (2020), 480. https://doi.org/10.1037/xap0000263",
      "doi": ""
    },
    {
      "text": "Karen Church, Mauro Cherubini, and Nuria Oliver. 2014. A Large-Scale Study of Daily Information Needs Captured in Situ. ACM Trans. Comput.-Hum. Interact. 21, 2, Article 10 (feb 2014), 46 pages. https://doi.org/10.1145/2552193",
      "doi": "10.1145/2552193"
    },
    {
      "text": "Karen Church and Barry Smyth. 2008. Understanding Mobile Information Needs. In Proceedings of the 10th International Conference on Human Computer Interaction with Mobile Devices and Services (Amsterdam, The Netherlands) (MobileHCI ’08). Association for Computing Machinery, New York, NY, USA, 493–494. https://doi.org/10.1145/1409240.1409325",
      "doi": "10.1145/1409240.1409325"
    },
    {
      "text": "Jacob Cohen. 1988. Statistical power analysis for the behavioral sciences. England: Routledge (1988). https://doi.org/10.4324/9780203771587",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1992. A power primer.Psychological bulletin 112, 1 (1992), 155. https://doi.org/10.1037/0033-2909.112.1.155",
      "doi": ""
    },
    {
      "text": "Ashley Colley, Juho Rantakari, and Jonna Häkkilä. 2014. Augmenting the Home to Remember: Initial User Perceptions. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (Seattle, Washington) (UbiComp ’14 Adjunct). Association for Computing Machinery, New York, NY, USA, 1369–1372. https://doi.org/10.1145/2638728.2641717",
      "doi": "10.1145/2638728.2641717"
    },
    {
      "text": "Mary L Cummings and Sylvain Bruni. 2009. Collaborative human–automation decision making. In Springer handbook of automation. Springer, 437–447. https://doi.org/10.1007/978-3-540-78831-7_26",
      "doi": ""
    },
    {
      "text": "Brendan David-John, Candace Peacock, Ting Zhang, T. Scott Murdison, Hrvoje Benko, and Tanya R. Jonker. 2021. Towards Gaze-Based Prediction of the Intent to Interact in Virtual Reality. In ACM Symposium on Eye Tracking Research and Applications (Virtual Event, Germany) (ETRA ’21 Short Papers). Association for Computing Machinery, New York, NY, USA, Article 2, 7 pages. https://doi.org/10.1145/3448018.3458008",
      "doi": "10.1145/3448018.3458008"
    },
    {
      "text": "David Dearman, Melanie Kellar, and Khai N. Truong. 2008. An Examination of Daily Information Needs and Sharing Opportunities. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (San Diego, CA, USA) (CSCW ’08). Association for Computing Machinery, New York, NY, USA, 679–688. https://doi.org/10.1145/1460563.1460668",
      "doi": "10.1145/1460563.1460668"
    },
    {
      "text": "S. Di Verdi, D. Nurmi, and T. Hollerer. 2003. ARWin - a desktop augmented reality Window Manager. In The Second IEEE and ACM International Symposium on Mixed and Augmented Reality, 2003. Proceedings.298–299. https://doi.org/10.1109/ISMAR.2003.1240729",
      "doi": ""
    },
    {
      "text": "Leah Findlater and Joanna McGrenere. 2004. A Comparison of Static, Adaptive, and Adaptable Menus. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vienna, Austria) (CHI ’04). Association for Computing Machinery, New York, NY, USA, 89–96. https://doi.org/10.1145/985692.985704",
      "doi": "10.1145/985692.985704"
    },
    {
      "text": "Andrew Fowler, Kurt Partridge, Ciprian Chelba, Xiaojun Bi, Tom Ouyang, and Shumin Zhai. 2015. Effects of Language Modeling and Its Personalization on Touchscreen Typing Performance. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 649–658. https://doi.org/10.1145/2702123.2702503",
      "doi": "10.1145/2702123.2702503"
    },
    {
      "text": "Joseph L. Gabbard, J. Edward Swan, and Deborah Hix. 2006. The Effects of Text Drawing Styles, Background Textures, and Natural Lighting on Text Legibility in Outdoor Augmented Reality. Presence 15, 1 (2006), 16–32. https://doi.org/10.1162/pres.2006.15.1.16",
      "doi": "10.1162/pres.2006.15.1.16"
    },
    {
      "text": "Krzysztof Z. Gajos, Mary Czerwinski, Desney S. Tan, and Daniel S. Weld. 2006. Exploring the Design Space for Adaptive Graphical User Interfaces. In Proceedings of the Working Conference on Advanced Visual Interfaces (Venezia, Italy) (AVI ’06). Association for Computing Machinery, New York, NY, USA, 201–208. https://doi.org/10.1145/1133265.1133306",
      "doi": "10.1145/1133265.1133306"
    },
    {
      "text": "Krzysztof Z. Gajos, Katherine Everitt, Desney S. Tan, Mary Czerwinski, and Daniel S. Weld. 2008. Predictability and Accuracy in Adaptive User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 1271–1274. https://doi.org/10.1145/1357054.1357252",
      "doi": "10.1145/1357054.1357252"
    },
    {
      "text": "Jens Grubert, Matthias Heinisch, Aaron Quigley, and Dieter Schmalstieg. 2015. MultiFi: Multi Fidelity Interaction with Displays On and Around the Body. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3933–3942. https://doi.org/10.1145/2702123.2702331",
      "doi": "10.1145/2702123.2702331"
    },
    {
      "text": "Jens Grubert, Tobias Langlotz, Stefanie Zollmann, and Holger Regenbrecht. 2017. Towards Pervasive Augmented Reality: Context-Awareness in Augmented Reality. IEEE Transactions on Visualization and Computer Graphics 23, 6(2017), 1706–1724. https://doi.org/10.1109/TVCG.2016.2543720",
      "doi": "10.1109/TVCG.2016.2543720"
    },
    {
      "text": "Chris Harrison, Hrvoje Benko, and Andrew D. Wilson. 2011. OmniTouch: Wearable Multitouch Interaction Everywhere. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 441–450. https://doi.org/10.1145/2047196.2047255",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Sandra G. Hart. 2006. Nasa-Task Load Index (NASA-TLX); 20 Years Later. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50, 9(2006), 904–908. https://doi.org/10.1177/154193120605000909",
      "doi": ""
    },
    {
      "text": "Ke Huang, Chunhui Zhang, Xiaoxiao Ma, and Guanling Chen. 2012. Predicting Mobile Application Usage Using Contextual Information. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (Pittsburgh, Pennsylvania) (UbiComp ’12). Association for Computing Machinery, New York, NY, USA, 1059–1065. https://doi.org/10.1145/2370216.2370442",
      "doi": "10.1145/2370216.2370442"
    },
    {
      "text": "Jonathan W. Kelly, Alec G. Ostrander, Alex F. Lim, Lucia A. Cherep, and Stephen B. Gilbert. 2020. Teleporting through virtual environments: Effects of path scale and environment scale on spatial updating. IEEE Transactions on Visualization and Computer Graphics 26, 5(2020), 1841–1850. https://doi.org/10.1109/TVCG.2020.2973051",
      "doi": ""
    },
    {
      "text": "Inyeop Kim, Hwarang Goh, Nematjon Narziev, Youngtae Noh, and Uichin Lee. 2020. Understanding User Contexts and Coping Strategies for Context-Aware Phone Distraction Management System Design. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 4, Article 134 (dec 2020), 33 pages. https://doi.org/10.1145/3432213",
      "doi": "10.1145/3432213"
    },
    {
      "text": "Pascal Knierim, Paweł W. Woźniak, Yomna Abdelrahman, and Albrecht Schmidt. 2019. Exploring the Potential of Augmented Reality in Domestic Environments. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei, Taiwan) (MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, Article 31, 12 pages. https://doi.org/10.1145/3338286.3340142",
      "doi": "10.1145/3338286.3340142"
    },
    {
      "text": "Ben Lafreniere, Tanya R. Jonker, Stephanie Santosa, Mark Parent, Michael Glueck, Tovi Grossman, Hrvoje Benko, and Daniel Wigdor. 2021. False Positives vs. False Negatives: The Effects of Recovery Time and Cognitive Costs on Input Error Preference. Association for Computing Machinery, New York, NY, USA, 54–68. https://doi.org/10.1145/3472749.3474735",
      "doi": ""
    },
    {
      "text": "Wallace S. Lages and Doug A. Bowman. 2019. Walking with Adaptive Augmented Reality Workspaces: Design and Usage Patterns. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 356–366. https://doi.org/10.1145/3301275.3302278",
      "doi": "10.1145/3301275.3302278"
    },
    {
      "text": "Cha Lee, Scott Bonebrake, Doug A. Bowman, and Tobias Höllerer. 2010. The role of latency in the validity of AR simulation. In 2010 IEEE Virtual Reality Conference (VR). 11–18. https://doi.org/10.1109/VR.2010.5444820",
      "doi": "10.1109/VR.2010.5444820"
    },
    {
      "text": "Yuan Li, Feiyu Lu, Wallace S Lages, and Doug Bowman. 2019. Gaze Direction Visualization Techniques for Collaborative Wide-Area Model-Free Augmented Reality. In Symposium on Spatial User Interaction (New Orleans, LA, USA) (SUI ’19). Association for Computing Machinery, New York, NY, USA, Article 11, 11 pages. https://doi.org/10.1145/3357251.3357583",
      "doi": "10.1145/3357251.3357583"
    },
    {
      "text": "David Lindlbauer, Anna Maria Feit, and Otmar Hilliges. 2019. Context-Aware Online Adaptation of Mixed Reality Interfaces. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 147–160. https://doi.org/10.1145/3332165.3347945",
      "doi": "10.1145/3332165.3347945"
    },
    {
      "text": "Feiyu Lu and Doug A. Bowman. 2021. Evaluating the Potential of Glanceable AR Interfaces for Authentic Everyday Uses. In 2021 IEEE Virtual Reality and 3D User Interfaces (VR). 768–777. https://doi.org/10.1109/VR50410.2021.00104",
      "doi": ""
    },
    {
      "text": "Feiyu Lu, Shakiba Davari, Lee Lisle, Yuan Li, and Doug A. Bowman. 2020. Glanceable AR: Evaluating Information Access Methods for Head-Worn Augmented Reality. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 930–939. https://doi.org/10.1109/VR46266.2020.00113",
      "doi": ""
    },
    {
      "text": "K. Makita, M. Kanbara, and N. Yokoya. 2009. View management of annotations for wearable augmented reality. In 2009 IEEE International Conference on Multimedia and Expo. 982–985. https://doi.org/10.1109/ICME.2009.5202661",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen. 1994. Usability Inspection Methods. In Conference Companion on Human Factors in Computing Systems (Boston, Massachusetts, USA) (CHI ’94). Association for Computing Machinery, New York, NY, USA, 413–414. https://doi.org/10.1145/259963.260531",
      "doi": ""
    },
    {
      "text": "Don Norman. 2009. The design of future things. Basic books.",
      "doi": ""
    },
    {
      "text": "Chen Qu, Liu Yang, W. Bruce Croft, Yongfeng Zhang, Johanne R. Trippas, and Minghui Qiu. 2019. User Intent Prediction in Information-Seeking Conversations. In Proceedings of the 2019 Conference on Human Information Interaction and Retrieval (Glasgow, Scotland UK) (CHIIR ’19). Association for Computing Machinery, New York, NY, USA, 25–33. https://doi.org/10.1145/3295750.3298924",
      "doi": "10.1145/3295750.3298924"
    },
    {
      "text": "Philip Quinn and Andy Cockburn. 2020. Loss Aversion and Preferences in Interaction. Human–Computer Interaction 35, 2 (2020), 143–190. https://doi.org/10.1080/07370024.2018.1433040",
      "doi": ""
    },
    {
      "text": "Philip Quinn and Shumin Zhai. 2016. A Cost-Benefit Study of Text Entry Suggestion Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 83–88. https://doi.org/10.1145/2858036.2858305",
      "doi": "10.1145/2858036.2858305"
    },
    {
      "text": "Robert Rosenthal, Harris Cooper, Larry Hedges, 1994. Parametric measures of effect size. The handbook of research synthesis 621, 2 (1994), 231–244.",
      "doi": ""
    },
    {
      "text": "Edward Rosten, Gerhard Reitmayr, and Tom Drummond. 2005. Real-time video annotations for augmented reality. In International Symposium on Visual Computing. Springer, 294–302. https://doi.org/10.1007/11595755_36",
      "doi": "10.1007/11595755_36"
    },
    {
      "text": "Quentin Roy, Futian Zhang, and Daniel Vogel. 2019. Automation Accuracy Is Good, but High Controllability May Be Better. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3290605.3300750",
      "doi": "10.1145/3290605.3300750"
    },
    {
      "text": "SAE. 2021. Taxonomy and Definitions for Terms Related to Driving Automation Systems for On-Road Motor Vehicles. Retrieved February 23, 2022 from https://www.sae.org/standards/content/j3016_202104/",
      "doi": ""
    },
    {
      "text": "Jeff Sauro and Joseph S. Dumas. 2009. Comparison of Three One-Question, Post-Task Usability Questionnaires. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 1599–1608. https://doi.org/10.1145/1518701.1518946",
      "doi": "10.1145/1518701.1518946"
    },
    {
      "text": "Dennis Schleicher, Peter Jones, and Oksana Kachur. 2010. Bodystorming as Embodied Designing. Interactions 17, 6 (nov 2010), 47–51. https://doi.org/10.1145/1865245.1865256",
      "doi": "10.1145/1865245.1865256"
    },
    {
      "text": "Choonsung Shin, Jin-Hyuk Hong, and Anind K. Dey. 2012. Understanding and Prediction of Mobile Application Usage for Smart Phones. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (Pittsburgh, Pennsylvania) (UbiComp ’12). Association for Computing Machinery, New York, NY, USA, 173–182. https://doi.org/10.1145/2370216.2370243",
      "doi": "10.1145/2370216.2370243"
    },
    {
      "text": "B. Shneiderman. 1993. Beyond intelligent machines: just do it. IEEE Software 10, 1 (1993), 100–103. https://doi.org/10.1109/52.207235",
      "doi": "10.1109/52.207235"
    },
    {
      "text": "Timothy Sohn, Kevin A. Li, William G. Griswold, and James D. Hollan. 2008. A Diary Study of Mobile Information Needs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 433–442. https://doi.org/10.1145/1357054.1357125",
      "doi": "10.1145/1357054.1357125"
    },
    {
      "text": "Adam Tapal, Ela Oren, Reuven Dar, and Baruch Eitam. 2017. The Sense of Agency Scale: A Measure of Consciously Perceived Control over One’s Mind, Body, and the Immediate Environment. Frontiers in Psychology 8 (2017). https://doi.org/10.3389/fpsyg.2017.01552",
      "doi": ""
    },
    {
      "text": "Jaime Teevan, Susan T. Dumais, and Daniel J. Liebling. 2008. To Personalize or Not to Personalize: Modeling Queries with Variation in User Intent. In Proceedings of the 31st Annual International ACM SIGIR Conference on Research and Development in Information Retrieval(Singapore, Singapore) (SIGIR ’08). Association for Computing Machinery, New York, NY, USA, 163–170. https://doi.org/10.1145/1390334.1390364",
      "doi": "10.1145/1390334.1390364"
    },
    {
      "text": "April Tyack, Peta Wyeth, and Daniel Johnson. 2020. Restorative Play: Videogames Improve Player Wellbeing After a Need-Frustrating Event. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376332",
      "doi": ""
    },
    {
      "text": "Leena Ventä-Olkkonen, Jonna Häkkilä, and Kaisa Väänänen-Vainio-Mattila. 2014. Exploring the Augmented Home Window: User Perceptions of the Concept. In Proceedings of the 13th International Conference on Mobile and Ubiquitous Multimedia(Melbourne, Victoria, Australia) (MUM ’14). Association for Computing Machinery, New York, NY, USA, 190–198. https://doi.org/10.1145/2677972.2677994",
      "doi": "10.1145/2677972.2677994"
    },
    {
      "text": "Lars Vising. 2008. Mobile Widget Architecture.",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 143–146. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Wolfgang Woerndl, Christian Schueller, and Rolf Wojtech. 2007. A Hybrid Recommender System for Context-aware Recommendations of Mobile Applications. In 2007 IEEE 23rd International Conference on Data Engineering Workshop. 871–878. https://doi.org/10.1109/ICDEW.2007.4401078",
      "doi": "10.1109/ICDEW.2007.4401078"
    },
    {
      "text": "Jason Wu, Chris Harrison, Jeffrey P. Bigham, and Gierad Laput. 2020. Automated Class Discovery and One-Shot Interactions for Acoustic Activity Recognition. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376875",
      "doi": ""
    },
    {
      "text": "Congying Xia, Chenwei Zhang, Xiaohui Yan, Yi Chang, and Philip S Yu. 2018. Zero-shot user intent detection via capsule neural networks. arXiv preprint arXiv:1809.00385(2018). https://arxiv.org/abs/1809.00385",
      "doi": ""
    },
    {
      "text": "Xusheng Xiao, Xiaoyin Wang, Zhihao Cao, Hanlin Wang, and Peng Gao. 2019. IconIntent: Automatic Identification of Sensitive UI Widgets Based on Icon Classification for Android Apps. In 2019 IEEE/ACM 41st International Conference on Software Engineering (ICSE). 257–268. https://doi.org/10.1109/ICSE.2019.00041",
      "doi": ""
    },
    {
      "text": "Ye Xu, Mu Lin, Hong Lu, Giuseppe Cardone, Nicholas Lane, Zhenyu Chen, Andrew Campbell, and Tanzeem Choudhury. 2013. Preference, Context and Communities: A Multi-Faceted Approach to Predicting Smartphone App Usage Patterns. In Proceedings of the 2013 International Symposium on Wearable Computers (Zurich, Switzerland) (ISWC ’13). Association for Computing Machinery, New York, NY, USA, 69–76. https://doi.org/10.1145/2493988.2494333",
      "doi": "10.1145/2493988.2494333"
    },
    {
      "text": "Difeng Yu, Qiushi Zhou, Benjamin Tag, Tilman Dingler, Eduardo Velloso, and Jorge Goncalves. 2020. Engaging Participants during Selection Studies in Virtual Reality. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 500–509. https://doi.org/10.1109/VR46266.2020.00071",
      "doi": ""
    },
    {
      "text": "Fabio Massimo Zanzotto. 2019. Human-in-the-loop Artificial Intelligence. Journal of Artificial Intelligence Research 64 (2019), 243–252. https://doi.org/10.1613/jair.1.11345",
      "doi": "10.1613/jair.1.11345"
    },
    {
      "text": "Le Zhang, Qing-Xing Qu, Wen-Yu Chao, and Vincent G. Duffy. 2020. Investigating the Combination of Adaptive UIs and Adaptable UIs for Improving Usability and User Performance of Complex UIs. International Journal of Human–Computer Interaction 36, 1(2020), 82–94. https://doi.org/10.1080/10447318.2019.1606975",
      "doi": ""
    },
    {
      "text": "Xun Zou, Wangsheng Zhang, Shijian Li, and Gang Pan. 2013. Prophet: What App You Wish to Use Next. In Proceedings of the 2013 ACM Conference on Pervasive and Ubiquitous Computing Adjunct Publication (Zurich, Switzerland) (UbiComp ’13 Adjunct). Association for Computing Machinery, New York, NY, USA, 167–170. https://doi.org/10.1145/2494091.2494146",
      "doi": "10.1145/2494091.2494146"
    }
  ]
}