{
  "doi": "10.1145/3491102.3517515",
  "title": "Privacy Design Strategies for Home Energy Management Systems (HEMS)",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "Home energy management systems (HEMS) offer control and the ability to manage energy, generating and collecting energy consumption data at the most detailed level. However, data at this level poses various privacy concerns, including, for instance, profiling consumer behaviors and large-scale surveillance. The question of how utility providers can get value from such data without infringing consumers’ privacy has remained under-investigated. We address this gap by exploring the pro-sharing attitudes and privacy perceptions of 30 HEMS users and non-users through an interview study. While participants are concerned about data misuse and stigmatization, our analysis also reveals that incentives, altruism, trust, security and privacy, transparency and accountability encourage data sharing. From this analysis, we derive privacy design strategies for HEMS that can both improve privacy and engender adoption.",
  "tags": [
    "User Perceptions",
    "Smart Home",
    "Security and Privacy protections",
    "Energy Data",
    "Smart Home Energy Management Systems"
  ],
  "authors": [
    {
      "name": "Kopo Marvin Ramokapane",
      "institution": "Bristol Cyber Security Group, Department of Computer Science, University of Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-99659084639/rel-imgonly/20180113_142739.jpg",
      "acmid": "99659084639",
      "orcid": "0000-0001-8420-3929"
    },
    {
      "name": "Caroline Bird",
      "institution": "University of Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659360148",
      "orcid": "missing"
    },
    {
      "name": "Awais Rashid",
      "institution": "Bristol Cyber Security Group, Department of Computer Science, University of Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100280083",
      "orcid": "0000-0002-0109-1341"
    },
    {
      "name": "Ruzanna Chitchyan",
      "institution": "University of Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100420429",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Majed Alshammari and Andrew Simpson. 2018. Privacy Architectural Strategies: An Approach for Achieving Various Levels of Privacy Protection. In Proceedings of the 2018 Workshop on Privacy in the Electronic Society. ACM, ACM, New York, NY, USA, 143–154.",
      "doi": "10.1145/3267323.3268957"
    },
    {
      "text": "Will Anderson and Vicki White. 2009. Exploring consumer preferences for home energy display functionality. Report to the Energy Saving Trust 123 (2009), 1–49.",
      "doi": ""
    },
    {
      "text": "Paolo Bertoldi, J López-Lorente, and Nicola Labanca. 2016. Energy Consumption and Energy Efficiency Trends in the EU-28 2000–2014. Joint Research Centre: Ispra, Italy 1 (2016), 1–175.",
      "doi": ""
    },
    {
      "text": "Christoph Bosch, Benjamin Erb, Frank Kargl, Henning Kopp, and Stefan Pfattheicher. 2016. Tales from the dark side: Privacy dark strategies and privacy dark patterns. Proceedings on Privacy Enhancing Technologies 2016, 4(2016), 237–254.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Niklas Buescher, Spyros Boukoros, Stefan Bauregger, and Stefan Katzenbeisser. 2017. Two is not enough: Privacy assessment of aggregation schemes in smart metering. Proceedings on Privacy Enhancing Technologies 2017, 4(2017), 198–214.",
      "doi": ""
    },
    {
      "text": "Ann Cavoukian. 2009. Privacy by design. Take the challenge. Information and privacy commissioner of Ontario, Canada 2009(2009), 1–35.",
      "doi": ""
    },
    {
      "text": "Yunang Chen, Amrita Roy Chowdhury, Ruizhe Wang, Andrei Sabelfeld, Rahul Chatterjee, and Earlence Fernandes. 2021. Data Privacy in Trigger-Action Systems. In 2021 IEEE Symposium on Security and Privacy (SP). IEEE, IEEE, 445 Hoes Lane, Piscataway, NJ 08854-4141 USA, 501–518.",
      "doi": ""
    },
    {
      "text": "Ruzanna Chitchyan and Caroline Bird. 2020. Theory as a Source of Software Requirements. In 28th IEEE International Requirements Engineering Conference, RE 2020, Zurich, Switzerland, August 31 - September 4, 2020. IEEE, United States, 227–237. https://doi.org/10.1109/RE48521.2020.00033",
      "doi": ""
    },
    {
      "text": "Council of European Union. 2009. Council regulation (EU) no 2009/72/EC. https://eur-lex.europa.eu/legal-content/EN/TXT/PDF/?uri=CELEX:32009L0072&from=EN.",
      "doi": ""
    },
    {
      "text": "Council of European Union. 2012. Council regulation (EU) no 2012/27/EU. https://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=OJ:L:2012:315:0001:0056:EN:PDF.",
      "doi": ""
    },
    {
      "text": "Tawanna Dillahunt, Jennifer Mankoff, and Eric Paulos. 2010. Understanding Conflict between Landlords and Tenants: Implications for Energy Sensing and Feedback. In Proceedings of the 12th ACM International Conference on Ubiquitous Computing (Copenhagen, Denmark) (UbiComp ’10). Association for Computing Machinery, New York, NY, USA, 149–158. https://doi.org/10.1145/1864349.1864376",
      "doi": "10.1145/1864349.1864376"
    },
    {
      "text": "Susen Döbelt, Markus Jung, Marc Busch, and Manfred Tscheligi. 2015. Consumers’ privacy concerns and implications for a privacy preserving Smart Grid architecture—Results of an Austrian study. Energy Research & Social Science 9 (2015), 137–145.",
      "doi": ""
    },
    {
      "text": "Nick Doty and Mohit Gupta. 2013. Privacy design patterns and anti-patterns patterns misapplied and unintended consequences. Trustbusters - Workshop at the Symposium on Usable Privacy and Security 2013 (2013), 1–5.",
      "doi": ""
    },
    {
      "text": "Pardis Emami-Naeini, Yuvraj Agarwal, Lorrie Faith Cranor, and Hanan Hibshi. 2020. Ask the experts: What should be on an IoT privacy and security label?. In 2020 IEEE Symposium on Security and Privacy (SP). IEEE, IEEE, 445 Hoes Lane, Piscataway, NJ 08854-4141 USA, 447–464.",
      "doi": ""
    },
    {
      "text": "Dominik Engel. 2020. Enhancing privacy in smart energy systems. e & i Elektrotechnik und Informationstechnik 137, 1(2020), 33–37.",
      "doi": ""
    },
    {
      "text": "Thomas Erickson, Ming Li, Younghun Kim, Ajay Deshpande, Sambit Sahu, Tian Chao, Piyawadee Sukaviriya, and Milind Naphade. 2013. The Dubuque Electricity Portal: Evaluation of a City-Scale Residential Electricity Consumption Feedback System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 1203–1212. https://doi.org/10.1145/2470654.2466155",
      "doi": "10.1145/2470654.2466155"
    },
    {
      "text": "Zekeriya Erkin, Juan Ramón Troncoso-Pastoriza, Reginald L Lagendijk, and Fernando Pérez-González. 2013. Privacy-preserving data aggregation in smart metering systems: An overview. IEEE Signal Processing Magazine 30, 2 (2013), 75–86.",
      "doi": ""
    },
    {
      "text": "Earlence Fernandes, Jaeyeon Jung, and Atul Prakash. 2016. Security analysis of emerging smart home applications. In 2016 IEEE symposium on security and privacy (SP). IEEE, IEEE, 445 Hoes Lane, Piscataway, NJ 08854-4141 USA, 636–654.",
      "doi": ""
    },
    {
      "text": "Seda Gürses, Carmela Troncoso, and Claudia Diaz. 2011. Engineering privacy by design. Computers, Privacy & Data Protection 1 (2011), 1–21.",
      "doi": ""
    },
    {
      "text": "Seda Gürses, Carmela Troncoso, and Claudia Diaz. 2015. Engineering privacy by design reloaded. In Amsterdam Privacy Conference. Amsterdam Privacy Conference, Amsterdam, 1–21.",
      "doi": ""
    },
    {
      "text": "Jaap-Henk Hoepman. 2014. Privacy design strategies. In IFIP International Information Security Conference. Springer, Springer, Salmon Tower, Midtown Manhattan, New York City, 446–459.",
      "doi": ""
    },
    {
      "text": "Shama N Islam, Md Apel Mahmud, and Aman Maung Than Oo. 2018. Impact of optimal false data injection attacks on local energy trading in a residential microgrid. Ict Express 4, 1 (2018), 30–34.",
      "doi": ""
    },
    {
      "text": "Timo Jakobi, Sameer Patil, Dave Randall, Gunnar Stevens, and Volker Wulf. 2019. It Is About What They Could Do with the Data: A User Perspective on Privacy in Smart Metering. ACM Trans. Comput.-Hum. Interact. 26, 1, Article 2 (Jan. 2019), 44 pages. https://doi.org/10.1145/3281444",
      "doi": "10.1145/3281444"
    },
    {
      "text": "Marek Jawurek, Florian Kerschbaum, and George Danezis. 2012. Sok: Privacy technologies for smart grids–a survey of options. Microsoft Res., Cambridge, UK 1 (2012), 1–16.",
      "doi": ""
    },
    {
      "text": "WeiYu Ji and Edwin HW Chan. 2019. Critical Factors Influencing the Adoption of Smart Home Energy Technology in China: A Guangdong Province Case Study. Energies 12, 21 (2019), 4180.",
      "doi": ""
    },
    {
      "text": "Xin Jin, Kyri Baker, Dane Christensen, and Steven Isley. 2017. Foresee: A user-centric home energy management system for energy efficiency and demand response. Applied Energy 205(2017), 1583–1595.",
      "doi": ""
    },
    {
      "text": "Ahmed Shaharyar Khwaja, Alagan Anpalagan, Muhammad Naeem, and Bala Venkatesh. 2020. Smart Meter Data Obfuscation Using Correlated Noise. IEEE Internet of Things Journal 7, 8 (2020), 7250–7264.",
      "doi": ""
    },
    {
      "text": "Marc Langheinrich. 2001. Privacy by design—principles of privacy-aware ubiquitous systems. In International conference on Ubiquitous Computing. Springer, Springer, Salmon Tower, Midtown Manhattan, New York City, 273–291.",
      "doi": ""
    },
    {
      "text": "Javier Leiva, Alfonso Palacios, and Jose A Aguado. 2016. Smart metering trends, implications and necessities: A policy review. Renewable and Sustainable Energy Reviews 55 (2016), 227–233.",
      "doi": ""
    },
    {
      "text": "Bandana Mahapatra and Anand Nayyar. 2019. Home energy management system (HEMS): concept, architecture, infrastructure, challenges and energy management schemes. Energy Systems 10(2019), 1–27.",
      "doi": ""
    },
    {
      "text": "Aleksandra Michalec, Enda Hayes, James Longhurst, and David Tudgey. 2019. Enhancing the communication potential of smart metering for energy and water. Utilities Policy 56(2019), 33–40.",
      "doi": ""
    },
    {
      "text": "Søren Aagaard Mikkelsen and Rune Hylsberg Jacobsen. 2016. Securing the home energy management platform. Energy Management of Distributed Generation Systems 2016 (2016), 203.",
      "doi": ""
    },
    {
      "text": "Anders Nilsson, Misse Wester, David Lazarevic, and Nils Brandt. 2018. Smart homes, home energy management systems and real-time feedback: Lessons for influencing household energy consumption from a Swedish field study. Energy and Buildings 179(2018), 15–25.",
      "doi": ""
    },
    {
      "text": "N. Notario, A. Crespo, Y. Martín, J. M. D. Alamo, D. L. Métayer, T. Antignac, A. Kung, I. Kroener, and D. Wright. 2015. PRIPARE: Integrating Privacy Best Practices into a Privacy Engineering Methodology. In 2015 IEEE Security and Privacy Workshops. IEEE, 445 Hoes Lane, Piscataway, NJ 08854-4141 USA, 151–158.",
      "doi": ""
    },
    {
      "text": "Lorelli S Nowell, Jill M Norris, Deborah E White, and Nancy J Moules. 2017. Thematic analysis: Striving to meet the trustworthiness criteria. International Journal of Qualitative Methods 16, 1 (2017), 1609406917733847.",
      "doi": ""
    },
    {
      "text": "Mohammad Shahriar Rahman, Anirban Basu, Toru Nakamura, Haruo Takasaki, and Shinsaku Kiyomoto. 2018. PPM: Privacy Policy Manager for Home Energy Management System.J. Wirel. Mob. Networks Ubiquitous Comput. Dependable Appl. 9, 2(2018), 42–56.",
      "doi": ""
    },
    {
      "text": "Yann Riche, Jonathan Dodge, and Ronald A. Metoyer. 2010. Studying Always-on Electricity Feedback in the Home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1995–1998. https://doi.org/10.1145/1753326.1753628",
      "doi": "10.1145/1753326.1753628"
    },
    {
      "text": "Tom A. Rodden, Joel E. Fischer, Nadia Pantidi, Khaled Bachour, and Stuart Moran. 2013. At Home with Agents: Exploring Attitudes towards Future Smart Energy Infrastructures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 1173–1182. https://doi.org/10.1145/2470654.2466152",
      "doi": "10.1145/2470654.2466152"
    },
    {
      "text": "A Saha, S Rahman, Manisa Pipattanasomporn, and M Kuzlu. 2014. On security of a home energy management system. In IEEE PES Innovative Smart Grid Technologies, Europe. IEEE, IEEE, 445 Hoes Lane, Piscataway, NJ 08854-4141 USA, 1–5.",
      "doi": ""
    },
    {
      "text": "Aksha Sajeev and Haile-Selassie Rajamani. 2020. Cyber-Attacks on Smart Home Energy Management Systems under Aggregators. In 2020 International Conference on Communications, Computing, Cybersecurity, and Informatics (CCCI). IEEE, IEEE, 445 Hoes Lane, Piscataway, NJ 08854-4141 USA, 1–5.",
      "doi": ""
    },
    {
      "text": "Tobias Schwartz, Matthias Betz, Leonardo Ramirez, and Gunnar Stevens. 2010. Sustainable Energy Practices at Work: Understanding the Role of Workers in Energy Conservation. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (Reykjavik, Iceland) (NordiCHI ’10). Association for Computing Machinery, New York, NY, USA, 452–462. https://doi.org/10.1145/1868914.1868966",
      "doi": "10.1145/1868914.1868966"
    },
    {
      "text": "Tomas Moe Skjølsvold, Susanne Jørgensen, and Marianne Ryghaug. 2017. Users, design and the role of feedback technologies in the Norwegian energy transition: An empirical study and some radical challenges. Energy Research & Social Science 25 (2017), 1–8.",
      "doi": ""
    },
    {
      "text": "Sari Sultan. 2019. Privacy-preserving metering in smart grid for billing, operational metering, and incentive-based schemes: A survey. Computers & Security 84(2019), 148–165.",
      "doi": "10.1016/j.cose.2019.03.014"
    },
    {
      "text": "A. Ukil, S. Bandyopadhyay, and A. Pal. 2015. Privacy for IoT: Involuntary privacy enablement for smart energy systems. In 2015 IEEE International Conference on Communications (ICC). IEEE, 445 Hoes Lane, Piscataway, NJ 08854-4141 USA, 536–541.",
      "doi": ""
    },
    {
      "text": "SS Van Dam, CA Bakker, and JC Buiter. 2013. Do home energy management systems make sense? Assessing their overall lifecycle impact. Energy Policy 63(2013), 398–407.",
      "doi": ""
    },
    {
      "text": "Colin Whittle, Christopher R Jones, and Aidan While. 2020. Empowering householders: Identifying predictors of intentions to use a home energy management system in the United Kingdom. Energy Policy 139(2020), 111343.",
      "doi": ""
    },
    {
      "text": "Denise J. Wilkins, Ruzanna Chitchyan, and Mark Levine. 2020. Peer-to-Peer Energy Markets: Understanding the Values of Collective and Community Trading. In CHI ’20: CHI Conference on Human Factors in Computing Systems, Honolulu, HI, USA, April 25-30, 2020. ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376135",
      "doi": ""
    },
    {
      "text": "Philipp Wunderlich, Daniel Veit, and Saonee Sarker. 2012. Adoption of Information Systems in the Electricity Sector: The Issue of Smart Metering. In 18th Americas Conference on Information Systems, AMCIS 2012, Seattle, Washington, USA, August 9-11, 2012. Association for Information Systems, New York, NY, USA, 16. http://aisel.aisnet.org/amcis2012/proceedings/AdoptionDiffusionIT/16",
      "doi": ""
    },
    {
      "text": "Salman Yussof, Mohd Ezanee Rusli, Yunus Yusoff, Roslan Ismail, and Azimah Abdul Ghapar. 2014. Financial impacts of smart meter security and privacy breach. In Proceedings of the 6th International Conference on Information Technology and Multimedia. IEEE, IEEE, 445 Hoes Lane, Piscataway, NJ 08854-4141 USA, 11–14.",
      "doi": ""
    },
    {
      "text": "Shan Zhou and Marilyn A Brown. 2017. Smart meter deployment in Europe: A comparative case study on the impacts of national policy schemes. Journal of Cleaner Production 144 (2017), 22–32.",
      "doi": ""
    }
  ]
}