{
  "doi": "10.1145/3491102.3502008",
  "title": "Something Personal from the Metaverse: Goals, Topics, and Contextual Factors of Self-Disclosure in Commercial Social VR",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "Current Social VR literature provides limited insight on one of the most critical behaviors for developing and maintaining interpersonal relationships: self-disclosure. Therefore, we present an online survey (N = 126) investigating how users disclose personal information to each other in Social VR. Our results indicate that many participants see in Social VR access to authentic connections with others despite tending towards skepticism and privacy concerns. Most users disclose sexuality-related information, lifestyle preferences, and personal goals. In contrast, information that breaks anonymity, such as real names and more intimate aspects of oneself, are shared less commonly. Thereby, self-disclosure decisions depend on factors like the relationship to or age of disclosure recipients, the privacy of a virtual environment, the group size, or the activity context, and is driven by different goals, i.a., relational development or exploration of oneself. These insights advance the understanding of current Social VR users and their behavior by directing future research on self-disclosure-based relationship building in Social VR and outlying broader design implications for the future metaverse.",
  "authors": [
    {
      "name": "Philipp Sykownik",
      "institution": "Faculty of Engineering / Department for Computer Science and Cognitive Science / Entertainment Computing, University of Duisburg-Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659473578",
      "orcid": "0000-0003-0894-7242"
    },
    {
      "name": "Divine Maloney",
      "institution": "School of Computing, Human Centered Computing, Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659137255",
      "orcid": "missing"
    },
    {
      "name": "Guo Freeman",
      "institution": "School of Computing, Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658639182",
      "orcid": "0000-0001-5107-7794"
    },
    {
      "name": "Maic Masuch",
      "institution": "Faculty of Engineering / Department for Computer Science and Cognitive Science / Entertainment Computing, University of Duisburg-Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100616924",
      "orcid": "0000-0002-7965-6269"
    }
  ],
  "references": [
    {
      "text": "Dane Acena and Guo Freeman. 2021. “In My Safe Space”: Social Support for LGBTQ Users in Social Virtual Reality. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411763.3451673",
      "doi": ""
    },
    {
      "text": "Irwin Altman and Dalmas A Taylor. 1973. Social penetration: The development of interpersonal relationships.Holt, Rinehart & Winston.",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018. Announcing Pregnancy Loss on Facebook: A Decision-Making Framework for Stigmatized Disclosures on Identified Social Network Sites. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (2018).",
      "doi": "10.1145/3173574.3173732"
    },
    {
      "text": "Lily A. Baccon, Elodie Chiarovano, and Hamish G. MacDougall. 2019. Virtual Reality for Teletherapy: Avatars May Combine the Benefits of Face-to-Face Communication with the Anonymity of Online Text-Based Communication. Cyberpsychology, Behavior, and Social Networking 22, 2(2019), 158–165. https://doi.org/10.1089/cyber.2018.0247 arXiv:https://doi.org/10.1089/cyber.2018.0247PMID: 30540490.",
      "doi": ""
    },
    {
      "text": "Jeremy N. Bailenson. 2021. Nonverbal Overload: A Theoretical Argument for the Causes of Zoom Fatigue. Technology, Mind, and Behavior 2, 1 (23 2 2021). https://doi.org/10.1037/tmb0000030 https://tmb.apaopen.org/pub/nonverbal-overload.",
      "doi": ""
    },
    {
      "text": "Jeremy N Bailenson, Nick Yee, Dan Merget, and Ralph Schroeder. 2006. The effect of behavioral realism and form realism of real-time avatar faces on verbal disclosure, nonverbal disclosure, emotion recognition, and copresence in dyadic interaction. Presence: Teleoperators and Virtual Environments 15, 4(2006), 359–372.",
      "doi": "10.1162/pres.15.4.359"
    },
    {
      "text": "John A Bargh and Katelyn YA McKenna. 2004. The Internet and social life. Annu. Rev. Psychol. 55(2004), 573–590.",
      "doi": ""
    },
    {
      "text": "Miguel Barreda-Ángeles and Tilo Hartmann. 2022. Psychological benefits of using social virtual reality platforms during the covid-19 pandemic: The role of social and spatial presence. Computers in Human Behavior 127 (2022), 107047. https://doi.org/10.1016/j.chb.2021.107047",
      "doi": "10.1016/j.chb.2021.107047"
    },
    {
      "text": "Natalya N. Bazarova and Yoon Hyung Choi. 2014. Self-Disclosure in Social Media: Extending the Functional Approach to Disclosure Motivations and Characteristics on Social Network Sites1. Journal of Communication 64, 4 (06 2014), 635–657. https://doi.org/10.1111/jcom.12106 arXiv:https://academic.oup.com/joc/article-pdf/64/4/635/22322328/jjnlcom0635.pdf",
      "doi": ""
    },
    {
      "text": "Barbara Becker and Gloria Mark. 1998. Social conventions in collaborative virtual environments. In Proceedings of Collaborative Virtual Environments. 17–19.",
      "doi": ""
    },
    {
      "text": "Steve Benford, John Bowers, Lennart E Fahlén, Chris Greenhalgh, and Dave Snowdon. 1995. User embodiment in collaborative virtual environments. In Proceedings of the SIGCHI conference on Human factors in computing systems. 242–249.",
      "doi": "10.1145/223904.223935"
    },
    {
      "text": "Frank Biocca and Ben Delaney. 1995. Immersive virtual reality technology. Communication in the age of virtual reality 15 (1995), 32.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Nicole Ellison, Natasha Elliott-Deflo, and Raz Schwartz. 2019. Harassment in social virtual reality: Challenges for platform governance. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–25.",
      "doi": "10.1145/3359202"
    },
    {
      "text": "Amanda Carpenter and Kathryn Greene. 2015. Social penetration theory. The international encyclopedia of interpersonal communication (2015), 1–4.",
      "doi": ""
    },
    {
      "text": "Cathlin V. Clark-Gordon, Nicholas D. Bowman, Alan K. Goodboy, and Alyssa Wright. 2019. Anonymity and Online Self-Disclosure: A Meta-Analysis. Communication Reports 32, 2 (2019), 98–111. https://doi.org/10.1080/08934215.2019.1607516 arXiv:https://doi.org/10.1080/08934215.2019.1607516",
      "doi": ""
    },
    {
      "text": "Helena Cole and Mark D Griffiths. 2007. Social interactions in massively multiplayer online role-playing gamers. Cyberpsychology & behavior 10, 4 (2007), 575–583.",
      "doi": ""
    },
    {
      "text": "Mark É Czeisler, Rashon I Lane, Emiko Petrosky, Joshua F Wiley, Aleta Christensen, Rashid Njai, Matthew D Weaver, Rebecca Robbins, Elise R Facer-Childs, Laura K Barger, 2020. Mental health, substance use, and suicidal ideation during the COVID-19 pandemic—United States, June 24–30, 2020. Morbidity and Mortality Weekly Report 69, 32 (2020), 1049.",
      "doi": ""
    },
    {
      "text": "Thomas Dalsgaard, Mikael B. Skov, Malthe Stougaard, and Bo Thomassen. 2006. Mediated Intimacy in Families: Understanding the Relation between Children and Parents. In Proceedings of the 2006 Conference on Interaction Design and Children (Tampere, Finland) (IDC ’06). Association for Computing Machinery, New York, NY, USA, 145–152. https://doi.org/10.1145/1139073.1139110",
      "doi": "10.1145/1139073.1139110"
    },
    {
      "text": "Margaret De Larios and John T Lang. 2014. Pluralistic ignorance in virtually assembled peers: The case of World of Warcraft. Games and Culture 9, 2 (2014), 102–121.",
      "doi": ""
    },
    {
      "text": "Valerian J Derlega and Alan L Chaikin. 1977. Privacy and self-disclosure in social relationships. Journal of social issues 33, 3 (1977), 102–115.",
      "doi": ""
    },
    {
      "text": "Amandeep Dhir, Shalini Talwar, Puneet Kaur, Sunil Budhiraja, and Najmul Islam. [n.d.]. The dark side of social media: Stalking, online self-disclosure and problematic sleep. International Journal of Consumer Studies n/a, n/a ([n. d.]). https://doi.org/10.1111/ijcs.12659 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/ijcs.12659",
      "doi": ""
    },
    {
      "text": "Nicole Ellison, Rebecca Heino, and Jennifer Gibbs. 2006. Managing impressions online: Self-presentation processes in the online dating environment. Journal of computer-mediated communication 11, 2 (2006), 415–441.",
      "doi": ""
    },
    {
      "text": "M Fabri, DJ Moore, and DJ Hobbs. 2002. Expressive agents: Non-verbal communication in collaborative virtual environments. Proceedings of Autonomous Agents and Multi-Agent Systems (Embodied Conversational Agents)(2002).",
      "doi": ""
    },
    {
      "text": "Mozilla Foundation. 2021. Oculus Quest 2 | Privacy & security guide | Mozilla Foundation. Retrieved November 19, 2021 from https://foundation.mozilla.org/en/privacynotincluded/oculus-quest-2-vr-headset/",
      "doi": ""
    },
    {
      "text": "Guo Freeman and Dane Acena. 2021. Hugging from A Distance: Building Interpersonal Relationships in Social Virtual Reality. In ACM International Conference on Interactive Media Experiences (Virtual Event, USA) (IMX ’21). Association for Computing Machinery, New York, NY, USA, 84–95. https://doi.org/10.1145/3452918.3458805",
      "doi": "10.1145/3452918.3458805"
    },
    {
      "text": "Guo Freeman, Jeffrey Bardzell, and Shaowen Bardzell. 2016. Revisiting Computer-Mediated Intimacy: In-Game Marriage and Dyadic Gameplay in Audition. Association for Computing Machinery, New York, NY, USA, 4325–4336. https://doi.org/10.1145/2858036.2858484",
      "doi": ""
    },
    {
      "text": "Guo Freeman and Divine Maloney. 2021. Body, Avatar, and Me: The Presentation and Perception of Self in Social Virtual Reality. Proc. ACM Hum.-Comput. Interact. 4, CSCW3, Article 239 (Jan. 2021), 27 pages. https://doi.org/10.1145/3432938",
      "doi": "10.1145/3432938"
    },
    {
      "text": "Doron Friedman, Anthony Steed, and Mel Slater. 2007. Spatial social behavior in second life. In International Workshop on Intelligent Virtual Agents. Springer, 252–263.",
      "doi": "10.1007/978-3-540-74997-4_23"
    },
    {
      "text": "Kathryn Greene, Valerian J Derlega, and Alicia Mathews. 2006. Self-disclosure in personal relationships. The Cambridge handbook of personal relationships (2006), 409–427.",
      "doi": ""
    },
    {
      "text": "Carla F. Griggio, Arissa J. Sato, Wendy E. Mackay, and Koji Yatani. 2021. Mediating Intimacy with DearBoard: A Co-Customizable Keyboard for Everyday Messaging. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 342, 16 pages. https://doi.org/10.1145/3411764.3445757",
      "doi": "10.1145/3411764.3445757"
    },
    {
      "text": "Matthieu J Guitton. 2010. Cross-modal compensation between name and visual aspect in socially active avatars. Computers in Human Behavior 26, 6 (2010), 1772–1776.",
      "doi": "10.1016/j.chb.2010.07.004"
    },
    {
      "text": "Anthony Guye-Vuillème, Tolga K Capin, S Pandzic, N Magnenat Thalmann, and Daniel Thalmann. 1999. Nonverbal communication interface for collaborative virtual environments. Virtual Reality 4, 1 (1999), 49–59.",
      "doi": "10.1007/BF01434994"
    },
    {
      "text": "Béatrice S Hasler and Doron A Friedman. 2012. Sociocultural conventions in avatar-mediated nonverbal communication: A cross-cultural analysis of virtual proxemics. Journal of Intercultural Communication Research 41, 3 (2012), 238–259.",
      "doi": ""
    },
    {
      "text": "Rosalie Hooi and Hichang Cho. 2014. Avatar-driven self-disclosure: The virtual me is the actual me. Computers in Human Behavior 39 (2014), 20–28.",
      "doi": "10.1016/j.chb.2014.06.019"
    },
    {
      "text": "Emmi Ignatius and Marja Kokkonen. 2007. Factors contributing to verbal self-disclosure. Nordic Psychology 59, 4 (2007), 362–391. https://doi.org/10.1027/1901-2276.59.4.362",
      "doi": ""
    },
    {
      "text": "Adam N. Joinson. 2001. Self-disclosure in computer-mediated communication: The role of self-awareness and visual anonymity. European Journal of Social Psychology 31, 2 (2001), 177–192. https://doi.org/10.1002/ejsp.36 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/ejsp.36",
      "doi": ""
    },
    {
      "text": "Marcel Jonas, Steven Said, Daniel Yu, Chris Aiello, Nicholas Furlo, and Douglas Zytko. 2019. Towards a Taxonomy of Social VR Application Design. In Extended Abstracts of the Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts (Barcelona, Spain) (CHI PLAY ’19 Extended Abstracts). Association for Computing Machinery, New York, NY, USA, 437–444. https://doi.org/10.1145/3341215.3356271",
      "doi": "10.1145/3341215.3356271"
    },
    {
      "text": "Sidney M Jourard. 1971. Self-disclosure. An experimental analysis of the transparent self (1971).",
      "doi": ""
    },
    {
      "text": "Mark L Knapp and John A Daly. 2002. Handbook of interpersonal communication. Sage.",
      "doi": ""
    },
    {
      "text": "Anya Kolesnichenko, Joshua McVeigh-Schultz, and Katherine Isbister. 2019. Understanding Emerging Design Practices for Avatar Systems in the Commercial Social VR Ecology. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 241–252. https://doi.org/10.1145/3322276.3322352",
      "doi": "10.1145/3322276.3322352"
    },
    {
      "text": "Bianca W Lee and Peter RC Leeson. 2015. Online gaming in the context of social anxiety.Psychology of Addictive Behaviors 29, 2 (2015), 473.",
      "doi": ""
    },
    {
      "text": "Qiaoxi Liu and Anthony Steed. 2021. Social Virtual Reality Platform Comparison and Evaluation Using a Guided Group Walkthrough Method. Frontiers in Virtual Reality 2 (2021), 52. https://doi.org/10.3389/frvir.2021.668181",
      "doi": ""
    },
    {
      "text": "Mufan Luo and Jeffrey T. Hancock. 2020. Self-disclosure and social media: motivations, mechanisms and psychological well-being. Current Opinion in Psychology 31 (2020), 110–115. https://doi.org/10.1016/j.copsyc.2019.08.019 Privacy and Disclosure, Online and in Social Interactions.",
      "doi": ""
    },
    {
      "text": "Divine Maloney and Guo Freeman. 2020. Falling Asleep Together: What Makes Activities in Social Virtual Reality Meaningful to Users. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Virtual Event, Canada) (CHI PLAY ’20). Association for Computing Machinery, New York, NY, USA, 510–521. https://doi.org/10.1145/3410404.3414266",
      "doi": "10.1145/3410404.3414266"
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Robb Andrew. 2020. A Virtual Space for All: Exploring Children’s Experience in Social Virtual Reality. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play.",
      "doi": "10.1145/3410404.3414268"
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Andrew Robb. 2020. It Is Complicated: Interacting with Children in Social Virtual Reality. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, 343–347.",
      "doi": ""
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Andrew Robb. 2021. Social Virtual Reality: Ethical Considerations and Future Directions for An Emerging Research Space. In 2021 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, 271–277.",
      "doi": ""
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Andrew Robb. 2021. Stay Connected in An Immersive World: Why Teenagers Engage in Social Virtual Reality. In Interaction Design and Children (Athens, Greece) (IDC ’21). Association for Computing Machinery, New York, NY, USA, 69–79. https://doi.org/10.1145/3459990.3460703",
      "doi": "10.1145/3459990.3460703"
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Donghee Yvette Wohn. 2020. ”Talking without a Voice”: Understanding Non-Verbal Communication in Social Virtual Reality. Proc. ACM Hum.-Comput. Interact. 4, CSCW2, Article 175 (Oct. 2020), 25 pages. https://doi.org/10.1145/3415246",
      "doi": "10.1145/3415246"
    },
    {
      "text": "Divine Maloney, Samaneh Zamanifard, and Guo Freeman. 2020. Anonymity vs. Familiarity: Self-Disclosure and Privacy in Social Virtual Reality. In 26th ACM Symposium on Virtual Reality Software and Technology (Virtual Event, Canada) (VRST ’20). Association for Computing Machinery, New York, NY, USA, Article 25, 9 pages. https://doi.org/10.1145/3385956.3418967",
      "doi": "10.1145/3385956.3418967"
    },
    {
      "text": "Adam J Mason and Caleb T Carr. 2021. Toward a Theoretical Framework of Relational Maintenance in Computer-Mediated Communication. Communication Theory (02 2021). https://doi.org/10.1093/ct/qtaa035 arXiv:https://academic.oup.com/ct/advance-article-pdf/doi/10.1093/ct/qtaa035/36233393/qtaa035.pdfqtaa035.",
      "doi": ""
    },
    {
      "text": "Joshua McVeigh-Schultz and Katherine Isbister. 2021. The Case for “Weird Social” in VR/XR: A Vision of Social Superpowers Beyond Meatspace. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411763.3450377",
      "doi": ""
    },
    {
      "text": "Joshua McVeigh-Schultz, Anya Kolesnichenko, and Katherine Isbister. 2019. Shaping Pro-Social Interaction in VR: An Emerging Design Framework. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300794",
      "doi": "10.1145/3290605.3300794"
    },
    {
      "text": "Joshua McVeigh-Schultz, Elena Márquez Segura, Nick Merrill, and Katherine Isbister. 2018. What’s It Mean to ”Be Social” in VR? Mapping the Social VR Design Ecology. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems(Hong Kong, China) (DIS ’18 Companion). Association for Computing Machinery, New York, NY, USA, 289–294. https://doi.org/10.1145/3197391.3205451",
      "doi": "10.1145/3197391.3205451"
    },
    {
      "text": "Meta. 2020. Facebook Horizon Welcomes Its First Virtual Explorers. Retrieved December 31, 2021 from https://about.fb.com/news/2020/08/facebook-horizon-welcomes-first-virtual-explorers/",
      "doi": ""
    },
    {
      "text": "Meta. 2021. Introducing Meta: A Social Technology Company. Retrieved November 19, 2021 from https://about.fb.com/news/2021/10/facebook-company-is-now-meta/",
      "doi": ""
    },
    {
      "text": "Mark Roman Miller, Fernanda Herrera, Hanseul Jun, James A Landay, and Jeremy N Bailenson. 2020. Personal identifiability of user tracking data during observation of 360-degree VR video. Scientific Reports 10, 1 (2020), 1–10.",
      "doi": ""
    },
    {
      "text": "Fares Moustafa and Anthony Steed. 2018. A longitudinal study of small group interaction in social virtual reality. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology. ACM, 22.",
      "doi": "10.1145/3281505.3281527"
    },
    {
      "text": "Carman Neustaedter and Saul Greenberg. 2012. Intimacy in Long-Distance Relationships over Video Chat. Association for Computing Machinery, New York, NY, USA, 753–762. https://doi.org/10.1145/2207676.2207785",
      "doi": ""
    },
    {
      "text": "Melanie Nguyen, Yu Sun Bin, and Andrew Campbell. 2012. Comparing Online and Offline Self-Disclosure: A Systematic Review. Cyberpsychology, Behavior, and Social Networking 15, 2(2012), 103–111. https://doi.org/10.1089/cyber.2011.0277 arXiv:https://doi.org/10.1089/cyber.2011.0277PMID: 22032794.",
      "doi": ""
    },
    {
      "text": "Julia Omarzu. 2000. A Disclosure Decision Model: Determining How and When Individuals Will Self-Disclose. Personality and Social Psychology Review 4, 2 (2000), 174–185. https://doi.org/10.1207/S15327957PSPR0402_05 arXiv:https://doi.org/10.1207/S15327957PSPR0402_05",
      "doi": ""
    },
    {
      "text": "Sergio Orts-Escolano, Christoph Rhemann, Sean Fanello, Wayne Chang, Adarsh Kowdle, Yury Degtyarev, David Kim, Philip L. Davidson, Sameh Khamis, Mingsong Dou, Vladimir Tankovich, Charles Loop, Qin Cai, Philip A. Chou, Sarah Mennicken, Julien Valentin, Vivek Pradeep, Shenlong Wang, Sing Bing Kang, Pushmeet Kohli, Yuliya Lutchyn, Cem Keskin, and Shahram Izadi. 2016. Holoportation: Virtual 3D Teleportation in Real-Time. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 741–754. https://doi.org/10.1145/2984511.2984517",
      "doi": "10.1145/2984511.2984517"
    },
    {
      "text": "Seung-bae Park and Namho Chung. 2011. Mediating roles of self-presentation desire in online game community commitment and trust behavior of Massive Multiplayer Online Role-Playing Games. Computers in Human Behavior 27, 6 (2011), 2372–2379.",
      "doi": "10.1016/j.chb.2011.07.016"
    },
    {
      "text": "W. Barnett Pearce and Stewart M. Sharp. 2006. Self-Disclosing Communication. Journal of Communication 23, 4 (02 2006), 409–425. https://doi.org/10.1111/j.1460-2466.1973.tb00958.x arXiv:https://academic.oup.com/joc/article-pdf/23/4/409/22327499/jjnlcom0409.pdf",
      "doi": ""
    },
    {
      "text": "T. S. Perry. 2016. Virtual reality goes social. IEEE Spectrum 53, 1 (2016), 56–57. https://doi.org/10.1109/MSPEC.2016.7367470",
      "doi": "10.1109/MSPEC.2016.7367470"
    },
    {
      "text": "Adi Robertson. 2020. German regulators are investigating Facebook for its controversial Oculus account rules. Retrieved December 19, 2021 from https://www.theverge.com/2020/12/10/22167509/germany-fco-investigation-facebook-oculus-account-requirements-competition",
      "doi": ""
    },
    {
      "text": "Shane L Rogers, Rebecca Broadbent, Jemma Brown, Alan Fraser, and Craig Speelman. 2021. Realistic motion avatars are the future for social interaction in virtual reality. https://doi.org/10.31234/osf.io/gcakv",
      "doi": ""
    },
    {
      "text": "Daniel Roth, Gary Bente, Peter Kullmann, David Mal, Chris Felix Purps, Kai Vogeley, and Marc Erich Latoschik. 2019. Technologies for Social Augmentations in User-Embodied Virtual Reality. In 25th ACM Symposium on Virtual Reality Software and Technology (Parramatta, NSW, Australia) (VRST ’19). Association for Computing Machinery, New York, NY, USA, Article 5, 12 pages. https://doi.org/10.1145/3359996.3364269",
      "doi": "10.1145/3359996.3364269"
    },
    {
      "text": "Daniel Roth, Carola Bloch, Josephine Schmitt, Lena Frischlich, Marc Erich Latoschik, and Gary Bente. 2019. Perceived Authenticity, Empathy, and Pro-Social Intentions Evoked through Avatar-Mediated Self-Disclosures. In Proceedings of Mensch Und Computer 2019 (Hamburg, Germany) (MuC’19). Association for Computing Machinery, New York, NY, USA, 21–30. https://doi.org/10.1145/3340764.3340797",
      "doi": "10.1145/3340764.3340797"
    },
    {
      "text": "Rebecca B Rubin, Elizabeth M Perse, and Carole A Barbato. 1988. Conceptualization and measurement of interpersonal communication motives. Human Communication Research 14, 4 (1988), 602–628.",
      "doi": ""
    },
    {
      "text": "Erin K. Ruppel, Clare Gross, Arrington Stoll, Brittnie S. Peck, Mike Allen, and Sang-Yeon Kim. 2016. Reflecting on Connecting: Meta-Analysis of Differences between Computer-Mediated and Face-to-Face Self-Disclosure. Journal of Computer-Mediated Communication 22, 1 (11 2016), 18–34. https://doi.org/10.1111/jcc4.12179 arXiv:https://academic.oup.com/jcmc/article-pdf/22/1/18/22316369/jjcmcom0018.pdf",
      "doi": ""
    },
    {
      "text": "Koustuv Saha, Jordyn Seybolt, Stephen M Mattingly, Talayeh Aledavood, Chaitanya Konjeti, Gonzalo J. Martinez, Ted Grover, Gloria Mark, and Munmun De Choudhury. 2021. What Life Events Are Disclosed on Social Media, How, When, and By Whom?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 335, 22 pages. https://doi.org/10.1145/3411764.3445405",
      "doi": "10.1145/3411764.3445405"
    },
    {
      "text": "N. Stephenson. 2003. Snow Crash: A Novel. Random House Publishing Group. https://books.google.de/books?id=RMd3GpIFxcUC",
      "doi": ""
    },
    {
      "text": "Joseph P Stokes. 1987. The relation of loneliness and self-disclosure. In Self-disclosure. Springer, 175–201.",
      "doi": ""
    },
    {
      "text": "John Suler. 2004. The online disinhibition effect. Cyberpsychology & behavior 7, 3 (2004), 321–326.",
      "doi": ""
    },
    {
      "text": "Philipp Sykownik, Linda Graf, Christoph Zils, and Maic Masuch. 2021. The Most Social Platform Ever? A Survey about Activities & Motives of Social VR Users. In 2021 IEEE Virtual Reality and 3D User Interfaces (VR). 546–554. https://doi.org/10.1109/VR50410.2021.00079",
      "doi": ""
    },
    {
      "text": "Philipp Sykownik and Maic Masuch. 2021. Developing a Framework for Designing Augmentations of Social Touch in Multiuser Virtual Reality. In Mensch und Computer 2021 - Workshopband, Carolin Wienrich, Philipp Wintersberger, and Benjamin Weyers (Eds.). Gesellschaft für Informatik e.V., Bonn. https://doi.org/10.18420/muc2021-mci-ws16-241",
      "doi": ""
    },
    {
      "text": "Diana I Tamir and Jason P Mitchell. 2012. Disclosing information about the self is intrinsically rewarding. Proceedings of the National Academy of Sciences 109, 21(2012), 8038–8043.",
      "doi": ""
    },
    {
      "text": "Theresa Jean Tanenbaum, Nazely Hartoonian, and Jeffrey Bryan. 2020. ” How do I make this thing smile?” An Inventory of Expressive Nonverbal Communication in Commercial Social Virtual Reality Platforms. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376606"
    },
    {
      "text": "Aurelijus Vaitkevičius, Mantas Taroza, Tomas Blažauskas, Robertas Damaševičius, Rytis Maskeliūnas, and Marcin Woźniak. 2019. Recognition of American sign language gestures in a virtual reality using leap motion. Applied Sciences 9, 3 (2019), 445.",
      "doi": ""
    },
    {
      "text": "Kurt Wagner. 2021. Zuckerberg Says Facebook’s Future Lies in Virtual ‘Metaverse’. Retrieved November 19, 2021 from https://www.bloomberg.com/news/articles/2021-07-29/mark-zuckerberg-explains-metaverse-vision-to-facebook-fb-investors-analysts",
      "doi": ""
    },
    {
      "text": "Joseph B Walther. 1992. Interpersonal effects in computer-mediated interaction: A relational perspective. Communication research 19, 1 (1992), 52–90.",
      "doi": ""
    },
    {
      "text": "Joseph B Walther. 2011. Theories of computer-mediated communication and interpersonal relations. The handbook of interpersonal communication 4 (2011), 443–479.",
      "doi": ""
    },
    {
      "text": "Lawrence R Wheeless and Jams Grotz. 1976. Conceptualization and measurement of reported self-disclosure. Human communication research 2, 4 (1976), 338–346.",
      "doi": ""
    },
    {
      "text": "Ciara R Wigham and Thierry Chanier. 2013. A study of verbal and nonverbal communication in Second Life–the ARCHI21 experience. ReCALL 25, 1 (2013), 63–84.",
      "doi": ""
    },
    {
      "text": "Andrea Stevenson Won, Jeremy Bailenson, Jimmy Lee, and Jaron Lanier. 2015. Homuncular flexibility in virtual reality. Journal of Computer-Mediated Communication 20, 3 (2015), 241–259.",
      "doi": "10.1111/jcc4.12107"
    },
    {
      "text": "Nick Yee and Jeremy Bailenson. 2007. The Proteus effect: The effect of transformed self-representation on behavior. Human communication research 33, 3 (2007), 271–290.",
      "doi": ""
    },
    {
      "text": "Nick Yee, Jeremy N Bailenson, Mark Urbanek, Francis Chang, and Dan Merget. 2007. The unbearable likeness of being digital: The persistence of nonverbal social norms in online virtual environments. CyberPsychology & Behavior 10, 1 (2007), 115–121.",
      "doi": ""
    },
    {
      "text": "Samaneh Zamanifard and Guo Freeman. 2019. ”The Togetherness that We Crave” Experiencing Social VR in Long Distance Relationships. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing. 438–442.",
      "doi": "10.1145/3311957.3359453"
    },
    {
      "text": "Renwen Zhang, Natalya N. Bazarova, and Madhu Reddy. 2021. Distress Disclosure across Social Media Platforms during the COVID-19 Pandemic: Untangling the Effects of Platforms, Affordances, and Audiences. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 644, 15 pages. https://doi.org/10.1145/3411764.3445134",
      "doi": "10.1145/3411764.3445134"
    },
    {
      "text": "Zhuoming Zhang, Jessalyn Alvina, Robin Héron, Stéphane Safin, Françoise Détienne, and Eric Lecolinet. 2021. Touch without Touching: Overcoming Social Distancing in Semi-Intimate Relationships with SansTouch. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445612",
      "doi": ""
    }
  ]
}