{
  "doi": "10.1145/3491102.3517430",
  "title": "LivingMoments: Bespoke Social Communication for People living with Dementia and their Relatives",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "Dementia can hinder a person's ability to engage with their relatives. Existing communication technologies do not support people with dementia in maintaining social contact since they are not designed for their abilities and needs. This paper presents LivingMoments, a communication system that enables the engagement of people with dementia with their relatives. The system uses digital and physical interaction design considering people's different and changing abilities. Over a six-week field evaluation of LivingMoments, involving six participants living at home with different levels of dementia, we collected qualitative and quantitative data about the experiences of them and their relatives. Based on the data analysis, we found the need to adapt communication to individual abilities, lowering barriers through content calibration and establishing habits for continuous use. We evinced a set of design considerations for technologies to support a lasting engagement of people with dementia with different and changing abilities.",
  "tags": [],
  "authors": [
    {
      "name": "Myrte Thoolen",
      "institution": "Industrial Design, Eindhoven University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659441878",
      "orcid": "missing"
    },
    {
      "name": "Francesca Toso",
      "institution": "Industrial Design, Eindhoven University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235964",
      "orcid": "missing"
    },
    {
      "name": "Sebastiaan T.M. Peek",
      "institution": "Tranzo, Tilburg University, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239375",
      "orcid": "missing"
    },
    {
      "name": "Yuan Lu",
      "institution": "Industrial Design, Eindhoven University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659068470",
      "orcid": "missing"
    },
    {
      "name": "Rens Brankaert",
      "institution": "Industrial Design, Eindhoven University of Technology, Netherlands and Institute of Allied Health Professions, Fontys University of Applied Sciences, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659068300",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Norman Alm, Richard Dye, Gary Gowans, Jim Campbell, Arlene Astell, and Maggie Ellis. 2007. A Communication Support System for Older People with Dementia. Computer (Long. Beach. Calif). 40, 5 (May 2007), 35–41. https://doi.org/10.1109/MC.2007.153",
      "doi": ""
    },
    {
      "text": "Sarah Alsawy, Warren Mansell, Phil McEvoy, and Sara Tai. 2017. What is good communication for people living with dementia? A mixed-methods systematic review. Int. Psychogeriatrics 29, 11 (2017), 1785–1800. https://doi.org/10.1017/S1041610217001429",
      "doi": ""
    },
    {
      "text": "Sarah Alsawy, Sara Tai, Phil McEvoy, and Warren Mansell. 2020. ‘It's nice to think somebody's listening to me instead of saying “oh shut up”’. People with dementia reflect on what makes communication good and meaningful. J. Psychiatr. Ment. Health Nurs. 27, 2 (2020), 151–161. https://doi.org/10.1111/jpm.12559",
      "doi": ""
    },
    {
      "text": "Arlene Astell. 2006. Technology and Personhood in Dementia Care. Qual. Ageing Older Adults 7, 1 (March 2006), 15–25. https://doi.org/10.1108/14717794200600004",
      "doi": ""
    },
    {
      "text": "Arlene J. Astell, Nicole Bouranis, Jesse Hoey, Allison Lindauer, Alex Mihailidis, Chris Nugent, and Julie M. Robillard. 2019. Technology and Dementia: The Future is Now. Dement. Geriatr. Cogn. Disord. 47, 3 (2019), 131–139. https://doi.org/10.1159/000497800",
      "doi": ""
    },
    {
      "text": "Peter Bennett, Heidi Hinder, Seana Kozar, Christopher Bowdler, Elaine Massung, Tim Cole, Helen Manchester, and Kirsten Cater. 2015. TopoTiles: Storytelling in care homes with topographic tangibles. Conf. Hum. Factors Comput. Syst. - Proc. 18, (2015), 911–916. https://doi.org/10.1145/2702613.2732918",
      "doi": "10.1145/2702613.2732918"
    },
    {
      "text": "Linda Birt, Rebecca Griffiths, Georgina Charlesworth, Paul Higgs, Martin Orrell, Phuong Leung, and Fiona Poland. 2020. Maintaining Social Connections in Dementia: A Qualitative Synthesis. Qual. Health Res. 30, 1 (January 2020), 23–42. https://doi.org/10.1177/1049732319874782",
      "doi": ""
    },
    {
      "text": "Linda Birt, Fiona Poland, Emese Csipke, and Georgina Charlesworth. 2017. Shifting dementia discourses from deficit to active citizenship. Sociol. Heal. Illn. 39, 2 (2017), 199–211. DOI:https://doi.org/10.1111/1467-9566.12530",
      "doi": ""
    },
    {
      "text": "Marije Blok, Erik van Ingen, Alice H. de Boer, and Marieke Slootman. 2020. The use of information and communication technologies by older people with cognitive impairments: from barriers to benefits. Comput. Human Behav. 104, 3 (2020), 2015. https://doi.org/10.1016/j.chb.2019.106173",
      "doi": ""
    },
    {
      "text": "Alessandro Bosco, Justine Schneider, Donna Maria Coleston-Shields, Kaanthan Jawahar, Paul Higgs, and Martin Orrell. 2018. Agency in dementia care: Systematic review and meta-ethnography. Int. Psychogeriatrics (2018), 1–16. https://doi.org/10.1017/S1041610218001801",
      "doi": ""
    },
    {
      "text": "Simon Bowen and Daniela Petrelli. 2011. Remembering today tomorrow: Exploring the human-centred design of digital mementos. Int. J. Hum. Comput. Stud. 69, 5 (2011), 324–337. https://doi.org/10.1016/j.ijhcs.2010.12.005",
      "doi": "10.1016/j.ijhcs.2010.12.005"
    },
    {
      "text": "Rens Brankaert and Gail Kenning. 2020. HCI and Design in the Context of Dementia.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qual. Res. Psychol. 3, 2 (January 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Dawn Brooker. 2003. What is person-centred care in dementia? Rev. Clin. Gerontol. 13, 3 (August 2003), 215–222. https://doi.org/10.1017/S095925980400108X",
      "doi": ""
    },
    {
      "text": "Winslow Burleson, Cecil Lozano, Vijay Ravishankar, Jeremy Rowe, Edward Mahoney, and Diane Mahoney. 2015. Assistive Dressing System: A Capabilities Study for Personalized Support of Dressing Activities for People Living with Dementia. Iproceedings 1, 1 (2015), e13. https://doi.org/10.2196/iproc.4700",
      "doi": ""
    },
    {
      "text": "Joaquim Cerejeira, Luisa Lagarto, and Elizabeta Blagoja Mukaetova-Ladinska. 2012. Behavioral and Psychological Symptoms of Dementia. Front. Neurol. 3, May (2012), 1–21. https://doi.org/10.3389/fneur.2012.00073",
      "doi": ""
    },
    {
      "text": "Sabeth Diks, Timothy Hendrik Coen Muyrers, Guangyu Chen, Tzu Jou Huang, Myrte Thoolen, and Rens Brankaert. 2021. CoasterChat: Exploring Digital Communication between People with Early Stage Dementia and Family Members Embedded in a Daily Routine. Conf. Hum. Factors Comput. Syst. - Proc. 1, 1 (2021), 1–10. https://doi.org/10.1145/3411763.3451635",
      "doi": "10.1145/3411763.3451635"
    },
    {
      "text": "Emma Dixon and Amanda Lazar. 2020. The Role of Sensory Changes in Everyday Technology use by People with Mild to Moderate Dementia. ASSETS 2020 - 22nd Int. ACM SIGACCESS Conf. Comput. Access. (2020). https://doi.org/10.1145/3373625.3417000",
      "doi": "10.1145/3373625.3417000"
    },
    {
      "text": "Sam Fazio, Douglas Pace, Janice Flinner, and Beth Kallmyer. 2018. The Fundamentals of Person-Centered Care for Individuals With Dementia. Gerontologist 58, suppl_1 (January 2018), S10–S19. https://doi.org/10.1093/geront/gnx122",
      "doi": ""
    },
    {
      "text": "Yuan Feng, Suihuai Yu, Dirk van de Mortel, Emilia Barakova, Jun Hu, and Matthias Rauterberg. 2019. LiveNature: Ambient Display and Social Robot-Facilitated Multi-Sensory Engagement for People with Dementia. In Proceedings of the 2019 on Designing Interactive Systems Conference - DIS ’19, 1321–1333. https://doi.org/10.1145/3322276.3322331",
      "doi": "10.1145/3322276.3322331"
    },
    {
      "text": "Sarah Foley, John McCarthy, and Nadia Pantidi. 2019. The struggle for recognition in advanced dementia: Implications for experience-centered design. ACM Trans. Comput. Interact. 26, 6 (2019). https://doi.org/10.1145/3359594",
      "doi": ""
    },
    {
      "text": "Sarah Foley, Nadia Pantidi, and John McCarthy. 2019. Care and Design: An Ethnography of Mutual Recognition in the Context of Advanced Dementia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, 1–15. https://doi.org/10.1145/3290605.3300840",
      "doi": "10.1145/3290605.3300840"
    },
    {
      "text": "Sarah Foley, Daniel Welsh, Nadia Pantidi, Kellie Morrissey, Tom Nappey, and John McCarthy. 2019. Printer Pals: Experience-Centered Design to Support Agency for People with Dementia. Proc. 2019 CHI Conf. Hum. Factors Comput. Syst. - CHI ’19 (2019), 1–13. https://doi.org/10.1145/3290605.3300634",
      "doi": "10.1145/3290605.3300634"
    },
    {
      "text": "Vjenka Garms-Homolová, Nanna Notthoff, Anja Declercq, Henriette G. van der Roest, Graziano Onder, Pálmi Jónsson, and Hein van Hout. 2017. Social and functional health of home care clients with different levels of cognitive impairments. Aging Ment. Heal. 21, 1 (2017), 18–23. https://doi.org/10.1080/13607863.2016.1247426",
      "doi": ""
    },
    {
      "text": "Clarissa M Giebel, Caroline Sutcliffe, and David Challis. 2015. Activities of daily living and quality of life across different stages of dementia: a UK study. Aging Ment. Health 19, 1 (2015), 63–71. https://doi.org/10.1080/13607863.2014.915920",
      "doi": ""
    },
    {
      "text": "Tim Gomersall, Louise Nygård, Alex Mihailidis, Andrew Sixsmith, Amy S. Hwang, Annicka Hedman, and Arlene Astell. 2017. Network-based approaches for evaluating ambient assisted living (AAL) technologies. Evaluation 23, 2 (2017), 192–208. https://doi.org/10.1177/1356389017697615",
      "doi": ""
    },
    {
      "text": "Sylwia Górska, Kirsty Forsyth, and Donald Maciver. 2018. Living With Dementia: A Meta-synthesis of Qualitative Research on the Lived Experience. Gerontologist 58, 3 (2018), e180–e196. https://doi.org/10.1093/geront/gnw195",
      "doi": ""
    },
    {
      "text": "Ward de Groot, Gail Kenning, Elise van den Hoven, and Berry Eggen. 2021. Exploring How a Multisensory Media Album Can Support Dementia Care Staff BT - Dementia Lab 2021: Supporting Ability Through Design. 51–61.",
      "doi": ""
    },
    {
      "text": "Nancy Haak. 2002. Understanding Communication. Alzheimers. Care Q. 3, 2 (2002), 116–131. https://doi.org/10.4324/9781315670508",
      "doi": ""
    },
    {
      "text": "Ruth A. Hackett, Andrew Steptoe, Dorina Cadar, and Daisy Fancourt. 2019. Social engagement before and after dementia diagnosis in the English Longitudinal Study of Ageing. PLoS One 14, 8 (2019), 1–12. https://doi.org/10.1371/journal.pone.0220195",
      "doi": ""
    },
    {
      "text": "Caroline Hampson and Karen Morris. 2016. Dementia: Sustaining self in the face of cognitive decline. Geriatr. 1, 4 (2016), 1–6. https://doi.org/10.3390/geriatrics1040025",
      "doi": ""
    },
    {
      "text": "James Hodge, Madeline Balaam, Sandra Hastings, and Kellie Morrissey. 2018. Exploring the Design of Tailored Virtual Reality Experiences for People with Dementia. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18, 1–13. https://doi.org/10.1145/3173574.3174088",
      "doi": "10.1145/3173574.3174088"
    },
    {
      "text": "James Hodge, Sarah Foley, Rens Brankaert, Gail Kenning, Amanda Lazar, Jennifer Boger, and Kellie Morrissey. 2020. Relational, Flexible, Everyday: Learning from Ethics in Dementia Research. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, 1–16. https://doi.org/10.1145/3313831.3376627",
      "doi": "10.1145/3313831.3376627"
    },
    {
      "text": "James Hodge, Kyle Montague, Sandra Hastings, and Kellie Morrissey. 2019. Exploring Media Capture of Meaningful Experiences to Support Families Living with Dementia. (2019), 1–14. https://doi.org/10.1145/3290605.3300653",
      "doi": ""
    },
    {
      "text": "Maarten Houben, Rens Brankaert, Saskia Bakker, Gail Kenning, Inge Bongers, and Berry Eggen. 2019. Foregrounding Everyday Sounds in Dementia. In Proceedings of the 2019 on Designing Interactive Systems Conference - DIS ’19, 71–83. https://doi.org/10.1145/3322276.3322287",
      "doi": "10.1145/3322276.3322287"
    },
    {
      "text": "Maarten Houben, Rens Brankaert, Saskia Bakker, Gail Kenning, Inge Bongers, and Berry Eggen. 2020. The Role of Everyday Sounds in Advanced Dementia Care. Conf. Hum. Factors Comput. Syst. - Proc. (2020), 1–14. https://doi.org/10.1145/3313831.3376577",
      "doi": ""
    },
    {
      "text": "Stephan Huber, Renate Berner, Martina Uhlig, Peter Klein, and Jörn Hurtienne. 2019. Tangible Objects for Reminiscing in Dementia Care. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction - TEI ’19, 15–24. https://doi.org/10.1145/3294109.3295632",
      "doi": "10.1145/3294109.3295632"
    },
    {
      "text": "Alina Huldtgren, Fabian Mertl, Anja Vormann, and Chris Geiger. 2015. Probing the potential of multimedia artefacts to support communication of people with dementia. Lect. Notes Comput. Sci. (including Subser. Lect. Notes Artif. Intell. Lect. Notes Bioinformatics) 9298, (2015), 71–79. https://doi.org/10.1007/978-3-319-22698-9_6",
      "doi": ""
    },
    {
      "text": "Amy S. Hwang, Piper Jackson, Andrew Sixsmith, Louise Nygård, Arlene Astell, Khai N. Truong, and Alex Mihailidis. 2020. Exploring How Persons with Dementia and Care Partners Collaboratively Appropriate Information and Communication Technologies. ACM Trans. Comput. Interact. 27, 6 (2020), 1–38. https://doi.org/10.1145/3389377",
      "doi": "10.1145/3389377"
    },
    {
      "text": "Wijnand IJsselsteijn, Ans Tummers-Heemels, and Rens Brankaert. 2020. Warm Technology: A Novel Perspective on Design for and with People Living with Dementia. In HCI and Design in the Context of Dementia. 33–47. https://doi.org/10.1007/978-3-030-32835-1_3",
      "doi": ""
    },
    {
      "text": "Bridget Johnston and Melanie Narayanasamy. 2016. Exploring psychosocial interventions for people with dementia that enhance personhood and relate to legacy-an integrative review. BMC Geriatr. 16, 1 (2016), 1–25. https://doi.org/10.1186/s12877-016-0250-1",
      "doi": ""
    },
    {
      "text": "Paul Ariel Kenigsberg, Jean Pierre Aquino, Alain Bérard, François Brémond, Kevin Charras, Tom Dening, Rose Marie Droës, Fabrice Gzil, Ben Hicks, Anthea Innes, Sao Mai Nguyen, Louise Nygård, Maribel Pino, Guillaume Sacco, Eric Salmon, Henriëtte van der Roest, Hervé Villet, Marion Villez, Philippe Robert, and Valeria Manera. 2019. Assistive Technologies to Address Capabilities of People with Dementia: From Research to Practice. Dementia 18, 4 (2019), 1568–1595. https://doi.org/10.1177/1471301217714093",
      "doi": ""
    },
    {
      "text": "Paul Ariel Kenigsberg, Jean Pierre Aquino, Alain Bérard, Fabrice Gzil, Sandrine Andrieu, Sube Banerjee, François Brémond, Luc Buée, Jiska Cohen-Mansfield, Francesca Mangialasche, Hervé Platel, Eric Salmon, and Philippe Robert. 2016. Dementia beyond 2025: Knowledge and uncertainties. Dementia 15, 1 (2016), 6–21. https://doi.org/10.1177/1471301215574785",
      "doi": ""
    },
    {
      "text": "Gail Kenning and Cathy Treadaway. 2018. Designing for Dementia: Iterative Grief and Transitional Objects. Des. Issues 34, 1 (January 2018), 42–53. https://doi.org/10.1162/DESI_a_00475",
      "doi": ""
    },
    {
      "text": "Tom Kitwood. 1997. The Experience of Dementia. Aging Ment. Health 1, 1 (February 1997), 13–22. https://doi.org/10.1080/13607869757344",
      "doi": ""
    },
    {
      "text": "Tom Kitwood and Kathleen Bredin. 1992. Towards a theory of dementia care: personhood and well-being. Ageing Soc. 12, (1992), 269–287.",
      "doi": ""
    },
    {
      "text": "Agnieszka Barbara Kolasinska, Myrte Thoolen, Sebastiaan Peek, Yuan Lu, and Rens Brankaert. 2021. Co-creating Design Opportunities for Social Technology in the Context of Dementia. In Dementia Lab 2021: Supporting Ability Through Design, 125–141.",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Caroline Edasis, and Anne Marie Piper. 2017. Supporting people with dementia in digital social sharing. Conf. Hum. Factors Comput. Syst. - Proc. 2017-May, (2017), 2149–2162. https://doi.org/10.1145/3025453.3025586",
      "doi": "10.1145/3025453.3025586"
    },
    {
      "text": "Amanda Lazar, Caroline Edasis, and Anne Marie Piper. 2017. A Critical Lens on Dementia and Design in HCI. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI ’17. https://doi.org/10.1145/3025453.3025522",
      "doi": "10.1145/3025453.3025522"
    },
    {
      "text": "Amanda Lazar, Hilaire J. Thompson, and George Demiris. 2016. Design Recommendations for Recreational Systems Involving Older Adults Living With Dementia. J. Appl. Gerontol. 37, 5 (May 2016), 595–619. https://doi.org/10.1177/0733464816643880",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Hilaire RN. Thompson, and George Demiris. 2014. A Systematic Review of the Use of Technology for Reminiscence Therapy. Heal. Educ. Behav. 41, 1_suppl (2014), 51S-61S. https://doi.org/10.1177/1090198114537067",
      "doi": ""
    },
    {
      "text": "Anthony Martyr, Sharon M. Nelis, Catherine Quinn, Yu Tzu Wu, Ruth A. Lamont, Catherine Henderson, Rachel Clarke, John V. Hindle, Jeanette M. Thom, Ian Rees Jones, Robin G. Morris, Jennifer M. Rusted, Christina R. Victor, and Linda Clare. 2020. Living well with dementia: A systematic review and correlational meta-analysis of factors associated with quality of life, well-being and life satisfaction in people with dementia. Psychol. Med. (2020). https://doi.org/10.1017/S0033291720001713",
      "doi": ""
    },
    {
      "text": "Franka Meiland, Anthea Innes, Gail Mountain, Louise Robinson, Henriëtte van der Roest, J Antonio García-Casal, Dianne Gove, Jochen René Thyrian, Shirley Evans, Rose-Marie Dröes, Fiona Kelly, Alexander Kurz, Dympna Casey, Dorota Szcześniak, Tom Dening, Michael P Craven, Marijke Span, Heike Felzmann, Magda Tsolaki, and Manuel Franco-Martin. 2017. Technologies to Support Community-Dwelling Persons With Dementia: A Position Paper on Issues Regarding Development, Usability, Effectiveness and Cost-Effectiveness, Deployment, and Ethics. JMIR Rehabil. Assist. Technol. 4, 1 (January 2017), e1. https://doi.org/10.2196/rehab.6376",
      "doi": ""
    },
    {
      "text": "Alex Mihailidis, Jennifer N. Boger, Tammy Craig, and Jesse Hoey. 2008. The COACH prompting system to assist older adults with dementia through handwashing: An efficacy study. BMC Geriatr. 8, (2008), 1–18. https://doi.org/10.1186/1471-2318-8-28",
      "doi": ""
    },
    {
      "text": "Kellie Morrissey, John McCarthy, and Nadia Pantidi. 2017. The Value of Experience-Centred Design Approaches in Dementia Research Contexts. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI ’17, 1326–1338. https://doi.org/10.1145/3025453.3025527",
      "doi": "10.1145/3025453.3025527"
    },
    {
      "text": "Kellie Morrissey, Gavin Wood, David Green, Nadia Pantidi, and John McCarthy. 2016. “I'm a rambler, I'm a gambler, I'm a long way from home”: The Place of Props, Music, and Design in Dementia Care. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS ’16, 1008–1020. https://doi.org/10.1145/2901790.2901798",
      "doi": "10.1145/2901790.2901798"
    },
    {
      "text": "Diego Munoz, Stu Favilla, and Sonja Pedell. 2021. Evaluating an app to promote a beter visit through shared activities for people living with dementia and their families. Conf. Hum. Factors Comput. Syst. - Proc. (2021). https://doi.org/10.1145/3411764.3445764",
      "doi": ""
    },
    {
      "text": "Louise Nygård. 2006. How can we get access to the experiences of people with dementia? Scand. J. Occup. Ther. 13, 2 (2006), 101–112. https://doi.org/10.1080/11038120600723190",
      "doi": ""
    },
    {
      "text": "Louise Nygård and Sofia Starkhammar. 2007. The use of everyday technology by people with dementia living alone: Mapping out the difficulties. Aging Ment. Heal. 11, 2 (2007), 144–155. https://doi.org/10.1080/13607860600844168",
      "doi": ""
    },
    {
      "text": "Fredrica Nyqvist, Mima Cattan, Lars Andersson, Anna K. Forsman, and Yngve Gustafson. 2013. Social capital and loneliness among the very old living at home and in institutional settings: A comparative study. J. Aging Health 25, 6 (2013), 1013–1035. https://doi.org/10.1177/0898264313497508",
      "doi": ""
    },
    {
      "text": "Christina Patterson. 2018. World Alzheimer Report 2018. lzheimer's Dis. Int. (2018). https://doi.org/10.1111/j.0033-0124.1950.24_14.x",
      "doi": ""
    },
    {
      "text": "Lisa D. Ravdin and Heather L. Katzen. 2013. Handbook on the neuropsychology of aging and dementia. https://doi.org/10.1007/978-1-4614-3106-0",
      "doi": ""
    },
    {
      "text": "Anke Richters, Rene J.F. Melis, Marcel G.M. Olde Rikkert, and Marjolein A. van der Marck. 2016. The International Dementia Alliance Instrument for Feasible and Valid Staging of Individuals with Dementia by Informal Caregivers. J. Am. Geriatr. Soc. 64, 8 (2016), 1674–1678. https://doi.org/10.1111/jgs.14205",
      "doi": ""
    },
    {
      "text": "Lena Rosenberg and Louise Nygård. 2014. Learning and using technology in intertwined processes: A study of people with mild cognitive impairment or Alzheimer's disease. Dementia 13, 5 (2014), 662–677. https://doi.org/10.1177/1471301213481224",
      "doi": ""
    },
    {
      "text": "Steven R Sabat. 2008. A Bio-Psycho-Social approach to dementia. Excell. Dement. care Res. into Pract. January 2008 (2008), 70–84.",
      "doi": ""
    },
    {
      "text": "Corina Sas, Nigel Davies, Sarah Clinch, Peter Shaw, Mateusz Mikusz, Madeleine Steeds, and Lukas Nohrer. 2020. Supporting Stimulation Needs in Dementia Care through Wall-Sized Displays. Conf. Hum. Factors Comput. Syst. - Proc. (2020), 1–16. https://doi.org/10.1145/3313831.3376361",
      "doi": "10.1145/3313831.3376361"
    },
    {
      "text": "P. Frazer Seymour, Justin Matejka, Geoff Foulds, Ihor Petelycky, and Fraser Anderson. 2017. AMI: An adaptable music interface to support the varying needs of people with dementia. ASSETS 2017 - Proc. 19th Int. ACM SIGACCESS Conf. Comput. Access. (2017), 150–154. https://doi.org/10.1145/3132525",
      "doi": "10.1145/3132525.3132557"
    },
    {
      "text": "Karen Louise Smith, Masashi Crete-Nishihata, Thecla Damianakis, Ronald M. Baecker, and Elsa Marziali. 2009. Multimedia Biographies: A Reminiscence and Social Stimulus Tool for Persons with Cognitive Impairment. J. Technol. Hum. Serv. 27, 4 (November 2009), 287-306[1]Karen Louise Smith, Masashi Crete-Nishi. https://doi.org/10.1080/15228830903329831",
      "doi": ""
    },
    {
      "text": "The Alzheimer's Association. 2020. 2020 Alzheimer's disease facts and figures. Alzheimer's Dement. 16, 3 (March 2020), 391–460. https://doi.org/10.1002/alz.12068",
      "doi": ""
    },
    {
      "text": "Kristine Theurer, W. Ben Mortenson, Robyn Stone, Melinda Suto, Virpi Timonen, and Julia Rozanova. 2015. The need for a social revolution in residential care. J. Aging Stud. 35, (December 2015), 201–210. https://doi.org/10.1016/j.jaging.2015.08.011",
      "doi": ""
    },
    {
      "text": "Myrte Thoolen, Rens Brankaert, and Yuan Lu. 2019. Sentic: A Tailored Interface Design for People with Dementia to Access Music. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion - DIS ’19 Companion, 57–60. https://doi.org/10.1145/3301019.3325152",
      "doi": "10.1145/3301019.3325152"
    },
    {
      "text": "Myrte Thoolen, Rens Brankaert, and Yuan Lu. 2020. Designing Sentic: Participatory Design with People Living with Dementia. In HCI and Design in the Context of Dementia. Springer, Cham, 269–288. https://doi.org/10.1007/978-3-030-32835-1_17",
      "doi": ""
    },
    {
      "text": "Myrte Thoolen, Rens Brankaert, and Yuan Lu. 2020. AmbientEcho: Exploring Interactive Media Experiences in the Context of Residential Dementia Care. In Proceedings of the 2020 ACM Designing Interactive Systems Conference, 1495–1508. https://doi.org/10.1145/3357236.3395432",
      "doi": "10.1145/3357236.3395432"
    },
    {
      "text": "Oscar Tranvåg, Karin Anna Petersen, and Dagfinn Nåden. 2015. Relational interactions preserving dignity experience: Perceptions of persons living with dementia. Nurs. Ethics 22, 5 (2015), 577–593. https://doi.org/10.1177/0969733014549882",
      "doi": ""
    },
    {
      "text": "Tom Tullis, Bill Albert, Tom Tullis, and Bill Albert. 2008. Chapter 6 – Self-Reported Metrics. Meas. User Exp. (2008), 123–166.",
      "doi": ""
    },
    {
      "text": "David Unbehaun, Konstantin Aal, Daryoush Daniel Vaziri, Peter David Tolmie, Rainer Wieching, David Randall, and Volker Wulf. 2020. Social Technology Appropriation in Dementia: Investigating the Role of Caregivers in Engaging People with Dementia with a Videogame-based Training System. Conf. Hum. Factors Comput. Syst. - Proc. (2020), 1–15. https://doi.org/10.1145/3313831.3376648",
      "doi": "10.1145/3313831.3376648"
    },
    {
      "text": "Jayne Wallace, Anja Thieme, Gavin Wood, Guy Schofield, and Patrick Olivier. 2012. Enabling Self, Intimacy and a Sense of Home in Dementia. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12, 2629. https://doi.org/10.1145/2207676.2208654",
      "doi": "10.1145/2207676.2208654"
    },
    {
      "text": "Jayne Wallace, Peter C. Wright, John McCarthy, David Philip Green, James Thomas, and Patrick Olivier. 2013. A Design-led Inquiry into Personhood in Dementia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’13, 2617. https://doi.org/10.1145/2470654.2481363",
      "doi": "10.1145/2470654.2481363"
    },
    {
      "text": "Joseph Webb. 2017. Conversation takes two: understanding interactions with people with dementia. Disabil. Soc. 32, 7 (2017), 1102–1106. https://doi.org/10.1080/09687599.2017.1321225",
      "doi": ""
    },
    {
      "text": "Daniel Welsh, Kellie Morrissey, Sarah Foley, Roisin McNaney, Christos Salis, John McCarthy, and John Vines. 2018. Ticket to Talk: Supporting Conversation between Young People and People with Dementia through Digital Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18 (CHI ’18), 1–14. https://doi.org/10.1145/3173574.3173949",
      "doi": "10.1145/3173574.3173949"
    },
    {
      "text": "Els van Wijngaarden, Manna Alma, and Anne Mei The. 2019. ‘The eyes of others’ are what really matters: The experience of living with dementia from an insider perspective. PLoS One 14, 4 (2019). https://doi.org/10.1371/journal.pone.0214724",
      "doi": ""
    },
    {
      "text": "Alison Wray. 2020. The Dynamics of Dementia Communication. Oxford University Press. https://doi.org/10.1093/oso/9780190917807.001.0001",
      "doi": ""
    }
  ]
}