{
  "doi": "10.1145/3491102.3501998",
  "title": "Model Positionality and Computational Reflexivity: Promoting Reflexivity in Data Science",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Data science and machine learning provide indispensable techniques for understanding phenomena at scale, but the discretionary choices made when doing this work are often not recognized. Drawing from qualitative research practices, we describe how the concepts of positionality and reflexivity can be adapted to provide a framework for understanding, discussing, and disclosing the discretionary choices and subjectivity inherent to data science work. We first introduce the concepts of model positionality and computational reflexivity that can help data scientists to reflect on and communicate the social and cultural context of a model’s development and use, the data annotators and their annotations, and the data scientists themselves. We then describe the unique challenges of adapting these concepts for data science work and offer annotator fingerprinting and position mining as promising solutions. Finally, we demonstrate these techniques in a case study of the development of classifiers for toxic commenting in online communities.",
  "tags": [
    "critical data studies",
    "position mining",
    "annotator fingerprinting",
    "Computational reflexivity",
    "human-centered data science",
    "data science",
    "human-centered machine learning",
    "model positionality"
  ],
  "authors": [
    {
      "name": "Scott Allen Cambo",
      "institution": "Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659080799",
      "orcid": "missing"
    },
    {
      "name": "Darren Gergle",
      "institution": "Northwestern University, United States",
      "img": "/do/10.1145/contrib-81100246470/rel-imgonly/gergle-darren.jpg",
      "acmid": "81100246470",
      "orcid": "0000-0003-4052-0214"
    }
  ],
  "references": [
    {
      "text": "Sweta Agrawal and Amit Awekar. 2018. Deep Learning for Detecting Cyberbullying Across Multiple Social Media Platforms. In Advances in Information Retrieval (2018) (Lecture Notes in Computer Science), Gabriella Pasi, Benjamin Piwowarski, Leif Azzopardi, and Allan Hanbury (Eds.). Springer International Publishing, 141–153.",
      "doi": ""
    },
    {
      "text": "M. A. Al-Ajlan and M. Ykhlef. 2018. Optimized Twitter Cyberbullying Detection based on Deep Learning. In 2018 21st Saudi Computer Society National Computer Conference (NCC) (2018-04). 1–5. https://doi.org/10.1109/NCG.2018.8593146",
      "doi": ""
    },
    {
      "text": "Ali Alkhatib and Michael Bernstein. 2019. Street-Level Algorithms: A Theory at the Gaps Between Policy and Decisions. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300760",
      "doi": ""
    },
    {
      "text": "McKane Andrus, Elena Spitzer, Jeffrey Brown, and Alice Xiang. 2021. What We Can’t Measure, We Can’t Understand: Challenges to Demographic Data Procurement in the Pursuit of Fairness. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency (Virtual Event, Canada) (FAccT ’21). Association for Computing Machinery, New York, NY, USA, 249–260. https://doi.org/10.1145/3442188.3445888",
      "doi": "10.1145/3442188.3445888"
    },
    {
      "text": "Cecilia Aragon, Clayton Hutto, Andy Echenique, Brittany Fiore-Gartland, Yun Huang, Jinyoung Kim, Gina Neff, Wanli Xing, and Joseph Bayer. 2016. Developing a Research Agenda for Human-Centered Data Science. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion - CSCW ’16 Companion (San Francisco, California, USA, 2016). ACM Press, 529–535. https://doi.org/10.1145/2818052.2855518",
      "doi": "10.1145/2818052.2855518"
    },
    {
      "text": "Lora Aroyo, Lucas Dixon, Nithum Thain, Olivia Redfield, and Rachel Rosen. 2019. Crowdsourcing Subjective Tasks: The Case Study of Understanding Toxicity in Online Discussions. In Companion Proceedings of The 2019 World Wide Web Conference (New York, NY, USA, 2019) (WWW ’19). ACM, 1100–1105. https://doi.org/10.1145/3308560.3317083",
      "doi": "10.1145/3308560.3317083"
    },
    {
      "text": "Lora Aroyo and Chris Welty. 2013. Harnessing disagreement in crowdsourcing a relation extraction gold standard. In IBM Research Report (2013-04-23). IBM, 11. https://dominoweb.draco.res.ibm.com/reports/rc25371.pdf",
      "doi": ""
    },
    {
      "text": "Lora Aroyo and Chris Welty. 2014. The Three Sides of CrowdTruth. 1, 1 (2014). https://doi.org/10.15346/hc.v1i1.3",
      "doi": ""
    },
    {
      "text": "Lora Aroyo and Chris Welty. 2015. Truth Is a Lie: Crowd Truth and the Seven Myths of Human Annotation. 36, 1 (2015), 15–24. https://doi.org/10.1609/aimag.v36i1.2564",
      "doi": ""
    },
    {
      "text": "Pinkesh Badjatiya, Shashank Gupta, Manish Gupta, and Vasudeva Varma. 2017. Deep Learning for Hate Speech Detection in Tweets. In Proceedings of the 26th International Conference on World Wide Web Companion (Republic and Canton of Geneva, Switzerland, 2017) (WWW ’17 Companion). International World Wide Web Conferences Steering Committee, 759–760. https://doi.org/10.1145/3041021.3054223",
      "doi": "10.1145/3041021.3054223"
    },
    {
      "text": "Jo Bates, David Cameron, Alessandro Checco, Paul Clough, Frank Hopfgartner, Suvodeep Mazumdar, Laura Sbaffi, Peter Stordy, and Antonio de la Vega de León. 2020. Integrating FATE/critical data studies into data science curricula: where are we going and how do we get there?. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency (New York, NY, USA, 2020-01-27) (FAT* ’20). Association for Computing Machinery, 425–435. https://doi.org/10.1145/3351095.3372832",
      "doi": "10.1145/3351095.3372832"
    },
    {
      "text": "Eric PS Baumer, David Mimno, Shion Guha, Emily Quan, and Geri K Gay. 2017. Comparing grounded theory and topic modeling: Extreme divergence or unlikely convergence?Journal of the Association for Information Science and Technology 68, 6(2017), 1397–1410.",
      "doi": ""
    },
    {
      "text": "Emily M. Bender, Timnit Gebru, Angelina McMillan-Major, and Shmargaret Shmitchell. 2021. On the Dangers of Stochastic Parrots: Can Language Models Be Too Big?. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency (Virtual Event, Canada) (FAccT ’21). Association for Computing Machinery, New York, NY, USA, 610–623. https://doi.org/10.1145/3442188.3445922",
      "doi": "10.1145/3442188.3445922"
    },
    {
      "text": "Reuben Binns, Michael Veale, Max Van Kleek, and Nigel Shadbolt. 2017. Like trainer, like bot? Inheritance of bias in algorithmic content moderation. 10540 (2017), 405–415. https://doi.org/10.1007/978-3-319-67256-4_32 arxiv:1707.01477",
      "doi": ""
    },
    {
      "text": "David M. Blei, Andrew Y. Ng, and Michael I. Jordan. 2003. Latent Dirichlet Allocation. J. Mach. Learn. Res. 3, null (March 2003), 993–1022.",
      "doi": ""
    },
    {
      "text": "Victoria Bobicev and Marina Sokolova. 2017. Inter-Annotator Agreement in Sentiment Analysis: Machine Learning Perspective. In RANLP 2017 - Recent Advances in Natural Language Processing Meet Deep Learning (2017-11-10). Incoma Ltd. Shoumen, Bulgaria, 97–102. https://doi.org/10.26615/978-954-452-049-6_015",
      "doi": ""
    },
    {
      "text": "Peter Bourgonje, Julian Moreno-Schneider, Ankit Srivastava, and Georg Rehm. 2018. Automatic Classification of Abusive Language and Personal Attacks in Various Forms of Online Communication. In Language Technologies for the Challenges of the Digital Age (2018) (Lecture Notes in Computer Science), Georg Rehm and Thierry Declerck (Eds.). Springer International Publishing, 180–191.",
      "doi": ""
    },
    {
      "text": "danah boyd and Kate Crawford. 2012. CRITICAL QUESTIONS FOR BIG DATA: Provocations for a cultural, technological, and scholarly phenomenon. Information, Communication & Society 15, 5 (June 2012), 662–679. https://doi.org/10.1080/1369118X.2012.678878",
      "doi": ""
    },
    {
      "text": "Scott Allen Cambo. 2020. Model Positionality: A Novel Framework for Data Science with Subjective Target Concepts. Ph.D. Dissertation. Northwestern University, ProQuest Dissertations Publishing.",
      "doi": ""
    },
    {
      "text": "Scott Allen Cambo and Darren Gergle. 2018. User-Centred Evaluation for Machine Learning. In Human and Machine Learning: Visible, Explainable, Trustworthy and Transparent, Jianlong Zhou and Fang Chen (Eds.). Springer International Publishing, 315–339. https://doi.org/10.1007/978-3-319-90403-0_16",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Michael L. Birnbaum, Eric D. Caine, Vincent M. B. Silenzio, and Munmun De Choudhury. 2019. A Taxonomy of Ethical Tensions in Inferring Mental Health States from Social Media. In Proceedings of the Conference on Fairness, Accountability, and Transparency - FAT* ’19(Atlanta, GA, USA, 2019). ACM Press, 79–88. https://doi.org/10.1145/3287560.3287587",
      "doi": "10.1145/3287560.3287587"
    },
    {
      "text": "Justin Cheng, Cristian Danescu-Niculescu-Mizil, and Jure Leskovec. 2015. Antisocial Behavior in Online Discussion Communities. (2015). arxiv:1504.00680http://arxiv.org/abs/1504.00680",
      "doi": ""
    },
    {
      "text": "David Coghlan and Mary Brydon-Miller. 2014. Positionality. SAGE Publications Ltd. https://doi.org/10.4135/9781446294406.n277",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1968. Weighted kappa: Nominal scale agreement provision for scaled disagreement or partial credit. 70, 4 (1968), 213–220. https://doi.org/10.1037/h0026256",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1988. Statistical power analysis for the behavioral sciences (2nd ed ed.). L. Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Craig Dalton and Jim Thatcher. 2014. What does a critical data studies look like, and why do we care? Seven points for a critical approach to ‘big data’. Society and Space 29(2014).",
      "doi": ""
    },
    {
      "text": "Thomas Davidson, Dana Warmsley, Michael Macy, and Ingmar Weber. 2017. Automated Hate Speech Detection and the Problem of Offensive Language. (2017). arxiv:1703.04009http://arxiv.org/abs/1703.04009",
      "doi": ""
    },
    {
      "text": "Catherine D’Ignazio and Lauren F. Klein. 2020. Data feminism. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Karthik Dinakar, Roi Reichart, and Henry Lieberman. 2011. Modeling the Detection of Textual Cyberbullying. In Fifth International AAAI Conference on Weblogs and Social Media (2011-07-06). https://www.aaai.org/ocs/index.php/ICWSM/ICWSM11/paper/view/3841",
      "doi": ""
    },
    {
      "text": "Lucas Dixon. 2019. Perspective API. https://github.com/conversationai/perspectiveapi original-date: 2017-02-23T10:55:14Z.",
      "doi": ""
    },
    {
      "text": "Lucas Dixon, John Li, Jeffrey Sorensen, Nithum Thain, and Lucy Vasserman. 2018. Measuring and Mitigating Unintended Bias in Text Classification. In Proceedings of the 2018 AAAI/ACM Conference on AI, Ethics, and Society - AIES ’18 (New Orleans, LA, USA, 2018). ACM Press, 67–73. https://doi.org/10.1145/3278721.3278729",
      "doi": "10.1145/3278721.3278729"
    },
    {
      "text": "Pierre Dragicevic, Yvonne Jansen, Abhraneel Sarma, Matthew Kay, and Fanny Chevalier. 2019. Increasing the Transparency of Research Papers with Explorable Multiverse Analyses. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300295",
      "doi": ""
    },
    {
      "text": "Maeve Duggan. 2014. Online Harassment. (2014), 65. https://www.pewresearch.org/internet/2014/10/22/online-harassment/",
      "doi": ""
    },
    {
      "text": "Maeve Duggan. 2017. Online Harassment 2017 | Pew Research Center. http://www.pewinternet.org/2017/07/11/online-harassment-2017/",
      "doi": ""
    },
    {
      "text": "Anca Dumitrache, Lora Aroyo, and Chris Welty. 2018. Crowdsourcing Semantic Label Propagation in Relation Classification. (2018). arxiv:1809.00537http://arxiv.org/abs/1809.00537",
      "doi": ""
    },
    {
      "text": "Anca Dumitrache, Oana Inel, Lora Aroyo, Benjamin Timmermans, and Chris Welty. 2018. CrowdTruth 2.0: Quality Metrics for Crowdsourcing with Disagreement. (2018). arxiv:1808.06080http://arxiv.org/abs/1808.06080",
      "doi": ""
    },
    {
      "text": "M. C. Elish and danah boyd. 2018. Situating methods in the magic of Big Data and AI. Communication Monographs 85, 1 (Jan. 2018), 57–80. https://doi.org/10.1080/03637751.2017.1375130",
      "doi": ""
    },
    {
      "text": "Mai ElSherief, Shirin Nilizadeh, Dana Nguyen, Giovanni Vigna, and Elizabeth Belding. 2018. Peer to Peer Hate: Hate Speech Instigators and Their Targets. In Twelfth International AAAI Conference on Web and Social Media. https://www.aaai.org/ocs/index.php/ICWSM/ICWSM18/paper/view/17905",
      "doi": ""
    },
    {
      "text": "Ethan Fast, Binbin Chen, and Michael Bernstein. 2016. Empath: Understanding Topic Signals in Large-Scale Text. (2016), 4647–4657. https://doi.org/10.1145/2858036.2858535 arxiv:1602.06979",
      "doi": "10.1145/2858036.2858535"
    },
    {
      "text": "Rebecca Fiebrink and Marco Gillies. 2018. Introduction to the Special Issue on Human-Centered Machine Learning. 8, 2 (2018), 7:1–7:7. https://doi.org/10.1145/3205942",
      "doi": "10.1145/3205942"
    },
    {
      "text": "Timnit Gebru, Jamie Morgenstern, Briana Vecchione, Jennifer Wortman Vaughan, Hanna Wallach, Hal Daumé III, and Kate Crawford. 2020. Datasheets for Datasets. (2020). arxiv:1803.09010http://arxiv.org/abs/1803.09010",
      "doi": ""
    },
    {
      "text": "Andrew Gelman and Eric Loken. 2013. The garden of forking paths: Why multiple comparisons can be a problem, even when there is no “fishing expedition” or “p-hacking” and the research hypothesis was posited ahead of time. (2013).",
      "doi": ""
    },
    {
      "text": "Marco Gillies, Rebecca Fiebrink, Atau Tanaka, Jérémie Garcia, Frédéric Bevilacqua, Alexis Heloir, Fabrizio Nunnari, Wendy Mackay, Saleema Amershi, Bongshin Lee, Nicolas d’Alessandro, Joëlle Tilmanne, Todd Kulesza, and Baptiste Caramiaux. 2016. Human-Centred Machine Learning. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA, 2016-05-07) (CHI EA ’16). Association for Computing Machinery, 3558–3565. https://doi.org/10.1145/2851581.2856492",
      "doi": "10.1145/2851581.2856492"
    },
    {
      "text": "B. Green. 2019. “Good” isn’t good enough. In Proceedings of the AI for Social Good workshop at NeurIPS (2019).",
      "doi": ""
    },
    {
      "text": "Carlos Guestrin. 2019. 4 Systems Perspectives into Human-Centered Machine Learning. In The 25th Annual International Conference on Mobile Computing and Networking (Los Cabos, Mexico, 2019-10-11) (MobiCom ’19). Association for Computing Machinery, 1–2. https://doi.org/10.1145/3300061.3356017",
      "doi": "10.1145/3300061.3356017"
    },
    {
      "text": "Donna Haraway. 1988. Situated Knowledges: The Science Question in Feminism and the Privilege of Partial Perspective. 14, 3 (1988), 575. https://doi.org/10.2307/3178066",
      "doi": ""
    },
    {
      "text": "Christoph Hube, Besnik Fetahu, and Ujwal Gadiraju. 2019. Understanding and Mitigating Worker Biases in the Crowdsourced Collection of Subjective Judgments. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300637",
      "doi": ""
    },
    {
      "text": "Andrew Iliadis and Federica Russo. 2016. Critical data studies: An introduction. Big Data & Society 3, 2 (Dec. 2016), 205395171667423. https://doi.org/10.1177/2053951716674238",
      "doi": ""
    },
    {
      "text": "Oana Inel, Khalid Khamkham, Tatiana Cristea, Anca Dumitrache, Arne Rutjes, Jelle van der Ploeg, Lukasz Romaszko, Lora Aroyo, and Robert-Jan Sips. 2014. CrowdTruth: Machine-Human Computation Framework for Harnessing Disagreement in Gathering Annotated Data. In The Semantic Web – ISWC 2014, Peter Mika, Tania Tudorache, Abraham Bernstein, Chris Welty, Craig Knoblock, Denny Vrandečić, Paul Groth, Natasha Noy, Krzysztof Janowicz, and Carole Goble (Eds.). Vol. 8797. Springer International Publishing, 486–504. https://doi.org/10.1007/978-3-319-11915-1_31",
      "doi": ""
    },
    {
      "text": "Frank J. Massey Jr. 1951. The Kolmogorov-Smirnov Test for Goodness of Fit. 46, 253 (1951), 68–78. https://doi.org/10.1080/01621459.1951.10500769 Publisher: Taylor & Francis _eprint: https://www.tandfonline.com/doi/pdf/10.1080/01621459.1951.10500769.",
      "doi": ""
    },
    {
      "text": "Kaggle. 2019. Jigsaw Unintended Bias in Toxicity Classification | Kaggle. https://www.kaggle.com/c/jigsaw-unintended-bias-in-toxicity-classification",
      "doi": ""
    },
    {
      "text": "Alex Knapp. 2012. Kaggle Aims To Connect Companies With Successful Data Scientists. https://www.forbes.com/sites/alexknapp/2013/03/06/kaggle-aims-to-connect-companies-with-successful-data-scientists/",
      "doi": ""
    },
    {
      "text": "Marina Kogan, Aaron Halfaker, Shion Guha, Cecilia Aragon, Michael Muller, and Stuart Geiger. 2020. Mapping Out Human-Centered Data Science: Methods, Approaches, and Best Practices. In Companion of the 2020 ACM International Conference on Supporting Group Work (Sanibel Island, Florida, USA) (GROUP ’20). Association for Computing Machinery, New York, NY, USA, 151–156. https://doi.org/10.1145/3323994.3369898",
      "doi": "10.1145/3323994.3369898"
    },
    {
      "text": "Klaus Krippendorff. 2011. Computing Krippendorff’s Alpha-Reliability. (2011). https://repository.upenn.edu/asc_papers/43",
      "doi": ""
    },
    {
      "text": "Klaus Krippendorff. 2018. Content analysis: An introduction to its methodology. Sage publications.",
      "doi": ""
    },
    {
      "text": "Chris Lindner. 2018. Where do Data Scientists Come From?https://medium.com/indeed-engineering/where-do-data-scientists-come-from-fc526023ace",
      "doi": ""
    },
    {
      "text": "Scott M Lundberg and Su-In Lee. [n.d.]. A Unified Approach to Interpreting Model Predictions. In Advances in Neural Information Processing Systems 30, I. Guyon, U. V. Luxburg, S. Bengio, H. Wallach, R. Fergus, S. Vishwanathan, and R. Garnett (Eds.). Curran Associates, Inc., 4765–4774. http://papers.nips.cc/paper/7062-a-unified-approach-to-interpreting-model-predictions.pdf",
      "doi": ""
    },
    {
      "text": "Annette Markham. 2017. Reflexivity: Some techniques for interpretive researchers. https://annettemarkham.com/2017/02/reflexivity-for-interpretive-researchers/",
      "doi": ""
    },
    {
      "text": "Leland McInnes, John Healy, and James Melville. 2018. UMAP: Uniform Manifold Approximation and Projection for Dimension Reduction. (2018). arxiv:1802.03426http://arxiv.org/abs/1802.03426",
      "doi": ""
    },
    {
      "text": "Milagros Miceli, Tianling Yang, Laurens Naudts, Martin Schuessler, Diana Serbanescu, and Alex Hanna. 2021. Documenting Computer Vision Datasets: An Invitation to Reflexive Data Practices. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency (Virtual Event, Canada) (FAccT ’21). Association for Computing Machinery, New York, NY, USA, 161–172. https://doi.org/10.1145/3442188.3445880",
      "doi": "10.1145/3442188.3445880"
    },
    {
      "text": "Margaret Mitchell, Simone Wu, Andrew Zaldivar, Parker Barnes, Lucy Vasserman, Ben Hutchinson, Elena Spitzer, Inioluwa Deborah Raji, and Timnit Gebru. 2019. Model Cards for Model Reporting. In Proceedings of the Conference on Fairness, Accountability, and Transparency (New York, NY, USA, 2019) (FAT* ’19). ACM, 220–229. https://doi.org/10.1145/3287560.3287596",
      "doi": "10.1145/3287560.3287596"
    },
    {
      "text": "Michael Muller, Cecilia Aragon, Shion Guha, Marina Kogan, Gina Neff, Cathrine Seidelin, Katie Shilton, and Anissa Tanweer. 2020. Interrogating Data Science. Association for Computing Machinery, New York, NY, USA, 467–473. https://doi.org/10.1145/3406865.3418584",
      "doi": ""
    },
    {
      "text": "Michael Muller, Melanie Feinberg, Timothy George, Steven J. Jackson, Bonnie E. John, Mary Beth Kery, and Samir Passi. 2019. Human-Centered Study of Data Science Work Practices. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3290607.3299018",
      "doi": "10.1145/3290607.3299018"
    },
    {
      "text": "Michael Muller, Shion Guha, Eric P.S. Baumer, David Mimno, and N. Sadat Shami. 2016. Machine Learning and Grounded Theory Method: Convergence, Divergence, and Combination. In Proceedings of the 19th International Conference on Supporting Group Work (Sanibel Island, Florida, USA, 2016-11-13) (GROUP ’16). Association for Computing Machinery, 3–8. https://doi.org/10.1145/2957276.2957280",
      "doi": "10.1145/2957276.2957280"
    },
    {
      "text": "Chikashi Nobata, Joel Tetreault, Achint Thomas, Yashar Mehdad, and Yi Chang. 2016. Abusive Language Detection in Online User Content. In Proceedings of the 25th International Conference on World Wide Web (Republic and Canton of Geneva, Switzerland, 2016) (WWW ’16). International World Wide Web Conferences Steering Committee, 145–153. https://doi.org/10.1145/2872427.2883062",
      "doi": "10.1145/2872427.2883062"
    },
    {
      "text": "Brendan O’Connor, David Bamman, and Noah A Smith. 2011. Computational text analysis for social science: Model complexity and assumptions. In Proc. of the NIPS Workshop on Comptuational Social Science and the Wisdom of Crowds.",
      "doi": ""
    },
    {
      "text": "Scott E. Page. 2018. Why “Many-Model Thinkers” Make Better Decisions. (2018). https://hbr.org/2018/11/why-many-model-thinkers-make-better-decisions",
      "doi": ""
    },
    {
      "text": "Samir Passi and Solon Barocas. 2019. Problem Formulation and Fairness. In Proceedings of the Conference on Fairness, Accountability, and Transparency (New York, NY, USA, 2019) (FAT* ’19). ACM, 39–48. https://doi.org/10.1145/3287560.3287567",
      "doi": "10.1145/3287560.3287567"
    },
    {
      "text": "Samir Passi and Steven Jackson. 2017. Data Vision: Learning to See Through Algorithmic Abstraction. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (New York, NY, USA, 2017) (CSCW ’17). ACM, 2436–2447. https://doi.org/10.1145/2998181.2998331",
      "doi": "10.1145/2998181.2998331"
    },
    {
      "text": "Samir Passi and Steven J. Jackson. 2018. Trust in Data Science: Collaboration, Translation, and Accountability in Corporate Data Science Projects. 2 (2018), 1–28. Issue CSCW. https://doi.org/10.1145/3274405",
      "doi": ""
    },
    {
      "text": "John Pavlopoulos, Prodromos Malakasiotis, and Ion Androutsopoulos. 2017. Deep Learning for User Comment Moderation. (2017). arxiv:1705.09993http://arxiv.org/abs/1705.09993",
      "doi": ""
    },
    {
      "text": "John Pavlopoulos, Prodromos Malakasiotis, and Ion Androutsopoulos. 2017. Deeper Attention to Abusive User Content Moderation. In Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing (Copenhagen, Denmark, 2017). Association for Computational Linguistics, 1125–1135. https://doi.org/10.18653/v1/D17-1117",
      "doi": ""
    },
    {
      "text": "Marco Tulio Ribeiro, Sameer Singh, and Carlos Guestrin. 2016. ” Why should i trust you?” Explaining the predictions of any classifier. In Proceedings of the 22nd ACM SIGKDD international conference on knowledge discovery and data mining. 1135–1144.",
      "doi": "10.1145/2939672.2939778"
    },
    {
      "text": "Guy Rosen. 2018. Facebook Publishes Enforcement Numbers for the First Time | Facebook Newsroom. https://newsroom.fb.com/news/2018/05/enforcement-numbers/",
      "doi": ""
    },
    {
      "text": "Peter J. Rousseeuw. 1987. Silhouettes: A graphical aid to the interpretation and validation of cluster analysis. 20 (1987), 53–65. https://doi.org/10.1016/0377-0427(87)90125-7",
      "doi": ""
    },
    {
      "text": "Jeffrey M. Rzeszotarski and Aniket Kittur. 2011. Instrumenting the crowd: using implicit behavioral measures to predict task performance. In Proceedings of the 24th annual ACM symposium on User interface software and technology (Santa Barbara, California, USA, 2011-10-16) (UIST ’11). Association for Computing Machinery, 13–22. https://doi.org/10.1145/2047196.2047199",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Shivani Kapania, Hannah Highfill, Diana Akrong, Praveen Paritosh, and Lora M Aroyo. 2021. “Everyone Wants to Do the Model Work, Not the Data Work”: Data Cascades in High-Stakes AI. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445518",
      "doi": "10.1145/3411764.3445518"
    },
    {
      "text": "Maarten Sap, Dallas Card, Saadia Gabriel, Yejin Choi, and Noah A. Smith. 2019. The Risk of Racial Bias in Hate Speech Detection. In Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics (Florence, Italy, 2019). Association for Computational Linguistics, 1668–1678. https://doi.org/10.18653/v1/P19-1163",
      "doi": ""
    },
    {
      "text": "Maggi Savin-Baden and Claire Howell Major. 2012. Qualitative research: the essential guide to theory and practice. Routledge.",
      "doi": ""
    },
    {
      "text": "Erich Schubert, Jörg Sander, Martin Ester, Hans Peter Kriegel, and Xiaowei Xu. 2017. DBSCAN Revisited, Revisited: Why and How You Should (Still) Use DBSCAN. 42, 3 (2017), 1–21. https://doi.org/10.1145/3068335",
      "doi": ""
    },
    {
      "text": "D. Sculley and Bradley M. Pasanek. 2008. Meaning and mining: the impact of implicit assumptions in data mining for the humanities. Literary and Linguistic Computing 23, 4 (09 2008), 409–424. https://doi.org/10.1093/llc/fqn019 arXiv:https://academic.oup.com/dsh/article-pdf/23/4/409/3490781/fqn019.pdf",
      "doi": ""
    },
    {
      "text": "Aaron Smith and Maeve Duggan. 2018. Online Harassment: What Americans Consider Crossing the Line. https://www.pewinternet.org/2018/01/04/crossing-the-line-what-counts-as-online-harassment/",
      "doi": ""
    },
    {
      "text": "Guillermo Soberón, Lora Aroyo, Chris Welty, Oana Inel, Hui Lin, and Manfred Overmeen. 2013. Measuring crowd truth: disagreement metrics combined with worker behavior filters. In Proceedings of the 1st International Conference on Crowdsourcing the Semantic Web - Volume 1030 (Sydney, Australia, 2013-10-19) (CrowdSem’13). CEUR-WS.org, 45–58.",
      "doi": ""
    },
    {
      "text": "Sara Owsley Sood, Elizabeth F. Churchill, and Judd Antin. 2012. Automatic identification of personal insults on social news sites. 63, 2 (2012), 270–285. https://doi.org/10.1002/asi.21690",
      "doi": ""
    },
    {
      "text": "Sara Steegen, Francis Tuerlinckx, Andrew Gelman, and Wolf Vanpaemel. 2016. Increasing Transparency Through a Multiverse Analysis. 11, 5 (2016), 702–712. https://doi.org/10.1177/1745691616658637",
      "doi": ""
    },
    {
      "text": "Harini Suresh and John V Guttag. 2019. A framework for understanding unintended consequences of machine learning. arXiv preprint arXiv:1901.10002(2019).",
      "doi": ""
    },
    {
      "text": "Anissa Tanweer, Emily Kalah Gade, P.M. Krafft, and Sarah K. Dreier. 2021. Why the Data Revolution Needs Qualitative Thinking. Harvard Data Science Review (30 7 2021). https://doi.org/10.1162/99608f92.eee0b0da https://hdsr.mitpress.mit.edu/pub/u9s6f22y.",
      "doi": ""
    },
    {
      "text": "Yuan-Kai Wang. 2004. Context awareness and adaptation in mobile learning. In Wireless and Mobile Technologies in Education, 2004. Proceedings. The 2nd IEEE International Workshop on (2004). IEEE, 154–158.",
      "doi": ""
    },
    {
      "text": "William Warner and Julia Hirschberg. 2012. Detecting Hate Speech on the World Wide Web. In Proceedings of the Second Workshop on Language in Social Media (Montréal, Canada, 2012-06). Association for Computational Linguistics, 19–26. http://www.aclweb.org/anthology/W12-2103",
      "doi": ""
    },
    {
      "text": "Kyle Wiggers. 2020. COVID-19 vaccine distribution algorithms may cement health care inequalities. https://venturebeat.com/2020/12/19/covid-19-vaccine-distribution-algorithms-may-cement-health-care-inequalities/",
      "doi": ""
    },
    {
      "text": "Ellery Wulczyn, Nithum Thain, and Lucas Dixon. 2017. Wikipedia Talk Labels: Aggression. https://doi.org/10.6084/m9.figshare.4267550.v5 type: dataset.",
      "doi": ""
    },
    {
      "text": "Ellery Wulczyn, Nithum Thain, and Lucas Dixon. 2017. Wikipedia Talk Labels: Personal Attacks. https://doi.org/10.6084/m9.figshare.4054689.v6 type: dataset.",
      "doi": ""
    },
    {
      "text": "Ellery Wulczyn, Nithum Thain, and Lucas Dixon. 2017. Ex Machina: Personal Attacks Seen at Scale. In Proceedings of the 26th International Conference on World Wide Web (Republic and Canton of Geneva, Switzerland, 2017) (WWW ’17). International World Wide Web Conferences Steering Committee, 1391–1399. https://doi.org/10.1145/3038912.3052591",
      "doi": "10.1145/3038912.3052591"
    },
    {
      "text": "Dawei Yin, Zhenzhen Xue, and Liangjie Hong. 2009. Detection of Harassment on Web 2.0. (2009), 7.",
      "doi": ""
    }
  ]
}