{
  "doi": "10.1145/3491102.3501950",
  "title": "Embodied Negotiations, Practices and Experiences Interacting with Pregnancy Care Infrastructures in South India",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-21",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Behavior change and improving health literacy based on normative ideals of motherhood is a dominant paradigm to address maternal health challenges. However, these ideals often remove women's control over their bodies overlooking how the bodily experiences of pregnancy are socially and culturally constructed. We report on 27 interviews with pregnant women and nursing mothers in rural and semi-urban areas of South India, and six focus groups with 23 frontline health workers as secondary data. We explore how the embodied pregnancy experiences are influenced and negotiated by the socio-cultural context and existing care infrastructures. Our findings highlight how the ways of seeing, knowing, and caring for a body of a pregnant woman through often conflicting norms, beliefs and practices of medicine, nourishment and care actively shape the experiences of pregnancy. We open up a space for novel opportunities for digital health technologies to enhance women's embodied experiences and pregnancy care infrastructures in the Global South.",
  "tags": [
    "South India",
    "care infrastructures",
    "HCI4D",
    "Maternal health",
    "embodied experiences",
    "negotiation",
    "challenges",
    "pregnancy care",
    "digital health"
  ],
  "authors": [
    {
      "name": "Naveen Bagalkot",
      "institution": "Srishti Manipal Institute of Art, Design and Technology, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472655605",
      "orcid": "missing"
    },
    {
      "name": "Syeda Zainab Akbar",
      "institution": "Microsoft Research, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659541988",
      "orcid": "missing"
    },
    {
      "name": "Swati Sharma",
      "institution": "Srishti Manipal Institute of Art, Design and Technology, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659697891",
      "orcid": "missing"
    },
    {
      "name": "Nicola Mackintosh",
      "institution": "Department of Health Sciences, University of Leicester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659342694",
      "orcid": "missing"
    },
    {
      "name": "Deirdre Harrington",
      "institution": "School of Psychological Sciences and Health, University of Strathclyde, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659343345",
      "orcid": "missing"
    },
    {
      "name": "Paula Griffiths",
      "institution": "School of Sport, Exercise and Health Sciences, Loughborough University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659342591",
      "orcid": "missing"
    },
    {
      "name": "Judith Angelitta Noronha",
      "institution": "Manipal College of Nursing, Department of Obstetrical and Gynaecological Nursing, Manipal Academy of Higher Education, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659342337",
      "orcid": "missing"
    },
    {
      "name": "Nervo Verdezoto",
      "institution": "School of Computer Science and Informatics, Cardiff University, United Kingdom",
      "img": "/do/10.1145/contrib-81486655045/rel-imgonly/81486655045.png",
      "acmid": "81486655045",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aarhus, R. and Ballegaard, S.A. 2010. Negotiating boundaries: managing disease at home. Proceedings of the SIGCHI conference on Human Factors in Computing Systems (2010), 1223–1232.",
      "doi": "10.1145/1753326.1753509"
    },
    {
      "text": "Aarhus, R., Ballegaard, S.A. and Hansen, T.R. 2009. The eDiary: Bridging home and hospital through healthcare technology. ECSCW 2009. Springer. 63–83.",
      "doi": ""
    },
    {
      "text": "Abraham, J. and Reddy, M.C. 2013. Re-coordinating activities: an investigation of articulation work in patient transfers. Proceedings of the 2013 conference on Computer supported cooperative work (San Antonio, Texas, USA, 2013), 67–78.",
      "doi": "10.1145/2441776.2441787"
    },
    {
      "text": "Agrawal, P. 2015. Infrastructure in India: challenges and the way ahead. Inst. of Economic Growth, Unvi. of Delhi Enclave.",
      "doi": ""
    },
    {
      "text": "Alkema, L., Chou, D., Hogan, D., Zhang, S., Moller, A.-B., Gemmill, A., Fat, D.M., Boerma, T., Temmerman, M. and Mathers, C. 2016. Global, regional, and national levels and trends in maternal mortality between 1990 and 2015, with scenario-based projections to 2030: a systematic analysis by the UN Maternal Mortality Estimation Inter-Agency Group. The Lancet. 387, 10017 (2016), 462–474.",
      "doi": ""
    },
    {
      "text": "Almeida, T., Comber, R., Wood, G., Saraf, D. and Balaam, M. 2016. On Looking at the Vagina through Labella. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery.",
      "doi": ""
    },
    {
      "text": "Almeling, R. 2015. Reproduction. Annual Review of Sociology. 41, (Aug. 2015), 423–442.",
      "doi": ""
    },
    {
      "text": "Andalibi, N. and Forte, A. 2018. Announcing Pregnancy Loss on Facebook: A Decision-Making Framework for Stigmatized Disclosures on Identified Social Network Sites. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada, 2018), 1–14.",
      "doi": ""
    },
    {
      "text": "Andalibi, N., Marcu, G., Moesgen, T., Mullin, R. and Forte, A. 2018. Not Alone: Designing for Self-Disclosure and Social Support Exchange After Pregnancy Loss. Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada, 2018), 1–6.",
      "doi": ""
    },
    {
      "text": "Ashman, M.A., Collins, E.C., Brown, J.L., Rae, M.K. and Rollo, E.M. 2016. A Brief Tool to Assess Image-Based Dietary Records and Guide Nutrition Counselling Among Pregnant Women: An Evaluation. JMIR Mhealth Uhealth. 4, 4 (Nov. 2016), e123. DOI:https://doi.org/10.2196/mhealth.6469.",
      "doi": ""
    },
    {
      "text": "Aune, I. and Möller, A. 2012. ‘I want a choice, but I don't want to decide’—A qualitative study of pregnant women's experiences regarding early ultrasound risk assessment for chromosomal anomalies. Midwifery. 28, 1 (2012), 14–23.",
      "doi": ""
    },
    {
      "text": "Bagalkot, N., Verdezoto, N., Ghode, A., Purohit, S., Murthy, L., Mackintosh, N. and Griffiths, P. 2020. Beyond Health Literacy: Navigating Boundaries and Relationships During High-Risk Pregnancies: Challenges and Opportunities for Digital Health in North-West India. Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. Association for Computing Machinery.",
      "doi": ""
    },
    {
      "text": "Bagalkot, N., Verdezoto, N., Lewis, M., Griffiths, P., Harrington, D., Mackintosh, N. and Noronha, J.A. 2018. Towards Enhancing Everyday Pregnancy Care: Reflections from Community Stakeholders in South India. Proceedings of the 9th Indian Conference on Human Computer Interaction (2018), 71–74.",
      "doi": "10.1145/3297121.3297130"
    },
    {
      "text": "Balaam, M., Comber, R., Jenkins, E., Sutton, S. and Garbett, A. 2015. FeedFinder: a location-mapping mobile application for breastfeeding women. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (2015), 1709–1718.",
      "doi": "10.1145/2702123.2702328"
    },
    {
      "text": "Balaam, M., Robertson, J., Fitzpatrick, G., Say, R., Hayes, G., Mazmanian, M. and Parmar, B. 2013. Motherhood and HCI. CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France, 2013), 3215–3218.",
      "doi": ""
    },
    {
      "text": "Bardram, J.E. and Bossen, C. 2005. A web of coordinative artifacts: collaborative work at a hospital ward. Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work (Sanibel Island, Florida, USA, 2005), 168–176.",
      "doi": ""
    },
    {
      "text": "Bardzell, S. and Bardzell, J. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery.",
      "doi": ""
    },
    {
      "text": "Barry, M., Doherty, K., Marcano Belisario, J., Car, J., Morrison, C. and Doherty, G. 2017. mHealth for maternal mental health: everyday wisdom in ethical design. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (2017), 2708–2756.",
      "doi": "10.1145/3025453.3025918"
    },
    {
      "text": "Batool, A., Razaq, S., Javaid, M., Fatima, B. and Toyama, K. 2017. Maternal Complications: Nuances in Mobile Interventions for Maternal Health in Urban Pakistan. Proceedings of the Ninth International Conference on Information and Communication Technologies and Development (2017), 3.",
      "doi": "10.1145/3136560.3136573"
    },
    {
      "text": "Bentley, M.E. and Griffiths, P.L. 2003. The burden of anemia among women in India. European journal of clinical nutrition. 57, 1 (2003), 52–60.",
      "doi": ""
    },
    {
      "text": "Berg, M. 1999. Patient care information systems and health care work: a sociotechnical approach. International journal of medical informatics. 55, 2 (1999), 87–101.",
      "doi": ""
    },
    {
      "text": "Bloom, S.S., Wypij, D. and Gupta, M.D. 2001. Dimensions of women's autonomy and the influence on maternal health care utilization in a north Indian city. Demography. 38, 1 (2001), 67–78.",
      "doi": ""
    },
    {
      "text": "Blue, S., Shove, E., Carmona, C. and Kelly, M.P. 2016. Theories of practice and public health: understanding (un) healthy practices. Critical Public Health. 26, 1 (2016), 36–50.",
      "doi": ""
    },
    {
      "text": "Bossen, C. 2002. The parameters of common information spaces:: the heterogeneity of cooperative work at a hospital ward. Proceedings of the 2002 ACM conference on Computer supported cooperative work (2002), 176–185.",
      "doi": "10.1145/587078.587104"
    },
    {
      "text": "Brakman, S.-V. and Scholz, S.J. 2006. Adoption, ART, and a Re-Conception of the Maternal Body: Toward Embodied Maternity. Hypatia. 21, 1 (2006), 54–73. DOI:https://doi.org/10.1111/j.1527-2001.2006.tb00964.x.",
      "doi": ""
    },
    {
      "text": "Bratteteig, T. and Wagner, I. 2013. Moving healthcare to the home: The work to make homecare work. ECSCW 2013: Proceedings of the 13th European Conference on Computer Supported Cooperative Work, 21-25 September 2013, Paphos, Cyprus (2013), 143–162.",
      "doi": ""
    },
    {
      "text": "Braun, V. and Clarke, V. 2006. Using thematic analysis in psychology. Qualitative research in psychology. 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Britton, L.M. and Semaan, B. 2017. Manifesting the Cyborg through Techno-Body Modification: From Human-Computer Interaction to Integration. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery.",
      "doi": ""
    },
    {
      "text": "Brown, N. 2018. Exploring the lived experience of fibromyalgia using creative data collection methods. Cogent social sciences. 4, 1 (2018), 1447759.",
      "doi": ""
    },
    {
      "text": "Browner, C.H. and Press, N.A. 1995. The normalization of prenatal diagnostic screening. Conceiving the new world order: The global politics of reproduction. (1995), 307–322.",
      "doi": ""
    },
    {
      "text": "Carlo, L., Carpio, V., Verdezoto, N., Eslambolchilar, P., Cruz, E., Malo, F. and Espinosa, D. 2020. Healthcare Infrastructures in Ecuador: Challenges, Reflections and Opportunities for Digital Health. Proceedings of the 2020 International Conference on Information and Communication Technologies and Development (2020), 1–6.",
      "doi": "10.1145/3392561.3397578"
    },
    {
      "text": "Carlsson, T., Starke, V. and Mattsson, E. 2017. The emotional process from diagnosis to birth following a prenatal diagnosis of fetal anomaly: A qualitative study of messages in online discussion boards. Midwifery. 48, (2017), 53–59.",
      "doi": ""
    },
    {
      "text": "Chen, Y., Tang, C., Cheng, K. and Park, S.Y. 2012. Bridging clinical and non-clinical health practices: opportunities and challenges. CHI’12 Extended Abstracts on Human Factors in Computing Systems (2012), 2723–2726.",
      "doi": ""
    },
    {
      "text": "Chen, Y., Verdezoto, N., Gui, X., Ma, X., Bossen, C., Bagalkot, N., Herskovic, V. and Ploderer, B. 2019. Unpacking the Infrastructuring Work of Patients and Caregivers around the World. Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (2019), W03.",
      "doi": "10.1145/3290607.3299021"
    },
    {
      "text": "Chib, A. 2010. The Aceh Besar midwives with mobile phones project: Design and evaluation perspectives using the information and communication technologies for healthcare development model. Journal of Computer-Mediated Communication. 15, 3 (2010), 500–525.",
      "doi": ""
    },
    {
      "text": "Chib, A., Lwin, M.O., Ang, J., Lin, H. and Santoso, F. 2008. Midwives and mobiles: using ICTs to improve healthcare in Aceh Besar, Indonesia. Asian Journal of Communication. 18, 4 (2008), 348–364.",
      "doi": ""
    },
    {
      "text": "Chib, A., van Velthoven, M.H. and Car, J. 2015. mHealth adoption in low-resource environments: a review of the use of mobile healthcare in developing countries. Journal of health communication. 20, 1 (2015), 4–34.",
      "doi": ""
    },
    {
      "text": "Chokshi, M., Patil, B., Khanna, R., Neogi, S.B., Sharma, J., Paul, V.K. and Zodpey, S. 2016. Health systems in India. Journal of Perinatology. 36, s3 (2016), S9.",
      "doi": ""
    },
    {
      "text": "Coffey, D. 2015. Prepregnancy body mass and weight gain during pregnancy in India and sub-Saharan Africa. Proceedings of the National Academy of Sciences. 112, 11 (2015), 3302–3307.",
      "doi": ""
    },
    {
      "text": "Costa Figueiredo, M., Caldeira, C., Reynolds, T.L., Victory, S., Zheng, K. and Chen, Y. 2017. Self-tracking for fertility care: collaborative support for a highly personalized problem. Proceedings of the ACM on Human-Computer Interaction. 1, CSCW (2017), 36.",
      "doi": ""
    },
    {
      "text": "Coxon, K., Sandall, J. and Fulop, N.J. 2014. To what extent are women free to choose where to give birth? How discourses of risk, blame and responsibility influence birth place decisions. Health, Risk & Society. 16, 1 (2014), 51–67.",
      "doi": ""
    },
    {
      "text": "Dahl, A.A., Dunn, C.G., Boutté, A.K., Crimarco, A. and Turner-McGrievy, G. 2018. Mobilizing mHealth for Moms: a Review of Mobile Apps for Tracking Gestational Weight Gain. Journal of Technology in Behavioral Science. 3, 1 (Mar. 2018), 32–40. DOI:https://doi.org/10.1007/s41347-017-0030-6.",
      "doi": ""
    },
    {
      "text": "Danholt, P. and Langstrup, H. 2012. Medication as infrastructure: Decentring self-care. Culture Unbound: Journal of Current Cultural Research. 4, 3 (2012), 513–532.",
      "doi": ""
    },
    {
      "text": "Das, S., Sahu, M., Mohapatra, S., Padmavati, V. and Panigrahi, P.K. 2018. Pregnancy Induced Hypertension and Feto-Maternal Outcome in a Tertiary Care Hospital in Eastern India: A Prospective Study. Journal of Clinical & Diagnostic Research. 12, 11 (2018).",
      "doi": ""
    },
    {
      "text": "Davis, K. 1997. Embodied practices: Feminist perspectives on the body. Sage.",
      "doi": ""
    },
    {
      "text": "De Costa, A., Al-Muniri, A., Diwan, V.K. and Eriksson, B. 2009. Where are healthcare providers? Exploring relationships between context and human resources for health Madhya Pradesh province, India. Health Policy. 93, 1 (2009), 41–47.",
      "doi": ""
    },
    {
      "text": "DeRenzi, B., Borriello, G., Jackson, J., Kumar, V.S., Parikh, T.S., Virk, P. and Lesh, N. 2011. Mobile phone tools for field‐based health care workers in low‐income countries. Mount Sinai Journal of Medicine: A Journal of Translational and Personalized Medicine. 78, 3 (2011), 406–418.",
      "doi": ""
    },
    {
      "text": "DeRenzi, B., Dell, N., Wacksman, J., Lee, S. and Lesh, N. 2017. Supporting community health workers in India through voice-and web-based feedback. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (2017), 2770–2781.",
      "doi": "10.1145/3025453.3025514"
    },
    {
      "text": "DeRenzi, B., Wacksman, J., Dell, N., Lee, S., Lesh, N., Borriello, G. and Ellner, A. 2016. Closing the feedback Loop: A 12-month evaluation of ASTA, a self-tracking application for ASHAs. Proceedings of the Eighth International Conference on Information and Communication Technologies and Development (2016), 22.",
      "doi": "10.1145/2909609.2909652"
    },
    {
      "text": "Deshingkar, P. 2010. Migration, remote rural areas and chronic poverty in India. Overseas Development Institute (ODI) Working Paper. 323, (2010).",
      "doi": ""
    },
    {
      "text": "Dewan, M. 2008. Malnutrition in women. Studies on Home and Community Science. 2, 1 (2008), 7–10.",
      "doi": ""
    },
    {
      "text": "D'Ignazio, C., Hope, A., Michelson, B., Churchill, R. and Zuckerman, E. 2016. A Feminist HCI Approach to Designing Postpartum Technologies: When I first saw a breast pump I was wondering if it was a joke. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (2016), 2612–2622.",
      "doi": "10.1145/2858036.2858460"
    },
    {
      "text": "Doherty, K., Barry, M., Belisario, J.M., Morrison, C., Car, J. and Doherty, G. 2019. Personal Information and Public Health: Design Tensions in Sharing and Monitoring Wellbeing in Pregnancy. International Journal of Human-Computer Studies. (2019), 102373.",
      "doi": ""
    },
    {
      "text": "Doherty, K., Barry, M., Marcano-Belisario, J., Arnaud, B., Morrison, C., Car, J. and Doherty, G. 2018. A mobile app for the self-report of psychological well-being during pregnancy (BrightSelf): qualitative design study. JMIR mental health. 5, 4 (2018), e10007.",
      "doi": ""
    },
    {
      "text": "Doherty, K., Marcano-Belisario, J., Cohn, M., Mastellos, N., Morrison, C., Car, J. and Doherty, G. 2019. Engagement with Mental Health Screening on Mobile Devices: Results from an Antenatal Feasibility Study. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (2019), 186.",
      "doi": "10.1145/3290605.3300416"
    },
    {
      "text": "Donovan, S. 2006. Inescapable burden of choice? The impact of a culture of prenatal screening on women's experiences of pregnancy. Health Sociology Review. 15, 4 (2006), 397–405.",
      "doi": ""
    },
    {
      "text": "Draper, J. 2002. ‘It's the first scientific evidence’: men's experience of pregnancy confirmation. Journal of Advanced Nursing. 39, 6 (Sep. 2002), 563–570. DOI:https://doi.org/10.1046/j.1365-2648.2002.02325.x.",
      "doi": ""
    },
    {
      "text": "Draper, J. 2003. Men's passage to fatherhood: an analysis of the contemporary relevance of transition theory. Nursing Inquiry. 10, 1 (Mar. 2003), 66–78. DOI:https://doi.org/10.1046/j.1440-1800.2003.00157.x.",
      "doi": ""
    },
    {
      "text": "Duden, B. 1993. Disembodying women: Perspectives on pregnancy and the unborn. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Eccleston, C. 2016. Embodied: the psychology of physical sensation. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Enquist, H. and Tollmar, K. 2008. The memory stone: a personal ICT device in health care. Proceedings of the 5th Nordic conference on Human-computer interaction: building bridges (Lund, Sweden, 2008), 103–112.",
      "doi": ""
    },
    {
      "text": "Fagerhaugh, S.Y. 1997. Social organization of medical work. Transaction Publishers.",
      "doi": ""
    },
    {
      "text": "Faircloth, C. and Gürtin, Z.B. 2018. Fertile connections: Thinking across assisted reproductive technologies and parenting culture studies. Sociology. 52, 5 (2018), 983–1000.",
      "doi": ""
    },
    {
      "text": "Fikree, F.F. and Pasha, O. 2004. Role of gender in health disparity: the South Asian context. BMJ: British Medical Journal. 328, 7443 (2004), 823.",
      "doi": ""
    },
    {
      "text": "Filippi, V., Ronsmans, C., Campbell, O.M., Graham, W.J., Mills, A., Borghi, J., Koblinsky, M. and Osrin, D. 2006. Maternal health in poor countries: the broader context and a call for action. The Lancet. 368, 9546 (Oct. 2006), 1535–1541. DOI:https://doi.org/10.1016/S0140-6736(06)69384-7.",
      "doi": ""
    },
    {
      "text": "Fiore-Silfvast, B., Hartung, C., Iyengar, K., Iyengar, S., Israel-Ballard, K., Perin, N. and Anderson, R. 2013. Mobile video for patient education: the midwives’ perspective. Proceedings of the 3rd ACM Symposium on Computing for Development (2013), 2.",
      "doi": "10.1145/2442882.2442885"
    },
    {
      "text": "Fitzpatrick, G. and Ellingsen, G. 2013. A review of 25 years of CSCW research in healthcare: contributions, challenges and future agendas. Computer Supported Cooperative Work (CSCW). 22, 4–6 (2013), 609–665.",
      "doi": "10.1007/s10606-012-9168-0"
    },
    {
      "text": "Frauenberger, C. 2019. Entanglement HCI The Next Wave? ACM Trans. Comput.-Hum. Interact. 27, 1 (2019), 1–27.",
      "doi": "10.1145/3364998"
    },
    {
      "text": "Frazier, M. 2012. “The Data-Driven Parent: Will statistical analytics make for healthier, happier babies—or more-anxious adults?” The Atlantic.",
      "doi": ""
    },
    {
      "text": "Galloway, R. 2002. Women's perceptions of iron deficiency and anemia prevention and control in eight developing countries. Social Science & Medicine. 55, 4 (Aug. 2002), 529–544. DOI:https://doi.org/10.1016/S0277-9536(01)00185-X.",
      "doi": ""
    },
    {
      "text": "Gamble, J., Grant, J. and Tsourtos, G. 2015. Missed opportunities: A qualitative exploration of the experiences of smoking cessation interventions among socially disadvantaged pregnant women. Women and Birth. 28, 1 (Mar. 2015), 8–15. DOI:https://doi.org/10.1016/j.wombi.2014.11.003.",
      "doi": ""
    },
    {
      "text": "Gao, Y., Li, X., Lin, Y.-H., Liu, X. and Pang, L. 2014. Nuwa: enhancing the pregnancy experience for expectant parents. CHI’14 Extended Abstracts on Human Factors in Computing Systems (2014), 257–262.",
      "doi": ""
    },
    {
      "text": "Gardiner, P., Hempstead, M.B., Ring, L., Bickmore, T., Yinusa-Nyahkoon, L., Tran, H., Paasche-Orlow, M., Damus, K. and Jack, B. 2013. Reaching women through health information technology: the Gabby preconception care system. American Journal of Health Promotion. 27, 3_suppl (2013), eS11–eS20.",
      "doi": ""
    },
    {
      "text": "Gatrell, C. 2011. Policy and the Pregnant Body at Work: Strategies of Secrecy, Silence and Supra-performance. Gender, Work & Organization. 18, 2 (Mar. 2011), 158–181. DOI:https://doi.org/10.1111/j.1468-0432.2009.00485.x.",
      "doi": ""
    },
    {
      "text": "dit Gautier, E.J., Bot-Robin, V., Libessart, A., Doucède, G., Cosson, M. and Rubod, C. 2016. Design of a serious game for handling obstetrical emergencies. JMIR serious games. 4, 2 (2016), e21.",
      "doi": ""
    },
    {
      "text": "Georgsson Öhman, S., Saltvedt, S., Waldenström, U., Grunewald, C. and Olin‐Lauritzen, S. 2006. Pregnant women's responses to information about an increased risk of carrying a baby with Down syndrome. Birth. 33, 1 (2006), 64–73.",
      "doi": ""
    },
    {
      "text": "Gibson, L. and Hanson, V.L. 2013. Digital motherhood: How does technology help new mothers? Proceedings of the SIGCHI conference on human factors in computing systems (2013), 313–322.",
      "doi": "10.1145/2470654.2470700"
    },
    {
      "text": "Goetz, M., Müller, M., Matthies, M.L., Hansen, J., Doster, A., Szabo, A., Pauluschke-Fröhlich, J., Abele, H., Sohn, C., Wallwiener, M. and Wallwiener, S. 2017. Perceptions of Patient Engagement Applications During Pregnancy: A Qualitative Assessment of the Patient?s Perspective. JMIR Mhealth Uhealth. 5, 5 (May 2017), e73. DOI:https://doi.org/10.2196/mhealth.7040.",
      "doi": ""
    },
    {
      "text": "Grant, A., Mannay, D. and Marzella, R. 2018. “People try and police your behaviour”: the impact of surveillance on mothers and grandmothers’ perceptions and experiences of infant feeding. Families, Relationships and Societies. 7, 3 (Nov. 2018), 431–447. DOI:https://doi.org/10.1332/204674317X14888886530223.",
      "doi": ""
    },
    {
      "text": "Grant, A., Mannay, D. and Marzella, R. 2016. Surveillance and stigma during pregnancy and early motherhood: the changing experiences of mothers and grandmothers. (2016).",
      "doi": ""
    },
    {
      "text": "Grant, A., Morgan, M., Mannay, D. and Gallagher, D. 2019. Understanding health behaviour in pregnancy and infant feeding intentions in low-income women from the UK through qualitative visual methods and application to the COM-B (Capability, Opportunity, Motivation-Behaviour) model. BMC pregnancy and childbirth. 19, 1 (2019), 56.",
      "doi": ""
    },
    {
      "text": "Grönvall, E. and Verdezoto, N. 2013. Beyond self-monitoring: understanding non-functional aspects of home-based healthcare technology. Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (2013), 587–596.",
      "doi": "10.1145/2493432.2493495"
    },
    {
      "text": "Guelinckx, I., Devlieger, R., Beckers, K. and Vansant, G. 2008. Maternal obesity: pregnancy complications, gestational weight gain and nutrition. Obesity reviews. 9, 2 (2008), 140–150.",
      "doi": ""
    },
    {
      "text": "Gui, X. and Chen, Y. 2019. Making Healthcare Infrastructure Work: Unpacking the Infrastructuring Work of Individuals. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (2019), 458.",
      "doi": "10.1145/3290605.3300688"
    },
    {
      "text": "Gui, X., Chen, Y., Kou, Y., Pine, K. and Chen, Y. 2017. Investigating Support Seeking from Peers for Pregnancy in Online Health Communities. Proceedings of the ACM on Human-Computer Interaction. 1, CSCW (2017), 50.",
      "doi": ""
    },
    {
      "text": "Hall, K.S., Moreau, C. and Trussell, J. 2012. Determinants of and disparities in reproductive health service use among adolescent and young adult women in the United States, 2002–2008. American Journal of Public Health. 102, 2 (2012), 359–367.",
      "doi": ""
    },
    {
      "text": "Harpel, T.S. and Barras, K.G. 2018. The Impact of Ultrasound on Prenatal Attachment Among Disembodied and Embodied Knowers. Journal of Family Issues. 39, 6 (Apr. 2018), 1523–1544. DOI:https://doi.org/10.1177/0192513X17710774.",
      "doi": ""
    },
    {
      "text": "Hayes, G.R., Cheng, K.G., Hirano, S.H., Tang, K.P., Nagel, M.S. and Baker, D.E. 2014. Estrellita: a mobile capture and access tool for the support of preterm infants and their caregivers. ACM Transactions on Computer-Human Interaction (TOCHI). 21, 3 (2014), 19.",
      "doi": "10.1145/2617574"
    },
    {
      "text": "Henwood, F. and Marent, B. 2019. Understanding digital health: Productive tensions at the intersection of sociology of health and science and technology studies. Sociology of health & illness. 41, (2019), 1–15.",
      "doi": ""
    },
    {
      "text": "Homewood, S., Bewley, H. and Boer, L. 2019. Ovum: Designing for Fertility Tracking as a Shared and Domestic Experience. Proceedings of the 2019 on Designing Interactive Systems Conference (2019), 553–565.",
      "doi": "10.1145/3322276.3323692"
    },
    {
      "text": "Hui, M., Ly, C. and Neustaedter, C. 2012. MammiBelli: sharing baby activity levels between expectant mothers and their intimate social groups. CHI’12 Extended Abstracts on Human Factors in Computing Systems (2012), 1649–1654.",
      "doi": ""
    },
    {
      "text": "Ismail, A., Karusala, N. and Kumar, N. 2018. Bridging Disconnected Knowledges for Community Health. Proc. ACM Hum.-Comput. Interact. 2, Article 75, (2018), 27 pages.",
      "doi": ""
    },
    {
      "text": "Ismail, A. and Kumar, N. 2018. Engaging Solidarity in Data Collection Practices for Community Health. Proceedings of the ACM on Human-Computer Interaction. 2, CSCW (2018), 1–24.",
      "doi": ""
    },
    {
      "text": "Javaid, M., Fatima, B. and Batool, A. 2017. Bridging the Knowledge Gaps in Lady Health Visitors through Video Based Learning Tool. Proceedings of the Ninth International Conference on Information and Communication Technologies and Development (2017), 38.",
      "doi": "10.1145/3136560.3136603"
    },
    {
      "text": "Jensen, C.B. and Winthereik, B.R. 2013. Monitoring movements in development aid: recursive partnerships and infrastructures. MIT Press.",
      "doi": ""
    },
    {
      "text": "Johnson, S. 2014. “Maternal devices”, social media and the self-management of pregnancy, mothering and child health. Societies. 4, 2 (2014), 330–350.",
      "doi": ""
    },
    {
      "text": "Jones, C., Whitfield, C., Seymour, J. and Hayter, M. 2019. ‘Other Girls’: A Qualitative Exploration of Teenage Mothers’ Views on Teen Pregnancy in Contemporaries. Sexuality & Culture. (2019), 1–14.",
      "doi": ""
    },
    {
      "text": "Joshi, A., Roy, D., Ganju, A., Joshi, M. and Sharma, S. 2019. ICT Acceptance for Information Seeking Amongst Pre-and Postnatal Women in Urban Slums. IFIP Conference on Human-Computer Interaction (2019), 152–160.",
      "doi": ""
    },
    {
      "text": "Kaur, J., Wani, A.S. and Singh, P. 2019. Engagement of Pregnant Women and Mothers over WhatsApp: Challenges and Opportunities Involved. Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing (2019), 236–240.",
      "doi": "10.1145/3311957.3359481"
    },
    {
      "text": "Kazakos, K., Asthana, S., Balaam, M., Duggal, M., Holden, A., Jamir, L., Kannuri, N.K., Kumar, S., Manindla, A.R. and Manikam, S.A. 2016. A real-time ivr platform for community radio. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (2016), 343–354.",
      "doi": "10.1145/2858036.2858585"
    },
    {
      "text": "Kelly, M.P. and Barker, M. 2016. Why is changing health-related behaviour so difficult? Public health. 136, (2016), 109–116.",
      "doi": ""
    },
    {
      "text": "Kesterton, A.J. and Cleland, J. 2009. Neonatal care in rural Karnataka: healthy and harmful practices, the potential for change. BMC Pregnancy and Childbirth. 9, 1 (2009), 20.",
      "doi": ""
    },
    {
      "text": "Keyes, O., Peil, B., Williams, R.M. and Spiel, K. 2020. Reimagining (Women's) Health: HCI, Gender and Essentialised Embodiment. ACM Trans. Comput.-Hum. Interact. Association for Computing Machinery.",
      "doi": ""
    },
    {
      "text": "Klasnja, P., Hartzler, A.C., Unruh, K.T. and Pratt, W. 2010. Blowing in the wind: unanchored patient information work during cancer care. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA, 2010), 193–202.",
      "doi": "10.1145/1753326.1753355"
    },
    {
      "text": "Kosaka, T., Misumi, H., Iwamoto, T., Songer, R. and Akita, J. 2011. “Mommy Tummy” a pregnancy experience system simulating fetal movement. ACM SIGGRAPH 2011 Emerging Technologies (Vancouver, British Columbia, Canada, 2011), 1–1.",
      "doi": "10.1145/2048259.2048269"
    },
    {
      "text": "Kraschnewski, J.L., Chuang, C.H., Downs, D.S., Weisman, C.S., McCamant, E.L., Baptiste-Roberts, K., Zhu, J. and Kjerulff, K.H. 2013. Association of prenatal physical activity and gestational weight gain: results from the first baby study. Women's Health Issues. 23, 4 (2013), e233–e238.",
      "doi": ""
    },
    {
      "text": "Kulkarni, V.S., Kulkarni, V.S. and Gaiha, R. 2017. “Double Burden of Malnutrition” Reexamining the Coexistence of Undernutrition and Overweight Among Women in India. International Journal of Health Services. 47, 1 (2017), 108–133.",
      "doi": ""
    },
    {
      "text": "Kumar, N. and Anderson, R.J. 2015. Mobile phones for maternal health in rural India. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (2015), 427–436.",
      "doi": "10.1145/2702123.2702258"
    },
    {
      "text": "Kumar, N. and Anderson, R.J. 2015. Mobile Phones for Maternal Health in Rural India. (Apr. 2015), 427–436.",
      "doi": ""
    },
    {
      "text": "Kumar, N., Karusala, N., Ismail, A. and Tuli, A. 2020. Taking the Long, Holistic, and Intersectional View to Women's Wellbeing. ACM Trans. Comput.-Hum. Interact. Association for Computing Machinery.",
      "doi": ""
    },
    {
      "text": "Kumar, N., Perrier, T., Desmond, M., Israel-Ballard, K., Kumar, V., Mahapatra, S., Mishra, A., Agarwal, S., Gandhi, R. and Lal, P. 2015. Projecting health: community-led video education for maternal health. Proceedings of the Seventh International Conference on Information and Communication Technologies and Development (2015), 17.",
      "doi": "10.1145/2737856.2738023"
    },
    {
      "text": "Lagan, B.M., Sinclair, M. and Kernohan, W.G. 2011. What is the impact of the Internet on decision‐making in pregnancy? A global study. Birth. 38, 4 (2011), 336–345.",
      "doi": ""
    },
    {
      "text": "Lam, C. 2016. New reproductive technologies and disembodiment: Feminist and material resolutions. Routledge.",
      "doi": ""
    },
    {
      "text": "Langstrup, H. 2013. Chronic care infrastructures and the home. Sociology of health & illness. 35, 7 (2013), 1008–1022.",
      "doi": ""
    },
    {
      "text": "Largent, E.A. and Lynch, H.F. 2017. Paying research participants: regulatory uncertainty, conceptual confusion, and a path forward. Yale journal of health policy, law, and ethics. 17, 1 (2017), 61.",
      "doi": ""
    },
    {
      "text": "Larsson, A.-K., Svalenius, E.C., Lundqvist, A. and Dykes, A.-K. 2010. Parents’ experiences of an abnormal ultrasound examination - vacillating between emotional confusion and sense of reality. Reproductive Health. 7, 1 (Jun. 2010), 10. DOI:https://doi.org/10.1186/1742-4755-7-10.",
      "doi": ""
    },
    {
      "text": "Lawn, J.E. 2016. Stillbirths: rates, risk factors, and acceleration towards 2030. The Lancet. 387, 10018 (Feb. 2016), 587–603. DOI:https://doi.org/10.1016/S0140-6736(15)00837-5.",
      "doi": ""
    },
    {
      "text": "Lee, T.-I., Chiang, Y.-H., Guo, J., Chen, M.-T. and Chen, Y. 2016. Dot-it: Managing Nausea and Vomiting for A Peaceful Pregnancy with Personal Pattern Exploration. Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA, 2016), 20–25.",
      "doi": ""
    },
    {
      "text": "Lomanowska, A.M. and Guitton, M.J. 2014. My avatar is pregnant! Representation of pregnancy, birth, and maternity in a virtual world. Computers in Human Behavior. 31, 0 (Feb. 2014), 322–331.",
      "doi": "10.1016/j.chb.2013.10.058"
    },
    {
      "text": "Lupton, D. 2019. Caring dataveillance: Women's use of apps to monitor pregnancy and children. The Routledge Companion to Digital Media and Children. Abingdon-on-Thames: Routledge. (2019).",
      "doi": ""
    },
    {
      "text": "Lupton, D. 2012. Configuring maternal, preborn and infant embodiment. Sydney Health & Society Group Working Paper. 2 (2012).",
      "doi": ""
    },
    {
      "text": "Lupton, D. 2013. Infant embodiment and interembodiment: A review of sociocultural perspectives. Childhood. 20, 1 (2013), 37–50.",
      "doi": ""
    },
    {
      "text": "Lupton, D. 2017. ‘It just gives me a bit of peace of mind’: Australian women's use of digital media for pregnancy and early motherhood. Societies. 7, 3 (2017), 25.",
      "doi": ""
    },
    {
      "text": "Lupton, D. 2016. The use and value of digital media for information about pregnancy and early motherhood: a focus group study. BMC pregnancy and childbirth. 16, 1 (2016), 171.",
      "doi": ""
    },
    {
      "text": "Lupton, D. 2019. Toward a More-Than-Human Analysis of Digital Health: Inspirations From Feminist New Materialism. Qualitative health research. (2019), 1049732319833368.",
      "doi": ""
    },
    {
      "text": "Lupton, D.A. 2011. ‘The best thing for the baby’: Mothers’ concepts and experiences related to promoting their infants’ health and development. Health, risk & society. 13, 7–8 (2011), 637–651.",
      "doi": ""
    },
    {
      "text": "Mackintosh, N., Gong, Q. (Sarah), Hadjiconstantinou, M. and Verdezoto, N. 2021. Digital mediation of candidacy in maternity care: Managing boundaries between physiology and pathology. Social Science & Medicine. 285, (Sep. 2021), 114299. DOI:https://doi.org/10.1016/j.socscimed.2021.114299.",
      "doi": ""
    },
    {
      "text": "Malagi, U., Reddy, M. and Naik, R.K. 2006. Evaluation of National Nutritional Anaemia Control Programme in Dharwad (Karnataka). Journal of Human Ecology. 20, 4 (Dec. 2006), 279–281. DOI:https://doi.org/10.1080/09709274.2006.11905939.",
      "doi": ""
    },
    {
      "text": "Mannay, D., Creaghan, J., Gallagher, D., Marzella, R., Mason, S., Morgan, M. and Grant, A. 2018. Negotiating closed doors and constraining deadlines: the potential of visual ethnography to effectually explore private and public spaces of motherhood and parenting. Journal of contemporary ethnography. 47, 6 (2018), 758–781.",
      "doi": ""
    },
    {
      "text": "Mannay, D., Creaghan, J., Gallagher, D., Mason, S., Morgan, M. and Grant, A. 2018. “Watching What I'm Doing, Watching How I'm Doing It”: Exploring the Everyday Experiences of Surveillance and Silenced Voices Among Marginalized Mothers in Welsh Low-Income Locales. Marginalized Mothers, Mothering from the Margins. Emerald Publishing Limited. 25–40.",
      "doi": ""
    },
    {
      "text": "Markussen, R. 1996. Politics of intervention in design: feminist reflections on the Scandinavian tradition. ai & Society. 10, 2 (1996), 127–141.",
      "doi": ""
    },
    {
      "text": "Martin, E. 2001. The woman in the body: A cultural analysis of reproduction. Beacon Press.",
      "doi": ""
    },
    {
      "text": "Maternal Mortality Rate: 2015. https://www.cia.gov/library/publications/the-world-factbook/fields/353rank.html. Accessed: 2019-08-08.",
      "doi": ""
    },
    {
      "text": "Mberu, B.U., Haregu, T.N., Kyobutungi, C. and Ezeh, A.C. 2016. Health and health-related indicators in slum, rural, and urban communities: a comparative analysis. Global health action. 9, 1 (2016), 33163.",
      "doi": ""
    },
    {
      "text": "McArthur, J.W., Rasmussen, K. and Yamey, G. 2018. How many lives are at stake? Assessing 2030 sustainable development goal trajectories for maternal and child health. BMJ. 360, (Feb. 2018).",
      "doi": ""
    },
    {
      "text": "Mehta, B., Kumar, V., Chawla, S., Sachdeva, S. and Mahopatra, D. 2015. Hypertension in pregnancy: a community-based study. Indian journal of community medicine: official publication of Indian Association of Preventive & Social Medicine. 40, 4 (2015), 273.",
      "doi": ""
    },
    {
      "text": "Merleau-Ponty, M. and Smith, C. 1969. Phenomenology of perception. (1969).",
      "doi": ""
    },
    {
      "text": "Mitchell, L.M. and Georges, E. 1997. Cross-cultural cyborgs: Greek and Canadian women's discourses on fetal ultrasound. Feminist Studies. 23, 2 (1997), 373–401.",
      "doi": ""
    },
    {
      "text": "Molapo, M., Densmore, M. and Morie, L. 2016. Designing with community health workers: enabling productive participation through exploration. Proceedings of the First African Conference on Human Computer Interaction (2016), 58–68.",
      "doi": "10.1145/2998581.2998589"
    },
    {
      "text": "Morampudi, S., Balasubramanian, G., Gowda, A., Zomorodi, B. and Patil, A.S. 2017. The challenges and recommendations for gestational diabetes mellitus care in India: A review. Frontiers in endocrinology. 8, (2017).",
      "doi": ""
    },
    {
      "text": "Morris, M.R. 2014. Social networking site use by mothers of young children. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (2014), 1272–1282.",
      "doi": "10.1145/2531602.2531603"
    },
    {
      "text": "Murthy, N. and Vijayaraman, M.P.H. 2012. Role of Mobile Phone in Health Worker's Work Routine. Role of Mobile Phone in Health Worker's Work Routine (August 2012). (2012).",
      "doi": ""
    },
    {
      "text": "Mustafa, M., Batool, A., Fatima, B., Nawaz, F., Toyama, K. and Raza, A.A. 2020. Patriarchy, Maternal Health and Spiritual Healing: Designing Maternal Health Interventions in Pakistan. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery.",
      "doi": ""
    },
    {
      "text": "Nandan, D. and Agarwal, D. 2012. Human resources for health in India: urgent need for reforms. Indian journal of community medicine: official publication of Indian Association of Preventive & Social Medicine. 37, 4 (2012), 205.",
      "doi": ""
    },
    {
      "text": "Neiterman, E. 2012. Doing pregnancy: pregnant embodiment as performance. Women's Studies International Forum. 35, 5 (Sep. 2012), 372–383. DOI:https://doi.org/10.1016/j.wsif.2012.07.004.",
      "doi": ""
    },
    {
      "text": "Neiterman, E. 2013. Sharing bodies: the impact of the biomedical model of pregnancy on women's embodied experiences of the transition to motherhood. Healthcare policy = Politiques de sante. 9, Spec Issue (Oct. 2013), 112–125.",
      "doi": ""
    },
    {
      "text": "Noronha, J.A., Al Khasawneh, E., Seshan, V., Ramasubramaniam, S. and Raman, S. 2012. Anemia in pregnancy-consequences and challenges: a review of literature. Journal of South Asian Federation of Obstetrics and Gynecology. 4, 1 (2012), 64–70.",
      "doi": ""
    },
    {
      "text": "Noronha, J.A., Karkada, S.R., Prabhu, A., Shobha, D'Souza, S.R.B., Fernandes, S.J. and Kamath, P. 2018. Knowledge, attitude and risk perception for diabetes among pregnant women with gestational diabetes mellitus. Indian Journal of Public Health Research and Development. 9, 4 (Apr. 2018), 19–24. DOI:https://doi.org/10.5958/0976-5506.2018.00249.8.",
      "doi": ""
    },
    {
      "text": "Nunes, F., Verdezoto, N., Fitzpatrick, G., Kyng, M., Grönvall, E. and Storni, C. 2015. Self-care technologies in HCI: Trends, tensions, and opportunities. ACM Transactions on Computer-Human Interaction (TOCHI). 22, 6 (2015), 33.",
      "doi": "10.1145/2803173"
    },
    {
      "text": "Parmar, V. and Keyson, D. 2008. Persuasive technology for shaping social beliefs of rural women in India: an approach based on the theory of planned behaviour. International Conference on Persuasive Technology (2008), 104–115.",
      "doi": "10.1007/978-3-540-68504-3_10"
    },
    {
      "text": "Patton, M.Q. 2002. Designing qualitative studies. Qualitative research and evaluation methods. 3, (2002), 230–246.",
      "doi": ""
    },
    {
      "text": "Pendse, S.R., Lalani, F.M., De Choudhury, M., Sharma, A. and Kumar, N. 2020. “ Like Shock Absorbers”: Understanding the Human Infrastructures of Technology-Mediated Mental Health Support. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (2020), 1–14.",
      "doi": "10.1145/3313831.3376465"
    },
    {
      "text": "Perrier, T., Dell, N., DeRenzi, B., Anderson, R., Kinuthia, J., Unger, J. and John-Stewart, G. 2015. Engaging pregnant women in Kenya with a hybrid computer-human SMS communication system. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (2015), 1429–1438.",
      "doi": "10.1145/2702123.2702124"
    },
    {
      "text": "Perrier, T., Harrington, E.K., Ronen, K., Matemo, D., Kinuthia, J., John-Stewart, G., Anderson, R. and Unger, J.A. 2018. Male partner engagement in family planning SMS conversations at Kenyan health clinics. Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies (2018), 3.",
      "doi": "10.1145/3209811.3209857"
    },
    {
      "text": "Peters, D.H., Chakraborty, S., Mahapatra, P. and Steinhardt, L. 2010. Job satisfaction and motivation of health workers in public and private sectors: cross-sectional analysis from two Indian states. Human resources for health. 8, 1 (2010), 27.",
      "doi": ""
    },
    {
      "text": "Peyton, T., Poole, E., Reddy, M., Kraschnewski, J. and Chuang, C. 2014. Every pregnancy is different: designing mHealth for the pregnancy ecology. Proceedings of the 2014 conference on Designing interactive systems (2014), 577–586.",
      "doi": "10.1145/2598510.2598572"
    },
    {
      "text": "Peyton, T. and Wisniewski, P. 2019. Improving a design space: Pregnancy as a collaborative information and social support ecology. Future of Information and Communication Conference (2019), 505–525.",
      "doi": ""
    },
    {
      "text": "Phokeer, A., Hadzic, S., Nitschke, E., Van Zyl, A., Johnson, D., Densmore, M. and Chavula, J. 2020. iNethi Community Network: A first look at local and Internet traffic usage. Proceedings of the 3rd ACM SIGCAS Conference on Computing and Sustainable Societies (2020), 342–344.",
      "doi": "10.1145/3378393.3402289"
    },
    {
      "text": "Piras, E.M. and Zanutto, A. 2016. Tinkering Around Healthcare Infrastructures: Nursing Practices and Junction Work. COOP 2016: Proceedings of the 12th International Conference on the Design of Cooperative Systems, 23-27 May 2016, Trento, Italy (2016), 173–189.",
      "doi": ""
    },
    {
      "text": "Prabhakar, A.S., Guerra-Reyes, L., Kleinschmidt, V.M., Jelen, B., MacLeod, H., Connelly, K. and Siek, K.A. 2017. Investigating the suitability of the asynchronous, remote, community-based method for pregnant and new mothers. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (2017), 4924–4934.",
      "doi": "10.1145/3025453.3025546"
    },
    {
      "text": "Prabhakar, A.S., Newhouse, N., Simpson, E., Mburu, C.W., Ahmed, N. and Chen, Y. 2019. MatHealthXB: Designing Across Borders for Global Maternal Health. Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (2019), SIG04.",
      "doi": ""
    },
    {
      "text": "Ramachandran, D., Canny, J., Das, P.D. and Cutrell, E. 2010. Mobile-izing health workers in rural India. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2010), 1889–1898.",
      "doi": ""
    },
    {
      "text": "Ramachandran, D., Goswami, V. and Canny, J. 2010. Research and reality: using mobile messages to promote maternal health in rural India. Proceedings of the 4th ACM/IEEE international conference on information and communication technologies and development (2010), 35.",
      "doi": "10.1145/2369220.2369253"
    },
    {
      "text": "Randell, R., Wilson, S. and Woodward, P. 2011. Variations and commonalities in processes of collaboration: the need for multi-site workplace studies. Computer Supported Cooperative Work (CSCW). 20, 1–2 (2011), 37–59.",
      "doi": "10.1007/s10606-010-9127-6"
    },
    {
      "text": "Rao, K.D., Bhatnagar, A. and Berman, P. 2012. So many, yet few: human resources for health in India. Human resources for health. 10, 1 (2012), 19.",
      "doi": ""
    },
    {
      "text": "Ravishankar, A.K. 2012. Is India shouldering a double burden of malnutrition? Journal of Health Management. 14, 3 (2012), 313–328.",
      "doi": ""
    },
    {
      "text": "Ray Murray, P., Bagalkot, N.L., Srivatsa, S. and Anthony, P. 2021. Design Beku: Toward Decolonizing Design and Technology through Collaborative and Situated Care-in-Practices. Global Perspectives. 2, 1 (Aug. 2021), 26132. DOI:https://doi.org/10.1525/gp.2021.26132.",
      "doi": ""
    },
    {
      "text": "Robinson, J.R., Anders, S.H., Novak, L.L., Simpson, C.L., Holroyd, L.E., Bennett, K.A. and Jackson, G.P. 2018. Consumer health-related needs of pregnant women and their caregivers. JAMIA open. 1, 1 (Jul. 2018), 57–66. DOI:https://doi.org/10.1093/jamiaopen/ooy018.",
      "doi": ""
    },
    {
      "text": "Roy, M.P. 2016. Mitigating the stillbirth challenge in India. The Lancet. 387, 10032 (May 2016), 1995. DOI:https://doi.org/10.1016/S0140-6736(16)30460-3.",
      "doi": ""
    },
    {
      "text": "Rudolfsdottir, A.G. 2000. ‘I Am Not a Patient, and I Am Not a Child’: The Institutionalization and Experience of Pregnancy. Feminism & Psychology. 10, 3 (2000), 337–350.",
      "doi": ""
    },
    {
      "text": "Ruiz, E.C.V. and Sánchez, Á.J. 2019. E-Health in Ecuador: Experiences and Good Practice. 2019 Sixth International Conference on eDemocracy & eGovernment (ICEDEG) (2019), 92–100.",
      "doi": ""
    },
    {
      "text": "Saikia, D. 2014. Health Care Infrastructure in the Rural Areas of North-East India: Current Status and Future Challenges. Journal of Economic and Social Development. 10, (2014), 83–99.",
      "doi": ""
    },
    {
      "text": "Sanneving, L., Trygg, N., Saxena, D., Mavalankar, D. and Thomsen, S. 2013. Inequity in India: the case of maternal and reproductive health. Global health action. 6, 1 (2013), 19145.",
      "doi": ""
    },
    {
      "text": "Schneider, H., Wayrauther, J., Hassib, M. and Butz, A. 2019. Communicating Uncertainty in Fertility Prognosis. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk, 2019), 1–11.",
      "doi": ""
    },
    {
      "text": "Sen, G. and Iyer, A. 2016. THE MECHANISMS OF INTERSECTIONING SOCIAL INEQUALITIES IN HEALTH. BMJ Specialist Journals.",
      "doi": ""
    },
    {
      "text": "Sherman, L.E. and Greenfield, P.M. 2013. Forging friendship, soliciting support: A mixed-method examination of message boards for pregnant teens and teen mothers. Computers in Human Behavior. 29, 1 (Jan. 2013), 75–85.",
      "doi": "10.1016/j.chb.2012.07.018"
    },
    {
      "text": "Shidhaye, R. and Patel, V. 2010. Association of socio-economic, gender and health factors with common mental disorders in women: a population-based study of 5703 married rural women in India. International journal of epidemiology. 39, 6 (2010), 1510–1521.",
      "doi": ""
    },
    {
      "text": "Shroder, M., Anders, S.H., Dorst, M. and Jackson, G.P. 2018. Communication Technology Use and Preferences for Pregnant Women and Their Caregivers. AMIA Annual Symposium Proceedings (2018), 1515.",
      "doi": ""
    },
    {
      "text": "Shroff, M., Griffiths, P., Adair, L., Suchindran, C. and Bentley, M. 2009. Maternal autonomy is inversely related to child stunting in Andhra Pradesh, India. Maternal & child nutrition. 5, 1 (2009), 64–74.",
      "doi": ""
    },
    {
      "text": "Shroff, M.R., Griffiths, P.L., Suchindran, C., Nagalla, B., Vazir, S. and Bentley, M.E. 2011. Does maternal autonomy influence feeding practices and infant growth in rural India? Social science & medicine. 73, 3 (2011), 447–455.",
      "doi": ""
    },
    {
      "text": "Singh, P.K., Rai, R.K., Alagarajan, M. and Singh, L. 2012. Determinants of maternity care services utilization among married adolescents in rural India. PloS one. 7, 2 (2012), e31666.",
      "doi": ""
    },
    {
      "text": "Singh, Z. 2013. Universal health coverage for India by 2022: a utopia or reality? Indian journal of community medicine: official publication of Indian Association of Preventive & Social Medicine. 38, 2 (2013), 70.",
      "doi": ""
    },
    {
      "text": "Smith, D.L. and Bryant, J.H. 1988. Building the infrastructure for primary health care: an overview of vertical and integrated approaches. Social science & medicine. 26, 9 (1988), 909–917.",
      "doi": ""
    },
    {
      "text": "Smith, S. de-Vitry, Dietsch, E. and Bonner, A. 2013. Pregnancy as public property: The experience of couples following diagnosis of a foetal anomaly. Women and Birth. 26, 1 (Mar. 2013), 76–81. DOI:https://doi.org/10.1016/j.wombi.2012.05.003.",
      "doi": ""
    },
    {
      "text": "Smith, W., Wadley, G., Daly, O., Webb, M., Hughson, J., Hajek, J., Parker, A., Woodward-Kron, R. and Story, D. 2017. Designing an app for pregnancy care for a culturally and linguistically diverse community. Proceedings of the 29th Australian Conference on Computer-Human Interaction (Brisbane, Queensland, Australia, 2017), 337–346.",
      "doi": "10.1145/3152771.3152807"
    },
    {
      "text": "Song, F.W., West, J.E., Lundy, L. and Smith Dahmen, N. 2012. Women, pregnancy, and health information online: the making of informed patients and ideal mothers. Gender & Society. 26, 5 (2012), 773–798.",
      "doi": ""
    },
    {
      "text": "Star, S.L. 1999. The ethnography of infrastructure. American behavioral scientist. 43, 3 (1999), 377–391.",
      "doi": ""
    },
    {
      "text": "Star, S.L. and Ruhleder, K. 1996. Steps toward an ecology of infrastructure: Design and access for large information spaces. Information systems research. 7, 1 (1996), 111–134.",
      "doi": ""
    },
    {
      "text": "Star, S.L. and Strauss, A. 1999. Layers of silence, arenas of voice: The ecology of visible and invisible work. Computer supported cooperative work (CSCW). 8, 1–2 (1999), 9–30.",
      "doi": ""
    },
    {
      "text": "Stisen, A., Verdezoto, N., Blunck, H., Kjærgaard, M.B. and Grønbæk, K. 2016. Accounting for the invisible work of hospital orderlies: Designing for local and global coordination. Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (2016), 980–992.",
      "doi": ""
    },
    {
      "text": "Strauss, A.L. 1993. Continual permutations of action. Routledge.",
      "doi": ""
    },
    {
      "text": "Suh, H., Porter, J.R., Hiniker, A. and Kientz, J.A. 2014. @ BabySteps: design and evaluation of a system for using twitter for tracking children's developmental milestones. Proceedings of the 32nd annual ACM conference on Human factors in computing systems (2014), 2279–2288.",
      "doi": ""
    },
    {
      "text": "Sultana, S., Ahmed, S.I. and Fussell, S.R. 2019. “ Parar-daktar Understands My Problems Better” Disentangling the Challenges to Designing Better Access to Healthcare in Rural Bangladesh. Proceedings of the ACM on Human-Computer Interaction. 3, CSCW (2019), 1–27.",
      "doi": ""
    },
    {
      "text": "Sultana, S., Guimbretière, F., Sengers, P. and Dell, N. 2018. Design within a patriarchal society: Opportunities and challenges in designing for rural women in bangladesh. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (2018), 1–13.",
      "doi": "10.1145/3173574.3174110"
    },
    {
      "text": "Talhouk, R., Bartindale, T., Montague, K., Mesmar, S., Akik, C., Ghassani, A., Najem, M., Ghattas, H., Olivier, P. and Balaam, M. 2017. Implications of synchronous IVR radio on Syrian refugee health and community dynamics. Proceedings of the 8th International Conference on Communities and Technologies (2017), 193–202.",
      "doi": "10.1145/3083671.3083690"
    },
    {
      "text": "Talhouk, R., Mesmar, S., Thieme, A., Balaam, M., Olivier, P., Akik, C. and Ghattas, H. 2016. Syrian refugees and digital health in Lebanon: Opportunities for improving antenatal health. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (2016), 331–342.",
      "doi": "10.1145/2858036.2858331"
    },
    {
      "text": "Tang, C., Chen, Y., Cheng, K., Ngo, V. and Mattison, J.E. 2018. Awareness and handoffs in home care: coordination among informal caregivers. Behaviour & Information Technology. 37, 1 (2018), 66–86.",
      "doi": ""
    },
    {
      "text": "Tang, C., Chen, Y., Semaan, B.C. and Roberson, J.A. 2015. Restructuring Human Infrastructure: The Impact of EHR Deployment in a Volunteer-Dependent Clinic. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada, 2015), 649–661.",
      "doi": ""
    },
    {
      "text": "Tang, C., Xiao, Y., Chen, Y. and Gorman, P.N. 2015. Design for Supporting Healthcare Teams. Cognitive Informatics for Biomedicine: Human Computer Interaction in Healthcare. V.L. Patel, T.G. Kannampallil, and D.R. Kaufman, eds. Springer International Publishing. 215–239.",
      "doi": ""
    },
    {
      "text": "Tang, K., Gerling, K., Chen, W. and Geurts, L. 2019. Information and Communication Systems to Tackle Barriers to Breastfeeding: Systematic Search and Review. Journal of Medical Internet Research. 21, 9 (2019), e13947.",
      "doi": ""
    },
    {
      "text": "Thomas, G.M. and Lupton, D. 2015. Playing pregnancy: the ludification and gamification of expectant motherhood in smartphone apps. M/C Journal. 18, 5 (2015).",
      "doi": ""
    },
    {
      "text": "Thomas, G.M. and Lupton, D. 2016. Threats and thrills: pregnancy apps, risk and consumption. Health, Risk & Society. 17, 7–8 (2016), 495–509.",
      "doi": ""
    },
    {
      "text": "Thomas, G.M., Lupton, D. and Pedersen, S. 2018. ‘The appy for a happy pappy’: expectant fatherhood and pregnancy apps. Journal of Gender Studies. 27, 7 (2018), 759–770.",
      "doi": ""
    },
    {
      "text": "Timbi-Sisalima, C., Rodas, E.B., Salamea, J.C., Sacoto, H., Monje-Ortega, D. and Robles-Bykbaev, V. 2015. An Intelligent Ecosystem for Providing Support in Prehospital Trauma Care in Cuenca, Ecuador. MedInfo (2015), 329–332.",
      "doi": ""
    },
    {
      "text": "Tiwari, P. and Sorathia, K. 2014. Visualising and systematizing a per-poor ICT intervention for Rural and Semi-urban Mothers in India. Proceedings of the 7th International Symposium on Visual Information Communication and Interaction (2014), 129.",
      "doi": "10.1145/2636240.2636856"
    },
    {
      "text": "Toteja, G.S., Singh, P., Dhillon, B.S., Saxena, B.N., Ahmed, F.U., Singh, R.P., Prakash, B., Vijayaraghavan, K., Singh, Y. and Rauf, A. 2006. Prevalence of anemia among pregnant women and adolescent girls in 16 districts of India. Food and Nutrition Bulletin. 27, 4 (2006), 311–315.",
      "doi": ""
    },
    {
      "text": "Turner, B. 2004. The new medical sociology: Social forms of health and illness. WW Norton.",
      "doi": ""
    },
    {
      "text": "Unruh, K.T. and Pratt, W. 2008. The Invisible Work of Being a Patient and Implications for Health Care:“[the doctor is] my business partner in the most important business in my life, staying alive.” Ethnographic Praxis in Industry Conference Proceedings (2008), 40–50.",
      "doi": ""
    },
    {
      "text": "Vaira, L., Bochicchio, M.A., Conte, M., Casaluci, F.M. and Melpignano, A. 2018. MamaBot: a System based on ML and NLP for supporting Women and Families during Pregnancy. Proceedings of the 22nd International Database Engineering & Applications Symposium (2018), 273–277.",
      "doi": ""
    },
    {
      "text": "Van Dijk, R.M., Huijgen, A.N., Willemsen, P.S., Laven, S.J., Steegers, A.E. and Steegers-Theunissen, P.R. 2016. Impact of an mHealth Platform for Pregnancy on Nutrition and Lifestyle of the Reproductive Population: A Survey. JMIR mHealth uHealth. 4, 2 (May 2016), e53. DOI:https://doi.org/10.2196/mhealth.5197.",
      "doi": ""
    },
    {
      "text": "Vashistha, A., Kumar, N., Mishra, A. and Anderson, R. 2017. Examining Localization Approaches for Community Health. Proceedings of the 2017 Conference on Designing Interactive Systems (2017), 357–368.",
      "doi": "10.1145/3064663.3064754"
    },
    {
      "text": "Verdezoto, N., Bagalkot, N., Akbar, S.Z., Sharma, S., Mackintosh, N., Harrington, D. and Griffiths, P. 2021. The Invisible Work of Maintenance in Community Health: Challenges and Opportunities for Digital Health to Support Frontline Health Workers in Karnataka, South India. Proc. ACM Hum.-Comput. Interact. Association for Computing Machinery.",
      "doi": ""
    },
    {
      "text": "Verdezoto, N., Carpio-Arias, F., Carpio-Arias, V., Mackintosh, N., Eslambolchilar, P., Delgado, V., Andrade, C. and Vásconez, G. 2020. Indigenous Women Managing Pregnancy Complications in Rural Ecuador: Barriers and Opportunities to Enhance Antenatal Care. Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society (2020), 1–9.",
      "doi": "10.1145/3419249.3420141"
    },
    {
      "text": "Wang, J., O'Kane, A.A., Newhouse, N., Sethu-Jones, G.R. and de Barbaro, K. 2017. Quantified baby: parenting and the use of a baby wearable in the wild. Proceedings of the ACM on Human-Computer Interaction. 1, CSCW (2017), 108.",
      "doi": ""
    },
    {
      "text": "Wardle, C.-J., Green, M., Mburu, C.W. and Densmore, M. 2018. Exploring Co-design with Breastfeeding Mothers. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (2018), 482.",
      "doi": "10.1145/3173574.3174056"
    },
    {
      "text": "Weiner, K. and Will, C. 2018. Thinking with care infrastructures: people, devices and the home in home blood pressure monitoring. Sociology of health & illness. 40, 2 (2018), 270–282.",
      "doi": ""
    },
    {
      "text": "Wenger, M.S., Bell, J., McEvoy, P., Yamaguchi, C. and Shokrpour, A. 2014. Bloom: fostering healthy and peaceful pregnancies with personal analytics. CHI’14 Extended Abstracts on Human Factors in Computing Systems (2014), 245–250.",
      "doi": ""
    },
    {
      "text": "Wenham, A. 2016. “ I know I'm a good mum–no one can tell me different.” Young mothers negotiating a stigmatised identity through time. Families, Relationships and Societies. 5, 1 (2016), 127–144.",
      "doi": ""
    },
    {
      "text": "Wierckx, A., Shahid, S. and Al Mahmud, A. 2014. Babywijzer: an application to support women during their pregnancy. (Apr. 2014), 1333–1338.",
      "doi": "10.1145/2559206.2581179"
    },
    {
      "text": "Woodcock, C. 2010. “I Allow Myself to FEEL Now …”: Adolescent Girls’ Negotiations of Embodied Knowing, the Female Body, and Literacy. Journal of Literacy Research. 42, 4 (Dec. 2010), 349–384. DOI:https://doi.org/10.1080/1086296X.2010.524856.",
      "doi": ""
    },
    {
      "text": "World Health Organization 2019. WHO guideline: recommendations on digital interventions for health system strengthening: web supplement 2: summary of findings and GRADE tables. World Health Organization.",
      "doi": ""
    },
    {
      "text": "Yadav, D., Malik, P., Dabas, K. and Singh, P. 2019. Feedpal: Understanding Opportunities for Chatbots in Breastfeeding Education of Women in India. Proceedings of the ACM on Human-Computer Interaction. 3, CSCW (2019), 1–30.",
      "doi": ""
    },
    {
      "text": "Yin, R.K. 2009. Case study research: Design and methods. Sage publications, INC.",
      "doi": ""
    },
    {
      "text": "Zhu, C., Zeng, R., Zhang, W., Evans, R. and He, R. 2019. Pregnancy-Related Information Seeking and Sharing in the Social Media Era Among Expectant Mothers: Qualitative Study. J Med Internet Res. 21, 12 (Dec. 2019), e13694. DOI:https://doi.org/10.2196/13694.",
      "doi": ""
    },
    {
      "text": "Census of India 2011. Karnataka. District Census Handbook Ramanagar. Village and Town Wise Primary Census). DIRECTORATE OF CENSUS OPERATIONS.",
      "doi": ""
    }
  ]
}