{
  "doi": "10.1145/3491102.3517531",
  "title": "”Your Eyes Tell You Have Used This Password Before”: Identifying Password Reuse from Gaze and Keystroke Dynamics",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "A significant drawback of text passwords for end-user authentication is password reuse. We propose a novel approach to detect password reuse by leveraging gaze as well as typing behavior and study its accuracy. We collected gaze and typing behavior from 49 users while creating accounts for 1) a webmail client and 2) a news website. While most participants came up with a new password, 32% reported having reused an old password when setting up their accounts. We then compared different ML models to detect password reuse from the collected data. Our models achieve an accuracy of up to 87.7% in detecting password reuse from gaze, 75.8% accuracy from typing, and 88.75% when considering both types of behavior. We demonstrate that using gaze, password reuse can already be detected during the registration process, before users entered their password. Our work paves the road for developing novel interventions to prevent password reuse.",
  "tags": [
    "Gaze Behavior",
    "Machine Learning",
    "Passwords",
    "Keystroke Dynamics"
  ],
  "authors": [
    {
      "name": "Yasmeen Abdrabou",
      "institution": "Bundeswehr University Munich, Germany and University of Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-99659232892/rel-imgonly/img_20190415_175544.jpg",
      "acmid": "99659232892",
      "orcid": "0000-0002-8895-4997"
    },
    {
      "name": "Johannes Schütte",
      "institution": "Bundeswehr University Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234280",
      "orcid": "missing"
    },
    {
      "name": "Ahmed Shams",
      "institution": "Fatura LLC, Egypt",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700494",
      "orcid": "missing"
    },
    {
      "name": "Ken Pfeuffer",
      "institution": "Department of Computer Science, Aarhus University, Denmark and Bundeswehr University Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549578256",
      "orcid": "0000-0002-5870-1120"
    },
    {
      "name": "Daniel Buschek",
      "institution": "Department of Computer Science, University of Bayreuth, Germany",
      "img": "/do/10.1145/contrib-82659024557/rel-imgonly/daniel.png",
      "acmid": "82659024557",
      "orcid": "0000-0002-0013-715X"
    },
    {
      "name": "Mohamed Khamis",
      "institution": "University of Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-99659272366/rel-imgonly/22_-_287_computing_science_staff_mohamad_khamis_0058.jpg",
      "acmid": "99659272366",
      "orcid": "0000-0001-7051-5200"
    },
    {
      "name": "Florian Alt",
      "institution": "Bundeswehr University Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436594444",
      "orcid": "0000-0001-8354-2195"
    }
  ],
  "references": [
    {
      "text": "Jacob Abbott, Daniel Calarco, and L Jean Camp. 2018. Factors influencing password reuse: A case study. In Telecommunications Policy Research Conference on Communications, Information and Internet Policy (TPRC 46). DOI: http://dx. doi. org/10.2139/ssrn, Vol. 3142270.",
      "doi": ""
    },
    {
      "text": "Yasmeen Abdrabou, Yomna Abdelrahman, Mohamed Khamis, and Florian Alt. 2021. Think Harder! Investigating the Effect of Password Strength on Cognitive Load during Password Creation. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411763.3451636",
      "doi": ""
    },
    {
      "text": "Yasmeen Abdrabou, Ahmed Shams, Mohamed Omar Mantawy, Anam Ahmad Khan, Mohamed Khamis, Florian Alt, and Yomna Abdelrahman. 2021. GazeMeter: Exploring the Usage of Gaze Behaviour to Enhance Password Assessments. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3448017.3457384",
      "doi": ""
    },
    {
      "text": "E. R. Abdulin and O. V. Komogortsev. 2015. Person verification via eye movement-driven text reading model. In 2015 IEEE 7th International Conference on Biometrics Theory, Applications and Systems (BTAS). 1–8.",
      "doi": "10.1109/BTAS.2015.7358786"
    },
    {
      "text": "Alessandro Acquisti, Idris Adjerid, Rebecca Balebako, Laura Brandimarte, Lorrie Faith Cranor, Saranga Komanduri, Pedro Giovanni Leon, Norman Sadeh, Florian Schaub, Manya Sleeper, Yang Wang, and Shomir Wilson. 2017. Nudges for Privacy and Security: Understanding and Assisting Users’ Choices Online. ACM Comput. Surv. 50, 3, Article 44 (Aug. 2017), 41 pages. https://doi.org/10.1145/3054926",
      "doi": "10.1145/3054926"
    },
    {
      "text": "Suliman A Alsuhibany, Muna Almushyti, Noorah Alghasham, and Fatimah Alkhudhayr. 2019. The impact of using different keyboards on free-text keystroke dynamics authentication for Arabic language. Information & Computer Security(2019).",
      "doi": ""
    },
    {
      "text": "Suliman A Alsuhibany, Muna Almushyti, Noorah Alghasham, and Fatimah Alkhudier. 2016. Analysis of free-text keystroke dynamics for Arabic language using Euclidean distance. In 2016 12th International Conference on Innovations in Information Technology (IIT). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Florian Alt and Stefan Schneegass. 2021. Beyond Passwords—Challenges and Opportunities of Future Authentication. IEEE Security & Privacy(2021).",
      "doi": ""
    },
    {
      "text": "Akram Bayat and Marc Pomplun. 2018. Biometric Identification Through Eye-Movement Patterns. In Advances in Human Factors in Simulation and Modeling, Daniel N. Cassenti (Ed.). Springer International Publishing, Cham, 583–594.",
      "doi": ""
    },
    {
      "text": "Sruti Bhagavatula, Lujo Bauer, and Apu Kapadia. 2020. (How) Do people change their passwords after a breach?arXiv preprint arXiv:2010.09853(2020).",
      "doi": ""
    },
    {
      "text": "Joseph Bonneau, Cormac Herley, Paul C. van Oorschot, and Frank Stajano. 2015. Passwords and the Evolution of Imperfect Authentication. Commun. ACM 58, 7 (jun 2015), 78–87. https://doi.org/10.1145/2699390",
      "doi": "10.1145/2699390"
    },
    {
      "text": "Cristian Bravo-Lillo, Saranga Komanduri, Lorrie Faith Cranor, Robert W. Reeder, Manya Sleeper, Julie Downs, and Stuart Schechter. 2013. Your Attention Please: Designing Security-Decision UIs to Make Genuine Risks Harder to Ignore. In Proceedings of the Ninth Symposium on Usable Privacy and Security (Newcastle, United Kingdom) (SOUPS ’13). Association for Computing Machinery, New York, NY, USA, Article 6, 12 pages. https://doi.org/10.1145/2501604.2501610",
      "doi": "10.1145/2501604.2501610"
    },
    {
      "text": "Tarjani Buch, Andreea Cotoranu, Eric Jeskey, Florin Tihon, and Mary Villani. 2008. An enhanced keystroke biometric system and associated studies. Proc. CSIS Research Day, Pace Univ(2008).",
      "doi": ""
    },
    {
      "text": "John Campbell, Wanli Ma, and Dale Kleeman. 2011. Impact of restrictive composition policy on user password choices. Behaviour & Information Technology 30, 3 (2011), 379–388.",
      "doi": "10.1080/0144929X.2010.492876"
    },
    {
      "text": "Virginio Cantoni, Chiara Galdi, Michele Nappi, Marco Porta, and Daniel Riccio. 2015. GANT: Gaze analysis technique for human identification. Pattern Recognition 48, 4 (2015), 1027–1038.",
      "doi": "10.1016/j.patcog.2014.02.017"
    },
    {
      "text": "Virginio Cantoni, Tomas Lacovara, Marco Porta, and Haochen Wang. 2018. A Study on Gaze-Controlled PIN Input with Biometric Data Analysis. In Proceedings of the 19th International Conference on Computer Systems and Technologies (Ruse, Bulgaria) (CompSysTech’18). Association for Computing Machinery, New York, NY, USA, 99–103. https://doi.org/10.1145/3274005.3274029",
      "doi": "10.1145/3274005.3274029"
    },
    {
      "text": "Anupam Das, Joseph Bonneau, Matthew Caesar, Nikita Borisov, and XiaoFeng Wang. 2014. The tangled web of password reuse.. In NDSS, Vol. 14. 23–26.",
      "doi": ""
    },
    {
      "text": "Vivek Dhakal, Anna Maria Feit, Per Ola Kristensson, and Antti Oulasvirta. 2018. Observations on Typing from 136 Million Keystrokes. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174220",
      "doi": "10.1145/3173574.3174220"
    },
    {
      "text": "Serge Egelman, Andreas Sotirakopoulos, Ildar Muslukhov, Konstantin Beznosov, and Cormac Herley. 2013. Does My Password Go up to Eleven? The Impact of Password Meters on Password Selection. Association for Computing Machinery, New York, NY, USA, 2379–2388. https://doi.org/10.1145/2470654.2481329",
      "doi": ""
    },
    {
      "text": "Dinei Florencio and Cormac Herley. 2007. A Large-Scale Study of Web Password Habits. In Proceedings of the 16th International Conference on World Wide Web (Banff, Alberta, Canada) (WWW ’07). Association for Computing Machinery, New York, NY, USA, 657–666. https://doi.org/10.1145/1242572.1242661",
      "doi": "10.1145/1242572.1242661"
    },
    {
      "text": "Donald R. Gentner. 1983. Keystroke Timing in Transcription Typing. Springer New York, New York, NY, 95–120. https://doi.org/10.1007/978-1-4612-5470-6_5",
      "doi": ""
    },
    {
      "text": "Daniele Gunetti, Claudia Picardi, and Giancarlo Ruffo. 2005. Keystroke Analysis of Different Languages: A Case Study. In Advances in Intelligent Data Analysis VI, A. Fazel Famili, Joost N. Kok, José M. Peña, Arno Siebes, and Ad Feelders (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 133–144.",
      "doi": ""
    },
    {
      "text": "Ameya Hanamsagar, Simon S. Woo, Chris Kanich, and Jelena Mirkovic. 2018. Leveraging Semantic Transformation to Investigate Password Habits and Their Causes. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174144",
      "doi": "10.1145/3173574.3174144"
    },
    {
      "text": "S.M. Taiabul Haque, Matthew Wright, and Shannon Scielzo. 2013. A Study of User Password Strategy for Multiple Accounts. In Proceedings of the Third ACM Conference on Data and Application Security and Privacy (San Antonio, Texas, USA) (CODASPY ’13). Association for Computing Machinery, New York, NY, USA, 173–176. https://doi.org/10.1145/2435349.2435373",
      "doi": "10.1145/2435349.2435373"
    },
    {
      "text": "John M Henderson, Svetlana V Shinkareva, Jing Wang, Steven G Luke, and Jenn Olejarczyk. 2013. Predicting cognitive state from eye movements. PloS one 8, 5 (2013), e64937.",
      "doi": ""
    },
    {
      "text": "Sabrina Hoppe, Tobias Loetscher, Stephanie A. Morey, and Andreas Bulling. 2018. Eye Movements During Everyday Behavior Predict Personality Traits. Frontiers in Human Neuroscience 12 (2018), 105. https://doi.org/10.3389/fnhum.2018.00105",
      "doi": ""
    },
    {
      "text": "Robert JK Jacob and Keith S Karn. 2003. Eye tracking in human-computer interaction and usability research: Ready to deliver the promises. In The mind’s eye. Elsevier, 573–605.",
      "doi": ""
    },
    {
      "text": "Jeffrey L. Jenkins, Mark Grimes, Jeffrey Gainer Proudfoot, and Paul Benjamin Lowry. 2014. Improving Password Cybersecurity Through Inexpensive and Minimally Invasive Means: Detecting and Deterring Password Reuse Through Keystroke-Dynamics Monitoring and Just-in-Time Fear Appeals. Information Technology for Development 20, 2 (2014), 196–213. https://doi.org/10.1080/02681102.2013.814040 arXiv:https://doi.org/10.1080/02681102.2013.814040",
      "doi": "10.1080/02681102.2013.814040"
    },
    {
      "text": "Christina Katsini, Yasmeen Abdrabou, George Raptis, Mohamed Khamis, and Florian Alt. 2020. The Role of Eye Gaze in Security and Privacy Applications: Survey and Future HCI Research Directions.. In Proceedings of the 38th Annual ACM Conference on Human Factors in Computing Systems (Honolulu, Hawaii, USA) (CHI ’20). ACM, New York, NY, USA, 21 pages. https://doi.org/10.1145/3313831.3376840",
      "doi": "10.1145/3313831.3376840"
    },
    {
      "text": "Christina Katsini, Christos Fidas, George E. Raptis, Marios Belk, George Samaras, and Nikolaos Avouris. 2018. Influences of Human Cognition and Visual Behavior on Password Strength during Picture Password Composition. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173661",
      "doi": "10.1145/3173574.3173661"
    },
    {
      "text": "Christina Katsini, George E. Raptis, Christos Fidas, and Nikolaos Avouris. 2018. Towards Gaze-Based Quantification of the Security of Graphical Authentication Schemes. In Proceedings of the 2018 ACM Symposium on Eye Tracking Research & Applications (Warsaw, Poland) (ETRA ’18). Association for Computing Machinery, New York, NY, USA, Article 17, 5 pages. https://doi.org/10.1145/3204493.3204589",
      "doi": "10.1145/3204493.3204589"
    },
    {
      "text": "Mohamed Khamis, Florian Alt, and Andreas Bulling. 2018. The Past, Present, and Future of Gaze-Enabled Handheld Mobile Devices: Survey and Lessons Learned. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (Barcelona, Spain) (MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, Article 38, 17 pages. https://doi.org/10.1145/3229434.3229452",
      "doi": "10.1145/3229434.3229452"
    },
    {
      "text": "Nina Kolb, Steffen Bartsch, Melanie Volkamer, and Joachim Vogt. 2014. Capturing attention for warnings about insecure password fields–systematic development of a passive security intervention. In International Conference on Human Aspects of Information Security, Privacy, and Trust. Springer, 172–182.",
      "doi": "10.1007/978-3-319-07620-1_16"
    },
    {
      "text": "Scott Lundberg and Su-In Lee. 2017. A unified approach to interpreting model predictions. arXiv preprint arXiv:1705.07874(2017).",
      "doi": ""
    },
    {
      "text": "Yoshitomo Matsubara, Toshiharu Samura, Haruhiko Nishimura, 2015. Keyboard dependency of personal identification performance by keystroke dynamics in free text typing. Journal of Information Security 6, 03 (2015), 229.",
      "doi": ""
    },
    {
      "text": "Fabian Monrose and Aviel D Rubin. 2000. Keystroke dynamics as a biometric for authentication. Future Generation computer systems 16, 4 (2000), 351–359.",
      "doi": ""
    },
    {
      "text": "Robert Moskovitch, Clint Feher, Arik Messerman, Niklas Kirschnick, Tarik Mustafic, Ahmet Camtepe, Bernhard Löhlein, Ulrich Heister, Sebastian Möller, Lior Rokach, and Yuval Elovici. 2009. Identity Theft, Computers and Behavioral Biometrics. In Proceedings of the 2009 IEEE International Conference on Intelligence and Security Informatics(Richardson, Texas, USA) (ISI’09). IEEE Press, 155–160.",
      "doi": "10.5555/1706428.1706455"
    },
    {
      "text": "Sarah Pearman, Jeremy Thomas, Pardis Emami Naeini, Hana Habib, Lujo Bauer, Nicolas Christin, Lorrie Faith Cranor, Serge Egelman, and Alain Forget. 2017. Let’s Go in for a Closer Look: Observing Passwords in Their Natural Habitat. In Proceedings of the 2017 ACM SIGSAC Conference on Computer and Communications Security (Dallas, Texas, USA) (CCS ’17). Association for Computing Machinery, New York, NY, USA, 295–310. https://doi.org/10.1145/3133956.3133973",
      "doi": "10.1145/3133956.3133973"
    },
    {
      "text": "Sarah Pearman, Shikun Aerin Zhang, Lujo Bauer, Nicolas Christin, and Lorrie Faith Cranor. 2019. Why People (Don’t) Use Password Managers Effectively. In Proceedings of the Fifteenth USENIX Conference on Usable Privacy and Security (Santa Clara, CA, USA) (SOUPS’19). USENIX Association, USA, 319–338.",
      "doi": "10.5555/3361476.3361500"
    },
    {
      "text": "Ken Pfeuffer, Yasmeen Abdrabou, Augusto Esteves, Radiah Rivu, Yomna Abdelrahman, Stefanie Meitner, Amr Saadi, and Florian Alt. 2021. ARtention: A design space for gaze-adaptive user interfaces in augmented reality. Computers & Graphics 95(2021), 1–12.",
      "doi": ""
    },
    {
      "text": "George E. Raptis, Christina Katsini, Marios Belk, Christos Fidas, George Samaras, and Nikolaos Avouris. 2017. Using Eye Gaze Data and Visual Activities to Infer Human Cognitive Styles: Method and Feasibility Studies. In Proceedings of the 25th Conference on User Modeling, Adaptation and Personalization (Bratislava, Slovakia) (UMAP ’17). Association for Computing Machinery, New York, NY, USA, 164–173. https://doi.org/10.1145/3079628.3079690",
      "doi": "10.1145/3079628.3079690"
    },
    {
      "text": "Karen Renaud, Verena Zimmerman, Joseph Maguire, and Steve Draper. 2017. Lessons learned from evaluating eight password nudges in the wild. In The {LASER} Workshop: Learning from Authoritative Security Experiment Results ({LASER} 2017). 25–37.",
      "doi": ""
    },
    {
      "text": "Toshiharu Samura and Haruhiko Nishimura. 2012. Influence of Keyboard Difference on Personal Identification by Keystroke Dynamics in Japanese Free Text Typing. In 2012 Fifth International Conference on Emerging Trends in Engineering and Technology. 30–35. https://doi.org/10.1109/ICETET.2012.24",
      "doi": "10.1109/ICETET.2012.24"
    },
    {
      "text": "Tobias Seitz, Manuel Hartmann, Jakob Pfab, and Samuel Souque. 2017. Do Differences in Password Policies Prevent Password Reuse?. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(Denver, Colorado, USA) (CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 2056–2063. https://doi.org/10.1145/3027063.3053100",
      "doi": "10.1145/3027063.3053100"
    },
    {
      "text": "Richard Shay, Saranga Komanduri, Adam L. Durity, Phillip (Seyoung) Huh, Michelle L. Mazurek, Sean M. Segreti, Blase Ur, Lujo Bauer, Nicolas Christin, and Lorrie Faith Cranor. 2016. Designing Password Policies for Strength and Usability. ACM Trans. Inf. Syst. Secur. 18, 4, Article 13 (may 2016), 34 pages. https://doi.org/10.1145/2891411",
      "doi": "10.1145/2891411"
    },
    {
      "text": "Richard Shay, Saranga Komanduri, Patrick Gage Kelley, Pedro Giovanni Leon, Michelle L. Mazurek, Lujo Bauer, Nicolas Christin, and Lorrie Faith Cranor. 2010. Encountering Stronger Password Requirements: User Attitudes and Behaviors. In Proceedings of the Sixth Symposium on Usable Privacy and Security (Redmond, Washington, USA) (SOUPS ’10). Association for Computing Machinery, New York, NY, USA, Article 2, 20 pages. https://doi.org/10.1145/1837110.1837113",
      "doi": "10.1145/1837110.1837113"
    },
    {
      "text": "Julian Steil, Marion Koelle, Wilko Heuten, Susanne Boll, and Andreas Bulling. 2019. PrivacEye: Privacy-Preserving Head-Mounted Eye Tracking Using Egocentric Scene Image and Eye Movement Features. In Proceedings of the 11th ACM Symposium on Eye Tracking Research & Applications (Denver, Colorado) (ETRA ’19). Association for Computing Machinery, New York, NY, USA, Article 26, 10 pages. https://doi.org/10.1145/3314111.3319913",
      "doi": "10.1145/3314111.3319913"
    },
    {
      "text": "Charles C Tappert, Mary Villani, and Sung-Hyuk Cha. 2010. Keystroke biometric identification and authentication on long-text input. In Behavioral biometrics for human identification: Intelligent applications. IGI global, 342–367.",
      "doi": ""
    },
    {
      "text": "Kurt Thomas, Jennifer Pullman, Kevin Yeo, Ananth Raghunathan, Patrick Gage Kelley, Luca Invernizzi, Borbala Benko, Tadek Pietraszek, Sarvar Patel, Dan Boneh, 2019. Protecting accounts from credential stuffing with password breach alerting. In 28th {USENIX} Security Symposium ({USENIX} Security 19). 1556–1571.",
      "doi": ""
    },
    {
      "text": "D. Vitonis and D. W. Hansen. 2014. Person Identification Using Eye Movements and Post Saccadic Oscillations. In 2014 Tenth International Conference on Signal-Image Technology and Internet-Based Systems. 580–583.",
      "doi": ""
    },
    {
      "text": "Emanuel von Zezschwitz, Alexander De Luca, and Heinrich Hussmann. 2013. Survival of the Shortest: A Retrospective Analysis of Influencing Factors on Password Composition. In Human-Computer Interaction – INTERACT 2013, Paula Kotzé, Gary Marsden, Gitte Lindgaard, Janet Wesson, and Marco Winckler (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 460–467.",
      "doi": ""
    },
    {
      "text": "Rick Wash, Emilee Rader, Ruthie Berman, and Zac Wellmer. 2016. Understanding Password Choices: How Frequently Entered Passwords Are Re-used across Websites. In Twelfth Symposium on Usable Privacy and Security (SOUPS 2016). USENIX Association, Denver, CO, 175–188. https://www.usenix.org/conference/soups2016/technical-sessions/presentation/wash",
      "doi": "10.5555/3235895.3235911"
    },
    {
      "text": "Yongtuo Zhang, Wen Hu, Weitao Xu, Chun Tung Chou, and Jiankun Hu. 2018. Continuous Authentication Using Eye Movement Response of Implicit Visual Stimuli. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 4, Article 177 (Jan. 2018), 22 pages. https://doi.org/10.1145/3161410",
      "doi": "10.1145/3161410"
    }
  ]
}