{
  "doi": "10.1145/3491102.3517594",
  "title": "Digital Proxemics: Designing Social and Collaborative Interaction in Virtual Environments",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2022,
  "badges": [],
  "abstract": "Behaviour in virtual environments might be informed by our experiences in physical environments, but virtual environments are not constrained by the same physical, perceptual, or social cues. Instead of replicating the properties of physical spaces, one can create virtual experiences that diverge from reality by dynamically manipulating environmental, aural, and social properties. This paper explores digital proxemics, which describe how we use space in virtual environments and how the presence of others influences our behaviours, interactions, and movements. First, we frame the open challenges of digital proxemics in terms of activity, social signals, audio design, and environment. We explore a subset of these challenges through an evaluation that compares two audio designs and two displays with different social signal affordances: head-mounted display (HMD) versus desktop PC. We use quantitative methods using instrumented tracking to analyse behaviour, demonstrating how personal space, proximity, and attention compare between desktop PC and HMDs.",
  "tags": [
    "Digital Proxemics",
    "Social Signal Processing",
    "Quantitative Methods.",
    "Virtual Environments"
  ],
  "authors": [
    {
      "name": "Julie R. Williamson",
      "institution": "School of Computing Science, University of Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81442606751/rel-imgonly/julie_pic.jpg",
      "acmid": "81442606751",
      "orcid": "missing"
    },
    {
      "name": "Joseph O'Hagan",
      "institution": "School of Computing Science, University of Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659535752",
      "orcid": "0000-0003-2905-1584"
    },
    {
      "name": "John Alexis Guerra-Gomez",
      "institution": "Computer Science, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659476420",
      "orcid": "missing"
    },
    {
      "name": "John H Williamson",
      "institution": "School of Computing Science, University of Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100169940",
      "orcid": "missing"
    },
    {
      "name": "Pablo Cesar",
      "institution": "Centrum Wiskunde & Informatica (CWI), Netherlands",
      "img": "/do/10.1145/contrib-81318497573/rel-imgonly/pablo.jpg",
      "acmid": "81318497573",
      "orcid": "missing"
    },
    {
      "name": "David A. Shamma",
      "institution": "Toyota Research Institute, United States",
      "img": "/do/10.1145/contrib-81100288295/rel-imgonly/me.jpg",
      "acmid": "81100288295",
      "orcid": "0000-0003-2399-9374"
    }
  ],
  "references": [
    {
      "text": "Mark S. Ackerman, Jack Muramatsu, and David W. McDonald. 2010. Social regulation in an online game: Uncovering the problematics of code. In Proceedings of the 16th ACM International Conference on Supporting Group Work, GROUP’10. Association for Computing Machinery, New York, NY, USA, 173–182. https://doi.org/10.1145/1880071.1880101",
      "doi": "10.1145/1880071.1880101"
    },
    {
      "text": "Sun Joo (Grace) Ahn, Laura Levy, Allison Eden, Andrea Stevenson Won, Blair MacIntyre, and Kyle Johnsen. 2021. IEEEVR2020: Exploring the First Steps Toward Standalone Virtual Conferences. Frontiers in Virtual Reality 2, April (2021), 1–15. https://doi.org/10.3389/frvir.2021.648575",
      "doi": ""
    },
    {
      "text": "Jeremy N. Bailenson, Jim Blascovich, Andrew C. Beall, and Jack M. Loomis. 2001. Equilibrium theory revisited: Mutual gaze and personal space in virtual environments. Presence: Teleoperators and Virtual Environments 10, 6(2001), 583–598. https://doi.org/10.1162/105474601753272844",
      "doi": "10.1162/105474601753272844"
    },
    {
      "text": "Steve Benford, John Bowers, Lennart E. Fahlén, Chris Greenhalgh, and Dave Snowdon. 1995. User embodiment in collaborative virtual environments. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI ’95. Association for Computing Machinery, New York, NY, USA, 242–249. https://doi.org/10.1145/223904.223935",
      "doi": "10.1145/223904.223935"
    },
    {
      "text": "Steve Benford, Dave Snowdon, Andy Colebourne, Jon O’Brien, and Tom Rodden. 1997. Informing the design of collaborative virtual environments. In Proceedings of the International ACM SIGGROUP Conference on Supporting Group Work. Association for Computing Machinery, New York, NY, USA, 71–79. https://doi.org/10.1145/266838.266866",
      "doi": "10.1145/266838.266866"
    },
    {
      "text": "Andrea Bonsch, Sina Radke, Heiko Overath, Laura M. Asche, Jonathan Wendt, Tom Vierjahn, Ute Habel, and Torsten W. Kuhlen. 2018. Social VR: How Personal Space is Affected by Virtual Agents’ Emotions. In 25th IEEE Conference on Virtual Reality and 3D User Interfaces, VR 2018 - Proceedings. IEEE, NJ, USA, 199–206. https://doi.org/10.1109/VR.2018.8446480",
      "doi": ""
    },
    {
      "text": "John Bowers, James Pycock, and Jon O’Brien. 1996. Talk and embodiment in collaborative virtual environments. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI ’96. Association for Computing Machinery, New York, NY, USA, 58–65. https://doi.org/10.1145/238386.238404",
      "doi": "10.1145/238386.238404"
    },
    {
      "text": "Philip Brey. 1999. The ethics of representation and action in virtual reality. Ethics and Information Technology 1, 1 (1999), 5–14. https://doi.org/10.1023/A:1010069907461",
      "doi": "10.1023/A%3A1010069907461"
    },
    {
      "text": "Barry Brown and Marek Bell. 2004. CSCW at play : ‘ There ’ as a collaborative virtual environment. In CSCW 2004. Association for Computing Machinery, New York, NY, USA, 350–359.",
      "doi": ""
    },
    {
      "text": "E F Churchill and D Snowdon. 1998. Environments : An Introductory Review of Issues and Systems. Virtual Reality 3, 1 (1998), 3–15. https://link.springer.com/content/pdf/10.1007/BF01409793.pdf",
      "doi": "10.1007/BF01409793"
    },
    {
      "text": "Nicolas Ducheneaut, Mh Wen, Nicholas Yee, Greg Wadley, Palo Alto, and Palo Alto. 2009. Body and Mind: A Study of Avatar Personalization in Three Virtual Worlds. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1151–1160. https://doi.org/10.1145/1518701.1518877",
      "doi": "10.1145/1518701.1518877"
    },
    {
      "text": "Mike Fraser, Tony Glover, Ivan Vaghi, Steve Benford, Chris Greenhalgh, Jon Hindmarsh, and Christian Heath. 2000. Revealing the realities of collaborative virtual reality. In Proceedings of the Third International Conference on Collaborative Virtual Environments. Association for Computing Machinery, New York, NY, USA, 29–37. https://doi.org/10.1145/351006.351010",
      "doi": "10.1145/351006.351010"
    },
    {
      "text": "Doron Friedman, Anthony Steed, and Mel Slater. 2007. Spatial social behavior in second life. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 4722 LNCS (2007), 252–263. https://doi.org/10.1007/978-3-540-74997-4_23",
      "doi": "10.1007/978-3-540-74997-4_23"
    },
    {
      "text": "Thomas Funkhouser, Nicolas Tsingos, and Jean-Marc Jot. 2003. Survey of Methods for Modeling Sound Propagation in Interactive Virtual Environment Systems.",
      "doi": ""
    },
    {
      "text": "Juan C. Gil-Carvajal, Jens Cubick, Sébastien Santurette, and Torsten Dau. 2016. Spatial Hearing with Incongruent Visual or Auditory Room Cues. Scientific Reports 6, November (2016), 1–10. https://doi.org/10.1038/srep37342",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1959. The Presentation of Self in Everyday Life. Doubleday, NY, USA. 259 pages. https://doi.org/10.2307/2089106",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1963. Behavior in Public Places: Notes on the Social Organization of Gatherings. Free Press of Glencoe, NY, USA. 248 pages. http://www.jstor.org/stable/4105254%0Ahttp://books.google.com/books?id=EM1NNzcR-V0C&pgis=1%5Cnhttp://should-i-read-this.info/wp-content/uploads/pdfs/Behavior in Public Places Notes on the Social Organization of Gatherings by Erving Goffman - Genius In The",
      "doi": ""
    },
    {
      "text": "Saul Greenberg, Nicolai Marquardt, Till Ballendat, Rob Diaz-Marino, and Miaosen Wang. 2011. Proxemic interactions. Interactions XVIII, 1 (2011), 42. https://doi.org/10.1145/1897239.1897250",
      "doi": "10.1145/1897239.1897250"
    },
    {
      "text": "A. Guye-Vuillème, T. K. Capin, I. S. Pandzic, N. Magnenat Thalmann, and D. Thalmann. 1999. Nonverbal communication interface for collaborative virtual environments. Virtual Reality 4, 1 (1999), 49–59. https://doi.org/10.1007/BF01434994",
      "doi": "10.1007/BF01434994"
    },
    {
      "text": "Edward Hall. 1969. The Hidden Dimension : man’s use of space in public and in private. Anchor Books, NY, USA. 217 pages.",
      "doi": ""
    },
    {
      "text": "Heiko Hecht, Robin Welsch, Jana Viehoff, and Matthew R. Longo. 2019. The shape of personal space. Acta Psychologica 193, April 2018 (2019), 113–122. https://doi.org/10.1016/j.actpsy.2018.12.009",
      "doi": ""
    },
    {
      "text": "B. Hillier and J. Hanson. 1988. The social logic of space. Cambridge University Press, Cambridge, UK. https://doi.org/10.4324/9780429450174-9",
      "doi": ""
    },
    {
      "text": "Tammo Houtgast and Herman JM Steeneken. 1971. Evaluation of speech transmission channels by using artificial signals. Acta Acustica united with Acustica 25, 6 (1971), 355–367.",
      "doi": ""
    },
    {
      "text": "Adam Kendon. 1990. Conducting interaction. Patterns of behaviour in focused encounters. Cambridge University Press, UK. 308 pages. http://books.google.com/books?id=7-8zAAAAIAAJ",
      "doi": ""
    },
    {
      "text": "Duc Anh Le, Blair MacIntyre, and Jessica Outlaw. 2020. Enhancing the Experience of Virtual Conferences in Social Virtual Environments. In Proceedings - 2020 IEEE Conference on Virtual Reality and 3D User Interfaces, VRW 2020. IEEE, NJ, USA, 485–494. https://doi.org/10.1109/VRW50115.2020.00101",
      "doi": ""
    },
    {
      "text": "Jie Li, Vinoba Vinayagamoorthy, Julie Williamson, David A. Shamma, and Pablo Cesar. 2021. Social VR: A New Medium for Remote Communication and Collaboration. In Conference on Human Factors in Computing Systems - Proceedings. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3411763.3441346",
      "doi": ""
    },
    {
      "text": "Joan Llobera, Bernhard Spanlang, Giulio Ruffini, and Mel Slater. 2010. Proxemics with multiple dynamic characters in an immersive virtual environment. ACM Transactions on Applied Perception 8, 1 (2010), 12. https://doi.org/10.1145/1857893.1857896",
      "doi": "10.1145/1857893.1857896"
    },
    {
      "text": "Antonella Maselli and Mel Slater. 2013. The building blocks of the full body ownership illusion. Frontiers in Human Neuroscience 7, March (2013), 1–15. https://doi.org/10.3389/fnhum.2013.00083",
      "doi": ""
    },
    {
      "text": "John A. McArthur. 2016. Digital Proxemics. Peter Lang International Academic Publishers, Berne,Switzerland. https://doi.org/10.3726/978-1-4539-1724-4",
      "doi": ""
    },
    {
      "text": "Joshua McVeigh-Schultz, Anya Kolesnichenko, and Katherine Isbister. 2019. Shaping Pro-Social Interaction in VR. In CHI ’19. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300794",
      "doi": ""
    },
    {
      "text": "Robert Moore, E. Hankinson Gathman, and Nicolas Ducheneaut. 2009. From 3D space to third place: The social life of small virtual spaces. Human Organization 68, 2 (2009), 230–240. https://doi.org/10.17730/humo.68.2.q673k16185u68v15",
      "doi": ""
    },
    {
      "text": "Alexander Muryy and Andrew Glennerster. 2021. Route selection in non-Euclidean virtual environments. PLoS ONE 16, 4 April (2021), 1–23. https://doi.org/10.1371/journal.pone.0247818",
      "doi": ""
    },
    {
      "text": "Bonnie Nardi and Justin Harris. 2006. Strangers and Friends: Collaborative Play in World of Warcraft. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work (Banff, Alberta, Canada) (CSCW ’06). Association for Computing Machinery, New York, NY, USA, 149–158. https://doi.org/10.1145/1180875.1180898",
      "doi": "10.1145/1180875.1180898"
    },
    {
      "text": "Nasser Nassiri, Norman Powell, and David Moore. 2010. Human interactions and personal space in collaborative virtual environments. Virtual Reality 14, 4 (12 2010), 229–240. https://doi.org/10.1007/s10055-010-0169-3",
      "doi": ""
    },
    {
      "text": "Carman Neustaedter and Elena Fedorovskaya. 2009. Presenting identity in a virtual world through avatar appearances. In Proceedings of Graphics Interface 2009. Association for Computing Machinery, New York, NY, USA, 183–190. http://portal.acm.org/citation.cfm?id=1555921",
      "doi": "10.5555/1555880.1555921"
    },
    {
      "text": "Iana Podkosova and Hannes Kaufmann. 2018. Co-presence and proxemics in shared walkable virtual environments with mixed colocation. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST. Association for Computing Machinery, New York, NY, USA, 11 pages. https://doi.org/10.1145/3281505.3281523",
      "doi": "10.1145/3281505.3281523"
    },
    {
      "text": "Daniel Pohl and Markus Achtelik. 2019. Personalized personal spaces for virtual reality. In 26th IEEE Conference on Virtual Reality and 3D User Interfaces, VR 2019 - Proceedings. IEEE, NJ, USA, 1128–1129. https://doi.org/10.1109/VR.2019.8797773",
      "doi": ""
    },
    {
      "text": "Bill Rogers, Masood Masoodian, and Mark Apperley. 2018. A virtual cocktail party: Supporting informal social interactions in a virtual conference. In Proceedings of the Workshop on Advanced Visual Interfaces AVI. Association for Computing Machinery, New York, NY, USA, 3 pages. https://doi.org/10.1145/3206505.3206569",
      "doi": "10.1145/3206505.3206569"
    },
    {
      "text": "Daniel Roth, Constantin Klelnbeck, Tobias Feigl, Christopher Mutschler, and Marc Erich Latoschik. 2018. Beyond Replication: Augmenting Social Behaviors in Multi-User Virtual Realities. In 2018 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, NJ, USA, 215–222. https://doi.org/10.1109/VR.2018.8447550",
      "doi": ""
    },
    {
      "text": "Ralph Schroeder, Ilona Heldal, and Jolanda Tromp. 2006. The usability of collaborative virtual environments and methods for the analysis of interaction. Presence: Teleoperators and Virtual Environments 15, 6(2006), 655–667. https://doi.org/10.1162/pres.15.6.655",
      "doi": "10.1162/pres.15.6.655"
    },
    {
      "text": "Shishir Subramanyam, Jie Li, Irene Viola, and Pablo Cesar. 2020. Comparing the Quality of Highly Realistic Digital Humans in 3DoF and 6DoF: A Volumetric Video Case Study. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, NJ, USA, 127–136. https://doi.org/10.1109/VR46266.2020.00031",
      "doi": ""
    },
    {
      "text": "Theresa Jean Tanenbaum, Nazely Hartoonian, and Jeffrey Bryan. 2020. ”how do i make this thing smile?”: An Inventory of Expressive Nonverbal Communication in Commercial Social Virtual Reality Platforms. In Conference on Human Factors in Computing Systems - Proceedings. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376606",
      "doi": ""
    },
    {
      "text": "David Thery and Brian F. G. Katz. 2021. Auditory perception stability evaluation comparing binaural and loudspeaker Ambisonic presentations of dynamic virtual concert auralizations. The Journal of the Acoustical Society of America 149, 1 (2021), 246–258. https://doi.org/10.1121/10.0002942",
      "doi": ""
    },
    {
      "text": "Matteo Varvello, Stefano Ferrari, Ernst Biersack, and Christophe Diot. 2011. Exploring second life. IEEE/ACM Transactions on Networking 19, 1 (2011), 80–91. https://doi.org/10.1109/TNET.2010.2060351",
      "doi": "10.1109/TNET.2010.2060351"
    },
    {
      "text": "Alessandro Vinciarelli, Hugues Salamin, Anna Polychroniou, Gelareh Mohammadi, and Antonio Origlia. 2012. From nonverbal cues to perception: Personality and social attractiveness. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 7403 LNCS (2012), 60–72. https://doi.org/10.1007/978-3-642-34584-5_5",
      "doi": ""
    },
    {
      "text": "William H. Whyte. 1982. The Social Life of Small Urban Spaces. Washington, D.C: Conservation Foundation, USA. 466–468 pages. https://doi.org/10.1177/089124168201000411",
      "doi": ""
    },
    {
      "text": "Laurie M. Wilcox, Samuel Elfassy, Cynthia Grelik, and Robert S. Allison. 2006. Personal Space in Virtual Reality. ACM Transactions on Applied Perception 3, 4 (2006), 412–428. https://doi.org/10.1145/1190036.1190041",
      "doi": "10.1145/1190036.1190041"
    },
    {
      "text": "Julie Williamson, Jie Li, Vinoba Vinayagamoorthy, David A. Shamma, and Pablo Cesar. 2021. Proxemics and Social Interactions in an Instrumented Virtual Reality Workshop. In ACM Conference on Human Factors in Computing Systems (CHI). Association for Computing Machinery, New York, NY, USA, 1–20. https://doi.org/10.1145/3411764.3445729",
      "doi": "10.1145/3411764.3445729"
    },
    {
      "text": "Graham Wilson and Mark McGill. 2018. Violent Video Games in Virtual Reality: Re-Evaluating the Impact and Rating of Interactive Experiences. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (Melbourne, VIC, Australia) (CHI PLAY ’18). Association for Computing Machinery, New York, NY, USA, 535–548. https://doi.org/10.1145/3242671.3242684",
      "doi": "10.1145/3242671.3242684"
    },
    {
      "text": "Noelle L. Wood and Nelson Cowan. 1995. The Cocktail Party Phenomenon Revisited: Attention and Memory in the Classic Selective Listening Procedure of Cherry (1953). Journal of Experimental Psychology: General 124, 3 (1995), 243–262. https://doi.org/10.1037/0096-3445.124.3.243",
      "doi": ""
    },
    {
      "text": "Amal Yassien, Passant ElAgroudy, Elhassan Makled, and Slim Abdennadher. 2020. A Design Space for Social Presence in VR. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. Association for Computing Machinery, New York, NY, USA, Article 8, 12 pages. https://doi.org/10.1145/3419249.3420112",
      "doi": "10.1145/3419249.3420112"
    }
  ]
}