{
  "doi": "10.1145/3491102.3502084",
  "title": "Re-imagining the Power of Priming and Framing Effects in the Context of Political Crowdfunding Campaigns",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-22",
  "year": 2022,
  "badges": [],
  "abstract": "In recent years, political crowdfunding campaigns have emerged through which politicians raise money to fund their election campaigns. Divisive issues discussed in these campaigns may not only motivate donations but also could have a broader priming effect on people’s social opinions. In the U.S., more than one-third of the population with moderate opinions show a tendency to swing their opinion based on recent and more accessible events. In this paper, we ask: can such campaigns further prime people’s responses to partisan topics, even when we discuss those topics in a non-political context? To answer this question, we analyzed the influence of exposure to a political candidate’s crowdfunding campaign on responses to a subsequently seen, unrelated scientific topic that is not inherently political but is seen as partisan in the U.S. (climate change). We found that exposure to an attitude-inconsistent political candidate’s crowdfunding campaign (a campaign that is counter to someone’s existing political beliefs) can have a significant priming effect on subsequently seen politically charged topics. This effect may occur due to the activation of in-group identity by the candidate’s partisan campaign. Guided by these findings, we investigated elements that can mitigate this self-categorization effect. We found that carefully designed content following framing techniques such as schema framing and threat/safety framing can mitigate people’s sense of self-categorization toward non-political topics.",
  "tags": [
    "priming effect",
    "political crowdfunding",
    "framing technique",
    "charitable crowdfunding"
  ],
  "authors": [
    {
      "name": "Sanorita Dey",
      "institution": "Computer Science and Electrical Engineering, University of Maryland Baltimore County, United States",
      "img": "/do/10.1145/contrib-99658693184/rel-imgonly/capture.png",
      "acmid": "99658693184",
      "orcid": "missing"
    },
    {
      "name": "Brittany R.L. Duff",
      "institution": "Charles H. Sandage Dept. of Advertising, University of Illinois at Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659043716",
      "orcid": "missing"
    },
    {
      "name": "Karrie Karahalios",
      "institution": "Computer Science, University of Illinois at Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350570757",
      "orcid": "0000-0001-8788-3405"
    }
  ],
  "references": [
    {
      "text": "Ahmer Arif, Leo Graiden Stewart, and Kate Starbird. 2018. Acting the part: Examining information operations within# BlackLivesMatter discourse. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–27.",
      "doi": "10.1145/3274289"
    },
    {
      "text": "Elena M Auer, Tara S Behrend, Andrew B Collmus, Richard N Landers, and Ahleah F Miles. 2021. Pay for performance, satisfaction and retention in longitudinal crowdsourced research. Plos one 16, 1 (2021), e0245460.",
      "doi": ""
    },
    {
      "text": "Eric PS Baumer, Francesca Polletta, Nicole Pierski, and Geri K Gay. 2017. A simple intervention to reduce framing effects in perceptions of global climate change. Environmental Communication 11, 3 (2017), 289–310.",
      "doi": ""
    },
    {
      "text": "Janine Berg. 2015. Income security in the on-demand economy: Findings and policy lessons from a survey of crowdworkers. Comp. Lab. L. & Pol’y J. 37 (2015), 543.",
      "doi": ""
    },
    {
      "text": "Jonah Berger and Lindsay Rand. 2008. Shifting signals to help health: Using identity signaling to reduce risky health behaviors. Journal of Consumer Research 35, 3 (2008), 509–518.",
      "doi": ""
    },
    {
      "text": "Lawrence Bobo. 1991. Social responsibility, individualism, and redistributive policies. In Sociological Forum, Vol. 6. Springer, 71–92.",
      "doi": ""
    },
    {
      "text": "Javier Borge-Holthoefer, Walid Magdy, Kareem Darwish, and Ingmar Weber. 2015. Content and network dynamics behind Egyptian political polarization on Twitter. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 700–711.",
      "doi": "10.1145/2675133.2675163"
    },
    {
      "text": "Paul R Brewer, Joseph Graf, and Lars Willnat. 2003. Priming or framing: Media influence on attitudes toward foreign countries. Gazette (Leiden, Netherlands) 65, 6 (2003), 493–508.",
      "doi": ""
    },
    {
      "text": "Christopher J Bryan, Carol S Dweck, Lee Ross, Aaron C Kay, and Natalia O Mislavsky. 2009. Political mindset: Effects of schema priming on liberal-conservative political positions. Journal of Experimental Social Psychology 45, 4 (2009), 890–895.",
      "doi": ""
    },
    {
      "text": "Ed Cairns, Jared Kenworthy, Andrea Campbell, and Miles Hewstone. 2006. The role of in-group identification, religious group membership and intergroup conflict in moderating in-group and out-group affect. British Journal of Social Psychology 45, 4 (2006), 701–716.",
      "doi": ""
    },
    {
      "text": "Christina Caron. 2019. Pinterest Restricts Vaccine Search Results to Curb Spread of Misinformation.https://www.nytimes.com/2019/02/23/health/pinterestvaccination-searches.html.",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2016. Political Party Quiz. https://www.people-press.org/quiz/political-party-quiz/.",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2021. Political Typology Quiz. https://www.people-press.org/quiz/political-typology/.",
      "doi": ""
    },
    {
      "text": "Jung-Hua Chang, Yu-Qian Zhu, Shan-Huei Wang, and Yi-Jung Li. 2018. Would you change your mind? An empirical study of social impact theory on Facebook. Telematics and Informatics 35, 1 (2018), 282–292.",
      "doi": ""
    },
    {
      "text": "Adam Corner, Lorraine Whitmarsh, and Dimitrios Xenias. 2012. Uncertainty, scepticism and attitudes towards climate change: biased assimilation and attitude polarisation. Climatic change 114, 3-4 (2012), 463–478.",
      "doi": ""
    },
    {
      "text": "Crowdpac. 2020. Crowdfunding Platform Crowdpac is the Social Network for Politics. https://www.prnewswire.com/news-releases/crowdfunding-platform-crowdpac-is-the-social-network-for-politics-301147844.html.",
      "doi": ""
    },
    {
      "text": "CrowdPac 2021.. https://www.crowdpac.com/.",
      "doi": ""
    },
    {
      "text": "Kahneman Daniel and Tversky Amos. 1984. Choices, values, and frames. American Psychologist 39, 4 (1984), 341–350.",
      "doi": ""
    },
    {
      "text": "Nilanjana Dasgupta. 2004. Implicit ingroup favoritism, outgroup favoritism, and their behavioral manifestations. Social justice research 17, 2 (2004), 143–169.",
      "doi": ""
    },
    {
      "text": "Gerrit De Vynck. 2021. YouTube is banning prominent anti-vaccine activists and blocking all anti-vaccine content.https://www.washingtonpost.com/technology/2021/09/29/youtube-ban-joseph-mercola/.",
      "doi": ""
    },
    {
      "text": "Nicola Dell, Vidya Vaidyanathan, Indrani Medhi, Edward Cutrell, and William Thies. 2012. ” Yours is better!” participant response bias in HCI. In Proceedings of the sigchi conference on human factors in computing systems. 1321–1330.",
      "doi": "10.1145/2207676.2208589"
    },
    {
      "text": "Sanorita Dey, Karrie Karahalios, and Wai-Tat Fu. 2018. Effects of Socially Stigmatized Crowdfunding Campaigns in Shaping Opinions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 242.",
      "doi": "10.1145/3173574.3173816"
    },
    {
      "text": "Diffen.com 2021. Democrat vs Republican - Difference and Comparison. https://www.diffen.com/difference/Democrat_vs_Republican.",
      "doi": ""
    },
    {
      "text": "Lee Drutman. 2020. America Is Now the Divided Republic the Framers Feared. https://www.theatlantic.com/ideas/archive/2020/01/two-party-system-broke-constitution/604213/.",
      "doi": ""
    },
    {
      "text": "Maeve Duggan and Aaron Smith. 2016. The Political Environment on Social Media. https://www.pewresearch.org/internet/2016/10/25/the-political-environment-on-social-media/.",
      "doi": ""
    },
    {
      "text": "Stanley Feldman. 1988. Structure and consistency in public opinion: The role of core beliefs and values. American Journal of political science(1988), 416–440.",
      "doi": ""
    },
    {
      "text": "Stanley Feldman and John Zaller. 1992. The political culture of ambivalence: Ideological responses to the welfare state. American Journal of Political Science(1992), 268–307.",
      "doi": ""
    },
    {
      "text": "Oriel FeldmanHall, Dean Mobbs, Davy Evans, Lucy Hiscox, Lauren Navrady, and Tim Dalgleish. 2012. What we say and what we do: The relationship between real and hypothetical moral choices. Cognition 123, 3 (2012), 434–441.",
      "doi": ""
    },
    {
      "text": "Flippable 2019.. https://flippable.org/.",
      "doi": ""
    },
    {
      "text": "For radical political crowdsourcing 2019. FIREFUND. https://www.firefund.net/.",
      "doi": ""
    },
    {
      "text": "Gallup 2021. Is the seriousness of global warming generally exaggerated, generally correct, or is it generally underestimated?https://news.gallup.com/poll/1615/environment.aspx.",
      "doi": ""
    },
    {
      "text": "Herbert J Gans. 1979. Deciding what’s news: story suitability. Society 16, 3 (1979), 65–77.",
      "doi": ""
    },
    {
      "text": "R Kelly Garrett. 2009. Echo chambers online?: Politically motivated selective exposure among Internet news users. Journal of Computer-Mediated Communication 14, 2 (2009), 265–285.",
      "doi": ""
    },
    {
      "text": "Catherine Grevet, Loren G Terveen, and Eric Gilbert. 2014. Managing political differences in social media. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. 1400–1408.",
      "doi": "10.1145/2531602.2531676"
    },
    {
      "text": "Ulrike Hahn, Adam JL Harris, and Adam Corner. 2009. Argument content and argument source: An exploration. Informal Logic 29, 4 (2009), 337–367.",
      "doi": ""
    },
    {
      "text": "Kotaro Hara, Abigail Adams, Kristy Milland, Saiph Savage, Chris Callison-Burch, and Jeffrey P Bigham. 2018. A data-driven analysis of workers’ earnings on Amazon Mechanical Turk. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3173574.3174023"
    },
    {
      "text": "Reid Hastie and Bernadette Park. 1986. The relationship between memory and judgment depends on whether the judgment task is memory-based or on-line.Psychological review 93, 3 (1986), 258.",
      "doi": ""
    },
    {
      "text": "Paul M Herr, Steven J Sherman, and Russell H Fazio. 1983. On the consequences of priming: Assimilation and contrast effects. Journal of experimental social psychology 19, 4 (1983), 323–340.",
      "doi": ""
    },
    {
      "text": "E Tory Higgins, John A Bargh, and Wendy J Lombardi. 1985. Nature of priming effects on categorization.Journal of experimental psychology: Learning, Memory, and Cognition 11, 1(1985), 59.",
      "doi": ""
    },
    {
      "text": "E Tory Higgins, William S Rholes, and Carl R Jones. 1977. Category accessibility and impression formation. Journal of experimental social psychology 13, 2 (1977), 141–154.",
      "doi": ""
    },
    {
      "text": "Yiqing Hua, Mor Naaman, and Thomas Ristenpart. 2020. Characterizing twitter users who engage in adversarial interactions against political candidates. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376548"
    },
    {
      "text": "Andrew Hutchinsona. 2019. Pinterest Will Limit Search Results for Vaccine-Related Queries to Content from Official Health Outlets.https://www.socialmediatoday.com/news/pinterest-will-limit-search-resultsfor-vaccine-related-queries-to-content/561885/.",
      "doi": ""
    },
    {
      "text": "Shanto Iyengar and Donald R Kinder. 2010. News that matters: Television and American opinion. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "John T Jost, Jack Glaser, Arie W Kruglanski, and Frank J Sulloway. 2003. Political conservatism as motivated social cognition.Psychological bulletin 129, 3 (2003), 339.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman and Amos Tversky. 2013. Choices, values, and frames. In Handbook of the fundamentals of financial decision making: Part I. World Scientific, 269–278.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman and Amos Tversky. 2013. Prospect theory: An analysis of decision under risk. In Handbook of the fundamentals of financial decision making: Part I. World Scientific, 99–127.",
      "doi": ""
    },
    {
      "text": "Caroline Kelly. 1989. Political identity and perceived intragroup homogeneity. British Journal of Social Psychology 28, 3 (1989), 239–250.",
      "doi": ""
    },
    {
      "text": "David C Kimball. 2005. Priming partisan evaluations of congress. Legislative Studies Quarterly 30, 1 (2005), 63–84.",
      "doi": ""
    },
    {
      "text": "Joshua Klayman. 1995. Varieties of confirmation bias. In Psychology of learning and motivation. Vol. 32. Elsevier, 385–418.",
      "doi": ""
    },
    {
      "text": "James R Kluegel and Eliot R Smith. 2017. Beliefs about inequality: Americans’ views of what is and what ought to be. Routledge.",
      "doi": ""
    },
    {
      "text": "Juhi Kulshrestha, Motahhare Eslami, Johnnatan Messias, Muhammad Bilal Zafar, Saptarshi Ghosh, Krishna P Gummadi, and Karrie Karahalios. 2017. Quantifying search bias: Investigating sources of bias for political searches in social media. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 417–432.",
      "doi": "10.1145/2998181.2998321"
    },
    {
      "text": "Shana Kushner Gadarian, Sara Wallace Goodman, and Thomas B Pepinsky. 2020. Partisanship, health behavior, and policy attitudes in the early stages of the COVID-19 pandemic. Health Behavior, and Policy Attitudes in the Early Stages of the COVID-19 Pandemic (March 27, 2020)(2020).",
      "doi": ""
    },
    {
      "text": "Anthony Leiserowitz. 2006. Climate change risk perception and policy preferences: The role of affect, imagery, and values. Climatic change 77, 1-2 (2006), 45–72.",
      "doi": ""
    },
    {
      "text": "Matthew Levendusky. 2013. Partisan media exposure and attitudes toward the opposition. Political communication 30, 4 (2013), 565–581.",
      "doi": ""
    },
    {
      "text": "Charles G Lord, Lee Ross, and Mark R Lepper. 1979. Biased assimilation and attitude polarization: The effects of prior theories on subsequently considered evidence.Journal of personality and social psychology 37, 11(1979), 2098.",
      "doi": ""
    },
    {
      "text": "Matsakis Louise. 2019. Facebook Will Crack Down on Anti-Vaccine Content.https://www.wired.com/story/facebook-anti-vaccine-crack-down/.",
      "doi": ""
    },
    {
      "text": "Sam J Maglio. 2020. Psychological distance in consumer psychology: Consequences and antecedents. Consumer Psychology Review 3, 1 (2020), 108–125.",
      "doi": ""
    },
    {
      "text": "Dan Marom. 2012. A Framework for Political Crowdfunding: Lessons From President Obama. https://crowdsourcingweek.com/blog/a-framework-for-political-crowdfunding-lessons-from-president-obama/.",
      "doi": ""
    },
    {
      "text": "Najle Maxine and Jones Robert P.2019. American Democracy in Crisis: The Fate of Pluralism in a Divided Nation. https://www.prri.org/research/american-democracy-in-crisis-the-fate-of-pluralism-in-a-divided-nation/.",
      "doi": ""
    },
    {
      "text": "Herbert McClosky and John Zaller. 1984. The American ethos: Public attitudes toward capitalism and democracy. Harvard Univ Press.",
      "doi": ""
    },
    {
      "text": "Matt McGee. 2013. In Quality Raters’ Handbook, Google Adds Higher Standards For “Your Money Or Your Life” Websites. https://searchengineland.com/quality-raters-handbook-your-money-or-your-life-177663.",
      "doi": ""
    },
    {
      "text": "Brian McInnis, Dan Cosley, Chaebong Nam, and Gilly Leshed. 2016. Taking a HIT: Designing around rejection, mistrust, risk, and workers’ experiences in Amazon Mechanical Turk. In Proceedings of the 2016 CHI conference on human factors in computing systems. 2271–2282.",
      "doi": "10.1145/2858036.2858539"
    },
    {
      "text": "Marshall H Medoff. 1997. The political implications of state political ideology: A measure tested. American Journal of Economics and Sociology 56, 2 (1997), 145–158.",
      "doi": ""
    },
    {
      "text": "Jeffrey Mervis. 2015. Politics, science, and public attitudes: What we’re learning, and why it matters. https://www.sciencemag.org/news/2015/02/politics-science-and-public-attitudes-what-we-re-learning-and-why-it-matters.",
      "doi": ""
    },
    {
      "text": "Solomon Messing and Sean J Westwood. 2014. Selective exposure in the age of social media: Endorsements trump partisan source affiliation when selecting news online. Communication research 41, 8 (2014), 1042–1063.",
      "doi": ""
    },
    {
      "text": "Miriam J Metzger, Ethan H Hartsell, and Andrew J Flanagin. 2020. Cognitive dissonance or credibility? A comparison of two theoretical explanations for selective exposure to partisan news. Communication Research 47, 1 (2020), 3–28.",
      "doi": ""
    },
    {
      "text": "Amy Mitchell, Jeffrey Gottfried, Jocelyn Kiley, and Katerina Eva Matsa. 2014. Political Polarization & Media Habits. https://www.journalism.org/2014/10/21/political-polarization-media-habits/.",
      "doi": ""
    },
    {
      "text": "David B Mitchell. 2006. Nonconscious priming after 17 years: Invulnerable implicit memory?Psychological Science 17, 11 (2006), 925–929.",
      "doi": ""
    },
    {
      "text": "Karolina Moutsopoulou, Christina Pfeuffer, Andrea Kiesel, Qing Yang, and Florian Waszak. 2019. How long is long-term priming? Classification and action priming in the scale of days. Quarterly Journal of Experimental Psychology 72, 5(2019), 1183–1199.",
      "doi": ""
    },
    {
      "text": "Paul R Nail, Ian McGregor, April E Drinkwater, Garrett M Steele, and Anthony W Thompson. 2009. Threat causes liberals to think like conservatives. Journal of Experimental Social Psychology 45, 4 (2009), 901–907.",
      "doi": ""
    },
    {
      "text": "Jaime L Napier, Julie Huang, Andrew J Vonasch, and John A Bargh. 2018. Superheroes for change: Physical safety promotes socially (but not economically) progressive attitudes among conservatives. European Journal of Social Psychology 48, 2 (2018), 187–195.",
      "doi": ""
    },
    {
      "text": "Thomas E Nelson, Rosalee A Clawson, and Zoe M Oxley. 1997. Media framing of a civil liberties conflict and its effect on tolerance. American Political Science Review(1997), 567–583.",
      "doi": ""
    },
    {
      "text": "Thomas E Nelson and Donald R Kinder. 1996. Issue frames and group-centrism in American public opinion. The Journal of Politics 58, 4 (1996), 1055–1078.",
      "doi": ""
    },
    {
      "text": "Thomas E Nelson, Zoe M Oxley, and Rosalee A Clawson. 1997. Toward a psychology of framing effects. Political behavior 19, 3 (1997), 221–246.",
      "doi": ""
    },
    {
      "text": "Frank Newport and Andrew Dugan. 2017. Partisan Differences Growing on a Number of Issues. https://news.gallup.com/opinion/polling-matters/215210/partisan-differences-growing-number-issues.aspx.",
      "doi": ""
    },
    {
      "text": "BBC News. 2013. The Statue of Liberty and America’s crowdfunding pioneer. https://www.bbc.com/news/magazine-21932675.",
      "doi": ""
    },
    {
      "text": "Stephen P Nicholson. 2012. Polarizing cues. American Journal of Political Science 56, 1 (2012), 52–66.",
      "doi": ""
    },
    {
      "text": "Raymond S Nickerson. 1998. Confirmation bias: A ubiquitous phenomenon in many guises. Review of general psychology 2, 2 (1998), 175–220.",
      "doi": ""
    },
    {
      "text": "Gastón Olivares, Juan Pablo Cárdenas, Juan Carlos Losada, and Javier Borondo. 2019. Opinion polarization during a dichotomous electoral process. Complexity 2019(2019).",
      "doi": ""
    },
    {
      "text": "Elizabeth Levy Paluck, Seth A Green, and Donald P Green. 2018. The contact hypothesis re-evaluated. Behavioural Public Policy(2018), 1–30.",
      "doi": ""
    },
    {
      "text": "Zhongdang Pan and Gerald M Kosicki. 1993. Framing analysis: An approach to news discourse. Political communication 10, 1 (1993), 55–75.",
      "doi": ""
    },
    {
      "text": "Zizi Papacharissi and Maria de Fatima Oliveira. 2012. Affective news and networked publics: The rhythms of news storytelling on# Egypt. Journal of communication 62, 2 (2012), 266–282.",
      "doi": ""
    },
    {
      "text": "Partisanship and political animosity in 2016. 2016. Views of parties’ positions on issues, ideologies. https://www.pewresearch.org/politics/2016/06/22/5-views-of-parties-positions-on-issues-ideologies/.",
      "doi": ""
    },
    {
      "text": "Gordon Pennycook, Jonathon McPhetres, Yunhao Zhang, Jackson G Lu, and David G Rand. 2020. Fighting COVID-19 misinformation on social media: Experimental evidence for a scalable accuracy-nudge intervention. Psychological science 31, 7 (2020), 770–780.",
      "doi": ""
    },
    {
      "text": "Richard E Petty and John T Cacioppo. 1984. The effects of involvement on responses to argument quantity and quality: Central and peripheral routes to persuasion.Journal of personality and social psychology 46, 1(1984), 69.",
      "doi": ""
    },
    {
      "text": "Richard E Petty, Kenneth G DeMarree, Pablo Briñol, Javier Horcajo, and Alan J Strathman. 2008. Need for cognition can magnify or attenuate priming effects in social judgment. Personality and Social Psychology Bulletin 34, 7 (2008), 900–912.",
      "doi": ""
    },
    {
      "text": "Eva M Pomerantz, Shelly Chaiken, and Rosalind S Tordesillas. 1995. Attitude strength and resistance processes.Journal of personality and social psychology 69, 3(1995), 408.",
      "doi": ""
    },
    {
      "text": "Solange Pompl and Sergiu Gherghina. 2019. Familiar faces and negative messages: how to crowdfund a political campaign in the UK. https://blogs.lse.ac.uk/politicsandpolicy/how-to-crowdfund-a-political-campaign/.",
      "doi": ""
    },
    {
      "text": "Nadja Popovich. 2020. Climate Change Rises as a Public Priority. But It’s More Partisan Than Ever.https://www.nytimes.com/interactive/2020/02/20/climate/climate-change-polls.html.",
      "doi": ""
    },
    {
      "text": "Scott A Reid. 2012. A self-categorization explanation for the hostile media effect. Journal of Communication 62, 3 (2012), 381–399.",
      "doi": ""
    },
    {
      "text": "David R Roskos-Ewoldsen and Beverly Roskos-Ewoldsen. 2009. Media priming: An updated synthesis. In Media effects. Routledge, 90–109.",
      "doi": ""
    },
    {
      "text": "LYDIA SAAD. 2012. Conservatives Remain the Largest Ideological Group in U.S.https://news.gallup.com/poll/152021/conservatives-remain-largest-ideological-group.aspx.",
      "doi": ""
    },
    {
      "text": "Lydia Saad. 2018. Conservative Lead in U.S. Ideology Is Down to Single Digits. https://news.gallup.com/poll/225074/conservative-lead-ideology-down-single-digits.aspx.",
      "doi": ""
    },
    {
      "text": "Dietram A Scheufele and David Tewksbury. 2007. Framing, agenda setting, and priming: The evolution of three media effects models. Journal of communication 57, 1 (2007), 9–20.",
      "doi": ""
    },
    {
      "text": "Norbert Schwarz and Gerald L Clore. 1983. Mood, misattribution, and judgments of well-being: informative and directive functions of affective states.Journal of personality and social psychology 45, 3(1983), 513.",
      "doi": ""
    },
    {
      "text": "Bryan C Semaan, Scott P Robertson, Sara Douglas, and Misa Maruyama. 2014. Social media supporting political deliberation across multiple public spheres: towards depolarization. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. 1409–1421.",
      "doi": "10.1145/2531602.2531605"
    },
    {
      "text": "AARTI SHAHANI. 2017. Thinking Of Running For Office? A Website Lets You Test The Waters. https://www.npr.org/sections/alltechconsidered/2017/08/30/546061687/thinking-of-running-for-office-a-website-lets-you-test-the-waters.",
      "doi": ""
    },
    {
      "text": "Sister District Project 2021.. https://sisterdistrict.com/.",
      "doi": ""
    },
    {
      "text": "Eliot R Smith. 1986. Beliefs about Inequality: Americans’ Views of what is and what Ought to be. New York: A. de Gruyter.",
      "doi": ""
    },
    {
      "text": "Thomas K Srull and Robert S Wyer. 1980. Category accessibility and social perception: Some implications for the study of person memory and interpersonal judgments.Journal of Personality and Social Psychology 38, 6(1980), 841.",
      "doi": ""
    },
    {
      "text": "SwingLeft 2020.. https://swingleft.org/.",
      "doi": ""
    },
    {
      "text": "Briony Swire, Ullrich KH Ecker, and Stephan Lewandowsky. 2017. The role of familiarity in correcting inaccurate information.Journal of experimental psychology: learning, memory, and cognition 43, 12(2017), 1948.",
      "doi": ""
    },
    {
      "text": "History Talk. 2017. Smart conversations about today’s most interesting topics - a history podcast for everyone. https://origins.osu.edu/history-talk.",
      "doi": ""
    },
    {
      "text": "Amanda Taub. 2017. Why Americans Vote ‘Against Their Interest’: Partisanship. https://www.nytimes.com/2017/04/12/upshot/why-americans-vote-against-their-interest-partisanship.html.",
      "doi": ""
    },
    {
      "text": "GlobalGiving Team. 2018. Content Vs. Context: The Effects Of Messaging + Framing On Charitable Giving. https://www.globalgiving.org/learn/framing-tips-for-fundraising/.",
      "doi": ""
    },
    {
      "text": "Erik P Thompson, Robert J Roman, Gordon B Moskowitz, Shelly Chaiken, and John A Bargh. 1994. Accuracy motivation attenuates covert priming: The systematic reprocessing of social information.Journal of personality and Social Psychology 66, 3(1994), 474.",
      "doi": ""
    },
    {
      "text": "Yariv Tsfati and Joseph N Cappella. 2003. Do people watch what they do not trust? Exploring the association between news media skepticism and exposure. Communication Research 30, 5 (2003), 504–529.",
      "doi": ""
    },
    {
      "text": "uCampaign 2021.. https://ucampaignapp.com/.",
      "doi": ""
    },
    {
      "text": "Yiran Wang and Gloria Mark. 2017. Engaging with political and social issues on Facebook in college life. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 433–445.",
      "doi": "10.1145/2998181.2998295"
    },
    {
      "text": "Amanda Wills. 2014. How Increasing Ideological Uniformity and Partisan Antipathy Affect Politics, Compromise and Everyday Life. https://www.people-press.org/2014/06/12/political-polarization-in-the-american-public/.",
      "doi": ""
    }
  ]
}