{
  "doi": "10.1145/3491102.3502117",
  "title": "Embr: A Creative Framework for Hand Embroidered Liquid Crystal Textile Displays",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "Conductive thread is a common material in e-textile toolkits that allows practitioners to create connections between electronic components sewn on fabric. When powered, conductive threads are used as resistive heaters to activate thermochromic dyes or pigments on textiles to create interactive, aesthetic, and ambient textile displays. In this work, we introduce Embr, a creative framework for supporting hand-embroidered liquid crystal textile displays (LCTDs). This framework includes a characterization of conductive embroidery stitches, an expanded repertoire of thermal formgiving techniques, and a thread modeling tool used to simulate mechanical, thermal, and electrical behaviors of LCTDs. Through exemplar artifacts, we annotate a morphological design space of LCTDs and discuss the tensions and opportunities of satisfying the wider range of electrical, craft, cultural, aesthetic, and functional concerns inherent to e-textile practices.",
  "authors": [
    {
      "name": "Shreyosi Endow",
      "institution": "The University of Texas at Arlington, United States",
      "img": "/do/10.1145/contrib-99659755038/rel-imgonly/profile_pic.png",
      "acmid": "99659755038",
      "orcid": "missing"
    },
    {
      "name": "Mohammad Abu Nasir Rakib",
      "institution": "The University of Texas at Arlington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238397",
      "orcid": "missing"
    },
    {
      "name": "Anvay Srivastava",
      "institution": "The University of Texas at Arlington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659755890",
      "orcid": "missing"
    },
    {
      "name": "Sara Rastegarpouyani",
      "institution": "Savannah College of Art and Design, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239898",
      "orcid": "missing"
    },
    {
      "name": "Cesar Torres",
      "institution": "The University of Texas at Arlington, United States",
      "img": "/do/10.1145/contrib-81557154856/rel-imgonly/cesartorres.jpg",
      "acmid": "81557154856",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Roland Aigner, Andreas Pointner, Thomas Preindl, Rainer Danner, and Michael Haller. 2021. TexYZ: Embroidering Enameled Wires for Three Degree-of-Freedom Mutual Capacitive Sensing. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445479"
    },
    {
      "text": "Roland Aigner, Andreas Pointner, Thomas Preindl, Patrick Parzer, and Michael Haller. 2020. Embroidered Resistive Pressure Sensors: A Novel Approach for Textile Interfaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376305",
      "doi": "10.1145/3313831.3376305"
    },
    {
      "text": "Desislava Baeva. 2019. Using Lindenmayer Systems For Generative Modeling Of Graphic Concepts, Set In Elements Of Bulgarian Folklore Embroidery. In Proceedings of the 20th International Conference on Computer Systems and Technologies. 234–239.",
      "doi": "10.1145/3345252.3345295"
    },
    {
      "text": "Joanna Berzowska. 2004. Very slowly animating textiles: shimmering flower. In ACM SIGGRAPH 2004 Sketches. 34.",
      "doi": "10.1145/1186223.1186266"
    },
    {
      "text": "Joanna Berzowska. 2005. Electronic Textiles: Wearable Computers, Reactive Fashion, and Soft Computation. TEXTILE 3, 1 (2005), 58–75. https://doi.org/10.2752/147597505778052639",
      "doi": ""
    },
    {
      "text": "Joanna Berzowska. 2005. Memory rich clothing: second skins that communicate physical memory. In Proceedings of the 5th Conference on Creativity & Cognition. 32–40.",
      "doi": "10.1145/1056224.1056231"
    },
    {
      "text": "Joanna Berzowska and Marcelo Coelho. 2006. Smoks: the memory suits. In CHI’06 Extended Abstracts on Human Factors in Computing Systems. 538–543.",
      "doi": ""
    },
    {
      "text": "Leah Buechley and Benjamin Mako Hill. 2010. LilyPad in the wild: how hardware’s long tail is supporting new engineering and design communities. In Proceedings of the 8th ACM conference on designing interactive systems. 199–207.",
      "doi": "10.1145/1858171.1858206"
    },
    {
      "text": "Laura Devendorf, Joanne Lo, Noura Howell, Jung Lin Lee, Nan-Wei Gong, M Emre Karagozler, Shiho Fukuhara, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. ” I don’t Want to Wear a Screen” Probing Perceptions of and Possibilities for Dynamic Displays on Clothing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 6028–6039.",
      "doi": "10.1145/2858036.2858192"
    },
    {
      "text": "Tamara Anna Efrat, Moran Mizrahi, and Amit Zoran. 2016. The hybrid bricolage: Bridging parametric design with craft through algorithmic modularity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 5984–5995.",
      "doi": "10.1145/2858036.2858441"
    },
    {
      "text": "Maas Goudswaard, Abel Abraham, Bruna Goveia da Rocha, Kristina Andersen, and Rong-Hao Liang. 2020. FabriClick: Interweaving Pushbuttons into Fabrics Using 3D Printing and Digital Embroidery. In Proceedings of the 2020 ACM on Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 379–393. https://doi.org/10.1145/3357236.3395569",
      "doi": "10.1145/3357236.3395569"
    },
    {
      "text": "Bruna Goveia da Rocha, Oscar Tomico, Panos Markopoulos, and Daniel Tetteroo. 2020. Crafting Research Products through Digital Machine Embroidery. In Proceedings of the 2020 ACM on Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 341–350. https://doi.org/10.1145/3357236.3395443",
      "doi": "10.1145/3357236.3395443"
    },
    {
      "text": "Ramyah Gowrishankar and Jussi Mikkonen. 2013. Pattern Resistors: Exploring Resistive Motifs as Components for e-Embroidery. In Proceedings of the 2013 International Symposium on Wearable Computers (Zurich, Switzerland) (ISWC ’13). Association for Computing Machinery, New York, NY, USA, 137–138. https://doi.org/10.1145/2493988.2494341",
      "doi": "10.1145/2493988.2494341"
    },
    {
      "text": "Nur Al-huda Hamdan, Simon Voelker, and Jan Borchers. 2018. Sketch&Stitch: Interactive Embroidery for E-Textiles. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173656",
      "doi": "10.1145/3173574.3173656"
    },
    {
      "text": "Shiqing He and Eytan Adar. 2020. Plotting with Thread: Fabricating Delicate Punch Needle Embroidery with X-Y Plotters. In Proceedings of the 2020 ACM on Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 1047–1057. https://doi.org/10.1145/3357236.3395540",
      "doi": "10.1145/3357236.3395540"
    },
    {
      "text": "Chris Hill, Michael Schneider, Ann Eisenberg, and Mark D Gross. 2021. The ThreadBoard: Designing an E-Textile Rapid Prototyping Board. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction. 1–7.",
      "doi": "10.1145/3430524.3440642"
    },
    {
      "text": "Megan Hofmann, Jennifer Mankoff, and Scott E Hudson. 2020. KnitGIST: A programming synthesis toolkit for generating functional machine-knitting textures. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 1234–1247.",
      "doi": "10.1145/3379337.3415590"
    },
    {
      "text": "Noura Howell, Laura Devendorf, Rundong Tian, Tomás Vega Galvez, Nan-Wei Gong, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. Biosignals as social cues: Ambiguity and emotional interpretation in social displays of skin conductance. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. 865–870.",
      "doi": "10.1145/2901790.2901850"
    },
    {
      "text": "Margot Jacobs and Linda Worbin. 2005. Reach: dynamic textile patterns for communication and social expression. In CHI’05 Extended Abstracts on Human Factors in Computing Systems. 1493–1496.",
      "doi": ""
    },
    {
      "text": "Jeyeon Jo and Cindy Hsin-Liu Kao. 2021. SkinLace: Freestanding Lace by Machine Embroidery for On-Skin Interface. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3411763.3451756"
    },
    {
      "text": "Yasmin Kafai, Kristin Searle, Crîstobal Martinez, and Bryan Brayboy. 2014. Ethnocomputing with electronic textiles: Culturally responsive open design to broaden participation in computing in American Indian youth and communities. In Proceedings of the 45th ACM technical symposium on Computer science education. 241–246.",
      "doi": "10.1145/2538862.2538903"
    },
    {
      "text": "James C Kaufman and Ronald A Beghetto. 2009. Beyond big and little: The four c model of creativity. Review of general psychology 13, 1 (2009), 1–12.",
      "doi": ""
    },
    {
      "text": "Blazej Kubiak, Nico Pietroni, Fabio Ganovelli, and Marco Fratarcangeli. 2007. A robust method for real-time thread simulation. In Proceedings of the 2007 ACM symposium on Virtual reality software and technology. 85–88.",
      "doi": "10.1145/1315184.1315198"
    },
    {
      "text": "Stacey Kuznetsov, Piyum Fernando, Emily Ritter, Cassandra Barrett, Jennifer Weiler, and Marissa Rohr. 2018. Screenprinting and TEI: Supporting Engagement with STEAM through DIY Fabrication of Smart Materials. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (Stockholm, Sweden) (TEI ’18). Association for Computing Machinery, New York, NY, USA, 211–220. https://doi.org/10.1145/3173225.3173253",
      "doi": "10.1145/3173225.3173253"
    },
    {
      "text": "Anne Lamers, Evy Murraij, Elze Schers, and Armando Rodríguez Pérez. 2019. Layered embroidery for dynamic aesthetics. In Proceedings of the 23rd International Symposium on Wearable Computers. 302–305.",
      "doi": "10.1145/3341163.3346942"
    },
    {
      "text": "Yi-Chin Lee and Daniel Cardoso Llach. 2020. Hybrid embroidery: exploring interactive fabrication in handcrafts. Leonardo 53, 4 (2020), 429–433.",
      "doi": ""
    },
    {
      "text": "Jürg Lehni and Jonathan Puckey. 2011. Paper.js. http://paperjs.org/",
      "doi": ""
    },
    {
      "text": "Vladimir Leonov and Ruud JM Vullers. 2009. Wearable electronics self-powered by using human body heat: The state of the art and the perspective. Journal of Renewable and Sustainable Energy 1, 6 (2009), 062701.",
      "doi": ""
    },
    {
      "text": "Yulong Liu, Miao Wang, Bingyi Xia, and Terry Tao Ye. 2020. Fabrics-Based Embroidered Passive Displacement Sensors for On-Body Applications.. In EWSN. 230–235.",
      "doi": ""
    },
    {
      "text": "Joanne Lo, Cesar Torres, Isabel Yang, Jasper O’Leary, Danny Kaufman, Wilmot Li, Mira Dontcheva, and Eric Paulos. 2016. Aesthetic electronics: Designing, sketching, and fabricating circuits through digital exploration. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 665–676.",
      "doi": "10.1145/2984511.2984579"
    },
    {
      "text": "Nicolas Maréchal, Eric Guérin, Eric Galin, Stéphane Mérillou, and Nicolas Mérillou. 2010. Heat transfer simulation for modeling realistic winter sceneries. In Computer Graphics Forum, Vol. 29. Wiley Online Library, 449–458.",
      "doi": ""
    },
    {
      "text": "Viktorija Mecnika, Melanie Hoerr, Ivars Krievins, Stefan Jockenhoevel, and Thomas Gries. 2014. Technical embroidery for smart textiles. Materials Science. Textile and Clothing Technology 9 (2014), 56–63.",
      "doi": ""
    },
    {
      "text": "Janis Lena Meissner, Angelika Strohmayer, Peter Wright, and Geraldine Fitzpatrick. 2018. A Schnittmuster for Crafting Context-Sensitive Toolkits. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173725"
    },
    {
      "text": "Sara Mlakar and Michael Haller. 2020. Design Investigation of Embroidered Interactive Elements on Non-Wearable Textile Interfaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3313831.3376692",
      "doi": "10.1145/3313831.3376692"
    },
    {
      "text": "Martin Murer, Verena Fuchsberger, and Manfred Tscheligi. 2017. Un-crafting: De-constructive engagements with interactive artifacts. In Proceedings of the Eleventh International Conference on tangible, embedded, and embodied interaction. 67–77.",
      "doi": "10.1145/3024969.3024993"
    },
    {
      "text": "Sara Nabil, Lee Jones, and Audrey Girouard. 2021. Soft Speakers: Digital Embroidering of DIY Customizable Fabric Actuators. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction. 1–12.",
      "doi": "10.1145/3430524.3440630"
    },
    {
      "text": "Linnéa Nilsson, Mika Satomi, Anna Vallgårda, and Linda Worbin. 2011. Understanding the complexity of designing dynamic textile patterns. In Ambience’11, where art, technology and design meet, Borås Sweden, 28-30 November 2011. CTF.",
      "doi": ""
    },
    {
      "text": "Michael Nitsche and Anna Weisling. 2019. When is it not Craft? Materiality and Mediation when Craft and Computing Meet. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction. 683–689.",
      "doi": "10.1145/3294109.3295651"
    },
    {
      "text": "Roshan Lalintha Peiris, Adrian David Cheok, James Keng Soon Teh, Owen Noel Newton Fernando, Wen Yingqian, Andre Lim, Pan Yi, Doros Polydorou, Kian Peng Ong, and Mili Tharakan. 2009. AmbiKraf: an embedded non-emissive and fast changing wearable display. In ACM SIGGRAPH 2009 Emerging Technologies. 1–1.",
      "doi": "10.1145/1597956.1597957"
    },
    {
      "text": "Roshan Lalintha Peiris and Ryohei Nakatsu. 2013. TempTouch: a novel touch sensor using temperature controllers for surface based textile displays. In Proceedings of the 2013 ACM international conference on Interactive tabletops and surfaces. 105–114.",
      "doi": "10.1145/2512349.2512813"
    },
    {
      "text": "Hannah Perner-Wilson, Leah Buechley, and Mika Satomi. 2010. Handcrafting textile interfaces from a kit-of-no-parts. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction. 61–68.",
      "doi": "10.1145/1935701.1935715"
    },
    {
      "text": "Irene Posch and Geraldine Fitzpatrick. 2018. Integrating Textile Materials with Electronic Making: Creating New Tools and Practices. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction. 158–165.",
      "doi": "10.1145/3173225.3173255"
    },
    {
      "text": "Irene Posch and Ebru Kurbak. 2016. Crafted logic towards hand-crafting a computer. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 3881–3884.",
      "doi": "10.1145/2851581.2891101"
    },
    {
      "text": "Ernest Rehmatulla Post, Maggie Orth, Peter R Russo, and Neil Gershenfeld. 2000. E-broidery: Design and fabrication of textile-based computing. IBM Systems journal 39, 3.4 (2000), 840–860.",
      "doi": "10.1147/sj.393.0840"
    },
    {
      "text": "Thomas Preindl, Cedric Honnet, Andreas Pointner, Roland Aigner, Joseph A Paradiso, and Michael Haller. 2020. Sonoflex: Embroidered Speakers Without Permanent Magnets. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 675–685.",
      "doi": "10.1145/3379337.3415888"
    },
    {
      "text": "Mitchel Resnick, Brad Myers, Kumiyo Nakakoji, Ben Shneiderman, Randy Pausch, Ted Selker, and Mike Eisenberg. 2005. Design principles for tools to support creative thinking. (2005).",
      "doi": ""
    },
    {
      "text": "Daniel Saakes, Masahiko Inami, Takeo Igarashi, Naoya Koizumi, and Ramesh Raskar. 2012. Shader printer. In ACM SIGGRAPH 2012 Emerging Technologies. 1–1.",
      "doi": "10.1145/2343456.2343474"
    },
    {
      "text": "Masato Sekine, Naoya Watabe, Miki Yamamura, and Hiroko Uchiyama. 2018. Expansion of Textile Expression Utilizing Op Art Methods and Transmissive Liquid Crystal Film, and Progress toward Its Use in Garments. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems. 299–302.",
      "doi": "10.1145/3197391.3205389"
    },
    {
      "text": "Richard Sennett. 2008. The craftsman. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Manlin Song, Chenyu Jia, and Katia Vega. 2018. Eunoia: Dynamically Control Thermochromic Displays for Animating Patterns on Fabrics. In Proceedings of the 2018 ACM International Joint Conference and 2018 International Symposium on Pervasive and Ubiquitous Computing and Wearable Computers. 255–258.",
      "doi": "10.1145/3267305.3267557"
    },
    {
      "text": "Yuka Takahashi and Tsukasa Fukusato. 2018. Stitch: An Interactive Design System for Hand-Sewn Embroidery. In ACM SIGGRAPH 2018 Posters(Vancouver, British Columbia, Canada) (SIGGRAPH ’18). Association for Computing Machinery, New York, NY, USA, Article 17, 2 pages. https://doi.org/10.1145/3230744.3230758",
      "doi": "10.1145/3230744.3230758"
    },
    {
      "text": "Cesar Torres, Jessica Chang, Advaita Patel, and Eric Paulos. 2019. Phosphenes: Crafting Resistive Heaters Within Thermoreactive Composites. In Proceedings of the 2019 on Designing Interactive Systems Conference. 907–919.",
      "doi": "10.1145/3322276.3322375"
    },
    {
      "text": "Muhammad Umair, Muhammad Hamza Latif, and Corina Sas. 2018. Dynamic displays at wrist for real time visualization of affective data. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems. 201–205.",
      "doi": "10.1145/3197391.3205436"
    },
    {
      "text": "Muhammad Umair, Corina Sas, and Miquel Alfaras. 2020. ThermoPixels: Toolkit for personalizing arousal-based interfaces through hybrid crafting. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 1017–1032.",
      "doi": "10.1145/3357236.3395512"
    },
    {
      "text": "Muhammad Umair, Corina Sas, and Muhammad Hamza Latif. 2019. Towards affective chronometry: Exploring smart materials and actuators for real-time representations of changes in arousal. In Proceedings of the 2019 on Designing Interactive Systems Conference. 1479–1494.",
      "doi": "10.1145/3322276.3322367"
    },
    {
      "text": "Akira Wakita and Midori Shibutani. 2006. Mosaic textile: wearable ambient display with non-emissive color-changing modules. In Proceedings of the 2006 ACM SIGCHI international conference on Advances in computer entertainment technology. 48–es.",
      "doi": "10.1145/1178823.1178880"
    },
    {
      "text": "Gili Weinberg, Maggie Orth, and Peter Russo. 2000. The embroidered musical ball: a squeezable instrument for expressive performance. In CHI’00 extended abstracts on Human factors in computing systems. 283–284.",
      "doi": ""
    },
    {
      "text": "Ursula Wolz, Michael Auschauer, and Andrea Mayr-Stalder. 2019. Programming Embroidery with Turtlestitch. In ACM SIGGRAPH 2019 Studio (Los Angeles, California) (SIGGRAPH ’19). Association for Computing Machinery, New York, NY, USA, Article 12, 2 pages. https://doi.org/10.1145/3306306.3328002",
      "doi": ""
    },
    {
      "text": "Kewei Yang, Zhengxing Sun, Chen Ma, and Wei Yang. 2016. Paint with stitches: a random-needle embroidery rendering method. In Proceedings of the 33rd computer graphics International. 9–12.",
      "doi": "10.1145/2949035.2949038"
    },
    {
      "text": "Kewei Yang, Jie Zhou, Zhengxing Sun, and Yi Li. 2012. Image-based irregular needling embroidery rendering. In proceedings of the 5th international symposium on visual information communication and interaction. 87–94.",
      "doi": "10.1145/2397696.2397709"
    }
  ]
}