{
  "doi": "10.1145/3491102.3502113",
  "title": "FlexHaptics: A Design Method for Passive Haptic Inputs Using Planar Compliant Structures",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2022,
  "badges": [],
  "abstract": "This paper presents FlexHaptics, a design method for creating custom haptic input interfaces. Our approach leverages planar compliant structures whose force-deformation relationship can be altered by adjusting the geometries. Embedded with such structures, a FlexHaptics module exerts a fine-tunable haptic effect (i.e., resistance, detent, or bounce) along a movement path (i.e., linear, rotary, or ortho-planar). These modules can work separately or combine into an interface with complex movement paths and haptic effects. To enable the parametric design of FlexHaptic modules, we provide a design editor that converts user-specified haptic properties into underlying mechanical structures of haptic modules. We validate our approach and demonstrate the potential of FlexHaptic modules through six application examples, including a slider control for a painting application and a piano keyboard interface on touchscreens, a tactile low vision timer, VR game controllers, and a compound input device of a joystick and a two-step button.",
  "tags": [
    "Digital fabrication",
    "Tangible interface.",
    "Compliant structure",
    "Parametric design",
    "Haptics"
  ],
  "authors": [
    {
      "name": "Hongnan Lin",
      "institution": "Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659442244",
      "orcid": "missing"
    },
    {
      "name": "Liang He",
      "institution": "Computer Science & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660661510",
      "orcid": "missing"
    },
    {
      "name": "Fangli Song",
      "institution": "Georgia Institute of Technology, School of design, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240399",
      "orcid": "missing"
    },
    {
      "name": "Yifan Li",
      "institution": "Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238157",
      "orcid": "missing"
    },
    {
      "name": "Tingyu Cheng",
      "institution": "Georgia Institute of Technology, Interactive Computing, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261459",
      "orcid": "0000-0002-2398-2348"
    },
    {
      "name": "Clement Zheng",
      "institution": "Division of Industrial Design, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659143831",
      "orcid": "0000-0003-0336-6430"
    },
    {
      "name": "Wei Wang",
      "institution": "Hunan University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239097",
      "orcid": "missing"
    },
    {
      "name": "HyunJoo Oh",
      "institution": "Industrial Design & Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658684885",
      "orcid": "0000-0001-8661-9426"
    }
  ],
  "references": [
    {
      "text": "Merwan Achibet, Benoîit Le Gouis, Maud Marchal, Pierre-Alexandre Leziart, Ferran Argelaguet, Adrien Girard, Anatole Lécuyer, and Hiroyuki Kajimoto. 2017. FlexiFingers: Multi-finger interaction in VR combining passive haptics and pseudo-haptics. In 2017 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 103–106.",
      "doi": ""
    },
    {
      "text": "Oliver A Bauchau and James I Craig. 2009. Euler-Bernoulli beam theory. In Structural analysis. Springer, 173–221.",
      "doi": ""
    },
    {
      "text": "VB Bhandari. 2010. Design of machine elements. Tata McGraw-Hill Education.",
      "doi": ""
    },
    {
      "text": "Paul R Bonenberger. 2000. The First Snap-Fit Handbook: Creating Attachments for Plastics Parts. Hanser.",
      "doi": ""
    },
    {
      "text": "Stefan J Breitschaft, Stella Clarke, and Claus-Christian Carbon. 2019. A theoretical framework of haptic processing in automotive user interfaces and its implications on design and engineering. Frontiers in Psychology 10 (2019), 1470.",
      "doi": ""
    },
    {
      "text": "Jesse Burstyn, Nicholas Fellion, Paul Strohmeier, and Roel Vertegaal. 2015. Printput: Resistive and capacitive input widgets for interactive 3D prints. In IFIP Conference on Human-Computer Interaction. Springer, 332–339.",
      "doi": "10.1007/978-3-319-22701-6_25"
    },
    {
      "text": "Stuart K Card, Jock D Mackinlay, and George G Robertson. 1990. The design space of input devices. In Proceedings of the SIGCHI conference on Human factors in computing systems. 117–124.",
      "doi": "10.1145/97243.97263"
    },
    {
      "text": "Zekun Chang, Tung D Ta, Koya Narumi, Heeju Kim, Fuminori Okuya, Dongchi Li, Kunihiro Kato, Jie Qi, Yoshinobu Miyamoto, Kazuya Saito, and Others. 2020. Kirigami Haptic Swatches: Design Methods for Cut-and-Fold Haptic Feedback Mechanisms. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376655"
    },
    {
      "text": "Tore Dahlberg. 2004. Procedure to calculate deflections of curved beams. International journal of engineering education 20, 3 (2004), 503–513.",
      "doi": ""
    },
    {
      "text": "Cathy Fang, Yang Zhang, Matthew Dworman, and Chris Harrison. 2020. Wireality: Enabling Complex Tangible Geometries in Virtual Reality with Worn Multi-String Haptics. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–10.",
      "doi": "10.1145/3313831.3376470"
    },
    {
      "text": "Vincent Hayward, Oliver R Astley, Manuel Cruz-Hernandez, Danny Grant, and Gabriel Robles-De-La-Torre. 2004. Haptic interfaces and devices. Sensor review (2004).",
      "doi": ""
    },
    {
      "text": "Liang He, Huaishu Peng, Michelle Lin, Ravikanth Konjeti, François Guimbretière, and Jon E Froehlich. 2019. Ondulé: Designing and Controlling 3D Printable Springs. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 739–750.",
      "doi": "10.1145/3332165.3347951"
    },
    {
      "text": "Larry L Howell. 2013. Compliant mechanisms. In 21st century kinematics. Springer, 189–216.",
      "doi": ""
    },
    {
      "text": "Alexandra Ion, David Lindlbauer, Philipp Herholz, Marc Alexa, and Patrick Baudisch. 2019. Understanding metamaterial mechanisms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300877"
    },
    {
      "text": "Jingjing Ji, Kok-Meng Lee, and Shuyou Zhang. 2011. Cantilever snap-fit performance analysis for haptic evaluation. (2011).",
      "doi": ""
    },
    {
      "text": "Christoph Klahn, Daniel Singer, and Mirko Meboldt. 2016. Design guidelines for additive manufactured snap-fit joints. Procedia Cirp 50(2016), 264–269.",
      "doi": ""
    },
    {
      "text": "Susan J Lederman and Roberta L Klatzky. 2009. Haptic perception: A tutorial. Attention, Perception, & Psychophysics 71, 7 (2009), 1439–1459.",
      "doi": ""
    },
    {
      "text": "Tania K Morimoto, Paulo Blikstein, and Allison M Okamura. 2014. [D81] Hapkit: An open-hardware haptic device for online education. In 2014 IEEE Haptics Symposium (HAPTICS). IEEE, 1–1.",
      "doi": ""
    },
    {
      "text": "Nam-Trung Nguyen, Thai-Quang Truong, Kok-Keong Wong, Soon-Seng Ho, and Cassandra Lee-Ngo Low. 2003. Micro check valves for integration into polymeric microfluidic devices. Journal of Micromechanics and Microengineering 14, 1(2003), 69.",
      "doi": ""
    },
    {
      "text": "Masa Ogata. 2018. Magneto-haptics: Embedding magnetic force feedback for physical interactions. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology. 737–743.",
      "doi": "10.1145/3242587.3242615"
    },
    {
      "text": "Simon Olberding, Sergio Soto Ortega, Klaus Hildebrandt, and Jürgen Steimle. 2015. Foldio: Digital fabrication of interactive and shape-changing objects with foldable printed electronics. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. 223–232.",
      "doi": "10.1145/2807442.2807494"
    },
    {
      "text": "Julian Panetta, Qingnan Zhou, Luigi Malomo, Nico Pietroni, Paolo Cignoni, and Denis Zorin. 2015. Elastic textures for additive fabrication. ACM Transactions on Graphics (TOG) 34, 4 (2015), 1–12.",
      "doi": "10.1145/2766937"
    },
    {
      "text": "Pornthep Preechayasomboon and Ali Israr. 2020. Crossing the Chasm: Linking with the Virtual World through a Compact Haptic Actuator. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–4.",
      "doi": "10.1145/3334480.3383137"
    },
    {
      "text": "Pornthep Preechayasomboon, Ali Israr, and Majed Samad. 2020. Chasm: A Screw Based Expressive Compact Haptic Actuator. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376512"
    },
    {
      "text": "Michael L Rivera, Melissa Moukperian, Daniel Ashbrook, Jennifer Mankoff, and Scott E Hudson. 2017. Stretching the bounds of 3D printing with embedded textiles. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 497–508.",
      "doi": "10.1145/3025453.3025460"
    },
    {
      "text": "Ciprian Ion Rizescu and Dana Rizescu. 2020. Mechanical Behaviour Analysis of Snap Joints for Haptic Evaluation. In International Conference of Mechatronics and Cyber-Mixmechatronics. Springer, 12–19.",
      "doi": ""
    },
    {
      "text": "Christopher Robeller, Paul Mayencourt, and Yves Weinand. 2014. Snap-fit joints-CNC fabricated, integrated mechanical attachment for structural wood panels. In ACADIA 2014 Design Agency: Proceedings of the 34th Annual Conference of the Association for Computer Aided Design in Architecture. Riverside Architectural Press, 189–198.",
      "doi": ""
    },
    {
      "text": "Thijs Roumen, Ingo Apel, Jotaro Shigeyama, Abdullah Muhammad, and Patrick Baudisch. 2020. Kerf-canceling mechanisms: making laser-cut mechanisms operate across different laser cutters. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 293–303.",
      "doi": "10.1145/3379337.3415895"
    },
    {
      "text": "Thijs Roumen, Jotaro Shigeyama, Julius Cosmo Romeo Rudolph, Felix Grzelka, and Patrick Baudisch. 2019. SpringFit: Joints and Mounts that Fabricate on Any Laser Cutter. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 727–738.",
      "doi": "10.1145/3332165.3347930"
    },
    {
      "text": "Valkyrie Savage, Andrew Head, Björn Hartmann, Dan B Goldman, Gautham Mysore, and Wilmot Li. 2015. Lamello: Passive acoustic sensing for tangible input components. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1277–1280.",
      "doi": "10.1145/2702123.2702207"
    },
    {
      "text": "Martin Schmitz, Jürgen Steimle, Jochen Huber, Niloofar Dezfuli, and Max Mühlhäuser. 2017. Flexibles: deformation-aware 3D-printed tangibles for capacitive touchscreens. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 1001–1014.",
      "doi": "10.1145/3025453.3025663"
    },
    {
      "text": "Christian Schumacher, Bernd Bickel, Jan Rys, Steve Marschner, Chiara Daraio, and Markus Gross. 2015. Microstructures to control elasticity in 3D printing. ACM Transactions on Graphics (TOG) 34, 4 (2015), 1–13.",
      "doi": "10.1145/2766926"
    },
    {
      "text": "Youngbo Aram Shim, Keunwoo Park, Sangyoon Lee, Jeongmin Son, Taeyun Woo, and Geehyuk Lee. 2020. FS-Pad: Video Game Interactions Using Force Feedback Gamepad. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 938–950.",
      "doi": "10.1145/3379337.3415850"
    },
    {
      "text": "Ronit Slyper and Jessica Hodgins. 2012. Prototyping robot appearance, movement, and interactions using flexible 3d printing and air pressure sensors. In 2012 IEEE RO-MAN: The 21st IEEE International Symposium on Robot and Human Interactive Communication. IEEE, 6–11.",
      "doi": ""
    },
    {
      "text": "Haruki Takahashi, Parinya Punpongsanon, and Jeeeun Kim. 2020. Programmable filament: Printed filaments for multi-material 3D printing. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 1209–1221.",
      "doi": "10.1145/3379337.3415863"
    },
    {
      "text": "Anke van Oosterhout, Miguel Bruns, and Eve Hoggan. 2020. Facilitating Flexible Force Feedback Design with Feelix. In Proceedings of the 2020 International Conference on Multimodal Interaction. 184–193.",
      "doi": "10.1145/3382507.3418819"
    },
    {
      "text": "Anke van Oosterhout, Eve Hoggan, Majken Kirkegaard Rasmussen, and Miguel Bruns. 2019. DynaKnob: combining haptic force feedback and shape change. In Proceedings of the 2019 on Designing Interactive Systems Conference. 963–974.",
      "doi": "10.1145/3322276.3322321"
    },
    {
      "text": "Tatyana Vasilevitsky and Amit Zoran. 2016. Steel-sense: Integrating machine elements with sensors by additive manufacturing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 5731–5742.",
      "doi": "10.1145/2858036.2858309"
    },
    {
      "text": "Marynel Vázquez, Eric Brockmeyer, Ruta Desai, Chris Harrison, and Scott E Hudson. 2015. 3d printing pneumatic device controls with variable activation force capabilities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1295–1304.",
      "doi": "10.1145/2702123.2702569"
    },
    {
      "text": "Kentaro Yasu. 2019. Magnetact: magnetic-sheet-based haptic interfaces for touch devices. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3290605.3300470"
    },
    {
      "text": "Clement Zheng, Jeeeun Kim, Daniel Leithinger, Mark D Gross, and Ellen Yi-Luen Do. 2019. Mechamagnets: Designing and fabricating haptic and functional physical inputs with embedded magnets. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction. 325–334.",
      "doi": "10.1145/3294109.3295622"
    },
    {
      "text": "Clement Zheng, HyunJoo Oh, Laura Devendorf, and Ellen Yi-Luen Do. 2019. Sensing kirigami. In Proceedings of the 2019 on Designing Interactive Systems Conference. 921–934.",
      "doi": "10.1145/3322276.3323689"
    }
  ]
}