{
  "doi": "10.1145/3491102.3501822",
  "title": "Who, What, Why and How? Towards the Monetary Incentive in Crowd Collaboration: A Case Study of Github’s Sponsor Mechanism",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "While many forms of financial support are currently available, there are still many complaints about inadequate financing from software maintainers. In May 2019, GitHub, the world’s most active social coding platform, launched the Sponsor mechanism as a step toward more deeply integrating open source development and financial support. This paper collects data on 8,028 maintainers, 13,555 sponsors, and 22,515 sponsorships and conducts a comprehensive analysis. We explore the relationship between the Sponsor mechanism and developers along four dimensions using a combination of qualitative and quantitative analysis, examining why developers participate, how the mechanism affects developer activity, who obtains more sponsorships, and what mechanism flaws developers have encountered in the process of using it. We find a long-tail effect in the act of sponsorship, with most maintainers’ expectations remaining unmet, and sponsorship has only a short-term, slightly positive impact on development activity but is not sustainable. While sponsors participate in this mechanism mainly as a means of thanking the developers of OSS that they use, in practice, the social status of developers is the primary influence on the number of sponsorships. We find that both the Sponsor mechanism and open source donations have certain shortcomings and need further improvements to attract more participants.",
  "tags": [
    "GitHub",
    "financial support",
    "open source",
    "sponsor",
    "donation"
  ],
  "authors": [
    {
      "name": "Xunhui Zhang",
      "institution": "National University of Defense Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659205383",
      "orcid": "missing"
    },
    {
      "name": "Tao Wang",
      "institution": "National University of Defense Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548881556",
      "orcid": "missing"
    },
    {
      "name": "Yue Yu",
      "institution": "National University of Defense Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84460575257",
      "orcid": "missing"
    },
    {
      "name": "Qiubing Zeng",
      "institution": "National University of Defense Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238701",
      "orcid": "missing"
    },
    {
      "name": "Zhixing Li",
      "institution": "National University of Defense Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659081656",
      "orcid": "missing"
    },
    {
      "name": "Huaimin Wang",
      "institution": "National University of Defense Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452603741",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mark Aberdour. 2007. Achieving quality in open-source software. IEEE software 24, 1 (2007), 58–64.",
      "doi": "10.1109/MS.2007.2"
    },
    {
      "text": "Bethany Alender. 2016. Understanding volunteer motivations to participate in citizen science projects: a deeper look at water quality monitoring. Journal of Science Communication 15, 3 (2016), A04.",
      "doi": ""
    },
    {
      "text": "Shaosong Ou Alexander Hars. 2002. Working for free? Motivations for participating in open-source projects. International journal of electronic commerce 6, 3 (2002), 25–39.",
      "doi": ""
    },
    {
      "text": "Maria J Antikainen and Heli K Vaataja. 2010. Rewarding in open innovation communities–how to motivate members. International Journal of Entrepreneurship and Innovation Management 11, 4(2010), 440–456.",
      "doi": ""
    },
    {
      "text": "Dryden Ashe. 2013. The ethics of unpaid labor and the oss community. https://www.ashedryden.com/blog/the-ethics-of-unpaid-labor-and-the-oss-community. [Online; accessed June 8, 2021].",
      "doi": ""
    },
    {
      "text": "Susanne Beck, Carsten Bergenholtz, Marcel Bogers, Tiare-Maria Brasseur, Marie Louise Conradsen, Diletta Di Marco, Andreas P Distel, Leonhard Dobusch, Daniel Dörler, Agnes Effert, 2020. The Open Innovation in Science research field: a collaborative conceptualisation approach. Industry and Innovation(2020), 1–50.",
      "doi": ""
    },
    {
      "text": "Kenneth P. Burnham and David R. Anderson. 2002. Model Selection and Multimodel Inference: a Practical Information-Theoretic Approach (2nd ed.). Springer.",
      "doi": ""
    },
    {
      "text": "G. Canfora, L. Cerulo, M. Cimitile, and MD Penta. 2014. How changes affect software entropy: an empirical study. Empirical Software Engineering 19, 1 (2014), 1–38.",
      "doi": "10.1007/s10664-012-9214-z"
    },
    {
      "text": "Francesco Cappa, Jeffrey Laut, Maurizio Porfiri, and Luca Giustiniano. 2018. Bring them aboard: rewarding participation in technology-mediated citizen science projects. Computers in Human Behavior 89 (2018), 246–257.",
      "doi": "10.1016/j.chb.2018.08.017"
    },
    {
      "text": "Krista Casler, Lydia Bickel, and Elizabeth Hackett. 2013. Separate but equal? A comparison of participants and data gathered via Amazon’s MTurk, social media, and face-to-face behavioral testing. Computers in human behavior 29, 6 (2013), 2156–2160.",
      "doi": "10.1016/j.chb.2013.05.009"
    },
    {
      "text": "Jacob Cohen, Patricia Cohen, Stephen G West, and Leona S Aiken. 2013. Applied multiple regression/correlation analysis for the behavioral sciences. Routledge.",
      "doi": ""
    },
    {
      "text": "The SciPy community. 2008. API Reference of scipy.stats.wilcoxon. https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.wilcoxon.html. [Online; accessed July 31, 2021].",
      "doi": ""
    },
    {
      "text": "Paul G Curran. 2016. Methods for the detection of carelessly invalid responses in survey data. Journal of Experimental Social Psychology 66 (2016), 4–19.",
      "doi": ""
    },
    {
      "text": "Paul A David and Joseph S Shapiro. 2008. Community-based production of open-source software: What do we know about the developers who participate?Information Economics and Policy 20, 4 (2008), 364–398.",
      "doi": ""
    },
    {
      "text": "Margret C Domroese and Elizabeth A Johnson. 2017. Why watch bees? Motivations of citizen science volunteers in the Great Pollinator Project. Biological Conservation 208 (2017), 40–47.",
      "doi": ""
    },
    {
      "text": "Enrique Estellés-Arolas and Fernando González-Ladrón-de Guevara. 2012. Towards an integrated crowdsourcing definition. Journal of Information science 38, 2 (2012), 189–200.",
      "doi": "10.1177/0165551512437638"
    },
    {
      "text": "Yulin Fang and Derrick Neufeld. 2009. Understanding sustained participation in open source software projects. Journal of Management Information Systems 25, 4 (2009), 9–50.",
      "doi": "10.2753/MIS0742-1222250401"
    },
    {
      "text": "Oluwaseyi Feyisetan, Elena Simperl, Max Van Kleek, and Nigel Shadbolt. 2015. Improving paid microtasks through gamification and adaptive furtherance incentives. In Proceedings of the 24th international conference on world wide web. 333–343.",
      "doi": "10.1145/2736277.2741639"
    },
    {
      "text": "Andrzej Gałecki and Tomasz Burzykowski. 2013. Linear mixed-effects model. In Linear Mixed-Effects Models Using R. Springer, 245–273.",
      "doi": ""
    },
    {
      "text": "Rishab Aiyer Ghosh. 2005. Understanding free software developers: Findings from the FLOSS study. Perspectives on free and open source software 28 (2005), 23–47.",
      "doi": ""
    },
    {
      "text": "GitHub. 2016. Getting Paid for Open Source Work. https://opensource.guide/getting-paid/. [Online; accessed June 8, 2021].",
      "doi": ""
    },
    {
      "text": "GitHub. 2017. Open Source Survey. https://opensourcesurvey.org/2017/. [Online; accessed June 8, 2021].",
      "doi": ""
    },
    {
      "text": "GitHub. 2021. About your personal dashboard. https://docs.github.com/en/github/setting-up-and-managing-your-github-user-account/managing-user-account-settings/about-your-personal-dashboard#finding-your-top-repositories-and-teams. [Online; accessed May 24, 2021].",
      "doi": ""
    },
    {
      "text": "GitHub. 2021. Displaying a sponsor button in your repository. https://docs.github.com/en/github/administering-a-repository/managing-repository-settings/displaying-a-sponsor-button-in-your-repository. [Online; accessed May 22, 2021].",
      "doi": ""
    },
    {
      "text": "GitHub. 2021. Invest in the software that powers your world. https://github.com/sponsors. [Online; accessed July 30, 2021].",
      "doi": ""
    },
    {
      "text": "GitHub. 2021. Reference of GraphQL User API. https://docs.github.com/en/graphql/reference/objects#user. [Online; accessed July 30, 2021].",
      "doi": ""
    },
    {
      "text": "GitHub. 2021. Reference of RESTful List users API. https://docs.github.com/en/rest/reference/users#list-users. [Online; accessed August 1, 2021].",
      "doi": ""
    },
    {
      "text": "Github. 2021. The 2020 State of the OCTOVERSE. https://octoverse.github.com. [Online; accessed February 4, 2021].",
      "doi": ""
    },
    {
      "text": "R. J. Grissom and J. J. Kim. 2007. Effect Sizes for Research: A Broad Practical Approach. Effect sizes for research : a broad practical approach.",
      "doi": ""
    },
    {
      "text": "Carl Gutwin, Reagan Penner, and Kevin Schneider. 2004. Group awareness in distributed software development. In Proceedings of the 2004 ACM conference on Computer supported cooperative work. ACM, Chicago Illinois, USA, 72–81.",
      "doi": "10.1145/1031607.1031621"
    },
    {
      "text": "Stefan Haefliger, Georg Von Krogh, and Sebastian Spaeth. 2008. Code reuse in open source software. Management science 54, 1 (2008), 180–193.",
      "doi": ""
    },
    {
      "text": "Cynthia Harvey. 2017. 35 Top Open Source Companies. https://www.datamation.com/open-source/35-top-open-source-companies. [Online; accessed February 5, 2021].",
      "doi": ""
    },
    {
      "text": "Andrea Hemetsberger. 2002. Fostering cooperation on the Internet: Social exchange processes in innovative virtual consumer communities. ACR North American Advances 29 (2002), 354–356.",
      "doi": ""
    },
    {
      "text": "Mokter Hossain. 2012. Users’ motivation to participate in online crowdsourcing platforms. In 2012 International Conference on Innovation Management and Technology Research. IEEE, 310–315.",
      "doi": ""
    },
    {
      "text": "Javier Luis Cánovas Izquierdo and Jordi Cabot. 2018. The role of foundations in open source projects. In Proceedings of the 40th International Conference on Software Engineering: Software Engineering in Society. ACM, Gothenburg, Sweden, 3–12.",
      "doi": "10.1145/3183428.3183438"
    },
    {
      "text": "S. Jackman, C. Kleiber, and A. Zeileis. 2008. Regression Models for Count Data in R. Journal of Statistical Software 27, 8 (2008), 1–25.",
      "doi": ""
    },
    {
      "text": "Jaweria Kanwal and Onaiza Maqbool. 2012. Bug Prioritization to Facilitate Bug Report Triage. Journal of Computer Science and Technology 27 (2012), 397–412.",
      "doi": ""
    },
    {
      "text": "Bran Knowles. 2013. Cyber-sustainability: towards a sustainable digital future. Lancaster University (United Kingdom).",
      "doi": ""
    },
    {
      "text": "Bruce Kogut and Anca Metiu. 2001. Open-source software development and distributed innovation. Oxford review of economic policy 17, 2 (2001), 248–264.",
      "doi": ""
    },
    {
      "text": "Sandeep Krishnamurthy and Arvind K Tripathi. 2009. Monetary donations to an open source software platform. Research Policy 38, 2 (2009), 404–414.",
      "doi": ""
    },
    {
      "text": "Alexandra Kuznetsova, Per B. Brockhoff, and Rune H. B. Christensen. 2017. lmerTest Package: Tests in Linear Mixed Effects Models. Journal of Statistical Software 82, 13 (2017), 1–26. https://doi.org/10.18637/jss.v082.i13",
      "doi": ""
    },
    {
      "text": "Karim Lakhani and Robert Wolf. 2005. Why Hackers Do What They Do: Understanding Motivation and Effort in Free/Open Source Software Projects.MIT Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Lincoln R Larson, Caren B Cooper, Sara Futch, Devyani Singh, Nathan J Shipley, Kathy Dale, Geoffrey S LeBaron, and John Y Takekawa. 2020. The diverse motivations of citizen scientists: Does conservation emphasis grow as volunteer participation progresses?Biological Conservation 242 (2020), 108428.",
      "doi": ""
    },
    {
      "text": "Zhixing Li, Yue Yu, Tao Wang, Gang Yin, Shanshan Li, and Huaimin Wang. 2021. Are You Still Working on This An Empirical Study on Pull Request Abandonment. IEEE Transactions on Software Engineering(2021), 1–1. https://doi.org/10.1109/TSE.2021.3053403",
      "doi": "10.1109/TSE.2021.3053403"
    },
    {
      "text": "Huigang Liang, Meng-Meng Wang, Jian-Jun Wang, and Yajiong Xue. 2018. How intrinsic motivation and extrinsic incentives affect task effort in crowdsourcing contests: A mediated moderation model. Computers in Human behavior 81 (2018), 168–176.",
      "doi": ""
    },
    {
      "text": "Victoria J MacPhail and Sheila R Colla. 2020. Power of the people: A review of citizen science programs for conservation. Biological Conservation 249 (2020), 108739.",
      "doi": ""
    },
    {
      "text": "Andrew Mao, Ece Kamar, Yiling Chen, Eric Horvitz, Megan E Schwamb, Chris J Lintott, and Arfon M Smith. 2013. Volunteering versus work for pay: Incentives and tradeoffs in crowdsourcing. In First AAAI conference on human computation and crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Debra J Mesch, Patrick M Rooney, Kathryn S Steinberg, and Brian Denton. 2006. The effects of race, gender, and marital status on giving and volunteering in Indiana. Nonprofit and Voluntary Sector Quarterly 35, 4 (2006), 565–587.",
      "doi": ""
    },
    {
      "text": "Nadia. 2015. A handy guide to financial support for open source. https://github.com/nayafia/lemonade-stand/blob/master/README.md. [Online; accessed June 8, 2021].",
      "doi": ""
    },
    {
      "text": "Keitaro Nakasai, Hideaki Hata, and Kenichi Matsumoto. 2018. Are donation badges appealing?: A case study of developer responses to eclipse bug reports. IEEE Software 36, 3 (2018), 22–27.",
      "doi": ""
    },
    {
      "text": "Keitaro Nakasai, Hideaki Hata, Saya Onoue, and Kenichi Matsumoto. 2017. Analysis of donations in the eclipse project. In 8th International Workshop on Empirical Software Engineering in Practice (IWESEP). IEEE, Tokyo, Japan, 18–22.",
      "doi": ""
    },
    {
      "text": "Cassandra Overney. 2020. Hanging by the Thread: An Empirical Study of Donations in Open Source. In Proceedings of the ACM/IEEE 42nd International Conference on Software Engineering: Companion Proceedings (Seoul, South Korea) (ICSE ’20). Association for Computing Machinery, New York, NY, USA, 131–133. https://doi.org/10.1145/3377812.3382170",
      "doi": ""
    },
    {
      "text": "Cassandra Overney, Jens Meinicke, Christian Kästner, and Bogdan Vasilescu. 2020. How to Not Get Rich: An Empirical Study of Donations in Open Source. In Proceedings of the ACM/IEEE 42nd International Conference on Software Engineering (Seoul, South Korea) (ICSE ’20). Association for Computing Machinery, New York, NY, USA, 1209–1221. https://doi.org/10.1145/3377811.3380410",
      "doi": "10.1145/3377811.3380410"
    },
    {
      "text": "Patreon. 2021. Discord (Text chat for creators that’s free, secure, and works on both your desktop and phone). https://www.patreon.com/apps/discord. [Online; accessed August 8, 2021].",
      "doi": ""
    },
    {
      "text": "Anett Richter, Orr Comay, Cecilie S. Svenningsen, Jonas Colling Larsen, Susanne Hecker, Anders P. Tøttrup, Guy Pe’er, Robert R. Dunn, Aletta Bonn, and Melissa Marselle. 2021. Motivation and support services in citizen science insect monitoring: A cross-country study. Biological Conservation 263 (2021), 109325. https://doi.org/10.1016/j.biocon.2021.109325",
      "doi": ""
    },
    {
      "text": "Jackson Samantha. 2019. Feature Transformation (Understanding When to Scale and Standardize Data for Machine Learning). https://medium.com/@sjacks/feature-transformation-21282d1a3215. [Online; accessed August 8, 2021].",
      "doi": ""
    },
    {
      "text": "Isaac Schlueter. 2013. Money and Open Source. https://medium.com/open-source-life/money-and-open-source-d44a1953749c. [Online; accessed 8-June-2021].",
      "doi": ""
    },
    {
      "text": "Douglas C Schmidt and Adam Porter. 2001. Leveraging open-source communities to improve the quality & performance of open-source software. In Proceedings of the 1st Workshop on Open Source Software Engineering, Vol. 1. Citeseer, Toronto, Canada.",
      "doi": ""
    },
    {
      "text": "Andrew Schofield and Grahame S. Cooper. 2006. Participation in Free and Open Source Communities: An Empirical Study of Community Members’ Perceptions. In Open Source Systems, Ernesto Damiani, Brian Fitzgerald, Walt Scacchi, Marco Scotto, and Giancarlo Succi (Eds.). Springer US, Boston, MA, 221–231.",
      "doi": ""
    },
    {
      "text": "Manuel Sojer and Joachim Henkel. 2010. Code reuse in open source software development: Quantitative evidence, drivers, and impediments. Journal of the Association for Information Systems 11, 12 (2010), 2.",
      "doi": ""
    },
    {
      "text": "Diana Super. 2020. Become a sponsor to Super Diana. https://github.com/sponsors/alphacentauri82. [Online; accessed May 26, 2021].",
      "doi": ""
    },
    {
      "text": "[62] SurveyMonkey.1999. https://www.surveymonkey.com/. [Online; accessed May 26, 2021].",
      "doi": ""
    },
    {
      "text": "Patrícia Tiago, Maria João Gouveia, César Capinha, Margarida Santos-Reis, and Henrique M Pereira. 2017. The influence of motivational factors on the frequency of participation in citizen science activities. Nature Conservation 18(2017), 61.",
      "doi": ""
    },
    {
      "text": "Condon Tim. 2020. Become a sponsor to Tim Condon. https://github.com/sponsors/0xTim. [Online; accessed May 26, 2021].",
      "doi": ""
    },
    {
      "text": "Asher Trockman, Shurui Zhou, Christian Kästner, and Bogdan Vasilescu. 2018. Adding Sparkle to Social Coding: An Empirical Study of Repository Badges in the Npm Ecosystem. In Proceedings of the 40th International Conference on Software Engineering (Gothenburg, Sweden) (ICSE ’18). Association for Computing Machinery, New York, NY, USA, 511–522. https://doi.org/10.1145/3180155.3180209",
      "doi": "10.1145/3180155.3180209"
    },
    {
      "text": "Liam Tung. 2020. Redis database creator Sanfilippo: Why I’m stepping down from the open-source project. https://www.zdnet.com/article/redis-database-creator-sanfilippo-why-im-stepping-down-from-the-open-source-project/. [Online; accessed June 8, 2021].",
      "doi": ""
    },
    {
      "text": "Steven J. Vaughan-Nichols. 2021. Hard work and poor pay stresses out open-source maintainers. https://www.zdnet.com/article/hard-work-and-poor-pay-stresses-out-open-source-maintainers/. [Online; accessed Jun 8, 2021].",
      "doi": ""
    },
    {
      "text": "Georg Von Krogh, Stefan Haefliger, Sebastian Spaeth, and Martin W. Wallin. 2012. Carrots and Rainbows: Motivation and Social Practice in Open Source Software Development. MIS Q. 36, 2 (jun 2012), 649–676.",
      "doi": ""
    },
    {
      "text": "Jing Wang, Patrick C. Shih, and John M. Carroll. 2015. Revisiting Linus’s law: Benefits and challenges of open source software peer review. International Journal of Human-Computer Studies 77 (2015), 52–65. https://doi.org/10.1016/j.ijhcs.2015.01.005",
      "doi": "10.1016/j.ijhcs.2015.01.005"
    },
    {
      "text": "John Willinsky. 2005. The unacknowledged convergence of open source, open access, and open science. First Monday 10, 8 (Aug. 2005). https://doi.org/10.5210/fm.v10i8.1265",
      "doi": ""
    },
    {
      "text": "Sarah Wiseman, Anna L Cox, Sandy JJ Gould, and Duncan P Brumby. 2017. Exploring the effects of non-monetary reimbursement for participants in HCI research. Human Computation (2017).",
      "doi": ""
    },
    {
      "text": "Bo Xu, Donald R. Jones, and Bingjia Shao. 2009. Volunteers’ involvement in online community based software development. Information & Management 46, 3 (2009), 151–158. https://doi.org/10.1016/j.im.2008.12.005",
      "doi": "10.1016/j.im.2008.12.005"
    },
    {
      "text": "Bo Xu and Dahui Li. 2015. An empirical study of the motivations for content contribution and community participation in Wikipedia. Information & management 52, 3 (2015), 275–286.",
      "doi": ""
    },
    {
      "text": "Yue Yu, Gang Yin, Huaimin Wang, and Tao Wang. 2014. Exploring the Patterns of Social Behavior in GitHub. In Proceedings of the 1st International Workshop on Crowd-Based Software Development Methods and Technologies (Hong Kong, China) (CrowdSoft 2014). Association for Computing Machinery, New York, NY, USA, 31–36. https://doi.org/10.1145/2666539.2666571",
      "doi": "10.1145/2666539.2666571"
    },
    {
      "text": "Xunhui Zhang, Tao Wang, Yue Yu, Qiubing Zeng, Zhixing Li, and Huaimin Wang. 2022. Questionnaire design for GitHub Sponsor mechanism. (2022). https://doi.org/10.5281/ZENODO.5715824",
      "doi": ""
    },
    {
      "text": "Yangyang Zhao, Alexander Serebrenik, Yuming Zhou, Vladimir Filkov, and Bogdan Vasilescu. 2017. The impact of continuous integration on other software development practices: A large-scale empirical study. In 2017 32nd IEEE/ACM International Conference on Automated Software Engineering (ASE). 60–71. https://doi.org/10.1109/ASE.2017.8115619",
      "doi": ""
    },
    {
      "text": "Jiayuan Zhou, Shaowei Wang, Cor-Paul Bezemer, Ying Zou, and Ahmed E. Hassan. 2020. Studying the Association between Bountysource Bounties and the Issue-addressing Likelihood of GitHub Issue Reports. IEEE Transactions on Software Engineering(2020), 1–1. https://doi.org/10.1109/TSE.2020.2974469",
      "doi": ""
    },
    {
      "text": "T. Zimmermann. 2016. Card-sorting: From text to themes. In Perspectives on Data Science for Software Engineering, Tim Menzies, Laurie Williams, and Thomas Zimmermann (Eds.). Morgan Kaufmann, Boston, 137–141. https://doi.org/10.1016/B978-0-12-804206-9.00027-1",
      "doi": ""
    }
  ]
}