{
  "doi": "10.1145/3491102.3501963",
  "title": "Unpacking Intention and Behavior: Explaining Contact Tracing App Adoption and Hesitancy in the United States",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "COVID-19 has demonstrated the importance of digital contact tracing apps in reducing the spread of disease. Despite people widely expressing interest in using contact tracing apps, actual installation rates have been low in many parts of the world. Prior studies suggest that decisions to use these apps are largely shaped by pandemic beliefs, social influences, perceived benefits and harms, and other factors. However, there is a gap in understanding what factors motivate intention, but not subsequent behavior of actual adoption. Reporting on a survey of 290 U.S. residents, we disentangle the intention-behavior gap by investigating factors associated with installing a contact tracing app from those associated with intending to install, but not actually installing. Our results suggest that social norms can be leveraged to span the intention-behavior gap, and that a privacy paradox may influence people’s adoption decisions. We present recommendations for technologies that enlist individuals to address collective challenges.",
  "authors": [
    {
      "name": "Jack Jamieson",
      "institution": "NTT, Japan",
      "img": "/do/10.1145/contrib-99659895476/rel-imgonly/jackjamieson_photo_small.jpg",
      "acmid": "99659895476",
      "orcid": "0000-0002-8444-5722"
    },
    {
      "name": "Daniel A. Epstein",
      "institution": "Informatics, University of California, Irvine, United States",
      "img": "/do/10.1145/contrib-83458899257/rel-imgonly/img_3258a_square.jpg",
      "acmid": "83458899257",
      "orcid": "0000-0002-2657-6345"
    },
    {
      "name": "Yunan Chen",
      "institution": "Informatics, University of California Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131427",
      "orcid": "missing"
    },
    {
      "name": "Naomi Yamashita",
      "institution": "NTT, Japan",
      "img": "/do/10.1145/contrib-81309484665/rel-imgonly/photo2.png",
      "acmid": "81309484665",
      "orcid": "0000-0003-0643-6262"
    }
  ],
  "references": [
    {
      "text": "Matthew Abueg, Robert Hinch, Neo Wu, Luyang Liu, William Probert, Austin Wu, Paul Eastham, Yusef Shafi, Matt Rosencrantz, Michael Dikovsky, Zhao Cheng, Anel Nurtay, Lucie Abeler-Dörner, David Bonsall, Michael V. McConnell, Shawn O’Banion, and Christophe Fraser. 2021. Modeling the Effect of Exposure Notification and Non-Pharmaceutical Interventions on COVID-19 Transmission in Washington State. npj Digital Medicine 4, 1 (March 2021), 1–10. https://doi.org/10.1038/s41746-021-00422-7",
      "doi": ""
    },
    {
      "text": "Nadeem Ahmed, Regio A. Michelin, Wanli Xue, Sushmita Ruj, Robert Malaney, Salil S. Kanhere, Aruna Seneviratne, Wen Hu, Helge Janicke, and Sanjay Jha. 2020. A Survey of COVID-19 Contact Tracing Apps. IEEE Access 8(2020), 134577–134601. https://doi.org/10.1109/ACCESS.2020.3010226 arxiv:2006.10306",
      "doi": ""
    },
    {
      "text": "Icek Ajzen. 1991. The Theory of Planned Behavior. Organizational Behavior and Human Decision Processes 50, 2 (Dec. 1991), 179–211. https://doi.org/10.1016/0749-5978(91)90020-T",
      "doi": "10.1016/0749-5978%2891%2990020-t"
    },
    {
      "text": "Icek Ajzen. 2011. The Theory of Planned Behaviour: Reactions and Reflections. Psychology & Health 26, 9 (Sept. 2011), 1113–1127. https://doi.org/10.1080/08870446.2011.613995",
      "doi": ""
    },
    {
      "text": "Ali Alkhatib. 2020. We Need to Talk about Digital Contact Tracing. Interactions 27, 4 (July 2020), 84–89. https://doi.org/10.1145/3404205",
      "doi": "10.1145/3404205"
    },
    {
      "text": "Samuel Altmann, Luke Milsom, Hannah Zillessen, Raffaele Blasone, Frederic Gerdon, Ruben Bach, Frauke Kreuter, Daniele Nosenzo, Severine Toussaert, and Johannes Abeler. 2020. Acceptability of App-Based Contact Tracing for COVID-19: Cross-Country Survey Evidence. SSRN Scholarly Paper ID 3590505. Social Science Research Network, Rochester, NY. https://doi.org/10.2139/ssrn.3590505",
      "doi": ""
    },
    {
      "text": "Elske Ammenwerth. 2019. Technology Acceptance Models in Health Informatics: TAM and UTAUT. Applied Interdisciplinary Theory in Health Informatics (2019), 64–71. https://doi.org/10.3233/SHTI190111",
      "doi": ""
    },
    {
      "text": "Nikolett Aszodi, Jascha Galaski, Oleksandra Konoplia, and Orsolya Reich. 2021. COVID-19 Technology in the EU: A Bittersweet Victory for Human Rights?Technical Report. Civil Liberties Union for Europe, Berlin, Germany. 77 pages.",
      "doi": ""
    },
    {
      "text": "Christiane Attig and Thomas Franke. 2020. Abandonment of Personal Quantification: A Review and Empirical Study Investigating Reasons for Wearable Activity Tracking Attrition. Computers in Human Behavior 102 (Jan. 2020), 223–237. https://doi.org/10.1016/j.chb.2019.08.025",
      "doi": ""
    },
    {
      "text": "Francesco Barile, Judith Masthoff, and Silvia Rossi. 2017. A Detailed Analysis of the Impact of Tie Strength and Conflicts on Social Influence. In Adjunct Publication of the 25th Conference on User Modeling, Adaptation and Personalization(UMAP ’17). Association for Computing Machinery, New York, NY, USA, 227–230. https://doi.org/10.1145/3099023.3099056",
      "doi": "10.1145/3099023.3099056"
    },
    {
      "text": "Susanne Barth and Menno D. T. de Jong. 2017. The Privacy Paradox – Investigating Discrepancies between Expressed Privacy Concerns and Actual Online Behavior – A Systematic Literature Review. Telematics and Informatics 34, 7 (Nov. 2017), 1038–1058. https://doi.org/10.1016/j.tele.2017.04.013",
      "doi": "10.1016/j.tele.2017.04.013"
    },
    {
      "text": "Masooda Bashir, Carol Hayes, April D. Lambert, and Jay P. Kesan. 2015. Online Privacy and Informed Consent: The Dilemma of Information Asymmetry. In Proceedings of the 78th ASIS&T Annual Meeting: Information Science with Impact: Research in and for the Community(ASIST ’15). American Society for Information Science, USA, 1–10.",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer, Phil Adams, Vera D. Khovanskaya, Tony C. Liao, Madeline E. Smith, Victoria Schwanda Sosik, and Kaiton Williams. 2013. Limiting, Leaving, and (Re)Lapsing: An Exploration of Facebook Non-Use Practices and Experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 3257–3266.",
      "doi": "10.1145/2470654.2466446"
    },
    {
      "text": "Jay J. Van Bavel, Katherine Baicker, Paulo S. Boggio, Valerio Capraro, Aleksandra Cichocka, Mina Cikara, Molly J. Crockett, Alia J. Crum, Karen M. Douglas, James N. Druckman, John Drury, Oeindrila Dube, Naomi Ellemers, Eli J. Finkel, James H. Fowler, Michele Gelfand, Shihui Han, S. Alexander Haslam, Jolanda Jetten, Shinobu Kitayama, Dean Mobbs, Lucy E. Napper, Dominic J. Packer, Gordon Pennycook, Ellen Peters, Richard E. Petty, David G. Rand, Stephen D. Reicher, Simone Schnall, Azim Shariff, Linda J. Skitka, Sandra Susan Smith, Cass R. Sunstein, Nassim Tabri, Joshua A. Tucker, Sander van der Linden, Paul van Lange, Kim A. Weeden, Michael J. A. Wohl, Jamil Zaki, Sean R. Zion, and Robb Willer. 2020. Using Social and Behavioural Science to Support COVID-19 Pandemic Response. Nature Human Behaviour 4, 5 (May 2020), 460–471. https://doi.org/10.1038/s41562-020-0884-z",
      "doi": ""
    },
    {
      "text": "Annelies G Blom, Alexander Wenz, Carina Cornesse, Tobias Rettig, Marina Fikel, Sabine Friedel, Katja Möhring, Elias Naumann, Maximiliane Reifenscheid, and Ulrich Krieger. 2021. Barriers to the Large-Scale Adoption of a COVID-19 Contact Tracing App in Germany: Survey Study. Journal of Medical Internet Research 23, 3 (March 2021), e23362. https://doi.org/10.2196/23362",
      "doi": ""
    },
    {
      "text": "Toby Bolsen, Thomas J. Leeper, and Matthew A. Shapiro. 2014. Doing What Others Do: Norms, Science, and Collective Action on Global Warming. American Politics Research 42, 1 (Jan. 2014), 65–89. https://doi.org/10.1177/1532673X13484173",
      "doi": ""
    },
    {
      "text": "Bradley. 2018. Bots and Data Quality on Crowdsourcing Platforms | Prolific Blog. https://blog.prolific.ac/bots-and-data-quality-on-crowdsourcing-platforms/.",
      "doi": ""
    },
    {
      "text": "Jessica R. Cauchard, Jeremy Frey, Octavia Zahrt, Krister Johnson, Alia Crum, and James A. Landay. 2019. The Positive Impact of Push vs Pull Progress Feedback: A 6-Week Activity Tracking Study in the Wild. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 3 (Sept. 2019), 76:1–76:23. https://doi.org/10.1145/3351234",
      "doi": "10.1145/3351234"
    },
    {
      "text": "Pew Research Centre. 2021. Demographics of Mobile Device Ownership and Adoption in the United States.",
      "doi": ""
    },
    {
      "text": "Kristen R. Choi, MarySue V. Heilemann, Alex Fauer, and Meredith Mead. 2020. A Second Pandemic: Mental Health Spillover From the Novel Coronavirus (COVID-19). Journal of the American Psychiatric Nurses Association 26, 4 (July 2020), 340–343. https://doi.org/10.1177/1078390320919803",
      "doi": ""
    },
    {
      "text": "Robert B. Cialdini, Raymond R. Reno, and Carl A. Kallgren. 1990. A Focus Theory of Normative Conduct: Recycling the Concept of Norms to Reduce Littering in Public Places. Journal of Personality and Social Psychology 58, 6 (June 1990), 1015–1026. https://doi.org/10.1037/0022-3514.58.6.1015",
      "doi": ""
    },
    {
      "text": "Morning Consult. 2020. National Tracking Poll #201207. (Dec. 2020), 103.",
      "doi": ""
    },
    {
      "text": "Joseph Coveney. 2021. FIRTHLOGIT: Stata Module to Calculate Bias Reduction in Logistic Regression. Boston College Department of Economics.",
      "doi": ""
    },
    {
      "text": "John M. Darley and Bibb Latane. 1968. Bystander Intervention in Emergencies: Diffusion of Responsibility. Journal of Personality and Social Psychology 8, 4, Pt.1(1968), 377–383. https://doi.org/10.1037/h0025589",
      "doi": ""
    },
    {
      "text": "Andreas Diekmann and Peter Preisendörfer. 2003. Green and Greenback: The Behavioral Effects of Environmental Attitudes in Low-Cost and High-Cost Situations. Rationality and Society 15, 4 (Nov. 2003), 441–472. https://doi.org/10.1177/1043463103154002",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, Monica Caraway, Chuck Johnston, An Ping, James Fogarty, and Sean A. Munson. 2016. Beyond Abandonment to Next Steps: Understanding and Designing for Life after Personal Informatics Tool Use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1109–1113.",
      "doi": "10.1145/2858036.2858045"
    },
    {
      "text": "Imane Ezzaouia and Jacques Bulchand-Gidumal. 2021. A Model to Predict Users’ Intentions to Adopt Contact-Tracing Apps for Prevention from COVID-19. In Information and Communication Technologies in Tourism 2021, Wolfgang Wörndl, Chulmo Koo, and Jason L. Stienmetz (Eds.). Springer International Publishing, Cham, 543–548. https://doi.org/10.1007/978-3-030-65785-7_51",
      "doi": ""
    },
    {
      "text": "Robert A. Fahey and Airo Hino. 2020. COVID-19, Digital Privacy, and the Social Limits on Data-Focused Public Health Responses. International Journal of Information Management 55 (Dec. 2020), 102181. https://doi.org/10.1016/j.ijinfomgt.2020.102181",
      "doi": ""
    },
    {
      "text": "Luca Ferretti, Chris Wymant, Michelle Kendall, Lele Zhao, Anel Nurtay, Lucie Abeler-Dörner, Michael Parker, David Bonsall, and Christophe Fraser. 2020. Quantifying SARS-CoV-2 Transmission Suggests Epidemic Control with Digital Contact Tracing. Science 368, 6491 (May 2020). https://doi.org/10.1126/science.abb6936",
      "doi": ""
    },
    {
      "text": "David Firth. 1993. Bias Reduction of Maximum Likelihood Estimates. Biometrika 80, 1 (March 1993), 27–38. https://doi.org/10.1093/biomet/80.1.27",
      "doi": ""
    },
    {
      "text": "Grace Fox, Trevor Clohessy, Lisa van der Werff, Pierangelo Rosati, and Theo Lynn. 2021. Exploring the Competing Influences of Privacy Concerns and Positive Beliefs on Citizen Acceptance of Contact Tracing Mobile Applications. Computers in Human Behavior 121 (Aug. 2021), 106806. https://doi.org/10.1016/j.chb.2021.106806",
      "doi": ""
    },
    {
      "text": "Miquel A. Fullana, Diego Hidalgo-Mazzei, Eduard Vieta, and Joaquim Radua. 2020. Coping Behaviors Associated with Decreased Anxiety and Depressive Symptoms during the COVID-19 Pandemic and Lockdown. Journal of Affective Disorders 275 (Oct. 2020), 80–81. https://doi.org/10.1016/j.jad.2020.06.027",
      "doi": ""
    },
    {
      "text": "Eva Ganglbauer, Geraldine Fitzpatrick, and Georg Molzer. 2012. Creating Visibility: Understanding the Design Space for Food Waste. In Proceedings of the 11th International Conference on Mobile and Ubiquitous Multimedia(MUM ’12). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/2406367.2406369",
      "doi": "10.1145/2406367.2406369"
    },
    {
      "text": "Lorenz Graf-Vlachy and Katharina Buhtz. 2017. Social Influence in Technology Adoption Research: A Literature Review and Research Agenda. SSRN Scholarly Paper ID 2988497. Social Science Research Network, Rochester, NY.",
      "doi": ""
    },
    {
      "text": "Mark Granovetter. 1973. The Strength of Weak Ties. Amer. J. Sociology 78, 6 (May 1973), 1360–1380.",
      "doi": ""
    },
    {
      "text": "M. Guillon and P. Kergall. 2020. Attitudes and Opinions on Quarantine and Support for a Contact-Tracing Application in France during the COVID-19 Outbreak. Public Health 188 (Nov. 2020), 21–31. https://doi.org/10.1016/j.puhe.2020.08.026",
      "doi": ""
    },
    {
      "text": "Jessica Guynn. 2021. How to Add ‘I Got My COVID Vaccine’ Frame to Your Facebook Profile. https://www.usatoday.com/story/tech/2021/04/01/facebook-covid-vaccine-profile-frames/4829274001/.",
      "doi": ""
    },
    {
      "text": "Katrine Bach Habersaat, Cornelia Betsch, Margie Danchin, Cass R. Sunstein, Robert Böhm, Armin Falk, Noel T. Brewer, Saad B. Omer, Martha Scherzer, Sunita Sah, Edward F. Fischer, Andrea E. Scheel, Daisy Fancourt, Shinobu Kitayama, Eve Dubé, Julie Leask, Mohan Dutta, Noni E. MacDonald, Anna Temkina, Andreas Lieberoth, Mark Jackson, Stephan Lewandowsky, Holly Seale, Nils Fietje, Philipp Schmid, Michele Gelfand, Lars Korn, Sarah Eitze, Lisa Felgendreff, Philipp Sprengholz, Cristiana Salvi, and Robb Butler. 2020. Ten Considerations for Effectively Managing the COVID-19 Transition. Nature Human Behaviour 4, 7 (July 2020), 677–687. https://doi.org/10.1038/s41562-020-0906-x",
      "doi": ""
    },
    {
      "text": "Farkhondeh Hassandoust, Saeed Akhlaghpour, and Allen C Johnston. 2021. Individuals’ Privacy Concerns and Adoption of Contact Tracing Mobile Applications in a Pandemic: A Situational Privacy Calculus Perspective. Journal of the American Medical Informatics Association 28, 3 (March 2021), 463–471. https://doi.org/10.1093/jamia/ocaa240",
      "doi": ""
    },
    {
      "text": "Joel Hellewell, Sam Abbott, Amy Gimma, Nikos I. Bosse, Christopher I. Jarvis, Timothy W. Russell, James D. Munday, Adam J. Kucharski, W. John Edmunds, Fiona Sun, Stefan Flasche, Billy J. Quilty, Nicholas Davies, Yang Liu, Samuel Clifford, Petra Klepac, Mark Jit, Charlie Diamond, Hamish Gibbs, Kevin van Zandvoort, Sebastian Funk, and Rosalind M. Eggo. 2020. Feasibility of Controlling COVID-19 Outbreaks by Isolation of Cases and Contacts. The Lancet Global Health 8, 4 (April 2020), e488–e496. https://doi.org/10.1016/S2214-109X(20)30074-7",
      "doi": ""
    },
    {
      "text": "Robert Hinch, Will Probert, Anel Nurtay, Michelle Kendall, Chris Wymant, Matthew Hall, Katrina Lythgoe, Ana Bulas Cruz, Lele Zhao, Andrea Stewart, Luca Ferretti, Michael Parker, Ares Meroueh, Bryn Mathias, Scott Stevenson, Daniel Montero, James Warran, Nicole K Mather, Anthony Finkelstein, Lucie Abeler-Dörner, David Bonsall, and Christophe Fraser. 2020. Effective Configurations of a Digital Contact Tracing App: A Report to NHSX. Technical Report.",
      "doi": ""
    },
    {
      "text": "Rakibul Hoque and Golam Sorwar. 2017. Understanding Factors Influencing the Adoption of mHealth by the Elderly: An Extension of the UTAUT Model. International Journal of Medical Informatics 101 (May 2017), 75–84. https://doi.org/10.1016/j.ijmedinf.2017.02.002",
      "doi": ""
    },
    {
      "text": "Ruey-Lin Hsiao. 2003. Technology Fears: Distrust and Cultural Persistence in Electronic Marketplace Adoption. The Journal of Strategic Information Systems 12, 3 (Oct. 2003), 169–199. https://doi.org/10.1016/S0963-8687(03)00034-9",
      "doi": ""
    },
    {
      "text": "P. Ifinedo. 2012. Technology Acceptance by Health Professionals in Canada: An Analysis with a Modified UTAUT Model. In 2012 45th Hawaii International Conference on System Sciences. 2937–2946. https://doi.org/10.1109/HICSS.2012.556",
      "doi": "10.1109/HICSS.2012.556"
    },
    {
      "text": "Corey Brian Jackson and Yang Wang. 2018. Addressing The Privacy Paradox through Personalized Privacy Notifications. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 2 (July 2018), 1–25. https://doi.org/10.1145/3214271",
      "doi": "10.1145/3214271"
    },
    {
      "text": "Jack Jamieson, Naomi Yamashita, Daniel Epstein, and Yunan Chen. 2021. Deciding If and How to Use a COVID-19 Contact Tracing App: Influences of Social Factors on Individual Use in Japan. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2 (Oct. 2021), 481:1–481:30. https://doi.org/10.1145/3479868",
      "doi": "10.1145/3479868"
    },
    {
      "text": "N Kawakami, N Sasaki, R Kuroda, K Tsuno, and K Imamura. 2021. The Effects of Downloading a Government-Issued COVID-19 Contact Tracing App on Psychological Distress During the Pandemic Among Employed Adults: Prospective Study.JMIR Mental Health 8, 1 (Jan. 2021), e23699–e23699. https://doi.org/10.2196/23699",
      "doi": ""
    },
    {
      "text": "Boonchai Kijsanayotin, Supasit Pannarunothai, and Stuart M. Speedie. 2009. Factors Influencing Health Information Technology Adoption in Thailand’s Community Health Centers: Applying the UTAUT Model. International Journal of Medical Informatics 78, 6 (June 2009), 404–416. https://doi.org/10.1016/j.ijmedinf.2008.12.005",
      "doi": ""
    },
    {
      "text": "Jun Lang, Wesley W. Erickson, and Zhuo Jing-Schmidt. 2021. #MaskOn! #MaskOff! Digital Polarization of Mask-Wearing in the United States during COVID-19. PLOS ONE 16, 4 (April 2021), e0250817. https://doi.org/10.1371/journal.pone.0250817",
      "doi": ""
    },
    {
      "text": "Jinfeng Li and Xinyi Guo. 2020. COVID-19 Contact-tracing Apps: A Survey on the Global Deployment and Challenges. arXiv:2005.03599 [cs] (May 2020). arxiv:2005.03599 [cs]",
      "doi": ""
    },
    {
      "text": "Tianshi Li, Jackie, Yang, Cori Faklaris, Jennifer King, Yuvraj Agarwal, Laura Dabbish, and Jason I. Hong. 2020. Decentralized Is Not Risk-Free: Understanding Public Perceptions of Privacy-Utility Trade-Offs in COVID-19 Contact-Tracing Apps. (2020). arxiv:2005.11957",
      "doi": ""
    },
    {
      "text": "Xi Lu, Tera L. Reynolds, Eunkyung Jo, Hwajung Hong, Xinru Page, Yunan Chen, and Daniel A. Epstein. 2021. Comparing Perspectives Around Human and Technology Support for Contact Tracing. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3411764.3445669",
      "doi": ""
    },
    {
      "text": "Chandini Raina MacIntyre. 2020. Case Isolation, Contact Tracing, and Physical Distancing Are Pillars of COVID-19 Pandemic Control, Not Optional Choices. The Lancet Infectious Diseases 20, 10 (Oct. 2020), 1105–1106. https://doi.org/10.1016/S1473-3099(20)30512-0",
      "doi": ""
    },
    {
      "text": "Daniel McFadden. 1978. Quantitative Methods for Analysing Travel Behaviour of Individuals: Some Recent Developments. In Behavioural Travel Modelling, David A. Hensher and Peter R. Stopher (Eds.). Croom Helm London, London, 279–318.",
      "doi": ""
    },
    {
      "text": "Daphne Menheere, Carine Lallemand, Erik van der Spek, Carl Megens, Andrew Vande Moere, Mathias Funk, and Steven Vos. 2020. The Runner’s Journey: Identifying Design Opportunities for Running Motivation Technology. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society(NordiCHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3419249.3420151",
      "doi": ""
    },
    {
      "text": "Nasro Min-Allah, Bashayer Abdullah Alahmed, Elaf Mohammed Albreek, Lina Shabab Alghamdi, Doaa Abdullah Alawad, Abeer Salem Alharbi, Noor Al-Akkas, Dhiaa Musleh, and Saleh Alrashed. 2021. A Survey of COVID-19 Contact-Tracing Apps. Computers in Biology and Medicine 137 (Oct. 2021), 104787. https://doi.org/10.1016/j.compbiomed.2021.104787",
      "doi": ""
    },
    {
      "text": "Jessica Morley, Josh Cowls, Mariarosaria Taddeo, and Luciano Floridi. 2020. Ethical Guidelines for COVID-19 Tracing Apps. Nature 582, 7810 (June 2020), 29–31. https://doi.org/10.1038/d41586-020-01578-0",
      "doi": ""
    },
    {
      "text": "Mandy Murphey. 2021. Washington University Develops Contact Tracing App.",
      "doi": ""
    },
    {
      "text": "P. Ndayizigamiye and M. Maharaj. 2016. Mobile Health Adoption in Burundi: A UTAUT Perspective. In 2016 IEEE Global Humanitarian Technology Conference (GHTC). 613–623. https://doi.org/10.1109/GHTC.2016.7857342",
      "doi": ""
    },
    {
      "text": "Nikita A. Nekliudov, Oleg Blyuss, Ka Yan Cheung, Loukia Petrou, Jon Genuneit, Nikita Sushentsev, Anna Levadnaya, Pasquale Comberiati, John O. Warner, Gareth Tudor-Williams, Martin Teufel, Matthew Greenhawt, Audrey DunnGalvin, and Daniel Munblit. 2020. Excessive Media Consumption About COVID-19 Is Associated With Increased State Anxiety: Outcomes of a Large Online Survey in Russia. Journal of Medical Internet Research 22, 9 (Sept. 2020), e20955. https://doi.org/10.2196/20955",
      "doi": ""
    },
    {
      "text": "CBC News. 2021. Sault Ste. Marie Health-Care Professionals Create COVID-19 Contact Tracing App | CBC News. https://www.cbc.ca/news/canada/sudbury/contact-tracing-app-sault-1.6153049.",
      "doi": ""
    },
    {
      "text": "Andreas Oldeweme, Julian Märtins, Daniel Westmattelmann, and Gerhard Schewe. 2021. The Role of Transparency, Trust, and Social Influence on Uncertainty Reduction in Times of Pandemics: Empirical Study on the Adoption of COVID-19 Tracing Apps. Journal of Medical Internet Research 23, 2 (Feb. 2021), e25893. https://doi.org/10.2196/25893",
      "doi": ""
    },
    {
      "text": "Patrick Howell O’Neill. 2020. No, Coronavirus Apps Don’t Need 60% Adoption to Be Effective. https://www.technologyreview.com/2020/06/05/1002775/covid-apps-effective-at-less-than-60-percent-download/.",
      "doi": ""
    },
    {
      "text": "Patrick Howell O’Neill, Tate Ryan-Mosley, and Bobbie Johnson. 2021. A Flood of Coronavirus Apps Are Tracking Us. Now It’s Time to Keep Track of Them.",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2021. Considerations for Implementing and Adjusting Public Health and Social Measures in the Context of COVID-19. Technical Report. 25 pages.",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2021. Preventing and Mitigating COVID-19 at Work. Technical Report. 21 pages.",
      "doi": ""
    },
    {
      "text": "Chanda Phelan, Cliff Lampe, and Paul Resnick. 2016. It’s Creepy, But It Doesn’t Bother Me. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 5240–5251.",
      "doi": "10.1145/2858036.2858381"
    },
    {
      "text": "PolyU. 2021. PolyU’s research finds contact tracing is an effective way for controlling the spread of COVID-19 when borders reopen | Media Releases | Media | PolyU. https://www.polyu.edu.hk/media/media-releases/2021/0901_polyus-research-finds-contact-tracing-for-controlling-the-spread-of-covid-19.",
      "doi": ""
    },
    {
      "text": "Elissa M. Redmiles. 2020. User Concerns 8 Tradeoffs in Technology-facilitated COVID-19 Response. Digital Government: Research and Practice 2, 1 (Nov. 2020), 6:1–6:12. https://doi.org/10.1145/3428093",
      "doi": "10.1145/3428093"
    },
    {
      "text": "Frantz Rowe. 2020. Contact Tracing Apps and Values Dilemmas: A Privacy Paradox in a Neo-Liberal World. International Journal of Information Management (June 2020), 102178. https://doi.org/10.1016/j.ijinfomgt.2020.102178",
      "doi": ""
    },
    {
      "text": "Hervé Saint-Louis and Bob-Antoine Jerry Ménélas. 2021. User Perceptions of Security and Privacy Risks with Contact Tracing Apps. In 3rd International Conference on HCI for Cybersecurity, Privacy, and Trust. Washington, DC, USA, 15.",
      "doi": ""
    },
    {
      "text": "Mia Sato. 2020. Contact Tracing Apps Now Cover Nearly Half of America. It’s Not Too Late to Use One.",
      "doi": ""
    },
    {
      "text": "Gözel Shakeri and Claire H McCallum. 2021. Envirofy Your Shop: Development of a Real-time Tool to Support Eco-friendly Food Purchases Online. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. Number 390. Association for Computing Machinery, New York, NY, USA, 1–10.",
      "doi": "10.1145/3411763.3451713"
    },
    {
      "text": "Shavneet Sharma, Gurmeet Singh, Rashmini Sharma, Paul Jones, Sascha Kraus, and Yogesh K. Dwivedi. 2020. Digital Health Innovation: Exploring Adoption of COVID-19 Digital Contact Tracing Apps. IEEE Transactions on Engineering Management(2020), 1–17. https://doi.org/10.1109/TEM.2020.3019033",
      "doi": ""
    },
    {
      "text": "Tanusree Sharma, Hunter A. Dyer, and Masooda. Bashir. 2021. Enabling User-centered Privacy Controls for Mobile Applications: COVID-19 Perspective. ACM Transactions on Internet Technology 21, 1 (Jan. 2021), 26:1–26:24. https://doi.org/10.1145/3434777",
      "doi": "10.1145/3434777"
    },
    {
      "text": "Tanusree Sharma, Tian Wang, and Masooda Bashir. 2020. Advocating for Users’ Privacy Protections: A Case Study of COVID-19 Apps. In 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’20). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3406324.3410711",
      "doi": ""
    },
    {
      "text": "Paschal Sheeran. 2002. Intention—Behavior Relations: A Conceptual and Empirical Review. European Review of Social Psychology 12, 1 (Jan. 2002), 1–36. https://doi.org/10.1080/14792772143000003",
      "doi": ""
    },
    {
      "text": "Joanne Silberner. 2021. Now Isn’t the Time to Abandon Contact Tracing. Wired (Aug. 2021).",
      "doi": ""
    },
    {
      "text": "Lucy Simko, Ryan Calo, Franziska Roesner, and Tadayoshi Kohno. 2020. COVID-19 Contact Tracing and Privacy: Studying Opinion and Preferences. arXiv:2005.06056 [cs] (Dec. 2020). arxiv:2005.06056 [cs]",
      "doi": ""
    },
    {
      "text": "Raphael Sonabend, Lilith K. Whittles, Natsuko Imai, Pablo N. Perez-Guzman, Edward S. Knock, Thomas Rawson, Katy AM Gaythorpe, Bimandra A. Djaafara, Wes Hinsley, Richard G. FitzJohn, John A. Lees, Divya Thekke Kanapram, Erik M. Volz, Azra C. Ghani, Neil M. Ferguson, Marc Baguelin, and Anne Cori. 2021. Non-Pharmaceutical Interventions, Vaccination and the Delta Variant: Epidemiological Insights from Modelling England’s COVID-19 Roadmap out of Lockdown., 2021.08.17.21262164 pages. https://doi.org/10.1101/2021.08.17.21262164",
      "doi": ""
    },
    {
      "text": "Heshan Sun. 2013. A Longitudinal Study of Herd Behavior in the Adoption and Continued Use of Technology. MIS Quarterly 37, 4 (Dec. 2013), 1013–A13.",
      "doi": "10.25300/MISQ/2013/37.4.02"
    },
    {
      "text": "Monika Taddicken. 2014. The ‘Privacy Paradox’ in the Social Web: The Impact of Privacy Concerns, Individual Characteristics, and the Perceived Social Relevance on Different Forms of Self-Disclosure*. Journal of Computer-Mediated Communication 19, 2 (Jan. 2014), 248–273. https://doi.org/10.1111/jcc4.12052",
      "doi": "10.1111/jcc4.12052"
    },
    {
      "text": "Margaret E. Tankard and Elizabeth Levy Paluck. 2016. Norm Perception as a Vehicle for Social Change. Social Issues and Policy Review 10, 1 (2016), 181–211. https://doi.org/10.1111/sipr.12022",
      "doi": ""
    },
    {
      "text": "Steven Taylor, Caeleigh A. Landry, Michelle M. Paluszek, Thomas A. Fergus, Dean McKay, and Gordon J.G. Asmundson. 2020. Development and Initial Validation of the COVID Stress Scales. Journal of Anxiety Disorders 72 (May 2020), 102232. https://doi.org/10.1016/j.janxdis.2020.102232",
      "doi": ""
    },
    {
      "text": "Stephan ten Kate, Sophie Haverkamp, Fariha Mahmood, and Frans Feldberg. 2010. Social Network Influences on Technology Acceptance: A Matter of Tie Strength, Centrality and Density. In Bled 2010 Proceedings. 16.",
      "doi": ""
    },
    {
      "text": "Lohyd Terrier, Peter Varga, Alice Scaroni, and Laura Zizka. 2020. To Go or Not to Go, That Is the Question: Using Social Influence to Reduce Hot Beverage Cup Waste. Journal of Foodservice Business Research 23, 4 (July 2020), 350–357. https://doi.org/10.1080/15378020.2020.1768041",
      "doi": ""
    },
    {
      "text": "Samuel Tomczyk, Simon Barth, Silke Schmidt, and Holger Muehlan. 2021. Utilizing Health Behavior Change and Technology Acceptance Models to Predict the Adoption of COVID-19 Contact Tracing Apps: Cross-sectional Survey Study. Journal of Medical Internet Research 23, 5 (May 2021), e25447. https://doi.org/10.2196/25447",
      "doi": ""
    },
    {
      "text": "Sabina Tomkins, Steven Isley, Ben London, and Lise Getoor. 2018. Sustainability at Scale: Towards Bridging the Intention-Behavior Gap with Sustainable Recommendations. In Proceedings of the 12th ACM Conference on Recommender Systems(RecSys ’18). Association for Computing Machinery, New York, NY, USA, 214–218. https://doi.org/10.1145/3240323.3240411",
      "doi": "10.1145/3240323.3240411"
    },
    {
      "text": "Ingrid Torjesen. 2021. Covid-19: Omicron May Be More Transmissible than Other Variants and Partly Resistant to Existing Vaccines, Scientists Fear. BMJ 375 (Nov. 2021), n2943. https://doi.org/10.1136/bmj.n2943",
      "doi": ""
    },
    {
      "text": "Christine Utz, Steffen Becker, Theodor Schnitzler, Florian M. Farke, Franziska Herbert, Leonie Schaewitz, Martin Degeling, and Markus Dürmuth. 2021. Apps Against the Spread: Privacy Implications and User Acceptance of COVID-19-Related Smartphone Apps on Three Continents. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–22. https://doi.org/10.1145/3411764.3445517",
      "doi": "10.1145/3411764.3445517"
    },
    {
      "text": "Lindsey Van Ness. 2021. For States’ COVID Contact Tracing Apps, Privacy Tops Utility. https://pew.org/3r1F7VN.",
      "doi": ""
    },
    {
      "text": "Felix Velicia-Martin, Juan-Pedro Cabrera-Sanchez, Eloy Gil-Cordero, and Pedro R. Palos-Sanchez. 2021. Researching COVID-19 Tracing App Acceptance: Incorporating Theory from the Technological Acceptance Model. PeerJ Computer Science 7 (Jan. 2021), e316. https://doi.org/10.7717/peerj-cs.316",
      "doi": ""
    },
    {
      "text": "Viswanath Venkatesh, Michael G Morris, Gordon B Davis, and Fred D Davis. 2003. User Acceptance of Information Technology: Toward a Unified View. MIS Quarterly 27, 3 (2003), 425–478.",
      "doi": "10.5555/2017197.2017202"
    },
    {
      "text": "Kumar Vikram. 2021. Not Many Takers for Aarogya Setu App, Delhi and Chandigarh See Highest Users. https://www.newindianexpress.com/nation/2021/mar/21/not-many-takers-for-aarogya-setu-appdelhi-and-chandigarh-see-highest-users-2279311.html.",
      "doi": ""
    },
    {
      "text": "Michel Walrave, Cato Waeterloos, and Koen Ponnet. 2020. Ready or Not for Contact Tracing? Investigating the Adoption Intention of COVID-19 Contact-Tracing Technology Using an Extended Unified Theory of Acceptance and Use of Technology Model. Cyberpsychology, Behavior, and Social Networking (Oct. 2020). https://doi.org/10.1089/cyber.2020.0483",
      "doi": ""
    },
    {
      "text": "Yunlong Wang, Ahmed Fadhil, and Harald Reiterer. 2018. Supporting Action Planning for Sedentary Behavior Change by Visualizing Personal Mobility Patterns on Smartphone. In Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare(PervasiveHealth ’18). Association for Computing Machinery, New York, NY, USA, 396–401. https://doi.org/10.1145/3240925.3240962",
      "doi": "10.1145/3240925.3240962"
    },
    {
      "text": "K. Witte and M. Allen. 2000. A Meta-Analysis of Fear Appeals: Implications for Effective Public Health Campaigns. Health Education & Behavior: The Official Publication of the Society for Public Health Education 27, 5 (Oct. 2000), 591–615. https://doi.org/10.1177/109019810002700506",
      "doi": ""
    },
    {
      "text": "Chris Wymant, Luca Ferretti, Daphne Tsallis, Marcos Charalambides, Lucie Abeler-Dörner, David Bonsall, Robert Hinch, Michelle Kendall, Luke Milsom, Matthew Ayres, Chris Holmes, Mark Briers, and Christophe Fraser. 2021. The Epidemiological Impact of the NHS COVID-19 App. Nature 594, 7863 (June 2021), 408–412. https://doi.org/10.1038/s41586-021-03606-z",
      "doi": ""
    },
    {
      "text": "Yamin, Fei, Lahlou, and Levy. 2019. Using Social Norms to Change Behavior and Increase Sustainability in the Real World: A Systematic Review of the Literature. Sustainability 11, 20 (Oct. 2019), 5847. https://doi.org/10.3390/su11205847",
      "doi": ""
    },
    {
      "text": "Aristea M. Zafeiropoulou, David E. Millard, Craig Webber, and Kieron O’Hara. 2013. Unpicking the Privacy Paradox: Can Structuration Theory Help to Explain Location-Based Privacy Decisions?. In Proceedings of the 5th Annual ACM Web Science Conference(WebSci ’13). Association for Computing Machinery, New York, NY, USA, 463–472. https://doi.org/10.1145/2464464.2464503",
      "doi": "10.1145/2464464.2464503"
    },
    {
      "text": "Yaxi Zhao, Zhao Zhao, Jack Jamieson, Anthony Tang, and Rhonda Mcewen. 2021. Tracing a Pandemic: A Comparative Analysis of Contact Tracing Healthcare Approaches in China and Canada. In 71st Annual International Communication Association Conference. Virtual.",
      "doi": ""
    }
  ]
}