{
  "doi": "10.1145/3491102.3517511",
  "title": "GANSpiration: Balancing Targeted and Serendipitous Inspiration in User Interface Design with Style-Based Generative Adversarial Network",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "Inspiration from design examples plays a crucial role in the creative process of user interface design. However, current tools and techniques that support inspiration usually only focus on example browsing with limited user control or similarity-based example retrieval, leading to undesirable design outcomes such as focus drift and design fixation. To address these issues, we propose the GANSpiration approach that suggests design examples for both targeted and serendipitous inspiration, leveraging a style-based Generative Adversarial Network. A quantitative evaluation revealed that the outputs of GANSpiration-based example suggestion approaches are relevant to the input design, and at the same time include diverse instances. A user study with professional UI/UX practitioners showed that the examples suggested by our approach serve as viable sources of inspiration for overall design concepts and specific design elements. Overall, our work paves the road of using advanced generative machine learning techniques in supporting the creative design practice.",
  "authors": [
    {
      "name": "Mohammad Amin Mozaffari",
      "institution": "Department of Computer and Software Engineering, Polytechnique Montreal, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236627",
      "orcid": "missing"
    },
    {
      "name": "Xinyuan Zhang",
      "institution": "Department of Computer and Software Engineering, Polytechnique Montreal, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236243",
      "orcid": "missing"
    },
    {
      "name": "Jinghui Cheng",
      "institution": "Department of Computer and Software Engineering, Polytechnique Montreal, Canada",
      "img": "/do/10.1145/contrib-81548783656/rel-imgonly/profile2.png",
      "acmid": "81548783656",
      "orcid": "0000-0002-8474-5290"
    },
    {
      "name": "Jin L.C. Guo",
      "institution": "School of Computer Science, McGill University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "88158840757",
      "orcid": "0000-0003-1782-1545"
    }
  ],
  "references": [
    {
      "text": "Behance. 2022. Behance - Search Projects: Photos, videos, logos, illustrations and branding. https://www.behance.net",
      "doi": ""
    },
    {
      "text": "Farnaz Behrang, Steven P Reiss, and Alessandro Orso. 2018. GUIfetch. In Proceedings of the 5th International Conference on Mobile Software Engineering and Systems - MOBILESoft ’18. ACM Press, New York, New York, USA, 236–246. https://doi.org/10.1145/3197231.3197244",
      "doi": ""
    },
    {
      "text": "Tony Beltramelli. 2018. Pix2Code: Generating Code from a Graphical User Interface Screenshot. In Proceedings of the ACM SIGCHI Symposium on Engineering Interactive Computing Systems (Paris, France) (EICS ’18). ACM, New York, NY, USA, Article 3, 6 pages. https://doi.org/10.1145/3220134.3220135",
      "doi": "10.1145/3220134.3220135"
    },
    {
      "text": "Derya Birant and Alp Kut. 2007. ST-DBSCAN: An algorithm for clustering spatial–temporal data. Data & knowledge engineering 60, 1 (2007), 208–221.",
      "doi": ""
    },
    {
      "text": "Nathalie Bonnardel. 1999. Creativity in design activities. In Proceedings of the third conference on Creativity & cognition - C&C ’99. ACM Press, New York, New York, USA, 158–165. https://doi.org/10.1145/317561.317589",
      "doi": "10.1145/317561.317589"
    },
    {
      "text": "Sara Bunian, Kai Li, Chaima Jemmali, Casper Harteveld, Yun Fu, and Magy Seif Seif El-Nasr. 2021. VINS: Visual Search for Mobile User Interface Design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). ACM, New York, NY, USA, Article 423, 14 pages. https://doi.org/10.1145/3411764.3445762",
      "doi": "10.1145/3411764.3445762"
    },
    {
      "text": "Chunyang Chen, Ting Su, Guozhu Meng, Zhenchang Xing, and Yang Liu. 2018. From UI Design Image to GUI Skeleton: A Neural Machine Translator to Bootstrap Mobile GUI Implementation. In Proceedings of the 40th International Conference on Software Engineering (Gothenburg, Sweden) (ICSE ’18). ACM, New York, NY, USA, 665–676. https://doi.org/10.1145/3180155.3180240",
      "doi": "10.1145/3180155.3180240"
    },
    {
      "text": "Chunyang Chen, Ting Su, Guozhu Meng, Zhenchang Xing, and Yang Liu. 2018. From UI Design Image to GUI Skeleton: A Neural Machine Translator to Bootstrap Mobile GUI Implementation. In Proceedings of the 40th International Conference on Software Engineering (Gothenburg, Sweden) (ICSE ’18). ACM, New York, NY, USA, 665–676. https://doi.org/10.1145/3180155.3180240",
      "doi": "10.1145/3180155.3180240"
    },
    {
      "text": "Biplab Deka, Zifeng Huang, Chad Franzen, Joshua Hibschman, Daniel Afergan, Yang Li, Jeffrey Nichols, and Ranjitha Kumar. 2017. Rico: A Mobile App Dataset for Building Data-Driven Design Applications. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 845–854. https://doi.org/10.1145/3126594.3126651",
      "doi": "10.1145/3126594.3126651"
    },
    {
      "text": "Dribbble. 2022. Dribbble - Discover the World’s Top Designers and Creative Professionals. https://dribbble.com/",
      "doi": ""
    },
    {
      "text": "Claudia Eckert and Martin Stacey. 2000. Sources of inspiration: a language of design. Design Studies 21, 5 (2000), 523–538. https://doi.org/10.1016/S0142-694X(00)00022-3",
      "doi": ""
    },
    {
      "text": "Milene Gonçalves, Carlos Cardoso, and Petra Badke-Schaub. 2014. What inspires designers? Preferences on inspirational approaches during idea generation. Design Studies 35, 1 (2014), 29–53. https://doi.org/10.1016/j.destud.2013.09.001",
      "doi": ""
    },
    {
      "text": "Ian J. Goodfellow, Jean Pouget-Abadie, Mehdi Mirza, Bing Xu, David Warde-Farley, Sherjil Ozair, Aaron Courville, and Yoshua Bengio. 2014. Generative Adversarial Nets. In Proceedings of the 27th International Conference on Neural Information Processing Systems - Volume 2 (Montreal, Canada). MIT Press, Cambridge, MA, USA, 2672–2680.",
      "doi": "10.5555/2969033.2969125"
    },
    {
      "text": "Yasunari Hashimoto and T Igarashi. 2005. Retrieving web page layouts using sketches to support example-based web design. In Proceedings of 2nd Eurographics Workshop on Sketch-Based Interfaces and Modeling. Eurographics Association, Goslar, DEU, 10.",
      "doi": ""
    },
    {
      "text": "S.R. Herring, B.R. Jones, and B.P. Bailey. 2009. Idea Generation Techniques among Creative Professionals. In Proceedings of the 42nd Annual Hawaii International Conference on System Sciences, HICSS. IEEE Computer Society, Los Alamitos, CA, USA, 1–10. https://doi.org/10.1109/HICSS.2009.241",
      "doi": ""
    },
    {
      "text": "Scarlett R. Herring, Chia-Chen Chang, Jesse Krantzler, and Brian P. Bailey. 2009. Getting Inspired! Understanding How and Why Examples Are Used in Creative Design Practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 87–96. https://doi.org/10.1145/1518701.1518717",
      "doi": "10.1145/1518701.1518717"
    },
    {
      "text": "Martin Heusel, Hubert Ramsauer, Thomas Unterthiner, Bernhard Nessler, and Sepp Hochreiter. 2017. GANs Trained by a Two Time-Scale Update Rule Converge to a Local Nash Equilibrium. In Proceedings of the 31st International Conference on Neural Information Processing Systems (Long Beach, California, USA). Curran Associates Inc., Red Hook, NY, USA, 6629–6640.",
      "doi": "10.5555/3295222.3295408"
    },
    {
      "text": "Forrest Huang, John F. Canny, and Jeffrey Nichols. 2019. Swire: Sketch-based User Interface Retrieval. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 104, 10 pages. https://doi.org/10.1145/3290605.3300334",
      "doi": "10.1145/3290605.3300334"
    },
    {
      "text": "David G. Jansson and Steven M. Smith. 1991. Design fixation. Design Studies 12, 1 (1991), 3–11. https://doi.org/10.1016/0142-694X(91)90003-F",
      "doi": ""
    },
    {
      "text": "T. Karras, S. Laine, and T. Aila. 2019. A Style-Based Generator Architecture for Generative Adversarial Networks. In 2019 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR). IEEE Computer Society, Los Alamitos, CA, USA, 4396–4405. https://doi.org/10.1109/CVPR.2019.00453",
      "doi": ""
    },
    {
      "text": "T. Karras, S. Laine, M. Aittala, J. Hellsten, J. Lehtinen, and T. Aila. 2020. Analyzing and Improving the Image Quality of StyleGAN. In 2020 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR). IEEE Computer Society, Los Alamitos, CA, USA, 8107–8116. https://doi.org/10.1109/CVPR42600.2020.00813",
      "doi": ""
    },
    {
      "text": "Yann LeCun and Yoshua Bengio. 1998. Convolutional Networks for Images, Speech, and Time Series. MIT Press, Cambridge, MA, USA, 255–258.",
      "doi": ""
    },
    {
      "text": "Brian Lee, Savil Srivastava, Ranjitha Kumar, Ronen Brafman, and Scott R. Klemmer. 2010. Designing with interactive example galleries. In Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10. ACM Press, New York, New York, USA, 2257. https://doi.org/10.1145/1753326.1753667",
      "doi": "10.1145/1753326.1753667"
    },
    {
      "text": "Richard L. Marsh, Joshua D. Landau, and Jason L. Hicks. 1996. How examples may (and may not) constrain creativity. Memory & Cognition 24, 5 (sep 1996), 669–680. https://doi.org/10.3758/BF03201091",
      "doi": ""
    },
    {
      "text": "Kevin Moran, Carlos Bernal-Cárdenas, Michael Curcio, Richard Bonett, and Denys Poshyvanyk. 2020. Machine Learning-Based Prototyping of Graphical User Interfaces for Mobile Apps. IEEE Transactions on Software Engineering 46, 2 (2020), 196–221. https://doi.org/10.1109/TSE.2018.2844788",
      "doi": ""
    },
    {
      "text": "Dmitry Nikitko. 2019. StyleGAN-Encoder. https://github.com/Puzer/stylegan-encoder.",
      "doi": ""
    },
    {
      "text": "Daniel Ritchie, Ankita Arvind Kejriwal, and Scott R. Klemmer. 2011. d.tour: style-based exploration of design example galleries. In Proceedings of the 24th annual ACM symposium on User interface software and technology - UIST ’11. ACM Press, New York, New York, USA, 165. https://doi.org/10.1145/2047196.2047216",
      "doi": "10.1145/2047196.2047216"
    },
    {
      "text": "Pao Siangliulue, Joel Chan, Krzysztof Z. Gajos, and Steven P. Dow. 2015. Providing Timely Examples Improves the Quantity and Quality of Generated Ideas. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition - C&C ’15. ACM Press, New York, New York, USA, 83–92. https://doi.org/10.1145/2757226.2757230",
      "doi": "10.1145/2757226.2757230"
    },
    {
      "text": "Marco Suarez, Jina Anne, Katie Sylor-Miller, Diana Mounter, and Roy Stanfield. 2022. Design Systems Handbook. InVision, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Amanda Swearngin, Mira Dontcheva, Wilmot Li, Joel Brandt, Morgan Dixon, and Andrew J. Ko. 2018. Rewire. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, New York, New York, USA, 1–12. https://doi.org/10.1145/3173574.3174078",
      "doi": ""
    },
    {
      "text": "Todd M. Thrash and Andrew J. Elliot. 2003. Inspiration as a Psychological Construct. Journal of Personality and Social Psychology 84, 4(2003), 871–889. https://doi.org/10.1037/0022-3514.84.4.871",
      "doi": ""
    },
    {
      "text": "Todd M. Thrash, Emil G. Moldovan, Victoria C. Oleynick, and Laura A. Maruskin. 2014. The psychology of inspiration. Social and Personality Psychology Compass 8, 9 (2014), 495–510. https://doi.org/10.1111/spc3.12127",
      "doi": ""
    },
    {
      "text": "Mojtaba Vaismoradi, Hannele Turunen, and Terese Bondas. 2013. Content analysis and thematic analysis: Implications for conducting a qualitative descriptive study. Nursing & Health Sciences 15, 3 (2013), 398–405. https://doi.org/10.1111/nhs.12048 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/nhs.12048",
      "doi": ""
    },
    {
      "text": "Jason Wu, Xiaoyi Zhang, Jeff Nichols, and Jeffrey P Bigham. 2021. Screen Parsing: Towards Reverse Engineering of UI Models from Screenshots. Association for Computing Machinery, New York, NY, USA, 470–483. https://doi.org/10.1145/3472749.3474763",
      "doi": ""
    },
    {
      "text": "Mulong Xie, Sidong Feng, Zhenchang Xing, Jieshan Chen, and Chunyang Chen. 2020. UIED: A Hybrid Tool for GUI Element Detection. In Proceedings of the 28th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering (Virtual Event, USA) (ESEC/FSE 2020). ACM, New York, NY, USA, 1655–1659. https://doi.org/10.1145/3368089.3417940",
      "doi": "10.1145/3368089.3417940"
    },
    {
      "text": "R. Zhang, P. Isola, A. A. Efros, E. Shechtman, and O. Wang. 2018. The Unreasonable Effectiveness of Deep Features as a Perceptual Metric. In 2018 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR). IEEE Computer Society, Los Alamitos, CA, USA, 586–595. https://doi.org/10.1109/CVPR.2018.00068",
      "doi": ""
    },
    {
      "text": "Tianming Zhao, Chunyang Chen, Yuanning Liu, and Xiaodong Zhu. 2021. GUIGAN: Learning to Generate GUI Designs Using Generative Adversarial Networks. In 2021 IEEE/ACM 43rd International Conference on Software Engineering (ICSE). IEEE Computer Society, Los Alamitos, CA, USA, 748–760. https://doi.org/10.1109/ICSE43902.2021.00074",
      "doi": "10.1109/ICSE43902.2021.00074"
    }
  ]
}