{
  "doi": "10.1145/3491102.3517628",
  "title": "Coordination and Collaboration: How do Volunteer Moderators Work as a Team in Live Streaming Communities?",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "Volunteer moderators (mods) play significant roles in developing moderation standards and dealing with harmful content in their micro-communities. However, little work explores how volunteer mods work as a team. In line with prior work about understanding volunteer moderation, we interview 40 volunteer mods on Twitch — a leading live streaming platform. We identify how mods collaborate on tasks (off-streaming coordination and preparation, in-stream real-time collaboration, and relationship building both off-stream and in-stream to reinforce collaboration) and how mods contribute to moderation standards (collaboratively working on the community rulebook and individually shaping community norms). We uncover how volunteer mods work as an effective team. We also discuss how the affordances of multi-modal communication and informality of volunteer moderation contribute to task collaboration, standards development, and mod’s roles and responsibilities.",
  "tags": [
    "collaboration",
    "content moderation",
    "volunteer mods",
    "online community",
    "Teamwork",
    "rules and norms",
    "coordination",
    "live streaming"
  ],
  "authors": [
    {
      "name": "Jie Cai",
      "institution": "New Jersey Institute of Technology, United States",
      "img": "/do/10.1145/contrib-99659279169/rel-imgonly/selfsquare1.jpg",
      "acmid": "99659279169",
      "orcid": "0000-0002-0582-555X"
    },
    {
      "name": "Donghee Yvette Wohn",
      "institution": "New Jersey Institute of Technology, United States",
      "img": "/do/10.1145/contrib-81481649423/rel-imgonly/yvettesmall.jpg",
      "acmid": "81481649423",
      "orcid": "0000-0001-5583-4430"
    }
  ],
  "references": [
    {
      "text": "Ofer Arazy, Oded Nov, Raymond Patterson, and Lisa Yeo. 2011. Information quality in wikipedia: The effects of group composition and task conflict. Journal of Management Information Systems 27, 4 (2011), 71–98. https://doi.org/10.2753/MIS0742-1222270403",
      "doi": "10.2753/mis0742-1222270403"
    },
    {
      "text": "Pernille Bjørn, Morten Esbensen, Rasmus Eskild Jensen, and Stina Matthiesen. 2014. Does distance still matter? Revisiting the CSCW fundamentals on distributed collaboration. ACM Transactions on Computer-Human Interaction 21, 5(2014), 1–26. https://doi.org/10.1145/2670534",
      "doi": "10.1145/2670534"
    },
    {
      "text": "Pernille Bjørn and Ojelanki Ngwenyama. 2009. Virtual team collaboration: building shared meaning, resolving breakdowns and creating translucence. Information Systems Journal 19, 3 (5 2009), 227–253. https://doi.org/10.1111/j.1365-2575.2007.00281.x",
      "doi": ""
    },
    {
      "text": "Anita L. Blanchard, Jennifer L. Welbourne, and Marla D. Boughton. 2010. A model of online trust: The mediating role of norms and sense of virtual community. Information, Communication & Society 14, 1 (2010), 76–106. https://doi.org/10.1080/13691181003739633",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (1 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Jie Cai, Cameron Guanlao, and Donghee Yvette Wohn. 2021. Understanding Rules in Live Streaming Micro Communities on Twitch. In ACM International Conference on Interactive Media Experiences. ACM, New York, NY, USA, 290–295. https://doi.org/10.1145/3452918.3465491",
      "doi": "10.1145/3452918.3465491"
    },
    {
      "text": "Jie Cai and Donghee Yvette Wohn. 2019. Categorizing Live Streaming Moderation Tools. International Journal of Interactive Communication Systems and Technologies 9, 2 (7 2019), 36–50. https://doi.org/10.4018/IJICST.2019070103",
      "doi": ""
    },
    {
      "text": "Jie Cai, Donghee Yvette Wohn, and Mashael Almoqbel. 2021. Moderation Visibility: Mapping the Strategies of Volunteer Moderators in Live Streaming Micro Communities. In ACM International Conference on Interactive Media Experiences. ACM, New York, NY, USA, 61–72. https://doi.org/10.1145/3452918.3458796",
      "doi": "10.1145/3452918.3458796"
    },
    {
      "text": "Jie Cai and Donghee Yvette Wohn. 2021. After Violation But Before Sanction: Understanding Volunteer Moderators’ Profiling Processes Toward Violators in Live Streaming Communities. Proc. ACM Hum.-Comput. Interact. 5, CSCW2 (2021), 25. https://doi.org/10.1145/3479554",
      "doi": "10.1145/3479554"
    },
    {
      "text": "Stevie Chancellor, Andrea Hu, and Munmun De Choudhury. 2018. Norms Matter: Contrasting Social Support Around Behavior Change in Online Weight Loss Communities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, Vol. 2018-April. ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3174240",
      "doi": "10.1145/3173574.3174240"
    },
    {
      "text": "Eshwar Chandrasekharan, Mattia Samory, Shagun Jhaver, Hunter Charvat, Amy Bruckman, Cliff Lampe, Jacob Eisenstein, and Eric Gilbert. 2018. The Internet’s Hidden Rules: An Empirical Study of Reddit Norm Violations at Micro, Meso, and Macro Scales. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (11 2018), 1–25. https://doi.org/10.1145/3274301",
      "doi": "10.1145/3274301"
    },
    {
      "text": "Eshwar Chandrasekharan, Mattia Samory, Anirudh Srinivasan, and Eric Gilbert. 2017. The Bag of Communities. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 3175–3187. https://doi.org/10.1145/3025453.3026018",
      "doi": "10.1145/3025453.3026018"
    },
    {
      "text": "Robert B. Cialdini, Carl A. Kallgren, and Raymond R. Reno. 1991. A Focus Theory of Normative Conduct: A Theoretical Refinement and Reevaluation of the Role of Norms in Human Behavior. In Advances in Experimental Social Psychology. Vol. 24. 201–234. https://doi.org/10.1016/S0065-2601(08)60330-5",
      "doi": ""
    },
    {
      "text": "Robert B Cialdini and Melanie R Mr Trost. 1998. Social influence: Social norms, conformity and compliance.In The handbook of social psychology, Vols. 1-2, 4th ed.McGraw-Hill, New York, NY, US, 151–192.",
      "doi": ""
    },
    {
      "text": "Laura Dabbish, Robert Kraut, and Jordan Patton. 2012. Communication and commitment in an online game team. In Conference on Human Factors in Computing Systems - Proceedings. 879–888. https://doi.org/10.1145/2207676.2208529",
      "doi": "10.1145/2207676.2208529"
    },
    {
      "text": "Bryan Dosono and Bryan Semaan. 2019. Moderation Practices as Emotional Labor in Sustaining Online Communities. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, New York, New York, USA, 1–13. https://doi.org/10.1145/3290605.3300372",
      "doi": "10.1145/3290605.3300372"
    },
    {
      "text": "Blake Droesch. 2021. The Livestreaming Landscape 2021 - Insider Intelligence Trends, Forecasts & Statistics. https://www.emarketer.com/content/livestreaming-landscape-2021",
      "doi": ""
    },
    {
      "text": "Scott Elrod, Richard Bruce, Rich Gold, David Goldberg, Frank Halasz, William Janssen, David Lee, Kim McCall, Elin Pedersen, Ken Pier, John Tang, and Brent Welch. 1992. Liveboard: a large interactive display supporting group meetings, presentations and remote collaboration. In Conference on Human Factors in Computing Systems - Proceedings, Vol. 92. 599–607.",
      "doi": "10.1145/142750.143052"
    },
    {
      "text": "Dawn L. Eubanks, Michael Palanski, Joy Olabisi, Adam Joinson, and James Dove. 2016. Team dynamics in virtual, partially distributed teams: Optimal role fulfillment. Computers in Human Behavior 61 (8 2016), 556–568. https://doi.org/10.1016/j.chb.2016.03.035",
      "doi": ""
    },
    {
      "text": "Chenlu Feng and Donghee Yvette Wohn. 2020. Categorizing Online Harassment Interventions. In International Symposium on Technology and Society, Proceedings, Vol. 2020-Novem. Institute of Electrical and Electronics Engineers (IEEE), 255–265. https://doi.org/10.1109/ISTAS50296.2020.9462206",
      "doi": ""
    },
    {
      "text": "Casey Fiesler, Jialun ”Aaron” Jiang, Joshua McCann, Kyle Frye, and Jed R Brubaker. 2018. Reddit Rules! Characterizing an Ecosystem of Governance. In Proceedings of the 6th International AAAI Conference on Weblogs and Social Media. 72–81. https://doi.org/10.1016/j.tvjl.2007.05.023",
      "doi": ""
    },
    {
      "text": "Guo Freeman and Donghee Yvette Wohn. 2019. Understanding eSports Team Formation and Coordination. Computer Supported Cooperative Work (CSCW) 28, 1-2 (4 2019), 95–126. https://doi.org/10.1007/s10606-017-9299-4",
      "doi": "10.1007/s10606-017-9299-4"
    },
    {
      "text": "Sarah A. Gilbert. 2020. ”I run the world’s largest historical outreach project and it’s on a cesspool of a website.” Moderating a Public Scholarship Site on Reddit: A Case Study of r/AskHistorians. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1 (5 2020), 1–27. https://doi.org/10.1145/3392822",
      "doi": "10.1145/3392822"
    },
    {
      "text": "Tarleton Gillespie. 2018. Custodians of the internet: Platforms, content moderation, and the hidden decisions that shape social media. Yale University Press, New Haven. 1–288 pages.",
      "doi": ""
    },
    {
      "text": "Tarleton Gillespie. 2020. Content moderation, AI, and the question of scale. Big Data and Society 7, 2 (7 2020). https://doi.org/10.1177/2053951720943234",
      "doi": ""
    },
    {
      "text": "Tarleton Gillespie, Patricia Aufderheide, Elinor Carmi, Ysabel Gerrard, Robert Gorwa, Ariadna Matamoros-Fernández, Sarah T. Roberts, Aram Sinnreich, and Sarah Myers West. 2020. Expanding the debate about content moderation: Scholarly research agendas for the coming policy debates. Internet Policy Review 9, 4 (2020), 1–29. https://doi.org/10.14763/2020.4.1512",
      "doi": ""
    },
    {
      "text": "James Grimmelmann. 2015. The Virtues of Moderation. Yale Journal of Law and Technology 17, 1 (2015), 68. https://digitalcommons.law.yale.edu/yjolt/vol17/iss1/2",
      "doi": ""
    },
    {
      "text": "Carl Gutwin, Saul Greenberg, Roger Blum, Jeff Dyck, Kimberly Tee, and Gregor McEwan. 2008. Supporting informal collaboration in shared-workspace groupware. In Journal of Universal Computer Science, Vol. 14. 1411–1434.",
      "doi": ""
    },
    {
      "text": "William A Hamilton, Oliver Garretson, and Andruid Kerne. 2014. Streaming on twitch: fostering participatory communities of play within live mixed media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1315–1324. https://doi.org/10.1145/2556288.2557048",
      "doi": "10.1145/2556288.2557048"
    },
    {
      "text": "Michael A. Hogg and Scott A. Reid. 2006. Social Identity, Self-Categorization, and the Communication of Group Norms. Communication Theory 16, 1 (2 2006), 7–30. https://doi.org/10.1111/j.1468-2885.2006.00003.x",
      "doi": ""
    },
    {
      "text": "Liaquat Hossain and Rolf T. Wigand. 2004. ICT enabled virtual collaboration through trust. https://doi.org/10.1111/j.1083-6101.2004.tb00233.x",
      "doi": ""
    },
    {
      "text": "Jane Im, Sonali Tandon, Eshwar Chandrasekharan, Taylor Denby, and Eric Gilbert. 2020. Synthesized Social Signals: Computationally-Derived Social Signals from Account Histories. In Proceedings of the Conference on Human Factors in Computing Systems. 1–12. https://doi.org/10.1145/3313831.3376383",
      "doi": "10.1145/3313831.3376383"
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible bits: Towards seamless interfaces between people, bits and atoms. In Conference on Human Factors in Computing Systems - Proceedings. 234–241.",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Shagun Jhaver, Darren Scott Appling, Eric Gilbert, and Amy Bruckman. 2019. “Did you suspect the post would be removed?”: Understanding user reactions to content removals on reddit. In Proceedings of the ACM on Human-Computer Interaction, Vol. 3. CSCW, 33. https://doi.org/10.1145/3359294",
      "doi": "10.1145/3359294"
    },
    {
      "text": "Shagun Jhaver, Iris Birman, Eric Gilbert, and Amy Bruckman. 2019. Human-machine collaboration for content regulation: The case of reddit automoderator. ACM Transactions on Computer-Human Interaction 26, 5(2019), 35. https://doi.org/10.1145/3338243",
      "doi": "10.1145/3338243"
    },
    {
      "text": "Shagun Jhaver, Amy Bruckman, and Eric Gilbert. 2019. Does transparency in moderation really matter?: User behavior after content removal explanations on reddit. In Proceedings of the ACM on Human-Computer Interaction, Vol. 3. 27. https://doi.org/10.1145/3359252",
      "doi": "10.1145/3359252"
    },
    {
      "text": "Jialun Jiang, Charles Kiene, Skyler Middler, Jed R. Brubaker, and Casey Fiesler. 2019. Moderation challenges in voice-based online communities on discord. In Proceedings of the ACM on Human-Computer Interaction, Vol. 3. 23. https://doi.org/10.1145/3359157",
      "doi": "10.1145/3359157"
    },
    {
      "text": "Robyn Keast, Kerry Brown, and Myrna Mandell. 2007. Getting The Right Mix: Unpacking Integration Meanings and Strategies. International Public Management Journal 10, 1 (2 2007), 9–33. https://doi.org/10.1080/10967490601185716",
      "doi": ""
    },
    {
      "text": "Aniket Kittur and Robert E Kraut. 2008. Harnessing the wisdom of crowds in wikipedia. In Proceedings of the ACM 2008 conference on Computer supported cooperative work - CSCW ’08. ACM Press, New York, New York, USA, 37. https://doi.org/10.1145/1460563.1460572",
      "doi": "10.1145/1460563.1460572"
    },
    {
      "text": "Aniket Kittur and Robert E. Kraut. 2010. Beyond Wikipedia: Coordination and conflict in online production groups. In Proceedings of the ACM Conference on Computer Supported Cooperative Work. 215–224. https://doi.org/10.1145/1718918.1718959",
      "doi": "10.1145/1718918.1718959"
    },
    {
      "text": "Aniket Kittur, Bongwon Suh, Bryan A. Pendleton, and Ed H. Chi. 2007. He says, she says: Conflict and coordination in Wikipedia. In Conference on Human Factors in Computing Systems - Proceedings. 453–462. https://doi.org/10.1145/1240624.1240698",
      "doi": "10.1145/1240624.1240698"
    },
    {
      "text": "Yubo Kou and Xinning Gui. 2021. Flag and Flaggability in Automated Moderation. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3411764.3445279",
      "doi": "10.1145/3411764.3445279"
    },
    {
      "text": "Robert E. Kraut and Andrew T. Fiore. 2014. The role of founders in building online groups. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, New York, NY, USA, 722–732. https://doi.org/10.1145/2531602.2531648",
      "doi": ""
    },
    {
      "text": "Hideaki Kuzuoka. 1992. Spatial workspace collaboration: a sharedview video support system for remote collaboration capability. In Conference on Human Factors in Computing Systems - Proceedings. 533–540.",
      "doi": "10.1145/142750.142980"
    },
    {
      "text": "Stefan Larsson, Mans Svensson, Marcin de Kaminski, Kari Rönkkö, and Johanna Alkan Olsson. 2012. Law, norms, piracy and online anonymity: Practices of de-identification in the global file sharing community. Journal of Research in Interactive Marketing 6, 4 (2012), 260–280. https://doi.org/10.1108/17505931211282391",
      "doi": ""
    },
    {
      "text": "Alex Leavitt, Brian C. Keegan, and Joshua Clark. 2016. Ping to win? Non-verbal communication and team performance in competitive online multiplayer games. In Conference on Human Factors in Computing Systems - Proceedings. 4337–4350. https://doi.org/10.1145/2858036.2858132",
      "doi": ""
    },
    {
      "text": "Jean MacMillan, Elliot E. Entin, and Daniel Serfaty. 2004. Communication overhead: The hidden cost of team cognition.In Team cognition: Understanding the factors that drive process and performance.American Psychological Association, Washington, 61–82. https://doi.org/10.1037/10690-004",
      "doi": ""
    },
    {
      "text": "Kris M. Markman. 2012. A Networked Self: Identity, Community and Culture on Social Network Sites. New Media & Society 14, 7 (2012), 1240–1242. https://doi.org/10.1177/1461444812453432",
      "doi": ""
    },
    {
      "text": "J. Nathan Matias. 2019. The Civic Labor of Volunteer Moderators Online. Social Media + Society 5, 2 (2019), 12. https://doi.org/10.1177/2056305119836778",
      "doi": ""
    },
    {
      "text": "Aiden McGillicuddy, Jean Grégoire Bernard, and Jocelyn Cranefield. 2016. Controlling bad behavior in online communities: An examination of moderation work. In 2016 International Conference on Information Systems, ICIS 2016. 11. https://slashdot.org/moderation.shtml",
      "doi": ""
    },
    {
      "text": "Mostafa Mesgari, Chitu Okoli, Mohamad Mehdi, Finn Årup Nielsen, and Arto Lanamäki. 2015. “The sum of all human knowledge”: A systematic review of scholarly research on the content of Wikipedia. Journal of the Association for Information Science and Technology 66, 2 (2 2015), 219–245. https://doi.org/10.1002/ASI.23172",
      "doi": "10.1002/asi.23172"
    },
    {
      "text": "Claudia Müller-Birn, Leonhard Dobusch, and James D Herbsleb. 2013. Work-to-rule: the emergence of algorithmic governance in Wikipedia. In Proceedings of the 6th International Conference on Communities and Technologies - C&T ’13. ACM Press, New York, New York, USA, 80–89. https://doi.org/10.1145/2482991.2482999",
      "doi": "10.1145/2482991.2482999"
    },
    {
      "text": "Sarah Myers West. 2018. Censored, suspended, shadowbanned: User interpretations of content moderation on social media platforms. New Media and Society 20, 11 (2018), 4366–4383. https://doi.org/10.1177/1461444818773059",
      "doi": ""
    },
    {
      "text": "Gary M Olson and Judith S Olson. 2000. Distance Matters. Human –Computer Interaction 15, 2-3 (2000), 139–178. https://doi.org/10.1207/S15327051HCI1523",
      "doi": ""
    },
    {
      "text": "Joonsuk Park, Sally Klingel, Claire Cardie, Mary Newhart, Cynthia Farina, and Joan-Josep Vallbé. 2012. Facilitative moderation for online participation in eRulemaking. In Proceedings of the 13th Annual International Conference on Digital Government Research - dg.o ’12. ACM Press, New York, New York, USA, 173. https://doi.org/10.1145/2307729.2307757",
      "doi": "10.1145/2307729.2307757"
    },
    {
      "text": "Birgit Pfau-Effinger, Lluís Flaquer, and Per H. Jensen. 2010. Formal and Informal Work: The Hidden Work Regime in Europe. Routledge. 1–245 pages. https://doi.org/10.4324/9780203881392",
      "doi": ""
    },
    {
      "text": "Ramón Rico, Miriam Sánchez-Manzanares, Francisco Gil, and Cristina Gibson. 2008. Team implicit coordination processes: A team knowledge-based approach. Academy of Management Review 33, 1 (2008), 163–184. https://doi.org/10.5465/AMR.2008.27751276",
      "doi": ""
    },
    {
      "text": "Sarah T Roberts. 2016. Commercial content moderation: Digital laborers’ dirty work. In The Intersectional Internet: Race, Sex, Class and Culture Online, Safiya Umoja Noble and Brendesha Tynes (Eds.). NY: Peter Lang, New York, Chapter Commercial, 147–160. https://doi.org/10.1007/s13398-014-0173-7.2",
      "doi": ""
    },
    {
      "text": "Joseph Seering, Geoff Kaufman, and Stevie Chancellor. 2020. Metaphors in moderation. New Media & SocietySociety (10 2020), 1–20. https://doi.org/10.1177/1461444820964968",
      "doi": ""
    },
    {
      "text": "Joseph Seering, Robert Kraut, and Laura Dabbish. 2017. Shaping Pro and Anti-Social Behavior on Twitch Through Moderation and Example-Setting. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, New York, NY, USA, 111–125. https://doi.org/10.1145/2998181.2998277",
      "doi": "10.1145/2998181.2998277"
    },
    {
      "text": "Joseph Seering, Tony Wang, Jina Yoon, and Geoff Kaufman. 2019. Moderator engagement and community development in the age of algorithms. New Media & Society 21, 7 (7 2019), 1417–1443. https://doi.org/10.1177/1461444818821316",
      "doi": ""
    },
    {
      "text": "Fatma Cemile Sere, Kathleen Swigger, Ferda Nur Alpaslan, Robert Brazile, George Dafoulas, and Victor Lopez. 2011. Online collaboration: Collaborative behavior patterns and factors affecting globally distributed team performance. Computers in Human Behavior 27, 1 (1 2011), 490–503. https://doi.org/10.1016/j.chb.2010.09.017",
      "doi": ""
    },
    {
      "text": "Kumar Bhargav Srinivasan, Cristian Danescu-Niculescu-Mizil, Lillian Lee, and Chenhao Tan. 2019. Content Removal as a Moderation Strategy: Compliance and Other Outcomes in the ChangeMyView Community. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (11 2019), 1–21. https://doi.org/10.1145/3359265",
      "doi": "10.1145/3359265"
    },
    {
      "text": "Miriah Steiger, Timir J Bharucha, Sukrit Venkatagiri, Martin J. Riedl, and Matthew Lease. 2021. The Psychological Well-Being of Content Moderators. In Proceedings of 2021 CHI Conference on Human Factors in Computing Systems - CHI ’ 2021. ACM, New York, NY, USA, 14. https://doi.org/10.1145/3411764.3445092",
      "doi": "10.1145/3411764.3445092"
    },
    {
      "text": "Marcin Sydow, Katarzyna Baraniak, and Paweł Teisseyre. 2017. Diversity of editors and teams versus quality of cooperative work: experiments on wikipedia. Journal of Intelligent Information Systems 48, 3 (6 2017), 601–632. https://doi.org/10.1007/S10844-016-0428-1/TABLES/20",
      "doi": "10.1007/s10844-016-0428-1"
    },
    {
      "text": "Katie Salen Tekinbaş, Krithika Jagannath, Ulrik Lyngs, and Petr Slovák. 2021. Designing for Youth-Centered Moderation and Community Governance in Minecraft. ACM Transactions on Computer-Human Interaction 28, 4(2021), 1–41. https://doi.org/10.1145/3450290",
      "doi": "10.1145/3450290"
    },
    {
      "text": "Jirassaya Uttarapong, Jie Cai, and Donghee Yvette Wohn. 2021. Harassment Experiences of Women and LGBTQ Live Streamers and How They Handled Negativity. In ACM International Conference on Interactive Media Experiences. ACM, New York, NY, USA, 7–19. https://doi.org/10.1145/3452918.3458794",
      "doi": "10.1145/3452918.3458794"
    },
    {
      "text": "Sahaj Vaidya, Jie Cai, Soumyadeep Basu, Azadeh Naderi, and Donghee Yvette Wohn. 2021. Conceptualizing Visual Analytic Interventions for Content Moderation. In Proceedings of the IEEE Visualization Conference - VIS’21. 5.",
      "doi": ""
    },
    {
      "text": "Chad Whelan. 2017. Managing dynamic security networks: Towards the strategic managing of cooperation, coordination and collaboration. Security Journal 30, 1 (2 2017), 310–327. https://doi.org/10.1057/sj.2014.20",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn. 2019. Volunteer Moderators in Twitch Micro Communities: How They Get Involved, the Roles They Play, and the Emotional Labor They Experience. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300390",
      "doi": "10.1145/3290605.3300390"
    },
    {
      "text": "Donghee Yvette Wohn and Guo Freeman. 2020. Audience Management Practices of Live Streamers on Twitch. In IMX 2020 - Proceedings of the 2020 ACM International Conference on Interactive Media Experiences. Association for Computing Machinery, Inc, New York, NY, USA, 106–116. https://doi.org/10.1145/3391614.3393653",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn, Guo Freeman, and Caitlin McLaughlin. 2018. Explaining viewers’ emotional, instrumental, and financial support provision for live streamers. In Proceedings of 2018 CHI Conference on Human Factors in Computing Systems. ACM Press, New York, NY, 1–13. https://doi.org/10.1145/3173574.3174048",
      "doi": "10.1145/3173574.3174048"
    },
    {
      "text": "Victor Yanev. 2021. 37+ Live Streaming Statistics Every Marketer Should Keep In Mind in 2021. https://techjury.net/blog/live-streaming-statistics/gref",
      "doi": ""
    },
    {
      "text": "Tao Zhou. 2011. Understanding online community user participation: a social influence perspective. Internet Research 21, 1 (1 2011), 67–81. https://doi.org/10.1108/10662241111104884",
      "doi": ""
    },
    {
      "text": "Yingfan Zhou and Rosta Farzan. 2021. Designing to Stop Live Streaming Cyberbullying. In C&T ’21: Proceedings of the 10th International Conference on Communities & Technologies - Wicked Problems in the Age of Tech. ACM, New York, NY, USA, 138–150. https://doi.org/10.1145/3461564.3461574",
      "doi": "10.1145/3461564.3461574"
    }
  ]
}