{
  "doi": "10.1145/3491102.3501948",
  "title": "FitVid: Responsive and Flexible Video Content Adaptation",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "Mobile video-based learning attracts many learners with its mobility and ease of access. However, most lectures are designed for desktops. Our formative study reveals mobile learners’ two major needs: more readable content and customizable video design. To support mobile-optimized learning, we present FitVid, a system that provides responsive and customizable video content. Our system consists of (1) an adaptation pipeline that reverse-engineers pixels to retrieve design elements (e.g., text, images) from videos, leveraging deep learning with a custom dataset, which powers (2) a UI that enables resizing, repositioning, and toggling in-video elements. The content adaptation improves the guideline compliance rate by 24% and 8% for word count and font size. The content evaluation study (n=198) shows that the adaptation significantly increases readability and user satisfaction. The user study (n=31) indicates that FitVid significantly improves learning experience, interactivity, and concentration. We discuss design implications for responsive and customizable video adaptation.",
  "authors": [
    {
      "name": "Jeongyeon Kim",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366617",
      "orcid": "0000-0002-1925-5498"
    },
    {
      "name": "Yubin Choi",
      "institution": "KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237730",
      "orcid": "missing"
    },
    {
      "name": "Minsuk Kahng",
      "institution": "School of Electrical Engineering and Computer Science, Oregon State University, United States",
      "img": "/do/10.1145/contrib-81466648510/rel-imgonly/minsuk_kahng_photo.jpg",
      "acmid": "81466648510",
      "orcid": "missing"
    },
    {
      "name": "Juho Kim",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484651506",
      "orcid": "0000-0001-6348-4127"
    }
  ],
  "references": [
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N Bennett, Kori Inkpen, 2019. Guidelines for human-AI interaction. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Brett G Amidan, Thomas A Ferryman, and Scott K Cooley. 2005. Data outlier detection using the Chebyshev theorem. In 2005 IEEE Aerospace Conference. IEEE, 3814–3819.",
      "doi": ""
    },
    {
      "text": "Aries Arditi and Jianna Cho. 2005. Serifs and font legibility. Vision research 45, 23 (2005), 2926–2933.",
      "doi": ""
    },
    {
      "text": "Carlier Axel, Guntur Ravindra, and Ooi Wei Tsang. 2010. Towards characterizing users’ interaction with zoomable video. In Proceedings of the 2010 ACM workshop on Social, adaptive and personalized multimedia interaction and access. 21–24.",
      "doi": "10.1145/1878061.1878069"
    },
    {
      "text": "Esha Baidya and Sanjay Goel. 2014. LectureKhoj: automatic tagging and semantic segmentation of online lecture videos. In 2014 Seventh international conference on contemporary computing (IC3). IEEE, 37–43.",
      "doi": ""
    },
    {
      "text": "Deepika Bajaj and Shanu Sharma. 2016. Comparative analysis of shot boundary detection algorithms for video summarization. CSI transactions on ICT 4, 2-4 (2016), 265–269.",
      "doi": ""
    },
    {
      "text": "Meltem Huri Baturay and Murat Birtane. 2013. Responsive web design: a new type of design for web-based instructional content. Procedia-Social and Behavioral Sciences 106 (2013), 2275–2279.",
      "doi": ""
    },
    {
      "text": "Sofie Beier. 2009. Typeface legibility: towards defining familiarity. Royal College of Art (United Kingdom).",
      "doi": ""
    },
    {
      "text": "Marcelo Bertalmio, Andrea L Bertozzi, and Guillermo Sapiro. 2001. Navier-stokes, fluid dynamics, and image and video inpainting. In Proceedings of the 2001 IEEE Computer Society Conference on Computer Vision and Pattern Recognition. CVPR 2001, Vol. 1. IEEE, I–I.",
      "doi": ""
    },
    {
      "text": "Dimitri P Bertsekas. 2014. Constrained optimization and Lagrange multiplier methods. Academic press.",
      "doi": ""
    },
    {
      "text": "Vivek Bhuttoo, Kamlesh Soman, and Roopesh Kevin Sungkur. 2017. Responsive design and content adaptation for e-learning on mobile devices. In 2017 1st International Conference on Next Generation Computing Applications (NextComp). IEEE, 163–168.",
      "doi": ""
    },
    {
      "text": "H David Brecht. 2012. Learning from online video lectures. Journal of Information Technology Education 11, 1 (2012), 227–250.",
      "doi": ""
    },
    {
      "text": "Sabra Brock, Yogini Joglekar, and Eli Cohen. 2011. Empowering PowerPoint: Slides and teaching effectiveness. Interdisciplinary Journal of Information, Knowledge, and Management 6, 1(2011), 85–94.",
      "doi": ""
    },
    {
      "text": "Sara Bunian, Kai Li, Chaima Jemmali, Casper Harteveld, Yun Fu, and Magy Seif Seif El-Nasr. 2021. VINS: Visual Search for Mobile User Interface Design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445762"
    },
    {
      "text": "Kirsten R Butcher. 2014. The multimedia principle.(2014).",
      "doi": ""
    },
    {
      "text": "(c) Python Software Foundation. 2021 (accessed April 10, 2021). Python extcolors. https://pypi.org/project/extcolors/",
      "doi": ""
    },
    {
      "text": "Ben Caldwell, Michael Cooper, Loretta Guarino Reid, Gregg Vanderheiden, Wendy Chisholm, John Slatin, and Jason White. 2008. Web content accessibility guidelines (WCAG) 2.0. WWW Consortium (W3C) 290(2008).",
      "doi": ""
    },
    {
      "text": "Axel Carlier, Guntur Ravindra, Vincent Charvillat, and Wei Tsang Ooi. 2011. Combining content-based analysis and crowdsourcing to improve user interaction with zoomable video. In Proceedings of the 19th ACM international conference on Multimedia. 43–52.",
      "doi": "10.1145/2072298.2072306"
    },
    {
      "text": "Neil Charness, Elizabeth A Bosman, 1990. Human factors and design for older adults. Handbook of the psychology of aging 3 (1990), 446–464.",
      "doi": ""
    },
    {
      "text": "Lee J Cronbach. 1951. Coefficient alpha and the internal structure of tests. psychometrika 16, 3 (1951), 297–334.",
      "doi": ""
    },
    {
      "text": "Andrew Cross, Mydhili Bayyapunedi, Dilip Ravindran, Edward Cutrell, and William Thies. 2014. VidWiki: Enabling the crowd to improve the legibility of online educational videos. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. 1167–1175.",
      "doi": "10.1145/2531602.2531670"
    },
    {
      "text": "Ananda Das and Partha Pratim Das. 2019. Automatic semantic segmentation and annotation of MOOC lecture videos. In International Conference on Asian Digital Libraries. Springer, 181–188.",
      "doi": "10.1007/978-3-030-34058-2_17"
    },
    {
      "text": "Vagner Figueredo de Santana, Rosimeire de Oliveira, Leonelo Dell Anhol Almeida, and Maria Cecília Calani Baranauskas. 2012. Web accessibility and people with dyslexia: a survey on techniques and guidelines. In Proceedings of the international cross-disciplinary conference on web accessibility. 1–9.",
      "doi": "10.1145/2207016.2207047"
    },
    {
      "text": "Cindy Ann Dell, Thomas F Dell, and Terry L Blackwell. 2015. Applying universal design for learning in online courses: Pedagogical and practical considerations.Journal of Educators Online 12, 2 (2015), 166–192.",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic, Gonzalo Ramos, Jacobo Bibliowitcz, Derek Nowrouzezahrai, Ravin Balakrishnan, and Karan Singh. 2008. Video browsing by direct manipulation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 237–246.",
      "doi": "10.1145/1357054.1357096"
    },
    {
      "text": "Open Source Computer Vision enhanced by Google. 2021 (accessed April 8, 2021). OpenCV Motion Analysis and Object Tracking. https://docs.opencv.org/4.5.2/d7/df3/group__imgproc__motion.html",
      "doi": ""
    },
    {
      "text": "Python Software Foundation. 2020 (accessed September 10, 2020). pytesseract 0.3.6. https://pypi.org/project/pytesseract/",
      "doi": ""
    },
    {
      "text": "Zvi Galil. 1986. Efficient algorithms for finding maximum matching in graphs. ACM Computing Surveys (CSUR) 18, 1 (1986), 23–38.",
      "doi": "10.1145/6462.6502"
    },
    {
      "text": "Jun Gong, Peter Tarasewich, 2004. Guidelines for handheld mobile device interface design. In Proceedings of DSI 2004 Annual Meeting. Citeseer, 3751–3756.",
      "doi": ""
    },
    {
      "text": "Antonella Grasso and Teresa Roselli. 2005. Guidelines for designing and developing contents for mobile learning. In IEEE International Workshop on Wireless and Mobile Technologies in Education (WMTE’05). IEEE, 123–127.",
      "doi": "10.1109/WMTE.2005.27"
    },
    {
      "text": "Jay A Harolds. 2012. Tips for giving a memorable presentation, Part IV: Using and composing PowerPoint slides. Clinical nuclear medicine 37, 10 (2012), 977–980.",
      "doi": ""
    },
    {
      "text": "Taralynn Hartsell and Steve Chi-Yin Yuen. 2006. Video streaming in online learning. AACE Journal 14, 1 (2006), 31–43.",
      "doi": ""
    },
    {
      "text": "Monica Haurilet, Ziad Al-Halah, and Rainer Stiefelhagen. 2019. Spase-multi-label page segmentation for presentation slides. In 2019 IEEE Winter Conference on Applications of Computer Vision (WACV). IEEE, 726–734.",
      "doi": ""
    },
    {
      "text": "Monica Haurilet, Alina Roitberg, Manuel Martinez, and Rainer Stiefelhagen. 2019. Wise—slide segmentation in the wild. In 2019 International Conference on Document Analysis and Recognition (ICDAR). IEEE, 343–348.",
      "doi": ""
    },
    {
      "text": "Jane Hoffswell, Wilmot Li, and Zhicheng Liu. 2020. Techniques for Flexible Responsive Visualization Design. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376777"
    },
    {
      "text": "J Holzl. 1997. Twelve tips for effective PowerPoint presentations for the technologically challenged. Medical Teacher 19, 3 (1997), 175–179.",
      "doi": ""
    },
    {
      "text": "Daniel J Hruschka, Deborah Schwartz, Daphne Cobb St. John, Erin Picone-Decaro, Richard A Jenkins, and James W Carey. 2004. Reliability in coding open-ended data: Lessons learned from HIV behavioral research. Field methods 16, 3 (2004), 307–331.",
      "doi": ""
    },
    {
      "text": "Edwin L Hutchins, James D Hollan, and Donald A Norman. 1985. Direct manipulation interfaces. Human–computer interaction 1, 4 (1985), 311–338.",
      "doi": "10.1207/s15327051hci0104_2"
    },
    {
      "text": "Apple Inc.2021. Typography (Human Interface Guidelines). https://developer.apple.com/design/human-interface-guidelines/ios/visual-design/typography/",
      "doi": ""
    },
    {
      "text": "ClassCentral Inc.2021. The Best Online Courses of All Time. https://www.classcentral.com/collection/top-free-online-courses",
      "doi": ""
    },
    {
      "text": "ClassCentral Inc.2021. The Top 100 Most Popular Free Online Course (2021 Edition). https://www.classcentral.com/report/100-most-popular-online-courses-2021/",
      "doi": ""
    },
    {
      "text": "Luke Jefferson and Richard Harvey. 2006. Accommodating color blind computer users. In Proceedings of the 8th international ACM SIGACCESS conference on Computers and accessibility. 40–47.",
      "doi": "10.1145/1168987.1168996"
    },
    {
      "text": "Hyeungshik Jung, Hijung Valentina Shin, and Juho Kim. 2018. DynamicSlide: Exploring the Design Space of Reference-based Interaction Techniques for Slide-based Lecture Videos. In Proceedings of the 2018 Workshop on Multimedia for Accessible Human Computer Interface. 33–41.",
      "doi": "10.1145/3264856.3264861"
    },
    {
      "text": "Richard M Karp. 1980. An algorithm to solve the m × n assignment problem in expected time O (mn log n). Networks 10, 2 (1980), 143–152.",
      "doi": ""
    },
    {
      "text": "Thorsten Karrer, Malte Weiss, Eric Lee, and Jan Borchers. 2008. DRAGON: a direct manipulation interface for frame-accurate in-scene video navigation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 247–250.",
      "doi": "10.1145/1357054.1357097"
    },
    {
      "text": "Thorsten Karrer, Moritz Wittenhagen, and Jan Borchers. 2009. Pocketdragon: a direct manipulation video navigation interface for mobile devices. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services. 1–3.",
      "doi": "10.1145/1613858.1613917"
    },
    {
      "text": "Thorsten Karrer, Moritz Wittenhagen, and Jan Borchers. 2012. DragLocks: handling temporal ambiguities in direct manipulation video navigation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 623–626.",
      "doi": "10.1145/2207676.2207764"
    },
    {
      "text": "René F Kizilcec, Jeremy N Bailenson, and Charles J Gomez. 2015. The instructor’s face in video instruction: Evidence from two large-scale field studies.Journal of Educational Psychology 107, 3 (2015), 724.",
      "doi": ""
    },
    {
      "text": "Natasha Larocque, Stephanie Kenny, and Matthew DF McInnes. 2015. Medical school radiology lectures: what are determinants of lecture satisfaction?American Journal of Roentgenology 204, 5 (2015), 913–918.",
      "doi": ""
    },
    {
      "text": "Gordon E Legge. 2016. Reading digital with low vision. Visible language 50, 2 (2016), 102.",
      "doi": ""
    },
    {
      "text": "Petra J Lewis. 2016. Brain friendly teaching—reducing learner’s cognitive load. Academic radiology 23, 7 (2016), 877–880.",
      "doi": ""
    },
    {
      "text": "Minghao Li, Yiheng Xu, Lei Cui, Shaohan Huang, Furu Wei, Zhoujun Li, and Ming Zhou. 2020. DocBank: A benchmark dataset for document layout analysis. arXiv preprint arXiv:2006.01038(2020).",
      "doi": ""
    },
    {
      "text": "Qisheng Li, Meredith Ringel Morris, Adam Fourney, Kevin Larson, and Katharina Reinecke. 2019. The Impact of Web Browser Reader Views on Reading Speed and User Experience. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300754"
    },
    {
      "text": "Jiayin Lin, Geng Sun, Tingru Cui, Jun Shen, Dongming Xu, Ghassan Beydoun, Ping Yu, David Pritchard, Li Li, and Shiping Chen. 2020. From ideal to reality: segmentation, annotation, and recommendation, the vital trajectory of intelligent micro learning. World Wide Web 23, 3 (2020), 1747–1767.",
      "doi": "10.1007/s11280-019-00730-9"
    },
    {
      "text": "Tsung-Yi Lin, Piotr Dollár, Ross Girshick, Kaiming He, Bharath Hariharan, and Serge Belongie. 2017. Feature pyramid networks for object detection. In Proceedings of the IEEE conference on computer vision and pattern recognition. 2117–2125.",
      "doi": ""
    },
    {
      "text": "Tsung-Yi Lin, Priya Goyal, Ross Girshick, Kaiming He, and Piotr Dollár. 2017. Focal loss for dense object detection. In Proceedings of the IEEE international conference on computer vision. 2980–2988.",
      "doi": ""
    },
    {
      "text": "Google LLC.2021. Thetypesystem(MaterialDesign). https://material.io/design/typography/the-type-system.html#type-scale",
      "doi": ""
    },
    {
      "text": "Github lolipopshock. 2021 (accessed April 10, 2021). Deep Layout Parsing. https://github.com/Layout-Parser/layout-parser/blob/master/docs/example/deep_layout_parsing/index.rst",
      "doi": ""
    },
    {
      "text": "Patricia D Mautone and Richard E Mayer. 2001. Signaling as a cognitive guide in multimedia learning.Journal of educational Psychology 93, 2 (2001), 377.",
      "doi": ""
    },
    {
      "text": "Martin Merkt, Sonja Weigand, Anke Heier, and Stephan Schwan. 2011. Learning with videos vs. learning with print: The role of interactive features. Learning and Instruction 21, 6 (2011), 687–704.",
      "doi": ""
    },
    {
      "text": "Aliaksei Miniukovich, Antonella De Angeli, Simone Sulpizio, and Paola Venuti. 2017. Design guidelines for web readability. In Proceedings of the 2017 Conference on Designing Interactive Systems. 285–296.",
      "doi": "10.1145/3064663.3064711"
    },
    {
      "text": "Toni-Jan Keith Palma Monserrat, Shengdong Zhao, Kevin McGee, and Anshul Vikram Pandey. 2013. NoteVideo: facilitating navigation of blackboard-style lecture videos. In Proceedings of the SIGCHI conference on human factors in computing systems. 1139–1148.",
      "doi": "10.1145/2470654.2466147"
    },
    {
      "text": "Meredith Ringel Morris, Adam Fourney, Abdullah Ali, and Laura Vonessen. 2018. Understanding the needs of searchers with dyslexia. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173609"
    },
    {
      "text": "Derek A Muller, Kester J Lee, and Manjula D Sharma. 2008. Coherence or interest: Which is most important in online multimedia learning?Australasian Journal of Educational Technology 24, 2(2008).",
      "doi": ""
    },
    {
      "text": "Alejandro Newell, Kaiyu Yang, and Jia Deng. 2016. Stacked hourglass networks for human pose estimation. In European conference on computer vision. Springer, 483–499.",
      "doi": ""
    },
    {
      "text": "Cuong Nguyen, Yuzhen Niu, and Feng Liu. 2013. Direct manipulation video navigation in 3D. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1169–1172.",
      "doi": "10.1145/2470654.2466150"
    },
    {
      "text": "Daniel M Oppenheimer, Tom Meyvis, and Nicolas Davidenko. 2009. Instructional manipulation checks: Detecting satisficing to increase statistical power. Journal of experimental social psychology 45, 4 (2009), 867–872.",
      "doi": ""
    },
    {
      "text": "Derek Pang, Sherif Halawa, Ngai-Man Cheung, and Bernd Girod. 2011. Mobile interactive region-of-interest video streaming with crowd-driven prefetching. In Proceedings of the 2011 international ACM workshop on Interactive multimedia on mobile and portable devices. 7–12.",
      "doi": "10.1145/2072561.2072564"
    },
    {
      "text": "David Parsons, Hokyoung Ryu, and Mark Cranshaw. 2007. A design requirements framework for mobile learning environments.JCP 2, 4 (2007), 1–8.",
      "doi": ""
    },
    {
      "text": "Wenhui Peng and Yaling Zhou. 2015. The design and research of responsive web supporting mobile learning devices. In 2015 International Symposium on Educational Technology (ISET). IEEE, 163–167.",
      "doi": ""
    },
    {
      "text": "Yi-Hao Peng, JiWoong Jang, Jeffrey P Bigham, and Amy Pavel. 2021. Say It All: Feedback for Improving Non-Visual Presentation Accessibility. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445572"
    },
    {
      "text": "Minh Pham, Suresh Alse, Craig A Knoblock, and Pedro Szekely. 2016. Semantic labeling: a domain-independent approach. In International Semantic Web Conference. Springer, 446–462.",
      "doi": "10.1007/978-3-319-46523-4_27"
    },
    {
      "text": "Aryo Pinandito, Hanifah Muslimah Az-zahra, Lutfi Fanani, and Anggi Valeria Putri. 2017. Analysis of web content delivery effectiveness and efficiency in responsive web design using material design guidelines and User Centered Design. In 2017 International Conference on Sustainable Information Engineering and Technology (SIET). IEEE, 435–441.",
      "doi": ""
    },
    {
      "text": "Lesley Pugsley. 2010. How To... Design an effective power point presentation. Education for Primary Care 21, 1 (2010), 51–53.",
      "doi": ""
    },
    {
      "text": "Ngo Quang Minh Khiem, Guntur Ravindra, Axel Carlier, and Wei Tsang Ooi. 2010. Supporting zoomable video streams with dynamic region-of-interest cropping. In Proceedings of the first annual ACM SIGMM conference on Multimedia systems. 259–270.",
      "doi": "10.1145/1730836.1730868"
    },
    {
      "text": "S Krishnamurthy Ramnandan, Amol Mittal, Craig A Knoblock, and Pedro Szekely. 2015. Assigning semantic labels to data sources. In European Semantic Web Conference. Springer, 403–417.",
      "doi": "10.1007/978-3-319-18818-8_25"
    },
    {
      "text": "Nils Reimers and Iryna Gurevych. 2019. Sentence-bert: Sentence embeddings using siamese bert-networks. arXiv preprint arXiv:1908.10084(2019).",
      "doi": ""
    },
    {
      "text": "Luz Rello, Gaurang Kanvinde, and Ricardo Baeza-Yates. 2012. Layout guidelines for web text and a web service to improve accessibility for dyslexics. In Proceedings of the international cross-disciplinary conference on web accessibility. 1–9.",
      "doi": "10.1145/2207016.2207048"
    },
    {
      "text": "Luz Rello, Gaurang Kanvinde, and Ricardo Baeza-Yates. 2012. A mobile application for displaying more accessible eBooks for people with Dyslexia. Procedia Computer Science 14 (2012), 226–233.",
      "doi": ""
    },
    {
      "text": "Quentin Roy, Futian Zhang, and Daniel Vogel. 2019. Automation accuracy is good, but high controllability may be better. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3290605.3300750"
    },
    {
      "text": "Audrey Dawn Shaikh. 2007. Psychology of onscreen type: Investigations regarding typeface personality, appropriateness, and impact on document perception. Ph. D. Dissertation.",
      "doi": ""
    },
    {
      "text": "Hijung Valentina Shin, Floraine Berthouzoz, Wilmot Li, and Frédo Durand. 2015. Visual transcripts: lecture notes from blackboard-style lecture videos. ACM Transactions on Graphics (TOG) 34, 6 (2015), 1–10.",
      "doi": "10.1145/2816795.2818123"
    },
    {
      "text": "Ben Shneiderman. 1986. Eight golden rules of interface design. Disponible en 172(1986).",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 1997. Direct manipulation for comprehensible, predictable and controllable user interfaces. In Proceedings of the 2nd international conference on Intelligent user interfaces. 33–39.",
      "doi": "10.1145/238218.238281"
    },
    {
      "text": "Robert Sklar. 1993. Film: An international history of the medium. Prentice Hall.",
      "doi": ""
    },
    {
      "text": "Wei Song, Dian W Tjondronegoro, Shu-Hsien Wang, and Michael J Docherty. 2010. Impact of zooming and enhancing region of interests for optimizing user experience on mobile sports video. In Proceedings of the 18th ACM international conference on Multimedia. 321–330.",
      "doi": "10.1145/1873951.1873996"
    },
    {
      "text": "Karen Stein. 2006. The dos and don’ts of PowerPoint presentations. Journal of the American Dietetic Association 106, 11(2006), 1745–1748.",
      "doi": ""
    },
    {
      "text": "Ying Su and Yong Zhang. 2020. Automatic Construction of Subject Knowledge Graph based on Educational Big Data. In Proceedings of the 2020 The 3rd International Conference on Big Data and Education. 30–36.",
      "doi": "10.1145/3396452.3396458"
    },
    {
      "text": "Mingxing Tan, Ruoming Pang, and Quoc V Le. 2020. Efficientdet: Scalable and efficient object detection. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition. 10781–10790.",
      "doi": ""
    },
    {
      "text": "Mary Frances Theofanos and Janice Ginny Redish. 2005. Helping low-vision and other users with web sites that meet their needs: Is one site for all feasible?Technical communication 52, 1 (2005), 9–20.",
      "doi": ""
    },
    {
      "text": "Miles Thorogood. 2016. SlideDeck. js: A platform for generating accessible and interactive web-based course content. In Proceedings of the 21st Western Canadian Conference on Computing Education. 1–5.",
      "doi": "10.1145/2910925.2910941"
    },
    {
      "text": "Shoko Tsujimura, Kazumasa Yamamoto, and Seiichi Nakagawa. 2017. Automatic Explanation Spot Estimation Method Targeted at Text and Figures in Lecture Slides.. In INTERSPEECH. 2764–2768.",
      "doi": ""
    },
    {
      "text": "Margot van Wermeskerken and Tamara van Gog. 2017. Seeing the instructor’s face and gaze in demonstration video examples affects attention allocation but not learning. Computers & Education 113 (2017), 98–107.",
      "doi": ""
    },
    {
      "text": "Nicholas Vanderschantz, Claire Timpany, and Annika Hinze. 2015. Design exploration of ebook interfaces for personal digital libraries on tablet devices. In Proceedings of the 15th New Zealand Conference on Human-Computer Interaction. 21–30.",
      "doi": "10.1145/2808047.2808054"
    },
    {
      "text": "Jan Walraven and Johan W Alferdinck. 1997. Color displays for the color blind. In Color and Imaging Conference, Vol. 1997. Society for Imaging Science and Technology, 17–22.",
      "doi": ""
    },
    {
      "text": "Minjuan Wang and Ruimin Shen. 2012. Message design for mobile learning: Learning theories, human cognition and design principles. British Journal of Educational Technology 43, 4 (2012), 561–575.",
      "doi": ""
    },
    {
      "text": "Zhangyang Wang, Jianchao Yang, Hailin Jin, Eli Shechtman, Aseem Agarwala, Jonathan Brandt, and Thomas S Huang. 2015. Deepfont: Identify your font from an image. In Proceedings of the 23rd ACM international conference on Multimedia. 451–459.",
      "doi": "10.1145/2733373.2806219"
    },
    {
      "text": "Suroyya Wongsalam and Twittie Senivongse. 2019. Visual Design and Code Generation of User Interface Based on Responsive Web Design Approach. In Proceedings of the 2019 3rd International Conference on Software and e-Business. 51–59.",
      "doi": "10.1145/3374549.3374560"
    },
    {
      "text": "Aoyu Wu, Wai Tong, Tim Dwyer, Bongshin Lee, Petra Isenberg, and Huamin Qu. 2020. Mobilevisfixer: Tailoring web visualizations for mobile phones leveraging an explainable reinforcement learning framework. IEEE Transactions on Visualization and Computer Graphics 27, 2(2020), 464–474.",
      "doi": ""
    },
    {
      "text": "Chengpei Xu, Ruomei Wang, Shujin Lin, Xiaonan Luo, Baoquan Zhao, Lijie Shao, and Mengqiu Hu. 2019. Lecture2Note: Automatic Generation of Lecture Notes from Slide-Based Educational Videos. In 2019 IEEE International Conference on Multimedia and Expo (ICME). IEEE, 898–903.",
      "doi": ""
    },
    {
      "text": "Qianqian Xu, Ming Yan, Chendi Huang, Jiechao Xiong, Qingming Huang, and Yuan Yao. 2017. Exploring outliers in crowdsourced ranking for qoe. In Proceedings of the 25th ACM international conference on Multimedia. 1540–1548.",
      "doi": "10.1145/3123266.3123267"
    },
    {
      "text": "Kuldeep Yadav, Ankit Gandhi, Arijit Biswas, Kundan Shrivastava, Saurabh Srivastava, and Om Deshmukh. 2016. Vizig: Anchor points based non-linear navigation and summarization in educational videos. In Proceedings of the 21st International Conference on Intelligent User Interfaces. 407–418.",
      "doi": "10.1145/2856767.2856788"
    },
    {
      "text": "Haojin Yang and Christoph Meinel. 2014. Content based lecture video retrieval using speech and video text information. IEEE transactions on learning technologies 7, 2 (2014), 142–154.",
      "doi": ""
    },
    {
      "text": "Haojin Yang, Maria Siebert, Patrick Luhne, Harald Sack, and Christoph Meinel. 2011. Automatic lecture video indexing using video OCR technology. In 2011 IEEE International Symposium on Multimedia. IEEE, 111–116.",
      "doi": "10.1109/ISM.2011.26"
    },
    {
      "text": "Xuehui Yu, Zhenjun Han, Yuqi Gong, Nan Jan, Jian Zhao, Qixiang Ye, Jie Chen, Yuan Feng, Bin Zhang, Xiaodi Wang, 2020. The 1st tiny object detection challenge: Methods and results. In European Conference on Computer Vision. Springer, 315–323.",
      "doi": "10.1007/978-3-030-68238-5_23"
    },
    {
      "text": "Baoquan Zhao, Shujin Lin, Xiaonan Luo, Songhua Xu, and Ruomei Wang. 2017. A novel system for visual navigation of educational videos using multimodal cues. In Proceedings of the 25th ACM international conference on Multimedia. 1680–1688.",
      "doi": "10.1145/3123266.3123406"
    },
    {
      "text": "Baoquan Zhao, Songhua Xu, Shujin Lin, Ruomei Wang, and Xiaonan Luo. 2019. A New Visual Interface for Searching and Navigating Slide-Based Lecture Videos. In 2019 IEEE International Conference on Multimedia and Expo (ICME). IEEE, 928–933.",
      "doi": ""
    },
    {
      "text": "Xingyi Zhou, Dequan Wang, and Philipp Krähenbühl. 2019. Objects as points. arXiv preprint arXiv:1904.07850(2019).",
      "doi": ""
    }
  ]
}