{
  "doi": "10.1145/3491102.3517701",
  "title": "Prediction for Retrospection: Integrating Algorithmic Stress Prediction into Personal Informatics Systems for College Students’ Mental Health",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2022,
  "badges": [],
  "abstract": "Reflecting on stress-related data is critical in addressing one’s mental health. Personal Informatics (PI) systems augmented by algorithms and sensors have become popular ways to help users collect and reflect on data about stress. While prediction algorithms in the PI systems are mainly for diagnostic purposes, few studies examine how the explainability of algorithmic prediction can support user-driven self-insight. To this end, we developed MindScope, an algorithm-assisted stress management system that determines user stress levels and explains how the stress level was computed based on the user’s everyday activities captured by a smartphone. In a 25-day field study conducted with 36 college students, the prediction and explanation supported self-reflection, a process to re-establish preconceptions about stress by identifying stress patterns and recalling past stress levels and patterns that led to coping planning. We discuss the implications of exploiting prediction algorithms that facilitate user-driven retrospection in PI systems.",
  "authors": [
    {
      "name": "Taewan Kim",
      "institution": "Department of Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233659",
      "orcid": "0000-0002-5474-3438"
    },
    {
      "name": "Haesoo Kim",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234404",
      "orcid": "missing"
    },
    {
      "name": "Ha Yeon Lee",
      "institution": "Seoul National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233273",
      "orcid": "missing"
    },
    {
      "name": "Hwarang Goh",
      "institution": "Inha University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659664287",
      "orcid": "missing"
    },
    {
      "name": "Shakhboz Abdigapporov",
      "institution": "Department of Electrical and Computer Engineering/Intelligent Mobile Computing Lab, Inha University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238668",
      "orcid": "missing"
    },
    {
      "name": "Mingon Jeong",
      "institution": "Department of Artificial Intelligence, Hanyang University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233335",
      "orcid": "missing"
    },
    {
      "name": "Hyunsung Cho",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261187",
      "orcid": "missing"
    },
    {
      "name": "Kyungsik Han",
      "institution": "Department of Data Science, Hanyang University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658997188",
      "orcid": "0000-0001-5535-0081"
    },
    {
      "name": "Youngtae Noh",
      "institution": "KENTECH, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81466646029",
      "orcid": "missing"
    },
    {
      "name": "Sung-Ju Lee",
      "institution": "School of Electrical Engineering, KAIST, Korea, Republic of",
      "img": "/do/10.1145/contrib-81381593966/rel-imgonly/cl7p2486v3.jpg",
      "acmid": "81381593966",
      "orcid": "missing"
    },
    {
      "name": "Hwajung Hong",
      "institution": "KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022414",
      "orcid": "0000-0001-5268-3331"
    }
  ],
  "references": [
    {
      "text": "Phil Adams, Mashfiqui Rabbi, Tauhidur Rahman, Mark Matthews, Amy Voida, Geri Gay, Tanzeem Choudhury, and Stephen Voida. 2014. Towards Personal Stress Informatics: Comparing Minimally Invasive Techniques for Measuring Daily Stress in the Wild. In Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare (Oldenburg, Germany) (PervasiveHealth ’14). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), Brussels, BEL, 72–79. https://doi.org/10.4108/icst.pervasivehealth.2014.254959",
      "doi": "10.4108/icst.pervasivehealth.2014.254959"
    },
    {
      "text": "William Albert and Thomas Tullis. 2013. Measuring the user experience: collecting, analyzing, and presenting usability metrics. Newnes.",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N Bennett, Kori Inkpen, 2019. Guidelines for human-AI interaction. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Gerhard Andersson and Pim Cuijpers. 2009. Internet-based and other computerized psychological treatments for adult depression: a meta-analysis. Cognitive behaviour therapy 38, 4 (2009), 196–205.",
      "doi": ""
    },
    {
      "text": "Jakob E. Bardram, Mads Frost, Károly Szántó, and Gabriela Marcu. 2012. The MONARCA Self-Assessment System: A Persuasive Personal Monitoring System for Bipolar Patients. In Proceedings of the 2nd ACM SIGHIT International Health Informatics Symposium (Miami, Florida, USA) (IHI ’12). Association for Computing Machinery, New York, NY, USA, 21–30. https://doi.org/10.1145/2110363.2110370",
      "doi": "10.1145/2110363.2110370"
    },
    {
      "text": "Jakob E Bardram and Aleksandar Matic. 2020. A decade of ubiquitous computing research in mental health. IEEE Pervasive Computing 19, 1 (2020), 62–72.",
      "doi": ""
    },
    {
      "text": "Frank Bentley, Konrad Tollmar, Peter Stephenson, Laura Levy, Brian Jones, Scott Robertson, Ed Price, Richard Catrambone, and Jeff Wilson. 2013. Health Mashups: Presenting Statistical Patterns between Wellbeing Data and Context in Natural Language to Promote Behavior Change. ACM Trans. Comput.-Hum. Interact. 20, 5, Article 30 (nov 2013), 27 pages. https://doi.org/10.1145/2503823",
      "doi": "10.1145/2503823"
    },
    {
      "text": "Sofian Berrouiguet, David Ramírez, María Luisa Barrigón, Pablo Moreno-Muñoz, Rodrigo Carmona Camacho, Enrique Baca-García, and Antonio Artés-Rodríguez. 2018. Combining continuous smartphone native sensors data capture and unsupervised data mining techniques for behavioral changes detection: a case series of the evidence-based behavior (eB2) study. JMIR mHealth and uHealth 6, 12 (2018), e197.",
      "doi": ""
    },
    {
      "text": "A Bhattacharya, P Vasant, N Barsoum, C Andreeski, T Kolemisevska, Abdurrahman Talha Dinibütün, and Georgi M Dimirovski. 2006. Decision making in TOC-product-mix selection via fuzzy cost function optimization. IFAC Proceedings Volumes 39, 23 (2006), 51–56.",
      "doi": ""
    },
    {
      "text": "JesúS Bobadilla, Fernando Ortega, Antonio Hernando, and Jesús Bernal. 2012. A collaborative filtering approach to mitigate the new user cold start problem. Knowledge-based systems 26 (2012), 225–238.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Sandra Bucci, Matthias Schwannauer, and Natalie Berry. 2019. The digital revolution and its impact on mental health care. Psychology and Psychotherapy: Theory, Research and Practice 92, 2(2019), 277–297.",
      "doi": ""
    },
    {
      "text": "Clara Caldeira, Yu Chen, Lesley Chan, Vivian Pham, Yunan Chen, and Kai Zheng. 2017. Mobile apps for mood tracking: an analysis of features and user reviews. In AMIA Annual Symposium Proceedings, Vol. 2017. American Medical Informatics Association, 495.",
      "doi": ""
    },
    {
      "text": "Tianqi Chen and Carlos Guestrin. 2016. Xgboost: A scalable tree boosting system. In Proceedings of the 22nd acm sigkdd international conference on knowledge discovery and data mining. 785–794.",
      "doi": "10.1145/2939672.2939785"
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Matthew Kay, Wanda Pratt, and Julie A. Kientz. 2015. SleepTight: Low-Burden, Self-Monitoring Technology for Capturing and Reflecting on Sleep Behaviors. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Osaka, Japan) (UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 121–132. https://doi.org/10.1145/2750858.2804266",
      "doi": "10.1145/2750858.2804266"
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Haining Zhu, Nathalie Henry Riche, and Dominikus Baur. 2017. Understanding Self-Reflection: How People Reflect on Personal Data through Visual Data Exploration. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare (Barcelona, Spain) (PervasiveHealth ’17). Association for Computing Machinery, New York, NY, USA, 173–182. https://doi.org/10.1145/3154862.3154881",
      "doi": "10.1145/3154862.3154881"
    },
    {
      "text": "Sheldon Cohen, Tom Kamarck, Robin Mermelstein, 1994. Perceived stress scale. Measuring stress: A guide for health and social scientists 10, 2(1994), 1–2.",
      "doi": ""
    },
    {
      "text": "Victor P Cornet and Richard J Holden. 2018. Systematic review of smartphone-based passive sensing for health and wellbeing. Journal of biomedical informatics 77 (2018), 120–132.",
      "doi": ""
    },
    {
      "text": "Shipi Dhanorkar, Christine T. Wolf, Kun Qian, Anbang Xu, Lucian Popa, and Yunyao Li. 2021. Who Needs to Know What, When?: Broadening the Explainable AI (XAI) Design Space by Looking at Explanations Across the AI Lifecycle. Association for Computing Machinery, New York, NY, USA, 1591–1602. https://doi.org/10.1145/3461778.3462131",
      "doi": "10.1145/3461778.3462131"
    },
    {
      "text": "Upol Ehsan, Q. Vera Liao, Michael Muller, Mark O. Riedl, and Justin D. Weisz. 2021. Expanding Explainability: Towards Social Transparency in AI Systems. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445188",
      "doi": ""
    },
    {
      "text": "Malin Eiband, Hanna Schneider, Mark Bilandzic, Julian Fazekas-Con, Mareike Haug, and Heinrich Hussmann. 2018. Bringing Transparency Design into Practice. In 23rd International Conference on Intelligent User Interfaces (Tokyo, Japan) (IUI ’18). Association for Computing Machinery, New York, NY, USA, 211–223. https://doi.org/10.1145/3172944.3172961",
      "doi": "10.1145/3172944.3172961"
    },
    {
      "text": "Elizabeth V. Eikey and Madhu C. Reddy. 2017. ”It’s Definitely Been a Journey”: A Qualitative Study on How Women with Eating Disorders Use Weight Loss Apps. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 642–654. https://doi.org/10.1145/3025453.3025591",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, Clara Caldeira, Mayara Costa Figueiredo, Xi Lu, Lucas M. Silva, Lucretia Williams, Jong Ho Lee, Qingyang Li, Simran Ahuja, Qiuer Chen, Payam Dowlatyari, Craig Hilby, Sazeda Sultana, Elizabeth V. Eikey, and Yunan Chen. 2020. Mapping and Taking Stock of the Personal Informatics Literature. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 4, Article 126 (Dec. 2020), 38 pages. https://doi.org/10.1145/3432231",
      "doi": "10.1145/3432231"
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A Lived Informatics Model of Personal Informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Osaka, Japan) (UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 731–742. https://doi.org/10.1145/2750858.2804250",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Elliot G. Mitchell, Elizabeth M. Heitkemper, Marissa Burgermaster, Matthew E. Levine, Yishen Miao, Maria L. Hwang, Pooja M. Desai, Andrea Cassells, Jonathan N. Tobin, Esteban G. Tabak, David J. Albers, Arlene M. Smaldone, and Lena Mamykina. 2021. From Reflection to Action: Combining Machine Learning with Expert Knowledge for Nutrition Goal Recommendations. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 206, 17 pages. https://doi.org/10.1145/3411764.3445555",
      "doi": "10.1145/3411764.3445555"
    },
    {
      "text": "Enrique Garcia-Ceja, Venet Osmani, and Oscar Mayora. 2015. Automatic stress detection in working environments from smartphones’ accelerometer data: a first step. IEEE journal of biomedical and health informatics 20, 4(2015), 1053–1060.",
      "doi": ""
    },
    {
      "text": "Ben Green and Salomé Viljoen. 2020. Algorithmic Realism: Expanding the Boundaries of Algorithmic Thought. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency (Barcelona, Spain) (FAT* ’20). Association for Computing Machinery, New York, NY, USA, 19–31. https://doi.org/10.1145/3351095.3372840",
      "doi": "10.1145/3351095.3372840"
    },
    {
      "text": "Victoria Hollis, Artie Konrad, Aaron Springer, Matthew Antoun, Christopher Antoun, Rob Martin, and Steve Whittaker. 2017. What does all this data mean for my future mood? Actionable analytics and targeted reflection for emotional well-being. Human–Computer Interaction 32, 5-6 (2017), 208–267.",
      "doi": ""
    },
    {
      "text": "Victoria Hollis, Alon Pekurovsky, Eunika Wu, and Steve Whittaker. 2018. On Being Told How We Feel: How Algorithmic Sensor Feedback Influences Emotion Perception. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 3, Article 114 (Sept. 2018), 31 pages. https://doi.org/10.1145/3264924",
      "doi": "10.1145/3264924"
    },
    {
      "text": "Sture Holm. 1979. A simple sequentially rejective multiple test procedure. Scandinavian journal of statistics(1979), 65–70.",
      "doi": ""
    },
    {
      "text": "Bumsoo Kang, Chulhong Min, Wonjung Kim, Inseok Hwang, Chunjong Park, Seungchul Lee, Sung-Ju Lee, and Junehwa Song. 2017. Zaturi: We Put Together the 25th Hour for You. Create a Book for Your Baby. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1850–1863. https://doi.org/10.1145/2998181.2998186",
      "doi": "10.1145/2998181.2998186"
    },
    {
      "text": "Anna Kantosalo and Sirpa Riihiaho. 2019. Quantifying co-creative writing experiences. Digital Creativity 30, 1 (2019), 23–38.",
      "doi": ""
    },
    {
      "text": "Ronald C Kessler, G Paul Amminger, Sergio Aguilar-Gaxiola, Jordi Alonso, Sing Lee, and T Bedirhan Ustun. 2007. Age of onset of mental disorders: a review of recent literature. Current opinion in psychiatry 20, 4 (2007), 359.",
      "doi": ""
    },
    {
      "text": "Ronald C Kessler, Patricia Berglund, Olga Demler, Robert Jin, Kathleen R Merikangas, and Ellen E Walters. 2005. Lifetime prevalence and age-of-onset distributions of DSM-IV disorders in the National Comorbidity Survey Replication. Archives of general psychiatry 62, 6 (2005), 593–602.",
      "doi": ""
    },
    {
      "text": "John F Kihlstrom, Eric Eich, Deborah Sandbrand, and Betsy A Tobias. 1999. Emotion and memory: Implications for self-report. In The science of self-report. Psychology Press, 93–112.",
      "doi": ""
    },
    {
      "text": "Da-jung Kim, Yeoreum Lee, Saeyoung Rho, and Youn-kyung Lim. 2016. Design Opportunities in Three Stages of Relationship Development between Users and Self-Tracking Devices. Association for Computing Machinery, New York, NY, USA, 699–703. https://doi.org/10.1145/2858036.2858148",
      "doi": "10.1145/2858036.2858148"
    },
    {
      "text": "Da-jung Kim and Youn-kyung Lim. 2019. Co-Performing Agent: Design for Building User-Agent Partnership in Learning and Adaptive Services. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300714",
      "doi": ""
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Eun Kyoung Choe, Bongshin Lee, KwonHyun Kim, and Jinwook Seo. 2016. TimeAware: Leveraging Framing Effects to Enhance Personal Productivity. Association for Computing Machinery, New York, NY, USA, 272–283. https://doi.org/10.1145/2858036.2858428",
      "doi": ""
    },
    {
      "text": "Susanne Kirchner, Jessica Schroeder, James Fogarty, and Sean A. Munson. 2021. “They Don’t Always Think about That”: Translational Needs in the Design of Personal Health Informatics Applications. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445587",
      "doi": ""
    },
    {
      "text": "Rafal Kocielnik, Fabrizio Maria Maggi, and Natalia Sidorova. 2013. Enabling self-reflection with LifelogExplorer: Generating simple views from complex data. In 2013 7th International Conference on Pervasive Computing Technologies for Healthcare and Workshops. 184–191. https://doi.org/10.4108/icst.pervasivehealth.2013.251934",
      "doi": ""
    },
    {
      "text": "Todd Kulesza, Margaret Burnett, Weng-Keen Wong, and Simone Stumpf. 2015. Principles of Explanatory Debugging to Personalize Interactive Machine Learning. In Proceedings of the 20th International Conference on Intelligent User Interfaces (Atlanta, Georgia, USA) (IUI ’15). Association for Computing Machinery, New York, NY, USA, 126–137. https://doi.org/10.1145/2678025.2701399",
      "doi": "10.1145/2678025.2701399"
    },
    {
      "text": "Kwangyoung Lee, Hyewon Cho, Kobiljon Toshnazarov, Nematjon Narziev, So Young Rhim, Kyungsik Han, YoungTae Noh, and Hwajung Hong. 2020. Toward Future-Centric Personal Informatics: Expecting Stressful Events and Preparing Personalized Interventions in Stress Management. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376475",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A Stage-Based Model of Personal Informatics Systems. Association for Computing Machinery, New York, NY, USA, 557–566. https://doi.org/10.1145/1753326.1753409",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Q. Vera Liao, Daniel Gruen, and Sarah Miller. 2020. Questioning the AI: Informing Design Practices for Explainable AI User Experiences. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376590",
      "doi": "10.1145/3313831.3376590"
    },
    {
      "text": "Andy Liaw, Matthew Wiener, 2002. Classification and regression by randomForest. R news 2, 3 (2002), 18–22.",
      "doi": ""
    },
    {
      "text": "Brian Y. Lim and Anind K. Dey. 2011. Investigating Intelligibility for Uncertain Context-Aware Applications. In Proceedings of the 13th International Conference on Ubiquitous Computing (Beijing, China) (UbiComp ’11). Association for Computing Machinery, New York, NY, USA, 415–424. https://doi.org/10.1145/2030112.2030168",
      "doi": ""
    },
    {
      "text": "Scott M Lundberg and Su-In Lee. 2017. A unified approach to interpreting model predictions. In Proceedings of the 31st international conference on neural information processing systems. 4768–4777.",
      "doi": ""
    },
    {
      "text": "Therese H Macan, Comila Shahani, Robert L Dipboye, and Amanda P Phillips. 1990. College students’ time management: Correlations with academic performance and stress.Journal of educational psychology 82, 4 (1990), 760.",
      "doi": ""
    },
    {
      "text": "Sumit Majumder and M Jamal Deen. 2019. Smartphone sensors for health monitoring and diagnosis. Sensors 19, 9 (2019), 2164.",
      "doi": ""
    },
    {
      "text": "Daniel McDuff, Amy Karlson, Ashish Kapoor, Asta Roseway, and Mary Czerwinski. 2012. AffectAura: An Intelligent System for Emotional Memory. Association for Computing Machinery, New York, NY, USA, 849–858. https://doi.org/10.1145/2207676.2208525",
      "doi": "10.1145/2207676.2208525"
    },
    {
      "text": "Abhinav Mehrotra, Robert Hendley, and Mirco Musolesi. 2016. Towards multi-modal anticipatory monitoring of depressive states through the analysis of human-smartphone interaction. In Proceedings of the 2016 ACM international joint conference on pervasive and ubiquitous computing: adjunct. 1132–1138.",
      "doi": "10.1145/2968219.2968299"
    },
    {
      "text": "Martijn Millecamp, Robin Haveneers, and Katrien Verbert. 2020. Cogito Ergo Quid? The Effect of Cognitive Style in a Transparent Mobile Music Recommender System. Association for Computing Machinery, New York, NY, USA, 323–327. https://doi.org/10.1145/3340631.3394871",
      "doi": ""
    },
    {
      "text": "Ranjita Misra and Michelle McKean. 2000. College students’ academic stress and its relation to their anxiety, time management, and leisure satisfaction. American journal of Health studies 16, 1 (2000), 41.",
      "doi": ""
    },
    {
      "text": "Mehrab Bin Morshed, Koustuv Saha, Richard Li, Sidney K. D’Mello, Munmun De Choudhury, Gregory D. Abowd, and Thomas Plötz. 2019. Prediction of Mood Instability with Passive Sensing. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 3, Article 75 (Sept. 2019), 21 pages. https://doi.org/10.1145/3351233",
      "doi": "10.1145/3351233"
    },
    {
      "text": "Debbie S Moskowitz and Simon N Young. 2006. Ecological momentary assessment: what it is and why it is a method of the future in clinical psychopharmacology. Journal of Psychiatry and Neuroscience 31, 1 (2006), 13.",
      "doi": ""
    },
    {
      "text": "Amir Muaremi, Bert Arnrich, and Gerhard Tröster. 2013. Towards measuring stress with smartphones and wearable devices during workday and sleep. BioNanoScience 3, 2 (2013), 172–183.",
      "doi": ""
    },
    {
      "text": "Mahsan Nourani, Samia Kabir, Sina Mohseni, and Eric D Ragan. 2019. The effects of meaningful and meaningless explanations on trust and perceived system accuracy in intelligent systems. In Proceedings of the AAAI Conference on Human Computation and Crowdsourcing, Vol. 7. 97–105.",
      "doi": ""
    },
    {
      "text": "Changhoon Oh, Jungwoo Song, Jinhan Choi, Seonghyeon Kim, Sungwoo Lee, and Bongwon Suh. 2018. I Lead, You Help but Only with Enough Details: Understanding User Experience of Co-Creation with Artificial Intelligence. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174223",
      "doi": ""
    },
    {
      "text": "Fredrik Ohlin and Carl Magnus Olsson. 2015. Intelligent Computing in Personal Informatics: Key Design Considerations. In Proceedings of the 20th International Conference on Intelligent User Interfaces (Atlanta, Georgia, USA) (IUI ’15). Association for Computing Machinery, New York, NY, USA, 263–274. https://doi.org/10.1145/2678025.2701378",
      "doi": "10.1145/2678025.2701378"
    },
    {
      "text": "Antti Oulasvirta, Tye Rattenbury, Lingyi Ma, and Eeva Raita. 2012. Habits make smartphone use more pervasive. Personal and Ubiquitous computing 16, 1 (2012), 105–114.",
      "doi": ""
    },
    {
      "text": "Google PAIR. 2019. People + AI Guidebook.Retrieved Sep 8, 2021 from https://pair.withgoogle.com/guidebook",
      "doi": ""
    },
    {
      "text": "Amon Rapp and Federica Cena. 2014. Self-monitoring and technology: challenges and open issues in personal informatics. In International Conference on Universal Access in Human-Computer Interaction. Springer, 613–622.",
      "doi": ""
    },
    {
      "text": "Marco Tulio Ribeiro, Sameer Singh, and Carlos Guestrin. 2016. ”Why Should I Trust You?”: Explaining the Predictions of Any Classifier. In Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (San Francisco, California, USA) (KDD ’16). Association for Computing Machinery, New York, NY, USA, 1135–1144. https://doi.org/10.1145/2939672.2939778",
      "doi": "10.1145/2939672.2939778"
    },
    {
      "text": "Jens Riegelsberger, M Angela Sasse, and John D McCarthy. 2005. The mechanics of trust: A framework for research and design. International Journal of Human-Computer Studies 62, 3 (2005), 381–422.",
      "doi": "10.1016/j.ijhcs.2005.01.001"
    },
    {
      "text": "Sohrab Saeb, Emily G Lattie, Stephen M Schueller, Konrad P Kording, and David C Mohr. 2016. The relationship between mobile phone location sensor data and depressive symptom severity. PeerJ 4(2016), e2537.",
      "doi": ""
    },
    {
      "text": "Hillol Sarker, Matthew Tyburski, Md Mahbubur Rahman, Karen Hovsepian, Moushumi Sharmin, David H. Epstein, Kenzie L. Preston, C. Debra Furr-Holden, Adam Milam, Inbal Nahum-Shani, Mustafa al’Absi, and Santosh Kumar. 2016. Finding Significant Stress Episodes in a Discontinuous Time Series of Rapidly Varying Mobile Sensor Data. Association for Computing Machinery, New York, NY, USA, 4489–4501. https://doi.org/10.1145/2858036.2858218",
      "doi": ""
    },
    {
      "text": "Jessica Schroeder, Chia-Fang Chung, Daniel A. Epstein, Ravi Karkar, Adele Parsons, Natalia Murinova, James Fogarty, and Sean A. Munson. 2018. Examining Self-Tracking by People with Migraine: Goals, Needs, and Opportunities in a Chronic Health Condition. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 135–148. https://doi.org/10.1145/3196709.3196738",
      "doi": "10.1145/3196709.3196738"
    },
    {
      "text": "Jussi Seppälä, Ilaria De Vita, Timo Jämsä, Jouko Miettunen, Matti Isohanni, Katya Rubinstein, Yoram Feldman, Eva Grasa, Iluminada Corripio, Jesus Berdun, 2019. Mobile phone and wearable sensor-based mHealth approaches for psychiatric disorders and symptoms: systematic review. JMIR mental health 6, 2 (2019), e9819.",
      "doi": ""
    },
    {
      "text": "Saul Shiffman, Arthur A Stone, and Michael R Hufford. 2008. Ecological momentary assessment. Annu. Rev. Clin. Psychol. 4 (2008), 1–32.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2003. The eyes have it: A task by data type taxonomy for information visualizations. In The craft of information visualization. Elsevier, 364–371.",
      "doi": ""
    },
    {
      "text": "Åsa Smedberg, Hélène Sandmark, and Andrea Manth. 2017. Online Stress Management for Self- and Group-Reflections on Stress Patterns. In Biomedical Engineering Systems and Technologies, Ana Fred and Hugo Gamboa (Eds.). Springer International Publishing, Cham, 387–404.",
      "doi": ""
    },
    {
      "text": "Jaime Snyder, Mark Matthews, Jacqueline Chien, Pamara F. Chang, Emily Sun, Saeed Abdullah, and Geri Gay. 2015. MoodLight: Exploring Personal and Social Implications of Ambient Display of Biosensor Data. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work and Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 143–153. https://doi.org/10.1145/2675133.2675191",
      "doi": "10.1145/2675133.2675191"
    },
    {
      "text": "Aaron Springer, Victoria Hollis, and Steve Whittaker. 2018. Mood modeling: accuracy depends on active logging and reflection. Personal and Ubiquitous Computing 22, 4 (2018), 723–737.",
      "doi": "10.1007/s00779-018-1123-8"
    },
    {
      "text": "Aaron Springer and Steve Whittaker. 2018. Progressive disclosure: designing for effective transparency. arXiv preprint arXiv:1811.02164(2018).",
      "doi": ""
    },
    {
      "text": "Aaron Springer and Steve Whittaker. 2019. Progressive Disclosure: Empirically Motivated Approaches to Designing Effective Transparency. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 107–120. https://doi.org/10.1145/3301275.3302322",
      "doi": "10.1145/3301275.3302322"
    },
    {
      "text": "Aaron Springer and Steve Whittaker. 2020. Progressive Disclosure: When, Why, and How Do Users Want Algorithmic Transparency Information?ACM Trans. Interact. Intell. Syst. 10, 4, Article 29 (Oct. 2020), 32 pages. https://doi.org/10.1145/3374218",
      "doi": "10.1145/3374218"
    },
    {
      "text": "Maxwell Szymanski, Martijn Millecamp, and Katrien Verbert. 2021. Visual, Textual or Hybrid: The Effect of User Expertise on Different Explanations. In 26th International Conference on Intelligent User Interfaces (College Station, TX, USA) (IUI ’21). Association for Computing Machinery, New York, NY, USA, 109–119. https://doi.org/10.1145/3397481.3450662",
      "doi": "10.1145/3397481.3450662"
    },
    {
      "text": "Anja Thieme, Jayne Wallace, Thomas D. Meyer, and Patrick Olivier. 2015. Designing for Mental Wellbeing: Towards a More Holistic Approach in the Treatment and Prevention of Mental Illness. In Proceedings of the 2015 British HCI Conference(Lincoln, Lincolnshire, United Kingdom) (British HCI ’15). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/2783446.2783586",
      "doi": "10.1145/2783446.2783586"
    },
    {
      "text": "Karmen Toros and Michael C LaSala. 2019. Child protection workers’ understanding of the meaning and value of self-reflection in Estonia. Reflective Practice 20, 2 (2019), 266–278.",
      "doi": ""
    },
    {
      "text": "Alina Trifan, Maryse Oliveira, and José Luís Oliveira. 2019. Passive sensing of health outcomes through smartphones: systematic review of current solutions and possible limitations. JMIR mHealth and uHealth 7, 8 (2019), e12649.",
      "doi": ""
    },
    {
      "text": "Greg Wadley, Frank Vetere, Liza Hopkins, Julie Green, and Lars Kulik. 2014. Exploring Ambient Technology for Connecting Hospitalised Children with School and Home. Int. J. Hum.-Comput. Stud. 72, 8 (aug 2014), 640–653. https://doi.org/10.1016/j.ijhcs.2014.04.003",
      "doi": ""
    },
    {
      "text": "Rui Wang, Fanglin Chen, Zhenyu Chen, Tianxing Li, Gabriella Harari, Stefanie Tignor, Xia Zhou, Dror Ben-Zeev, and Andrew T. Campbell. 2014. StudentLife: Assessing Mental Health, Academic Performance and Behavioral Trends of College Students Using Smartphones. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Seattle, Washington) (UbiComp ’14). Association for Computing Machinery, New York, NY, USA, 3–14. https://doi.org/10.1145/2632048.2632054",
      "doi": "10.1145/2632048.2632054"
    },
    {
      "text": "Rui Wang, Weichen Wang, Alex daSilva, Jeremy F. Huckins, William M. Kelley, Todd F. Heatherton, and Andrew T. Campbell. 2018. Tracking Depression Dynamics in College Students Using Mobile Phone and Wearable Sensing. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 1, Article 43 (March 2018), 26 pages. https://doi.org/10.1145/3191775",
      "doi": "10.1145/3191775"
    },
    {
      "text": "Jeffrey Warshaw, Tara Matthews, Steve Whittaker, Chris Kau, Mateo Bengualid, and Barton A. Smith. 2015. Can an Algorithm Know the ”Real You”? Understanding People’s Reactions to Hyper-Personal Analytics Systems. Association for Computing Machinery, New York, NY, USA, 797–806. https://doi.org/10.1145/2702123.2702274",
      "doi": ""
    },
    {
      "text": "Paweł W. Woźniak, Przemysław Piotr Kucharski, Maartje M.A. de Graaf, and Jasmin Niess. 2020. Exploring Understandable Algorithms to Suggest Fitness Tracker Goals That Foster Commitment. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3419249.3420131",
      "doi": ""
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, Carolyn Rosé, and John Zimmerman. 2020. Re-Examining Whether, Why, and How Human-AI Interaction Is Uniquely Difficult to Design. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376301",
      "doi": "10.1145/3313831.3376301"
    },
    {
      "text": "Ming Yin, Jennifer Wortman Vaughan, and Hanna Wallach. 2019. Understanding the Effect of Accuracy on Trust in Machine Learning Models. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300509",
      "doi": ""
    },
    {
      "text": "Bin Zhu, Anders Hedman, and Haibo Li. 2016. Design Digital Mindfulness for Personal Wellbeing. In Proceedings of the 28th Australian Conference on Computer-Human Interaction (Launceston, Tasmania, Australia) (OzCHI ’16). Association for Computing Machinery, New York, NY, USA, 626–627. https://doi.org/10.1145/3010915.3011841",
      "doi": "10.1145/3010915.3011841"
    }
  ]
}