{
  "doi": "10.1145/3491102.3517645",
  "title": "Mobiot: Augmenting Everyday Objects into Moving IoT Devices Using 3D Printed Attachments Generated by Demonstration",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "Recent advancements in personal fabrication have brought novices closer to a reality, where they can automate routine tasks with mobilized everyday objects. However, the overall process remains challenging- from capturing design requirements and motion planning to authoring them to creating 3D models of mechanical parts to programming electronics, as it demands expertise.  We introduce Mobiot, an end-user toolkit to help non-experts capture the design and motion requirements of legacy objects by demonstration. It then automatically generates 3D printable attachments, programs to operate assembled modules, a list of off-the-shelf electronics, and assembly tutorials. The authoring feature further assists users to fine-tune as well as to reuse existing motion libraries and 3D printed mechanisms to adapt to other real-world objects with different motions. We validate Mobiot through application examples with 8 everyday objects with various motions applied, and through technical evaluation to measure the accuracy of motion reconstruction.",
  "tags": [
    "Home-automation",
    "Personal Fabrication",
    "Motion planning"
  ],
  "authors": [
    {
      "name": "Abul Al Arabi",
      "institution": "HCIED Lab, Texas A&M University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236328",
      "orcid": "missing"
    },
    {
      "name": "Jiahao Li",
      "institution": "HCI Research, UCLA, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659475299",
      "orcid": "missing"
    },
    {
      "name": "Xiang 'Anthony Chen",
      "institution": "HCI Research, UCLA, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659468135",
      "orcid": "0000-0002-8527-1744"
    },
    {
      "name": "Jeeeun Kim",
      "institution": "Computer Science & Engineering, Texas A&M University, United States",
      "img": "/do/10.1145/contrib-87959397157/rel-imgonly/me_2020.jpeg",
      "acmid": "87959397157",
      "orcid": "0000-0002-8915-481X"
    }
  ],
  "references": [
    {
      "text": "Jacopo Aleotti, Stefano Caselli, and Monica Reggiani. 2004. Leveraging on a virtual environment for robot programming by demonstration. Robotics and Autonomous Systems 47, 2-3 (2004), 153–161.",
      "doi": ""
    },
    {
      "text": "Ron Alterovitz, Sven Koenig, and Maxim Likhachev. 2016. Robot planning in the real world: Research challenges and opportunities. Ai Magazine 37, 2 (2016), 76–84.",
      "doi": ""
    },
    {
      "text": "Brenna D Argall, Sonia Chernova, Manuela Veloso, and Brett Browning. 2009. A survey of robot learning from demonstration. Robotics and autonomous systems 57, 5 (2009), 469–483.",
      "doi": ""
    },
    {
      "text": "Jordan Ash, Monica Babes, Gal Cohen, Sameen Jalal, Sam Lichtenberg, Michael Littman, Vukosi Marivate, Phillip Quiza, Blase Ur, and Emily Zhang. 2011. Scratchable devices: user-friendly programming for household appliances. In International Conference on Human-Computer Interaction. Springer, 137–146.",
      "doi": ""
    },
    {
      "text": "Daniel Ashbrook, Shitao Stan Guo, and Alan Lambie. 2016. Towards augmented fabrication: Combining fabricated and existing objects. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 1510–1518.",
      "doi": "10.1145/2851581.2892509"
    },
    {
      "text": "Alexander Berman, Francis Quek, Robert Woodward, Osazuwa Okundaye, and Jeeeun Kim. 2020. “Anyone Can Print”: Supporting Collaborations with 3D Printing Services to Empower Broader Participation in Personal Fabrication. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3419249.3420068",
      "doi": ""
    },
    {
      "text": "Aude Billard, Sylvain Calinon, Ruediger Dillmann, and Stefan Schaal. 2008. Survey: Robot programming by demonstration. Technical Report. Springrer.",
      "doi": ""
    },
    {
      "text": "Elin A Björling, Emma Rose, and Rachel Ren. 2018. Teen-robot interaction: A pilot study of engagement with a low-fidelity prototype. In Companion of the 2018 ACM/IEEE International Conference on Human-Robot Interaction. 69–70.",
      "doi": "10.1145/3173386.3177068"
    },
    {
      "text": "Alexey Bochkovskiy, Chien-Yao Wang, and Hong-Yuan Mark Liao. 2020. Yolov4: Optimal speed and accuracy of object detection. arXiv preprint arXiv:2004.10934(2020).",
      "doi": ""
    },
    {
      "text": "Paul Bovbel and Goldie Nejat. 2014. Casper: An assistive kitchen robot to promote aging in place. Journal of Medical Devices 8, 3 (2014).",
      "doi": ""
    },
    {
      "text": "Leah Buechley, Daniela K Rosner, Eric Paulos, and Amanda Williams. 2009. DIY for CHI: methods, communities, and values of reuse and customization. In CHI’09 Extended Abstracts on Human Factors in Computing Systems. 4823–4826.",
      "doi": ""
    },
    {
      "text": "Maya Cakmak, Crystal Chao, and Andrea L Thomaz. 2010. Designing interactions for robot active learners. IEEE Transactions on Autonomous Mental Development 2, 2(2010), 108–118.",
      "doi": "10.1109/TAMD.2010.2051030"
    },
    {
      "text": "Yuanzhi Cao, Zhuangying Xu, Fan Li, Wentao Zhong, Ke Huo, and Karthik Ramani. 2019. V. ra: An in-situ visual authoring system for robot-iot task planning with augmented reality. In Proceedings of the 2019 on Designing Interactive Systems Conference. 1059–1070.",
      "doi": "10.1145/3322276.3322278"
    },
    {
      "text": "Sonia Mary Chacko and Vikram Kapila. 2019. An augmented reality interface for human-robot interaction in unconstrained environments. In 2019 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEE, 3222–3228.",
      "doi": "10.1109/IROS40897.2019.8967973"
    },
    {
      "text": "Angel X. Chang, Thomas Funkhouser, Leonidas Guibas, Pat Hanrahan, Qixing Huang, Zimo Li, Silvio Savarese, Manolis Savva, Shuran Song, Hao Su, Jianxiong Xiao, Li Yi, and Fisher Yu. 2015. ShapeNet: An Information-Rich 3D Model Repository. Technical Report arXiv:1512.03012 [cs.GR]. Stanford University — Princeton University — Toyota Technological Institute at Chicago.",
      "doi": ""
    },
    {
      "text": "Xiang’Anthony’ Chen, Stelian Coros, Jennifer Mankoff, and Scott E Hudson. 2015. Encore: 3D printed augmentation of everyday objects with printed-over, affixed and interlocked attachments. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. 73–82.",
      "doi": "10.1145/2807442.2807498"
    },
    {
      "text": "Xiang’Anthony’ Chen, Jeeeun Kim, Jennifer Mankoff, Tovi Grossman, Stelian Coros, and Scott E Hudson. 2016. Reprise: A design tool for specifying, generating, and customizing 3D printable adaptations on everyday objects. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 29–39.",
      "doi": "10.1145/2984511.2984512"
    },
    {
      "text": "Hyungjun Cho, Han-Jong Kim, JiYeon Lee, Chang-Min Kim, Jinseong Bae, and Tek-Jin Nam. 2021. IoTIZER: A Versatile Mechanical Hijacking Device for Creating Internet of Old Things. In Designing Interactive Systems Conference 2021. 90–103.",
      "doi": ""
    },
    {
      "text": "Matei Ciocarlie, Kaijen Hsiao, Adam Leeper, and David Gossow. 2012. Mobile manipulation through an assistive home robot. In 2012 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE, 5313–5320.",
      "doi": ""
    },
    {
      "text": "Ruta Desai, James McCann, and Stelian Coros. 2018. Assembly-aware design of printable electromechanical devices. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology. 457–472.",
      "doi": "10.1145/3242587.3242655"
    },
    {
      "text": "Alexander Dijkshoorn, Patrick Werkman, Marcel Welleweerd, Gerjan Wolterink, Bram Eijking, John Delamare, Remco Sanders, and Gijs JM Krijnen. 2018. Embedded sensing: Integrating sensors in 3-D printed structures. Journal of Sensors and Sensor Systems 7, 1 (2018), 169–181.",
      "doi": ""
    },
    {
      "text": "Rüdiger Dillmann. 2004. Teaching and learning of robot tasks via observation of human performance. Robotics and Autonomous Systems 47, 2-3 (2004), 109–116.",
      "doi": ""
    },
    {
      "text": "Ohsung Doh and Ilkyu Ha. 2015. A digital door lock system for the internet of things with improved security and usability. Advanced Science and Technology Letters 109, Security, Reliability and Safety 2015 (2015), 33–38.",
      "doi": ""
    },
    {
      "text": "M Ehrenmann, R Zollner, O Rogalla, and R Dillmann. 2002. Programming service tasks in household environments by human demonstration. In Proceedings. 11th IEEE International Workshop on Robot and Human Interactive Communication. IEEE, 460–467.",
      "doi": ""
    },
    {
      "text": "Kerstin Fischer, Franziska Kirstein, Lars Christian Jensen, Norbert Krüger, Kamil Kukliński, Maria Vanessa aus der Wieschen, and Thiusius Rajeeth Savarimuthu. 2016. A comparison of types of robot control for programming by demonstration. In 2016 11th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 213–220.",
      "doi": ""
    },
    {
      "text": "David Fischinger, Peter Einramhof, Konstantinos Papoutsakis, Walter Wohlkinger, Peter Mayer, Paul Panek, Stefan Hofmann, Tobias Koertner, Astrid Weiss, Antonis Argyros, 2016. Hobbit, a care robot supporting independent living at home: First prototype and lessons learned. Robotics and Autonomous Systems 75 (2016), 60–78.",
      "doi": "10.1016/j.robot.2014.09.029"
    },
    {
      "text": "Google. 2019. Blockly. https://developers.google.com/blockly/.",
      "doi": ""
    },
    {
      "text": "Horst-Michael Gross, Steffen Mueller, Christof Schroeter, Michael Volkhardt, Andrea Scheidig, Klaus Debes, Katja Richter, and Nicola Doering. 2015. Robot companion for domestic health assistance: Implementation, test and case study under everyday conditions in private apartments. In 2015 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEE, 5992–5999.",
      "doi": "10.1109/IROS.2015.7354230"
    },
    {
      "text": "Sachini Herath, Hang Yan, and Yasutaka Furukawa. 2020. RoNIN: Robust Neural Inertial Navigation in the Wild: Benchmark, Evaluations, & New Methods. In 2020 IEEE International Conference on Robotics and Automation (ICRA). IEEE, 3146–3152.",
      "doi": ""
    },
    {
      "text": "Gaoping Huang, Pawan S Rao, Meng-Han Wu, Xun Qian, Shimon Y Nof, Karthik Ramani, and Alexander J Quinn. 2020. Vipo: Spatial-Visual Programming with Functions for Robot-IoT Workflows. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376670"
    },
    {
      "text": "Frédéric Kaplan. 2005. Everyday robotics: robots as everyday objects. In Proceedings of the 2005 joint conference on Smart objects and ambient intelligence: innovative context-aware services: usages and technologies. 59–64.",
      "doi": "10.1145/1107548.1107570"
    },
    {
      "text": "Tarik Keleştemur, Naoki Yokoyama, Joanne Truong, Anas Abou Allaban, and Taşkin Padir. 2019. System architecture for autonomous mobile manipulation of everyday objects in domestic environments. In Proceedings of the 12th ACM International Conference on PErvasive Technologies Related to Assistive Environments. 264–269.",
      "doi": "10.1145/3316782.3316797"
    },
    {
      "text": "Jeeeun Kim, Haruki Takahashi, Homei Miyashita, Michelle Annett, and Tom Yeh. 2017. Machines as co-designers: A fiction on the future of human-fabrication machine interaction. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 790–805.",
      "doi": "10.1145/3027063.3052763"
    },
    {
      "text": "Yuki Koyama, Shinjiro Sueda, Emma Steinhardt, Takeo Igarashi, Ariel Shamir, and Wojciech Matusik. 2015. AutoConnect: computational design of 3D-printable connectors. ACM Transactions on Graphics (TOG) 34, 6 (2015), 1–11.",
      "doi": "10.1145/2816795.2818060"
    },
    {
      "text": "Stacey Kuznetsov and Eric Paulos. 2010. Rise of the expert amateur: DIY projects, communities, and cultures. In Proceedings of the 6th Nordic conference on human-computer interaction: extending boundaries. 295–304.",
      "doi": "10.1145/1868914.1868950"
    },
    {
      "text": "Jiahao Li, Meilin Cui, Jeeeun Kim, and Xiang’Anthony’ Chen. 2020. Romeo: A Design Tool for Embedding Transformable Parts in 3D Models to Robotically Augment Default Functionalities. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 897–911.",
      "doi": "10.1145/3379337.3415826"
    },
    {
      "text": "Jiahao Li, Jeeeun Kim, and Xiang’Anthony’ Chen. 2019. Robiot: A Design Tool for Actuating Everyday Objects with Automatically Generated 3D Printable Mechanisms. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 673–685.",
      "doi": "10.1145/3332165.3347894"
    },
    {
      "text": "Chuanhua Lu, Hideaki Uchiyama, Diego Thomas, Atsushi Shimada, and Rin-ichiro Taniguchi. 2019. Indoor positioning system based on chest-mounted IMU. Sensors 19, 2 (2019), 420.",
      "doi": ""
    },
    {
      "text": "Catarina Mota. 2011. The rise of personal fabrication. In Proceedings of the 8th ACM conference on Creativity and cognition. 279–288.",
      "doi": "10.1145/2069618.2069665"
    },
    {
      "text": "Pedro Neto, J Norberto Pires, and A Paulo Moreira. 2010. High-level programming and control for industrial robotics: using a hand-held accelerometer-based input device for gesture and posture recognition. Industrial Robot: An International Journal(2010).",
      "doi": ""
    },
    {
      "text": "Pedro Neto, J Norberto Pires, and Anónio Paulo Moreira. 2013. 3-D position estimation from inertial sensing: Minimizing the error from the process of double integration of accelerations. In IECON 2013-39th Annual Conference of the IEEE Industrial Electronics Society. IEEE, 4026–4031.",
      "doi": ""
    },
    {
      "text": "Donald A Norman. 2005. Robots in the home: what might they do?Interactions 12, 2 (2005), 65.",
      "doi": "10.1145/1052438.1052473"
    },
    {
      "text": "William Odom, James Pierce, Erik Stolterman, and Eli Blevis. 2009. Understanding why we preserve some things and discard others in the context of interaction design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1053–1062.",
      "doi": "10.1145/1518701.1518862"
    },
    {
      "text": "Lauro Ojeda and Johann Borenstein. 2007. Non-GPS navigation with the personal dead-reckoning system. In Unmanned Systems Technology IX, Vol. 6561. International Society for Optics and Photonics, 65610C.",
      "doi": ""
    },
    {
      "text": "Lauro Ojeda and Johann Borenstein. 2007. Personal dead-reckoning system for GPS-denied environments. In 2007 IEEE International Workshop on Safety, Security and Rescue Robotics. IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Ortak. [n.d.]. Ortak 3D Printable Products - edelkrone. https://edelkrone.com/collections/ortak (Accessed on 03/09/2022).",
      "doi": ""
    },
    {
      "text": "Mikkel Rath Pedersen and Volker Krüger. 2015. Gesture-based extraction of robot skill parameters for intuitive robot programming. Journal of Intelligent & Robotic Systems 80, 1 (2015), 149–163.",
      "doi": "10.1007/s10846-015-0219-x"
    },
    {
      "text": "Huaishu Peng, Jimmy Briggs, Cheng-Yao Wang, Kevin Guo, Joseph Kider, Stefanie Mueller, Patrick Baudisch, and François Guimbretière. 2018. RoMA: Interactive fabrication with augmented reality and a robotic 3D printer. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3173574.3174153"
    },
    {
      "text": "Martha E Pollack, Laura Brown, Dirk Colbry, Cheryl Orosz, Bart Peintner, Sailesh Ramakrishnan, Sandra Engberg, Judith T Matthews, Jacqueline Dunbar-Jacob, Colleen E McCarthy, 2002. Pearl: A mobile robotic assistant for the elderly. In AAAI workshop on automation as eldercare, Vol. 2002. 85–91.",
      "doi": ""
    },
    {
      "text": "Print+. [n.d.]. print+ DIY products. https://www.print.plus/ (Accessed on 03/09/2022).",
      "doi": ""
    },
    {
      "text": "Raf Ramakers, Fraser Anderson, Tovi Grossman, and George Fitzmaurice. 2016. Retrofab: A design tool for retrofitting physical interfaces using actuators, sensors and 3d printing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 409–419.",
      "doi": "10.1145/2858036.2858485"
    },
    {
      "text": "Mitchel Resnick, Brad Myers, Kumiyo Nakakoji, Ben Shneiderman, Randy Pausch, Ted Selker, and Mike Eisenberg. 2005. Design Principles for Tools to Support Creative Thinking. http://www.cs.umd.edu/hcil/CST/Papers/designprinciples.htm. (Accessed on 03/27/2021).",
      "doi": ""
    },
    {
      "text": "David Roedl, Shaowen Bardzell, and Jeffrey Bardzell. 2015. Sustainable making? Balancing optimism and criticism in HCI discourse. ACM Transactions on Computer-Human Interaction (TOCHI) 22, 3(2015), 1–27.",
      "doi": "10.1145/2699742"
    },
    {
      "text": "Corey Shemelya, Fernando Cedillos, Efrian Aguilera, E Maestas, J Ramos, D Espalin, D Muse, R Wicker, and E MacDonald. 2013. 3D printed capacitive sensors. In SENSORS, 2013 IEEE. IEEE, 1–4.",
      "doi": ""
    },
    {
      "text": "Himanshu Singh, Vishal Pallagani, Vedant Khandelwal, and U Venkanna. 2018. IoT based smart home automation system using sensor node. In 2018 4th International Conference on Recent Advances in Information Technology (RAIT). IEEE, 1–5.",
      "doi": ""
    },
    {
      "text": "Steppschuh. [n.d.]. Steppschuh/Sensor-Data-Logger: Android Wear sensor data plotter. https://github.com/Steppschuh/Sensor-Data-Logger (Accessed on 03/09/2022).",
      "doi": ""
    },
    {
      "text": "Michael Suguitan and Guy Hoffman. 2019. Blossom: A handcrafted open-source robot. ACM Transactions on Human-Robot Interaction (THRI) 8, 1 (2019), 1–27.",
      "doi": "10.1145/3310356"
    },
    {
      "text": "Ja-Young Sung. 2011. Towards the human-centered design of everyday robots. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Carlos E Tejada, Raf Ramakers, Sebastian Boring, and Daniel Ashbrook. 2020. AirTouch: 3D-printed Touch-Sensitive Objects Using Pneumatic Sensing. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–10.",
      "doi": "10.1145/3313831.3376136"
    },
    {
      "text": "ThisAbles. [n.d.]. Assistive Technology Devices For Ikea Products. https://www.universaldesignstyle.com/thisables-assistive-technology-devices-for-ikea-products/. (Accessed on 03/09/2022).",
      "doi": ""
    },
    {
      "text": "Panagiota Tsarouchi, Athanasios Athanasatos, Sotiris Makris, Xenofon Chatzigeorgiou, and George Chryssolouris. 2016. High level robot programming using body and hand gestures. Procedia Cirp 55(2016), 1–5.",
      "doi": ""
    },
    {
      "text": "Ron Wakkary and Leah Maestri. 2007. The resourcefulness of everyday design. In Proceedings of the 6th ACM SIGCHI Conference on Creativity & Cognition. 163–172.",
      "doi": "10.1145/1254960.1254984"
    },
    {
      "text": "Weitian Wang, Rui Li, Yi Chen, Z Max Diekel, and Yunyi Jia. 2018. Facilitating human–robot collaborative tasks by teaching-learning-collaboration from human demonstrations. IEEE Transactions on Automation Science and Engineering 16, 2(2018), 640–653.",
      "doi": ""
    },
    {
      "text": "Chao Wen, Yinda Zhang, Zhuwen Li, and Yanwei Fu. 2019. Pixel2mesh++: Multi-view 3d mesh generation via deformation. In Proceedings of the IEEE/CVF International Conference on Computer Vision. 1042–1051.",
      "doi": ""
    },
    {
      "text": "Karl Willis, Eric Brockmeyer, Scott Hudson, and Ivan Poupyrev. 2012. Printed optics: 3D printing of embedded optical elements for interactive devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology. 589–598.",
      "doi": "10.1145/2380116.2380190"
    },
    {
      "text": "Thomas Wrensch and Michael Eisenberg. 1998. The programmable hinge: toward computationally enhanced crafts. In Proceedings of the 11th annual ACM symposium on User interface software and technology. 89–96.",
      "doi": "10.1145/288392.288577"
    },
    {
      "text": "Hang Yan, Qi Shan, and Yasutaka Furukawa. 2018. RIDI: Robust IMU double integration. In Proceedings of the European Conference on Computer Vision (ECCV). 621–636.",
      "doi": "10.1007/978-3-030-01261-8_38"
    },
    {
      "text": "Jing Zhu, Jin Xie, and Yi Fang. 2018. Learning adversarial 3d model generation with 2d image enhancer. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 32.",
      "doi": ""
    }
  ]
}