{
  "doi": "10.1145/3491102.3517541",
  "title": "Barriers to Expertise in Citizen Science Games",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-25",
  "year": 2022,
  "badges": [],
  "abstract": "Expertise-centric citizen science games (ECCSGs) can be powerful tools for crowdsourcing scientific knowledge production. However, to be effective these games must train their players on how to become experts, which is difficult in practice. In this study, we investigated the path to expertise and the barriers involved by interviewing players of three ECCSGs: Foldit, Eterna, and Eyewire. We then applied reflexive thematic analysis to generate themes of their experiences and produce a model of expertise and its barriers. We found expertise is constructed through a cycle of exploratory and social learning but prevented by instructional design issues. Moreover, exploration is slowed by a lack of polish to the game artifact, and social learning is disrupted by a lack of clear communication. Based on our analysis we make several recommendations for CSG developers, including: collaborating with professionals of required skill sets; providing social features and feedback systems; and improving scientific communication.",
  "authors": [
    {
      "name": "Josh Aaron Miller",
      "institution": "Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659461649",
      "orcid": "missing"
    },
    {
      "name": "Seth Cooper",
      "institution": "Northeastern University, United States",
      "img": "/do/10.1145/contrib-81314493529/rel-imgonly/81314493529.jpg",
      "acmid": "81314493529",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2021. iNaturalist. Retrieved from https://inaturalist.org/ on December 2, 2021.",
      "doi": ""
    },
    {
      "text": "2021. Player-Created Guides. Retrieved from http://eternawiki.org/wiki/index.php5/Player-Created_Guides on November 29, 2021.",
      "doi": ""
    },
    {
      "text": "2021. Zooniverse. Retrieved from https://www.zooniverse.org/ on December 2, 2021.",
      "doi": ""
    },
    {
      "text": "Rebecca Rashid Achterman. 2019. Minds at play: Using an online protein folding game, Foldit, to support student learning about protein folding, structure, and the scientific process. Journal of microbiology & biology education 20, 3 (2019), 100.",
      "doi": ""
    },
    {
      "text": "Marc Malmdorf Andersen and Andreas Roepstorff. 2021. Play in Predictive Minds: A Cognitive Theory of Play. (2021).",
      "doi": ""
    },
    {
      "text": "Aditya Anupam. 2021. Can Digital Games Teach Scientific Inquiry? A Case of How Affordances Can Become Constraints. Proceedings of the ACM on Human-Computer Interaction 5, CHI PLAY(2021), 1–21.",
      "doi": ""
    },
    {
      "text": "Louise Archer, Emily Dawson, Jennifer DeWitt, Amy Seakins, and Billy Wong. 2015. “Science capital”: A conceptual, methodological, and empirical argument for extending bourdieusian notions of capital beyond the arts. Journal of Research in Science Teaching 52, 7 (2015), 922–948.",
      "doi": ""
    },
    {
      "text": "Maria Aristeidou, Eileen Scanlon, and Mike Sharples. 2015. Weather-it: evolution of an online community for citizen inquiry. In Proceedings of the 15th International Conference on Knowledge Technologies and Data-driven Business. 1–8.",
      "doi": "10.1145/2809563.2809567"
    },
    {
      "text": "Maria Aristeidou, Eileen Scanlon, and Mike Sharples. 2017. Profiles of engagement in online communities of citizen science participation. Computers in Human Behavior 74 (2017), 246–256.",
      "doi": ""
    },
    {
      "text": "Aaron Bangor, Philip T Kortum, and James T Miller. 2008. An empirical evaluation of the system usability scale. Intl. Journal of Human–Computer Interaction 24, 6(2008), 574–594.",
      "doi": ""
    },
    {
      "text": "David Bar-El and Kathryn E. Ringland. 2020. Crafting Game-Based Learning: An Analysis of Lessons for Minecraft Education Edition. In International Conference on the Foundations of Digital Games. 1–4.",
      "doi": ""
    },
    {
      "text": "Yael Barel-Ben David, Erez S Garty, and Ayelet Baram-Tsabari. 2020. Can scientists fill the science journalism void? Online public engagement with science stories authored by scientists. PloS one 15, 1 (2020), e0222250.",
      "doi": ""
    },
    {
      "text": "Roy F Baumeister and Mark R Leary. 1995. The need to belong: desire for interpersonal attachments as a fundamental human motivation.Psychological bulletin 117, 3 (1995), 497.",
      "doi": ""
    },
    {
      "text": "Roy F Baumeister, Jean M Twenge, and Christopher K Nuss. 2002. Effects of social exclusion on cognitive processes: anticipated aloneness reduces intelligent thought.Journal of personality and social psychology 83, 4(2002), 817.",
      "doi": ""
    },
    {
      "text": "Elizabeth Bonsignore, Derek Hansen, Kari Kraus, and Marc Ruppel. 2013. Alternate reality games as platforms for practicing 21st-century literacies. (2013).",
      "doi": ""
    },
    {
      "text": "Anne Bowser, Derek Hansen, Yurong He, Carol Boston, Matthew Reid, Logan Gunnell, and Jennifer Preece. 2013. Using Gamification to Inspire New Citizen Science Volunteers. In Proceedings of the First International Conference on Gameful Design, Research, and Applications(Toronto, Ontario, Canada) (Gamification ’13). Association for Computing Machinery, New York, NY, USA, 18–25. https://doi.org/10.1145/2583008.2583011",
      "doi": "10.1145/2583008.2583011"
    },
    {
      "text": "Anne Bowser, Derek Hansen, and Jennifer Preece. 2013. Gamifying citizen science: Lessons and future directions. In Workshop on Designing Gamification: Creating Gameful and Playful Experiences.",
      "doi": ""
    },
    {
      "text": "Alan Boyle. 2020. A protein puzzle game called Foldit turns up 99 promising ways to confound coronavirus. https://www.geekwire.com/2020/protein-puzzle-game-called-foldit-turns-99-promising-ways-confound-coronavirus/",
      "doi": ""
    },
    {
      "text": "Daren C Brabham. 2013. Crowdsourcing. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4 (2019), 589–597.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. To saturate or not to saturate? Questioning data saturation as a useful concept for thematic analysis and sample-size rationales. Qualitative Research in Sport, Exercise and Health (2019), 1–16.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. Can I use TA? Should I use TA? Should I not use TA? Comparing reflexive thematic analysis and other pattern-based qualitative analytic approaches. Counselling and Psychotherapy Research 21, 1 (2021), 37–47.",
      "doi": "10.1002/capr.12360"
    },
    {
      "text": "John Brooke 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4–7.",
      "doi": ""
    },
    {
      "text": "Ann L Brown and Joseph C Campione. 1994. Guided discovery in a community of learners.The MIT Press.",
      "doi": ""
    },
    {
      "text": "Olivia M Bullock, Daniel Colón Amill, Hillary C Shulman, and Graham N Dixon. 2019. Jargon as a barrier to effective science communication: Evidence from metacognition. Public Understanding of Science 28, 7 (2019), 845–853.",
      "doi": ""
    },
    {
      "text": "Gordon Calleja. 2011. In-game: From immersion to incorporation. mit Press.",
      "doi": ""
    },
    {
      "text": "Luigi Ceccaroni, Anne Bowser, and Peter Brenton. 2017. Civic education and citizen science: Definitions, categories, knowledge representation. In Analyzing the role of citizen science in modern research. IGI Global, 1–23.",
      "doi": ""
    },
    {
      "text": "William G. Chase and Herbert A. Simon. 1973. Perception in chess. Cognitive psychology 4, 1 (1973), 55–81.",
      "doi": ""
    },
    {
      "text": "Jenova Chen. 2007. Flow in games (and everything else). Commun. ACM 50, 4 (2007), 31–34.",
      "doi": "10.1145/1232743.1232769"
    },
    {
      "text": "Michelene TH Chi, Paul J Feltovich, and Robert Glaser. 1981. Categorization and representation of physics problems by experts and novices. Cognitive science 5, 2 (1981), 121–152.",
      "doi": ""
    },
    {
      "text": "Hichang Cho, MeiHui Chen, and Siyoung Chung. 2010. Testing an integrative theoretical model of knowledge-sharing behavior in the context of Wikipedia. Journal of the American Society for Information Science and Technology 61, 6 (2010), 1198–1212.",
      "doi": "10.5555/1814490.1814499"
    },
    {
      "text": "Richard Clark. 2014. Cognitive task analysis for expert-based instruction in healthcare. In Handbook of research on educational communications and technology. Springer, 541–551.",
      "doi": ""
    },
    {
      "text": "Richard E Clark, Kenneth Yates, Sean Early, and Kathrine Moulton. 2009. An analysis of the failure of electronic media and discovery-based learning: Evidence for the performance benefits of guided training methods. Handbook of Improving Performance in the Workplace: Volumes 1-3 (2009), 263–297.",
      "doi": ""
    },
    {
      "text": "Cassandra Coburn. 2014. Play to cure: Genes in space. The Lancet Oncology 15, 7 (2014), 688.",
      "doi": ""
    },
    {
      "text": "Allan Collins. 1991. Cognitive apprenticeship and instructional technology. Educational values and cognitive instruction: Implications for reform 1991 (1991), 121–138.",
      "doi": ""
    },
    {
      "text": "Mia Consalvo. 2017. When paratexts become texts: de-centering the game-as-text. Critical Studies in Media Communication 34, 2 (2017), 177–183.",
      "doi": ""
    },
    {
      "text": "Seth Cooper. 2014. A framework for scientific discovery through video games. Morgan & Claypool.",
      "doi": ""
    },
    {
      "text": "Seth Cooper, Firas Khatib, Ilya Makedon, Hao Lu, Janos Barbero, David Baker, James Fogarty, Zoran Popović, and Foldit Players. 2011. Analysis of social gameplay macros in the Foldit cookbook. In Proceedings of the 6th International Conference on Foundations of Digital Games. 9–14.",
      "doi": "10.1145/2159365.2159367"
    },
    {
      "text": "Seth Cooper, Firas Khatib, Adrien Treuille, Janos Barbero, Jeehyung Lee, Michael Beenen, Andrew Leaver-Fay, David Baker, Zoran Popović, 2010. Predicting protein structures with a multiplayer online game. Nature 466, 7307 (2010), 756.",
      "doi": ""
    },
    {
      "text": "Seth Cooper, Adrien Treuille, Janos Barbero, Andrew Leaver-Fay, Kathleen Tuite, Firas Khatib, Alex Cho Snyder, Michael Beenen, David Salesin, David Baker, 2010. The challenge of designing scientific discovery games. In Proceedings of the Fifth international Conference on the Foundations of Digital Games. 40–47.",
      "doi": "10.1145/1822348.1822354"
    },
    {
      "text": "Justin Cranshaw and Aniket Kittur. 2011. The polymath project: lessons from a successful online collaboration in mathematics. In Proceedings of the SIGCHI conference on human factors in computing systems. 1865–1874.",
      "doi": "10.1145/1978942.1979213"
    },
    {
      "text": "Vickie Curtis. 2015. Motivation to participate in an online citizen science game: A study of Foldit. Science Communication 37, 6 (2015), 723–746.",
      "doi": ""
    },
    {
      "text": "Vickie Curtis. 2018. Who Takes Part in Online Citizen Science?In Online Citizen Science and the Widening of Academia. Springer, 45–68.",
      "doi": ""
    },
    {
      "text": "Heather Desurvire, Martin Caplan, and Jozsef A Toth. 2004. Using heuristics to evaluate the playability of games. In CHI’04 extended abstracts on Human factors in computing systems. ACM, 1509–1512.",
      "doi": ""
    },
    {
      "text": "Heather Desurvire and Charlotte Wiberg. 2009. Game usability heuristics (PLAY) for evaluating and designing better games: The next iteration. In International Conference on Online Communities and Social Computing. Springer, 557–566.",
      "doi": "10.1007/978-3-642-02774-1_60"
    },
    {
      "text": "Sebastian Deterding. 2013. Modes of play: A frame analytic account of video game play. Ph.D. Dissertation. Staats-und Universitätsbibliothek Hamburg Carl von Ossietzky.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding. 2014. The ambiguity of games: Histories and discourses of a gameful world. SP Walz, & S. Deterding, The Gameful World: Approaches, Issues, Applications (2014), 23–64.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness: defining” gamification”. In Proceedings of the 15th international academic MindTrek conference: Envisioning future media environments. 9–15.",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Carlos Díaz, Marisa Ponti, Pinja Haikka, Rajiv Basaiawmoit, and Jacob Sherson. 2020. More than data gatherers: exploring player experience in a citizen science game. Quality and User Experience 5, 1 (2020), 1.",
      "doi": ""
    },
    {
      "text": "Scott Donaldson. 2017. Mechanics and metagame: Exploring binary expertise in league of legends. Games and Culture 12, 5 (2017), 426–444.",
      "doi": ""
    },
    {
      "text": "Anders Drachen, Pejman Mirza-Babaei, and Lennart E Nacke. 2018. Games user research. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Peter Eastman, Jade Shi, Bharath Ramsundar, and Vijay S Pande. 2018. Solving the RNA design problem with reinforcement learning. PLoS computational biology 14, 6 (2018), e1006176.",
      "doi": ""
    },
    {
      "text": "Melissa V Eitzel, Jessica L Cappadonna, Chris Santos-Lang, Ruth Ellen Duerr, Arika Virapongse, Sarah Elizabeth West, Christopher Kyba, Anne Bowser, Caren Beth Cooper, Andrea Sforzi, 2017. Citizen science terminology matters: Exploring key terms. Citizen science: Theory and practice 2, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Séverine Erhel and Eric Jamet. 2013. Digital game-based learning: Impact of instructions and feedback on motivation and learning effectiveness. Computers & education 67 (2013), 156–167.",
      "doi": ""
    },
    {
      "text": "Alexandra Eveleigh, Charlene Jennett, Ann Blandford, Philip Brohan, and Anna L Cox. 2014. Designing for dabblers and deterring drop-outs in citizen science. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2985–2994.",
      "doi": "10.1145/2556288.2557262"
    },
    {
      "text": "Alexandra Eveleigh, Charlene Jennett, Stuart Lynn, and Anna L Cox. 2013. “I want to be a captain! I want to be a captain!” gamification in the old weather citizen science project. In Proceedings of the first international conference on gameful design, research, and applications. 79–82.",
      "doi": "10.1145/2583008.2583019"
    },
    {
      "text": "Travis Faas, Lynn Dombrowski, Alyson Young, and Andrew D Miller. 2018. Watch me code: Programming mentorship communities on twitch. tv. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–18.",
      "doi": "10.1145/3274319"
    },
    {
      "text": "Joey R Fanfarelli. 2018. Expertise in professional overwatch play. International Journal of Gaming and Computer-Mediated Simulations (IJGCMS) 10, 1 (2018), 1–22.",
      "doi": "10.4018/IJGCMS.2018010101"
    },
    {
      "text": "Peter C Farley. 2013. Using the computer game “FoldIt” to entice students to explore external representations of protein structure in a biochemistry course for nonmajors. Biochemistry and Molecular Biology Education 41, 1 (2013), 56–57.",
      "doi": ""
    },
    {
      "text": "Lucy Fortson, Karen Masters, Robert Nichol, EM Edmondson, C Lintott, J Raddick, and J Wallin. 2012. Galaxy zoo. Advances in machine learning and data mining for astronomy 2012 (2012), 213–236.",
      "doi": ""
    },
    {
      "text": "Chiara Franzoni and Henry Sauermann. 2014. Crowd science: The organization of scientific research in open collaborative projects. Research policy 43, 1 (2014), 1–20.",
      "doi": ""
    },
    {
      "text": "Matthew J Gaydos. 2013. Design-based research and video game based learning: Developing the educational video game” Citizen Science”. Ph.D. Dissertation. The University of Wisconsin-Madison.",
      "doi": ""
    },
    {
      "text": "James Paul Gee. 2003. What video games have to teach us about learning and literacy. Computers in Entertainment (CIE) 1, 1 (2003), 20–20.",
      "doi": "10.1145/950566.950595"
    },
    {
      "text": "James Paul Gee. 2004. An introduction to discourse analysis: Theory and method. Routledge.",
      "doi": ""
    },
    {
      "text": "James Paul Gee. 2005. Learning by design: Good video games as learning machines. E-learning and Digital Media 2, 1 (2005), 5–16.",
      "doi": ""
    },
    {
      "text": "James Paul Gee. 2005. Semiotic social spaces and affinity spaces. Beyond communities of practice language power and social context 214232 (2005).",
      "doi": ""
    },
    {
      "text": "James Paul Gee. 2007. Good video games+ good learning: Collected essays on video games, learning, and literacy. Peter Lang.",
      "doi": ""
    },
    {
      "text": "James Paul Gee. 2015. Discourse, small d, big D. The international encyclopedia of language and social interaction 3 (2015), 1–5.",
      "doi": ""
    },
    {
      "text": "CHRIS Georgen. 2015. Well played & well watched: Dota 2, spectatorship, and eSports. Well Played A Journal on Video Games, Values, and Meaning 4, 1(2015), 179–191.",
      "doi": ""
    },
    {
      "text": "Aytac Gogus. 2012. Peer Learning and Assessment. In Encyclopedia of the Sciences of Learning, Norbert M. Seel (Ed.). Springer US, Boston, MA, 2572–2576. https://doi.org/10.1007/978-1-4419-1428-6_146",
      "doi": ""
    },
    {
      "text": "Charles Goodwin. 2015. Professional vision. In Aufmerksamkeit. Springer, 387–425.",
      "doi": ""
    },
    {
      "text": "Anita Greenhill, Kate Holmes, Chris Lintott, Brooke Simmons, Karen Masters, Joe Cox, and Gary Graham. 2014. Playing with science: Gamised aspects of gamification found on the online citizen science project-zooniverse. In GAMEON’2014. EUROSIS, 15–24.",
      "doi": ""
    },
    {
      "text": "Greg Guest, Arwen Bunce, and Laura Johnson. 2006. How many interviews are enough? An experiment with data saturation and variability. Field methods 18, 1 (2006), 59–82.",
      "doi": ""
    },
    {
      "text": "Muki Haklay. 2013. Citizen Science and Volunteered Geographic Information: Overview and Typology of Participation. In Crowdsourcing Geographic Knowledge, Daniel Sui, Sarah Elwood, and Michael Goodchild (Eds.). Springer Netherlands, 105–122. https://doi.org/10.1007/978-94-007-4587-2_7",
      "doi": ""
    },
    {
      "text": "Allison W Harrison, R Kelly Rainer Jr, Wayne A Hochwarter, and Kenneth R Thompson. 1997. Testing the self-efficacy—performance linkage of social—cognitive theory. The Journal of social psychology 137, 1 (1997), 79–87.",
      "doi": ""
    },
    {
      "text": "Casper Harteveld. 2011. Triadic game design: Balancing reality, meaning and play. Springer Science & Business Media.",
      "doi": "10.5555/1972536"
    },
    {
      "text": "Joshua K Hartshorne, Claire Bonial, and Martha Palmer. 2014. The VerbCorner Project: Findings from Phase 1 of crowd-sourcing a semantic decomposition of verbs. In Proceedings of the 52nd Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers). 397–402.",
      "doi": ""
    },
    {
      "text": "Caroline Haythornthwaite. 2009. Crowds and communities: Light and heavyweight models of peer production. In 2009 42nd Hawaii international conference on system sciences. IEEE, 1–10.",
      "doi": ""
    },
    {
      "text": "Florian Heigl, Barbara Kieslinger, Katharina T Paul, Julia Uhlik, and Daniel Dörler. 2019. Opinion: Toward an international definition of citizen science. Proceedings of the National Academy of Sciences 116, 17(2019), 8089–8092.",
      "doi": ""
    },
    {
      "text": "Joseph Hesketh, Christoph Sebastian Deterding, and Jeremy Gow. 2020. How Players Learn Team-versus-Team Esports: First Results from A Grounded Theory Study. In DiGRA’20 Abstract-Proceedings of the 2020 DiGRA International Conference. York.",
      "doi": ""
    },
    {
      "text": "Celia Hodent. 2017. The gamer’s brain: How neuroscience and UX can impact video game design. CRC Press.",
      "doi": ""
    },
    {
      "text": "Jeff Huang, Eddie Yan, Gifford Cheung, Nachiappan Nagappan, and Thomas Zimmermann. 2017. Master maker: Understanding gaming skill through practice and habit from gameplay behavior. Topics in cognitive science 9, 2 (2017), 437–466.",
      "doi": ""
    },
    {
      "text": "Wenhao David Huang and Tristan Johnson. 2009. Instructional game design using cognitive load theory. In Handbook of research on effective electronic gaming in education. IGI Global, 1143–1165.",
      "doi": ""
    },
    {
      "text": "Matthew Hyde, Maxwell Scott-Slade, Hugo Scott-Slade, Michael Hornberger, Hugo Spiers, Ruth Dalton, Christoph Hoelscher, Jan Wiener, and Veronique Bohbot. 2016. Sea Hero Quest: the World’s first mobile game where anyone can help scientists fight dementia. (2016).",
      "doi": ""
    },
    {
      "text": "Ioanna Iacovides, James C Aczel, Eileen Scanlon, and Will IS Woods. 2011. What can breakdowns and breakthroughs tell us about learning and involvement experienced during game-play. In Proceedings of the 5th European Conference on Games Based Learning. Academic Publishing International Reading, UK, 275–281.",
      "doi": ""
    },
    {
      "text": "Ioanna Iacovides, Anna L Cox, Patrick McAndrew, James Aczel, and Eileen Scanlon. 2015. Game-play breakdowns and breakthroughs: exploring the relationship between action, understanding, and involvement. Human–computer interaction 30, 3-4 (2015), 202–231.",
      "doi": "10.1080/07370024.2014.987347"
    },
    {
      "text": "Ioanna Iacovides, Charlene Jennett, Cassandra Cornish-Trestrail, and Anna L Cox. 2013. Do games attract or sustain engagement in citizen science?: a study of volunteer motivations. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. ACM, 1101–1106.",
      "doi": ""
    },
    {
      "text": "Ioanna Iacovides, Patrick McAndrew, Eileen Scanlon, and James Aczel. 2014. The gaming involvement and informal learning framework. Simulation & gaming 45, 4-5 (2014), 611–626.",
      "doi": ""
    },
    {
      "text": "Charlene Jennett, Dominic J Furniss, Ioanna Iacovides, Sarah Wiseman, Sandy JJ Gould, and Anna L Cox. 2014. Exploring citizen psych-science and the motivations of errordiary volunteers. Human Computation 1, 2 (2014).",
      "doi": ""
    },
    {
      "text": "Charlene Jennett, Laure Kloetzer, Daniel Schneider, Ioanna Iacovides, Anna Cox, Margaret Gold, Brian Fuchs, Alexandra Eveleigh, Kathleen Methieu, Zoya Ajani, 2016. Motivations, learning and creativity in online citizen science. Journal of Science Communication 15, 3 (2016).",
      "doi": ""
    },
    {
      "text": "Jesper Hasseriis Mohr Jensen, Miroslav Gajdacz, Shaeema Zaman Ahmed, Jakub Herman Czarkowski, Carrie Weidner, Janet Rafner, Jens Jakob Sørensen, Klaus Mølmer, and Jacob Friis Sherson. 2021. Crowdsourcing human common sense for quantum control. Physical Review Research 3, 1 (2021), 013057.",
      "doi": ""
    },
    {
      "text": "Jae-Eun Jung and Yang-Hee Nam. 2015. Types of Gameplay Mechanics in Human Computation Games. Journal of Korea Game Society 15, 6 (2015), 157–170.",
      "doi": ""
    },
    {
      "text": "Jesper Juul. 2011. Half-real: Video games between real rules and fictional worlds. MIT press.",
      "doi": "10.5555/1076823"
    },
    {
      "text": "Slava Kalyuga and Jan L Plass. 2009. Evaluating and managing cognitive load in games. In Handbook of research on effective electronic gaming in education. IGI Global, 719–737.",
      "doi": ""
    },
    {
      "text": "Alexander Kawrykow, Gary Roumanis, Alfred Kam, Daniel Kwak, Clarence Leung, Chu Wu, Eleyine Zarour, Luis Sarmenta, Mathieu Blanchette, Jérôme Waldispühl, 2012. Phylo: a citizen science approach for improving multiple sequence alignment. PloS one 7, 3 (2012), e31362.",
      "doi": ""
    },
    {
      "text": "Benjamin Ernest Keep. 2018. Becoming Expert Problem Solvers: A Case Study in what Develops and how. Ph.D. Dissertation. Stanford University.",
      "doi": ""
    },
    {
      "text": "Ashley Rose Kelly and Kate Maddalena. 2015. Harnessing agency for efficacy:“Foldit” and citizen science. Poroi 11, 1 (2015), 1–20.",
      "doi": ""
    },
    {
      "text": "Firas Khatib, Seth Cooper, Michael D Tyka, Kefan Xu, Ilya Makedon, Zoran Popović, and David Baker. 2011. Algorithm discovery by protein folding game players. Proceedings of the National Academy of Sciences 108, 47(2011), 18949–18953.",
      "doi": ""
    },
    {
      "text": "Louise H Kidder and Michelle Fine. 1987. Qualitative and quantitative methods: When stories converge. New directions for program evaluation 1987, 35 (1987), 57–75.",
      "doi": ""
    },
    {
      "text": "Jeffrey Kim, Elan Lee, Timothy Thomas, and Caroline Dombrowski. 2009. Storytelling in new media: The case of alternate reality games, 2001–2009. First Monday (2009).",
      "doi": ""
    },
    {
      "text": "Jinseop S Kim, Matthew J Greene, Aleksandar Zlateski, Kisuk Lee, Mark Richardson, Srinivas C Turaga, Michael Purcaro, Matthew Balkam, Amy Robinson, Bardia F Behabadi, 2014. Space–time wiring specificity supports direction selectivity in the retina. Nature 509, 7500 (2014), 331–336.",
      "doi": ""
    },
    {
      "text": "Robert Kleffner, Jeff Flatten, Andrew Leaver-Fay, David Baker, Justin B Siegel, Firas Khatib, and Seth Cooper. 2017. Foldit Standalone: a video game-derived protein structure manipulation interface using Rosetta. Bioinformatics 33, 17 (2017), 2765–2767.",
      "doi": ""
    },
    {
      "text": "Eric Klopfer, Jason Haas, Scot Osterweil, and Louisa Rosenheck. 2018. Resonant games: Design principles for learning games that connect hearts, minds, and the everyday. MIT Press.",
      "doi": ""
    },
    {
      "text": "Hannu Korhonen and Elina MI Koivisto. 2007. Playability heuristics for mobile multi-player games. In Proceedings of the 2nd international conference on Digital interactive media in entertainment and arts. ACM, 28–35.",
      "doi": "10.1145/1306813.1306828"
    },
    {
      "text": "Jeff Kuhn. 2017. Minecraft: Education Edition. calico journal 35, 2 (2017), 214–223.",
      "doi": ""
    },
    {
      "text": "Mathieu Lafourcade, Alain Joubert, and Nathalie Le Brun. 2015. Unclassifiable GWAPs. Games with a Purpose (Gwaps)(2015), 73–89.",
      "doi": ""
    },
    {
      "text": "Anne Land-Zandstra, Gaia Agnello, and Yaşar Selman Gültekin. 2021. Participants in Citizen Science. The Science of Citizen Science(2021), 243.",
      "doi": ""
    },
    {
      "text": "Jeehyung Lee, Wipapat Kladwang, Minjae Lee, Daniel Cantu, Martin Azizyan, Hanjoo Kim, Alex Limpaecher, Snehal Gaikwad, Sungroh Yoon, Adrien Treuille, 2014. RNA design rules from a massive open laboratory. Proceedings of the National Academy of Sciences 111, 6 (2014), 2122–2127.",
      "doi": ""
    },
    {
      "text": "Kisuk Lee. 2015. Crowd Intelligence in EyeWire. Technical report. Retrieved from http://kisuklee.wikidot.com/research#toc2 on May 6, 2021.",
      "doi": ""
    },
    {
      "text": "Hjalti Leifsson and Jóhann Örn Bjarkason. 2015. Project Discovery-Advancing scientific research by implementing citizen science in EVE Online. Ph.D. Dissertation.",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star. 2010. This is not a boundary object: Reflections on the origin of a concept. Science, Technology, & Human Values 35, 5 (2010), 601–617.",
      "doi": ""
    },
    {
      "text": "Jimmie Leppink, Fred Paas, Tamara Van Gog, Cees PM van Der Vleuten, and Jeroen JG Van Merrienboer. 2014. Effects of pairs of problems and examples on task performance and different types of cognitive load. Learning and Instruction 30 (2014), 32–42.",
      "doi": ""
    },
    {
      "text": "Calvin A Liang, Sean A Munson, and Julie A Kientz. 2021. Embracing Four Tensions in Human-Computer Interaction Research with Marginalized People. ACM Transactions on Computer-Human Interaction (TOCHI) 28, 2(2021), 1–47.",
      "doi": "10.1145/3443686"
    },
    {
      "text": "Andreas Lieberoth, Mads Kock Pedersen, Andreea Catalina Marin, Tilo Planke, and Jacob Friis Sherson. 2015. Getting humans to do quantum optimization-user acquisition, engagement and early results from the citizen cyberscience game Quantum Moves. arXiv preprint arXiv:1506.08761(2015).",
      "doi": ""
    },
    {
      "text": "Jung Lim, Robert A Reiser, and Zane Olina. 2009. The effects of part-task and whole-task instructional approaches on acquisition and transfer of a complex cognitive skill. Educational Technology Research and Development 57, 1(2009), 61–77.",
      "doi": ""
    },
    {
      "text": "Chun-Yi Lin and Charles M Reigeluth. 2019. Scaffolding learner autonomy in a wiki-supported knowledge building community and its implications for mindset change. British Journal of Educational Technology 50, 5 (2019), 2667–2684.",
      "doi": ""
    },
    {
      "text": "Shlomit Aharoni Lir. 2019. Strangers in a seemingly open-to-all website: the gender bias in Wikipedia. Equality, Diversity and Inclusion: An International Journal (2019).",
      "doi": ""
    },
    {
      "text": "Jacqueline Low. 2019. A pragmatic definition of the concept of theoretical saturation. Sociological Focus 52, 2 (2019), 131–139.",
      "doi": ""
    },
    {
      "text": "Miguel Angel Luengo-Oroz, Asier Arranz, and John Frean. 2012. Crowdsourcing malaria parasite quantification: an online game for analyzing images of infected thick blood smears. Journal of medical Internet research 14, 6 (2012), e167.",
      "doi": ""
    },
    {
      "text": "Colleen Macklin and John Sharp. 2016. Games, design and play: a detailed approach to iterative game design (first edition ed.). Addison-Wesley, Boston, MA ; San Francisco, CA.",
      "doi": ""
    },
    {
      "text": "Vivien Marx. 2013. Neuroscience waves to the crowd. Nature methods 10, 11 (2013), 1069–1074.",
      "doi": ""
    },
    {
      "text": "Benedict McAteer, Wesley Flannery, and Brendan Murtagh. 2021. Linking the motivations and outcomes of volunteers to understand participation in marine community science. Marine Policy 124(2021), 104375.",
      "doi": ""
    },
    {
      "text": "Josh Aaron Miller, Britton Horn, Matthew Guthrie, Jonathan Romano, Guy Geva, Celia David, Amy Robinson Sterling, and Seth Cooper. 2021. How do Players and Developers of Citizen Science Games Conceptualize Skill Chains?. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play(CHI PLAY ’21). Association for Computing Machinery, New York, NY, USA, in press. https://doi.org/10.1145/3474671",
      "doi": "10.1145/3474671"
    },
    {
      "text": "Josh Aaron Miller, Vivian Lee, Seth Cooper, and Magy Seif El-Nasr. 2019. Large-Scale Analysis of Visualization Options in a Citizen Science Game. In Extended Abstracts of the Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts. 535–542.",
      "doi": "10.1145/3341215.3356274"
    },
    {
      "text": "Briana B Morrison and Betsy DiSalvo. 2014. Khan academy gamifies computer science. In Proceedings of the 45th ACM technical symposium on Computer science education. 39–44.",
      "doi": "10.1145/2538862.2538946"
    },
    {
      "text": "Benedikt Morschheuser, Juho Hamari, and Jonna Koivisto. 2016. Gamification in crowdsourcing: a review. In 2016 49th Hawaii International Conference on System Sciences (HICSS). IEEE, 4375–4384.",
      "doi": "10.1109/HICSS.2016.543"
    },
    {
      "text": "Benedikt Morschheuser, Juho Hamari, Jonna Koivisto, and Alexander Maedche. 2017. Gamified crowdsourcing: Conceptualization, literature review, and future agenda. International Journal of Human-Computer Studies 106 (2017), 26–43.",
      "doi": ""
    },
    {
      "text": "Andrew Murphy. 2020. A Gamer’s Guide to Eterna. Retrieved from https://www.keystone-research-solutions.com/en/item/a-gamers-guide-to-eternaon November 29, 2021.",
      "doi": ""
    },
    {
      "text": "Greg Newman, Andrea Wiggins, Alycia Crall, Eric Graham, Sarah Newman, and Kevin Crowston. 2012. The future of citizen science: emerging technologies and shifting paradigms. Frontiers in Ecology and the Environment 10, 6 (2012), 298–304.",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen. 1994. Enhancing the explanatory power of usability heuristics. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 152–158.",
      "doi": "10.1145/191666.191729"
    },
    {
      "text": "Donald A Norman and Stephen W Draper. 1986. User centered system design: New perspectives on human-computer interaction. (1986).",
      "doi": ""
    },
    {
      "text": "Jill Nugent. 2018. iNaturalist: citizen science for 21st-century naturalists. Science Scope 41, 7 (2018), 12.",
      "doi": ""
    },
    {
      "text": "Janne Paavilainen. 2010. Critical Review on Video Game Evaluation Heuristics: Social Games Perspective. In Proceedings of the International Academic Conference on the Future of Game Design and Technology (Vancouver, British Columbia, Canada) (Futureplay ’10). ACM, New York, NY, USA, 56–65. https://doi.org/10.1145/1920778.1920787",
      "doi": "10.1145/1920778.1920787"
    },
    {
      "text": "Janne Paavilainen. 2020. Defining playability of games: functionality, usability, and gameplay. In Proceedings of the 23rd International Conference on Academic Mindtrek. 55–64.",
      "doi": "10.1145/3377290.3377309"
    },
    {
      "text": "Carole Paleco, Sabina García Peter, Nora Salas Seoane, Julia Kaufmann, and Panagiota Argyri. 2021. Inclusiveness and Diversity in Citizen Science. The Science of Citizen Science(2021), 261.",
      "doi": ""
    },
    {
      "text": "Mads Kock Pedersen, Carlos Mauricio Castaño Díaz, Mario Alejandro Alba-Marrugo, Ali Amidi, Rajiv Vaid Basaiawmoit, Carsten Bergenholtz, Morten H Christiansen, Miroslav Gajdacz, Ralph Hertwig, Byurakn Ishkhanyan, 2020. Cognitive Abilities in the Wild: Population-scale game-based cognitive assessment. arXiv preprint arXiv:2009.05274(2020).",
      "doi": ""
    },
    {
      "text": "David Pinelle, Nelson Wong, Tadeusz Stach, and Carl Gutwin. 2009. Usability heuristics for networked multiplayer games. In Proceedings of the ACM 2009 international conference on Supporting group work. ACM, 169–178.",
      "doi": "10.1145/1531674.1531700"
    },
    {
      "text": "Lesandro Ponciano and Francisco Brasileiro. 2015. Finding volunteers’ engagement profiles in human computation for citizen science projects. arXiv preprint arXiv:1501.02134(2015).",
      "doi": ""
    },
    {
      "text": "Marisa Ponti, Thomas Hillman, Christopher Kullenberg, and Dick Kasperowski. 2018. Getting it right or being top rank: Games in citizen science. Citizen Science: Theory and Practice 3, 1 (2018).",
      "doi": ""
    },
    {
      "text": "Marisa Ponti, Igor Stankovic, Wolmet Barendregt, Bruno Kestemont, and Lyn Bain. 2018. Chefs know more than just recipes: professional vision in a citizen science game. Human Computation 5(2018), 1–12.",
      "doi": ""
    },
    {
      "text": "Fernando Portela. 2018. An unexpectedly effective Monte Carlo technique for the RNA inverse folding problem. BioRxiv (2018), 345587.",
      "doi": ""
    },
    {
      "text": "Nathan Prestopnik and Kevin Crowston. 2012. Purposeful gaming & socio-computational systems: a citizen science design case. In Proceedings of the 17th ACM international conference on Supporting group work. 75–84.",
      "doi": "10.1145/2389176.2389188"
    },
    {
      "text": "Nathan Prestopnik, Kevin Crowston, and Jun Wang. 2014. Exploring data quality in games with a purpose. iConference 2014 Proceedings(2014).",
      "doi": ""
    },
    {
      "text": "Nathan Prestopnik and Dania Souid. 2013. Forgotten island: a story-driven citizen science adventure. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. 2643–2646.",
      "doi": ""
    },
    {
      "text": "Nathan R Prestopnik and Kevin Crowston. 2012. Citizen science system assemblages: understanding the technologies that support crowdsourced science. In Proceedings of the 2012 iConference. 168–176.",
      "doi": "10.1145/2132176.2132198"
    },
    {
      "text": "Nathan R Prestopnik and Jian Tang. 2015. Points, stories, worlds, and diegesis: Comparing player experiences in two citizen science games. Computers in Human Behavior 52 (2015), 492–506.",
      "doi": "10.1016/j.chb.2015.05.051"
    },
    {
      "text": "Yu Qi Qiao, Jun Shen, Xiao Liang, Song Ding, Fang Yuan Chen, Li Shao, Qing Zheng, and Zhi Hua Ran. 2014. Using cognitive theory to facilitate medical education. BMC medical education 14, 1 (2014), 79.",
      "doi": ""
    },
    {
      "text": "Chris Quintana, Brian J Reiser, Elizabeth A Davis, Joseph Krajcik, Eric Fretz, Ravit Golan Duncan, Eleni Kyza, Daniel Edelson, and Elliot Soloway. 2004. A scaffolding design framework for software to support science inquiry. The journal of the learning sciences 13, 3 (2004), 337–386.",
      "doi": ""
    },
    {
      "text": "M Jordan Raddick, Georgia Bracey, Pamela L Gay, Chris J Lintott, Carie Cardamone, Phil Murray, Kevin Schawinski, Alexander S Szalay, and Jan Vandenberg. 2013. Galaxy Zoo: Motivations of citizen scientists. arXiv preprint arXiv:1303.6886(2013).",
      "doi": ""
    },
    {
      "text": "Janet Rafner, Miroslav Gajdacz, Gitte Kragh, Arthur Hjorth, Anna Gander, Blanka Palfi, Aleks Berditchevskaia, François Grey, Kobi Gal, Avi Segal, 2021. Revisiting Citizen Science Through the Lens of Hybrid Intelligence. arXiv preprint arXiv:2104.14961(2021).",
      "doi": ""
    },
    {
      "text": "Tzipora Rakedzon, Elad Segev, Noam Chapnik, Roy Yosef, and Ayelet Baram-Tsabari. 2017. Automatic jargon identifier for scientists engaging with the public and science communication educators. PloS one 12, 8 (2017), e0181742.",
      "doi": ""
    },
    {
      "text": "Neal Reeves, Peter West, and Elena Simperl. 2018. A game without competition is hardly a game”: The impact of competitions on player activity in a human computation game. In Sixth AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "C Reigeluth and R Stein. 1983. Elaboration theory. Instructional-design theories and models: An overview of their current status (1983) (1983), 335–381.",
      "doi": ""
    },
    {
      "text": "Dana Rotman, Jenny Preece, Jen Hammock, Kezee Procita, Derek Hansen, Cynthia Parr, Darcy Lewis, and David Jacobs. 2012. Dynamic changes in motivation in collaborative citizen-science projects. In Proceedings of the ACM 2012 conference on computer supported cooperative work. 217–226.",
      "doi": "10.1145/2145204.2145238"
    },
    {
      "text": "Thomas A Rowles. 2013. Power to the people: Does Eterna signal the arrival of a new wave of crowd-sourced projects?",
      "doi": ""
    },
    {
      "text": "Simone Rüfenacht, Tim Woods, Gaia Agnello, Margaret Gold, Philipp Hummer, Anne Land-Zandstra, and Andrea Sieber. 2021. Communication and Dissemination in Citizen Science. The Science of Citizen Science(2021), 475.",
      "doi": ""
    },
    {
      "text": "Fredrik Rusk, Matilda Ståhl, and Kenneth Silseth. 2020. Exploring Peer Mentoring and Learning Among Experts and Novices in Online in-Game Interactions. In Proceedings of the 14th International Conference on Game Based Learning, ed. P. Fotaris. 461–468.",
      "doi": ""
    },
    {
      "text": "Katie Salen, Katie Salen Tekinbaş, and Eric Zimmerman. 2004. Rules of play: Game design fundamentals. MIT press.",
      "doi": "10.5555/1215723"
    },
    {
      "text": "Henrik Schoenau-Fog. 2011. The Player Engagement Process-An Exploration of Continuation Desire in Digital Games.. In Proceedings of the DiGRA Conference.",
      "doi": ""
    },
    {
      "text": "Karen Schrier. 2016. Knowledge games: How playing games can solve problems, create insight, and make change. JHU Press.",
      "doi": ""
    },
    {
      "text": "Karen Schrier. 2017. Investigating typologies of games as research environments. In Proceedings of International Conference on the Foundations of Digital Games. 1–4.",
      "doi": ""
    },
    {
      "text": "Dale H Schunk. 2012. Learning theories an educational perspective sixth edition. Pearson.",
      "doi": ""
    },
    {
      "text": "Daniel L Schwartz and John D Bransford. 1998. A time for telling. Cognition and instruction 16, 4 (1998), 475–5223.",
      "doi": ""
    },
    {
      "text": "Hortense Serret, Nicolas Deguines, Yikweon Jang, Grégoire Lois, and Romain Julliard. 2019. Data quality and participant engagement in citizen science: comparing two approaches for monitoring pollinators in France and South Korea. Citizen Science: Theory and Practice 4, 1 (2019), 22.",
      "doi": ""
    },
    {
      "text": "Mike Sharples. 2009. Methods for evaluating mobile learning. Researching mobile learning: Frameworks, tools and research designs (2009), 17–39.",
      "doi": ""
    },
    {
      "text": "Jennifer L Shirk, Heidi L Ballard, Candie C Wilderman, Tina Phillips, Andrea Wiggins, Rebecca Jordan, Ellen McCallie, Matthew Minarchek, Bruce V Lewenstein, Marianne E Krasny, 2012. Public participation in scientific research: a framework for deliberate design. Ecology and society 17, 2 (2012).",
      "doi": ""
    },
    {
      "text": "Hillary C Shulman, Graham N Dixon, Olivia M Bullock, and Daniel Colón Amill. 2020. The effects of jargon on processing fluency, self-perceptions, and scientific engagement. Journal of Language and Social Psychology 39, 5-6 (2020), 579–597.",
      "doi": ""
    },
    {
      "text": "Nyet Moi Siew, Jolly Geofrey, and Bih Ni Lee. 2016. Students’ algebraic thinking and attitudes towards algebra: the effects of game-based learning using Dragonbox 12+ App. The Research Journal of Mathematics and Technology 5, 1 (2016), 66–79.",
      "doi": ""
    },
    {
      "text": "Artemis Skarlatidou, Alexandra Hamilton, Michalis Vitos, and Muki Haklay. 2019. What do volunteers want from citizen science technologies? A systematic literature review and best practice guidelines. JCOM: Journal of Science Communication 18, 1 (2019).",
      "doi": ""
    },
    {
      "text": "Helen Spiers, Alexandra Swanson, Lucy Fortson, Brooke Simmons, Laura Trouille, Samantha Blickhan, and Chris Lintott. 2019. Everyone counts? Design considerations in online citizen science. Journal of Science Communication 18, 1 (2019).",
      "doi": ""
    },
    {
      "text": "Kurt Squire. 2012. Designed Cultures. In Games, learning, and society: Learning and meaning in the digital age, Constance Steinkuehler, Kurt Squire, and Sasha Barab (Eds.). Cambridge University Press, Chapter 2.",
      "doi": ""
    },
    {
      "text": "Penelope Sweetser and Peta Wyeth. 2005. GameFlow: a model for evaluating player enjoyment in games. Computers in Entertainment (CIE) 3, 3 (2005), 3–3.",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "John Sweller. 2011. Cognitive load theory. In Psychology of learning and motivation. Vol. 55. Elsevier, 37–76.",
      "doi": ""
    },
    {
      "text": "Nick Paul Taylor. 2016. Gamers crush algorithms in RNA structure design challenge. https://www.fiercebiotech.com/r-d/gamers-crush-algorithms-rna-structure-design-challenge",
      "doi": ""
    },
    {
      "text": "Joseph J Thompson, Mark R Blair, Lihan Chen, and Andrew J Henrey. 2013. Video game telemetry as a critical tool in the study of complex skill learning. PloS one 8, 9 (2013), e75129.",
      "doi": ""
    },
    {
      "text": "Ramine Tinati, Markus Luczak-Roesch, Elena Simperl, and Wendy Hall. 2016. Because science is awesome: studying participation in a citizen science game. In Proceedings of the 8th ACM Conference on Web Science. 45–54.",
      "doi": "10.1145/2908131.2908151"
    },
    {
      "text": "Ramine Tinati, Markus Luczak-Roesch, Elena Simperl, and Wendy Hall. 2017. An investigation of player motivations in Eyewire, a gamified citizen science project. Computers in Human Behavior 73 (2017), 527–540.",
      "doi": "10.1016/j.chb.2016.12.074"
    },
    {
      "text": "Keith Topping and Stewart Ehly. 1998. Peer-assisted learning. Routledge.",
      "doi": ""
    },
    {
      "text": "Kathleen Tuite. 2014. GWAPs: Games with a problem.. In FDG.",
      "doi": ""
    },
    {
      "text": "TV Tropes contributors. 2020. Golden Path. Retrieved from https://tvtropes.org/pmwiki/pmwiki.php/Main/GoldenPath on January 5, 2021.",
      "doi": ""
    },
    {
      "text": "AlzheimersResearch UK. 2017. Sea Hero Quest VR - Walkthrough Video. Retrieved from https://www.youtube.com/watch?v=CcM6Yu9d4pM on December 2, 2021.",
      "doi": ""
    },
    {
      "text": "U.S. General Services Administration. 2018. EyeWire | A Game to Crowdsource Brain Mapping. https://www.citizenscience.gov/eyewire-brain-mapping/#",
      "doi": ""
    },
    {
      "text": "Krishna Teja Vaddepalli. 2019. Improving data quality in citizen science. (2019).",
      "doi": ""
    },
    {
      "text": "Jeroen JG Van Merriënboer. 1997. Training complex cognitive skills: A four-component instructional design model for technical training. Educational Technology.",
      "doi": ""
    },
    {
      "text": "Jeroen JG Van Merriënboer, Otto Jelsma, and Fred GWC Paas. 1992. Training for reflective expertise: A four-component instructional design model for complex cognitive skills. Educational Technology Research and Development 40, 2(1992), 23–43.",
      "doi": ""
    },
    {
      "text": "Jeroen JG Van Merriënboer and Liesbeth Kester. 2008. Whole-task models in education. Handbook of research on educational communications and technology 3 (2008), 441–456.",
      "doi": ""
    },
    {
      "text": "Jeroen JG Van Merriënboer and Liesbeth Kester. 2014. The four-component instructional design model: Multimedia principles in environments for complex learning.(2014).",
      "doi": ""
    },
    {
      "text": "Jeroen JG Van Merriënboer and Paul A Kirschner. 2017. Ten steps to complex learning: A systematic approach to four-component instructional design. Routledge.",
      "doi": ""
    },
    {
      "text": "Jeroen JG Van Merriënboer and Dominique MA Sluijsmans. 2009. Toward a synthesis of cognitive load theory, four-component instructional design, and self-directed learning. Educational Psychology Review 21, 1 (2009), 55–66.",
      "doi": ""
    },
    {
      "text": "Carina Maria Veeckman, Sarah Talboom, Liesbeth Gijsel, Hilde Devoghel, and Annelies Duerinckx. 2019. Communicatie bij burgerwetenschap: Een praktische handleiding voor communicatie en betrokkenheid bij citizen science. (2019).",
      "doi": ""
    },
    {
      "text": "Jérôme Waldispühl, Attila Szantner, Rob Knight, Sébastien Caisse, and Randy Pitchford. 2020. Leveling up citizen science. Nature Biotechnology 38, 10 (2020), 1124–1126.",
      "doi": ""
    },
    {
      "text": "Chih-Chien Wang and Yi-Shiu Chu. 2007. Harmonious passion and obsessive passion in playing online games. Social Behavior and Personality: an international journal 35, 7(2007), 997–1006.",
      "doi": ""
    },
    {
      "text": "Sarah Elizabeth West and Rachel Mary Pateman. 2016. Recruiting and retaining participants in citizen science: What can be learned from the volunteering literature?Citizen Science: Theory and Practice(2016).",
      "doi": ""
    },
    {
      "text": "Matthew M White. 2014. Learn to Play: Designing Tutorials for Video Games. CRC Press.",
      "doi": ""
    },
    {
      "text": "Andrea Wiggins and Kevin Crowston. 2011. From conservation to crowdsourcing: A typology of citizen science. In 2011 44th Hawaii international conference on system sciences. IEEE, 1–10.",
      "doi": "10.1109/HICSS.2011.207"
    },
    {
      "text": "Andrea Wiggins and Kevin Crowston. 2015. Surveying the citizen science landscape. First Monday (2015).",
      "doi": ""
    },
    {
      "text": "James Wootton. 2017. Decodoku: Quantum error rorrection as a simple puzzle game. In APS March Meeting Abstracts, Vol. 2017. V27–010.",
      "doi": ""
    },
    {
      "text": "James R Wootton. 2017. Getting the public involved in Quantum Error Correction. arXiv preprint arXiv:1712.09649(2017).",
      "doi": ""
    },
    {
      "text": "Binbin Zheng, Melissa Niiya, and Mark Warschauer. 2015. Wikis and collaborative learning in higher education. Technology, Pedagogy and Education 24, 3 (2015), 357–374.",
      "doi": ""
    }
  ]
}