{
  "doi": "10.1145/3491102.3502075",
  "title": "FlatMagic: Improving Flat Colorization through AI-driven Design for Digital Comic Professionals",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "Creating digital comics involves multiple stages, some creative and some menial. For example, coloring a comic requires a labor-intensive stage known as ‘flatting,’ or masking segments of continuous color, as well as creative shading, lighting, and stylization stages. The use of AI can automate the colorization process, but early efforts have revealed limitations—technical and UX—to full automation. Via a formative study of professionals, we identify flatting as a bottleneck and key target of opportunity for human-guided AI-driven automation. Based on this insight, we built FlatMagic, an interactive, AI-driven flat colorization support tool for Photoshop. Our user studies found that using FlatMagic significantly reduced professionals’ real and perceived effort versus their current practice. While participants effectively used FlatMagic, we also identified potential constraints in interactions with AI and partially automated workflows. We reflect on implications for comic-focused tools and the benefits and pitfalls of intermediate representations and partial automation in designing human-AI collaboration tools for professionals.",
  "tags": [
    "Human-AI collaboration",
    "digital comic colorization",
    "system for professionals",
    "automation and control",
    "Intermediate Representation"
  ],
  "authors": [
    {
      "name": "Chuan Yan",
      "institution": "George Mason University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659635529",
      "orcid": "missing"
    },
    {
      "name": "John Joon Young Chung",
      "institution": "University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659474867",
      "orcid": "missing"
    },
    {
      "name": "Yoon Kiheon",
      "institution": "Pusan National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238058",
      "orcid": "missing"
    },
    {
      "name": "Yotam Gingold",
      "institution": "George Mason University, United States",
      "img": "/do/10.1145/contrib-81314488646/rel-imgonly/yotamgingoldsquarepicture.jpg",
      "acmid": "81314488646",
      "orcid": "missing"
    },
    {
      "name": "Eytan Adar",
      "institution": "University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100589033",
      "orcid": "missing"
    },
    {
      "name": "Sungsoo Ray Hong",
      "institution": "George Mason University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659698065",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2020. Comic Book Market Size, Share & Industry Analysis, By Product Type, By Distribution Channel, and Regional Forecast 2021-2028. https://www.fortunebusinessinsights.com/comic-book-market-103903. Accessed: 2021-09-04.",
      "doi": ""
    },
    {
      "text": "Korea Creative Content Agency. 2020. Cartoon Industry White Paper. Ministry of Culture, Sports, and Tourism.",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N Bennett, Kori Inkpen, 2019. Guidelines for human-AI interaction. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Apple. 2021. Human Interface Guidelines - Machine Learning. https://developer.apple.com/design/human-interface-guidelines/machine-learning/overview/introduction/. Accessed: 2021-09-9.",
      "doi": ""
    },
    {
      "text": "Olivier Augereau, Motoi Iwata, and Koichi Kise. 2018. A survey of comics research in computer science. Journal of imaging 4, 7 (2018), 87.",
      "doi": ""
    },
    {
      "text": "H. G. Barrow, J. M. Tenenbaum, R. C. Bolles, and H. C. Wolf. 1977. Parametric Correspondence and Chamfer Matching: Two New Techniques for Image Matching. In Proceedings of the 5th International Joint Conference on Artificial Intelligence - Volume 2 (Cambridge, USA) (IJCAI’77). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, 659–663.",
      "doi": ""
    },
    {
      "text": "Luca Benedetti, Holger Winnemöller, Massimiliano Corsini, and Roberto Scopigno. 2014. Painting with Bob: assisted creativity for novices. In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM New York, NY, USA, New York, NY, USA, 419–428.",
      "doi": "10.1145/2642918.2647415"
    },
    {
      "text": "John Canny. 1986. A Computational Approach to Edge Detection. IEEE Transactions on Pattern Analysis and Machine Intelligence PAMI-8, 6(1986), 679–698. https://doi.org/10.1109/TPAMI.1986.4767851",
      "doi": "10.1109/TPAMI.1986.4767851"
    },
    {
      "text": "CELSYS. 2020. Clip Studio Paint Instruction Manual. https://www.clip-studio.com/site/gd_en/csp/userguide/csp_userguide/500_menu/500_menu_edit_autocolor.htm. Accessed: 2021-08-29.",
      "doi": ""
    },
    {
      "text": "CELSYS. 2021. Clip Studio Paint. https://www.clipstudio.net/. Accessed: 2021-09-04.",
      "doi": ""
    },
    {
      "text": "Siddhartha Chaudhuri and Vladlen Koltun. 2010. Data-driven suggestions for creativity support in 3D modeling. In ACM SIGGRAPH Asia 2010 papers. ACM New York, NY, USA, New York, NY, USA, 1–10.",
      "doi": ""
    },
    {
      "text": "Zezhou Cheng, Qingxiong Yang, and Bin Sheng. 2015. Deep Colorization. In Proceedings of the 2015 IEEE International Conference on Computer Vision (ICCV)(ICCV ’15). IEEE Computer Society, USA, 415–423. https://doi.org/10.1109/ICCV.2015.55",
      "doi": ""
    },
    {
      "text": "Parmit K Chilana, Andrew J Ko, and Jacob Wobbrock. 2015. From user-centered to adoption-centered design: a case study of an HCI research innovation becoming a product. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1749–1758.",
      "doi": "10.1145/2702123.2702412"
    },
    {
      "text": "John Joon Young Chung, Shiqing He, and Eytan Adar. 2021. The Intersection of Users, Roles, Interactions, and Technologies in Creativity Support Tools. Association for Computing Machinery, New York, NY, USA, 1817–1833. https://doi.org/10.1145/3461778.3462050",
      "doi": ""
    },
    {
      "text": "Nicholas Davis, Chih-PIn Hsiao, Kunwar Yashraj Singh, Lisa Li, Sanat Moningi, and Brian Magerko. 2015. Drawing apprentice: An enactive co-creative agent for artistic collaboration. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition. 185–186.",
      "doi": "10.1145/2757226.2764555"
    },
    {
      "text": "Nicholas Davis, Chih-Pin Hsiao, Kunwar Yashraj Singh, Lisa Li, and Brian Magerko. 2016. Empirically studying participatory sense-making in abstract drawing with a co-creative cognitive agent. In Proceedings of the 21st International Conference on Intelligent User Interfaces. 196–207.",
      "doi": "10.1145/2856767.2856795"
    },
    {
      "text": "Paul M Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology 47, 6 (1954), 381–391. https://doi.org/10.1037/h0055392",
      "doi": ""
    },
    {
      "text": "Krita Foundation. 2012. Krita. https://krita.org/ Accessed: 2021-08-11.",
      "doi": ""
    },
    {
      "text": "Sébastien Fourey, David Tschumperlé, and David Revoy. 2018. A Fast and Efficient Semi-guided Algorithm for Flat Coloring Line-arts. (2018).",
      "doi": ""
    },
    {
      "text": "Jonas Frich, Lindsay MacDonald Vermeulen, Christian Remy, Michael Mose Biskjaer, and Peter Dalsgaard. 2019. Mapping the landscape of creativity support tools in HCI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3290605.3300619"
    },
    {
      "text": "Chie Furusawa, Kazuyuki Hiroshiba, Keisuke Ogaki, and Yuri Odagiri. 2017. Comicolorization: Semi-Automatic Manga Colorization. In SIGGRAPH Asia 2017 Technical Briefs (Bangkok, Thailand) (SA ’17). Association for Computing Machinery, New York, NY, USA, Article 12, 4 pages. https://doi.org/10.1145/3145749.3149430",
      "doi": "10.1145/3145749.3149430"
    },
    {
      "text": "Nettrice Gaskins. 2017. Mind Drawing: Shantell Martin and the Algorist. http://magazine.art21.org/2017/07/06/machine-drawing-shantell-martin-and-the-algorist/. Accessed:2021-09-14.",
      "doi": ""
    },
    {
      "text": "GIMP. 2021. GNU Image Manipulation Program. https://www.gimp.org/. Accessed: 2021-09-04.",
      "doi": ""
    },
    {
      "text": "Google. 2019. People + AI Guidebook. https://pair.withgoogle.com/",
      "doi": ""
    },
    {
      "text": "Mingming He, Dongdong Chen, Jing Liao, Pedro V Sander, and Lu Yuan. 2018. Deep exemplar-based colorization. ACM Transactions on Graphics 37, 4 (2018). https://doi.org/10.1145/3197517.3201365 arxiv:1807.06587",
      "doi": "10.1145/3197517.3201365"
    },
    {
      "text": "Jeffrey Heer. 2019. Agency plus automation: Designing artificial intelligence into interactive systems. Proceedings of the National Academy of Sciences 116, 6 (2019), 1844–1850.",
      "doi": ""
    },
    {
      "text": "Scott E Hudson and Jennifer Mankoff. 2014. Concepts, values, and methods for technical human–computer interaction research. In Ways of Knowing in HCI. Springer, 69–93.",
      "doi": ""
    },
    {
      "text": "Satoshi Iizuka, Edgar Simo-Serra, and Hiroshi Ishikawa. 2016. Let there be color!: Joint end-to-end learning of global and local image priors for automatic image colorization with simultaneous classification. In ACM Transactions on Graphics, Vol. 35. https://doi.org/10.1145/2897824.2925974",
      "doi": ""
    },
    {
      "text": "Phillip Isola, Jun Yan Zhu, Tinghui Zhou, and Alexei A. Efros. 2017. Image-to-image translation with conditional adversarial networks. In Proceedings - 30th IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2017, Vol. 2017-Janua. 5967–5976. https://doi.org/10.1109/CVPR.2017.632 arXiv:1611.07004",
      "doi": ""
    },
    {
      "text": "Jennifer Jacobs, Joel Brandt, Radomír Mech, and Mitchel Resnick. 2018. Extending manual drawing practices with artist-centric programming tools. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3174164"
    },
    {
      "text": "Eungyeup Kim, Sanghyeon Lee, Jeonghoon Park, Somi Choi, Choonghyun Seo, and Jaegul Choo. 2021. Deep Edge-Aware Interactive Colorization against Color-Bleeding Effects. (jul 2021). arxiv:2107.01619http://arxiv.org/abs/2107.01619",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research methods in human-computer interaction. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Junsoo Lee, Eungyeup Kim, Yunsung Lee, Dongjun Kim, Jaehyuk Chang, and Jaegul Choo. 2020. Reference-based sketch image colorization using augmented-self reference and dense semantic correspondence. In Proceedings of the IEEE Computer Society Conference on Computer Vision and Pattern Recognition. 5800–5809. https://doi.org/10.1109/CVPR42600.2020.00584 arXiv:2005.05207",
      "doi": ""
    },
    {
      "text": "Anat Levin, Dani Lischinski, and Yair Weiss. 2004. Colorization Using Optimization. ACM Trans. Graph. 23, 3 (Aug. 2004), 689–694. https://doi.org/10.1145/1015706.1015780",
      "doi": "10.1145/1015706.1015780"
    },
    {
      "text": "Sarah Lewis. 2015. Qualitative inquiry and research design: Choosing among five approaches. Health promotion practice 16, 4 (2015), 473–475.",
      "doi": ""
    },
    {
      "text": "Joseph Lindley, Paul Coulton, and Miriam Sturdee. 2017. Implications for adoption. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 265–277.",
      "doi": "10.1145/3025453.3025742"
    },
    {
      "text": "Xiaopei Liu, Liang Wan, Yingge Qu, Tien Tsin Wong, Stephen Lin, Chi Sing Leung, and Pheng Ann Heng. 2008. Intrinsic colorization. In ACM SIGGRAPH Asia 2008 Papers, SIGGRAPH Asia’08. https://doi.org/10.1145/1457515.1409105",
      "doi": ""
    },
    {
      "text": "Brian Lubars and Chenhao Tan. 2019. Ask not what AI can do, but what AI should do: Towards a framework of task delegability. arXiv preprint arXiv:1902.03245(2019).",
      "doi": ""
    },
    {
      "text": "Pattie Maes. 1994. Agents That Reduce Work and Information Overload. Commun. ACM 37, 7 (July 1994), 30–40. https://doi.org/10.1145/176789.176792",
      "doi": "10.1145/176789.176792"
    },
    {
      "text": "Justin Matejka, Michael Glueck, Erin Bradner, Ali Hashemi, Tovi Grossman, and George Fitzmaurice. 2018. Dream lens: Exploration and visualization of large-scale generative design datasets. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3173574.3173943"
    },
    {
      "text": "Fabrice Matulic. 2018. ColourAIze: AI-Driven Colourisation of Paper Drawings with Interactive Projection System. In Proceedings of the 2018 ACM International Conference on Interactive Surfaces and Spaces. 273–278.",
      "doi": "10.1145/3279778.3279785"
    },
    {
      "text": "Changhoon Oh, Jungwoo Song, Jinhan Choi, Seonghyeon Kim, Sungwoo Lee, and Bongwon Suh. 2018. I Lead, You Help but Only with Enough Details: Understanding User Experience of Co-Creation with Artificial Intelligence. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174223",
      "doi": "10.1145/3173574.3174223"
    },
    {
      "text": "Amal Dev Parakkat, Prudhviraj Madipally, Hari Hara Gowtham, and Marie-Paule Cani. 2020. Interactive Flat Coloring of Minimalist Neat Sketches. (may 2020).",
      "doi": ""
    },
    {
      "text": "Yingge Qu, Tien-Tsin Wong, and Pheng-Ann Heng. 2006. Manga Colorization. In ACM SIGGRAPH 2006 Papers (Boston, Massachusetts) (SIGGRAPH ’06). Association for Computing Machinery, New York, NY, USA, 1214–1220. https://doi.org/10.1145/1179352.1142017",
      "doi": ""
    },
    {
      "text": "Olaf Ronneberger, Philipp Fischer, and Thomas Brox. 2015. U-Net: Convolutional Networks for Biomedical Image Segmentation. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). Vol. 9351. 234–241. https://doi.org/10.1007/978-3-319-24574-4_28 arXiv:1505.04597",
      "doi": ""
    },
    {
      "text": "Quentin Roy, Futian Zhang, and Daniel Vogel. 2019. Automation Accuracy Is Good, but High Controllability May Be Better. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3290605.3300750",
      "doi": "10.1145/3290605.3300750"
    },
    {
      "text": "Johnny Saldaña. 2015. The coding manual for qualitative researchers. Sage.",
      "doi": ""
    },
    {
      "text": "Yang Shi, Nan Cao, Xiaojuan Ma, Siji Chen, and Pei Liu. 2020. EmoG: Supporting the Sketching of Emotional Expressions for Storyboarding. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376520",
      "doi": "10.1145/3313831.3376520"
    },
    {
      "text": "Ben Shneiderman. 2020. Human-centered artificial intelligence: Three fresh ideas. AIS Transactions on Human-Computer Interaction 12, 3(2020), 109–124.",
      "doi": ""
    },
    {
      "text": "Edgar Simo-Serra, Satoshi Iizuka, Kazuma Sasaki, and Hiroshi Ishikawa. 2016. Learning to simplify: Fully convolutional networks for rough sketch cleanup. ACM Transactions on Graphics 35, 4 (jul 2016), 1–11. https://doi.org/10.1145/2897824.2925972",
      "doi": "10.1145/2897824.2925972"
    },
    {
      "text": "Statista. [n.d.]. Sales value of digital comics in Japan from fiscal year 2014 to 2020. https://www.statista.com/statistics/1119858/japan-e-comics-market-size/. Accessed: 2021-08-15.",
      "doi": ""
    },
    {
      "text": "Statista. [n.d.]. Sales value of digital comics in Japan from fiscal year 2014 to 2020. https://www.statista.com/statistics/1119858/japan-e-comics-market-size/. Accessed: 2021-08-15.",
      "doi": ""
    },
    {
      "text": "Jheng Wei Su, Hung Kuo Chu, and Jia Bin Huang. 2020. Instance-aware image colorization. In Proceedings of the IEEE Computer Society Conference on Computer Vision and Pattern Recognition. 7965–7974. https://doi.org/10.1109/CVPR42600.2020.00799 arxiv:2005.10825",
      "doi": ""
    },
    {
      "text": "Daniel Sýkora, John Dingliana, and Steven Collins. 2009. LazyBrush: Flexible Painting Tool for Hand-drawn Cartoons. Computer Graphics Forum 28, 2 (2009), 599–608. https://doi.org/10.1111/j.1467-8659.2009.01400.x arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1467-8659.2009.01400.x",
      "doi": ""
    },
    {
      "text": "TaiZan. 2021. Petalica Paint: AI-powered Automatic Colorization. https://petalica-paint.pixiv.dev/index_en.html Accessed: 2021-02-25.",
      "doi": ""
    },
    {
      "text": "Viswanath Venkatesh, Michael G Morris, Gordon B Davis, and Fred D Davis. 2003. User acceptance of information technology: Toward a unified view. MIS quarterly (2003), 425–478.",
      "doi": "10.5555/2017197.2017202"
    },
    {
      "text": "Naver Webtoon. 2022. PWebtoon AI Painter. https://ai.webtoons.com/painter Accessed: 2022-01-01.",
      "doi": ""
    },
    {
      "text": "WelshTomihisa, AshikhminMichael, and MuellerKlaus. 2002. Transferring color to greyscale images. ACM Transactions on Graphics (TOG) 21, 3 (jul 2002), 277–280. https://doi.org/10.1145/566654.566576",
      "doi": ""
    },
    {
      "text": "Yanze Wu, Xintao Wang, Yu Li, Honglun Zhang, Xun Zhao, and Ying Shan. 2021. Towards Vivid and Diverse Image Colorization with Generative Color Prior. (aug 2021). arxiv:2108.08826http://arxiv.org/abs/2108.08826",
      "doi": ""
    },
    {
      "text": "Jun Xie, Holger Winnemöller, Wilmot Li, and Stephen Schiller. 2017. Interactive Vectorization. Association for Computing Machinery, New York, NY, USA, 6695–6705. https://doi.org/10.1145/3025453.3025872",
      "doi": ""
    },
    {
      "text": "Lvmin Zhang, Yi Ji, and Chunping Liu. 2020. DanbooRegion: An Illustration Region Dataset. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), Vol. 12358 LNCS. 137–154. https://doi.org/10.1007/978-3-030-58601-0_9",
      "doi": ""
    },
    {
      "text": "Lvmin Zhang, Chengze Li, Edgar Simo-Serra, Yi Ji, Tien-Tsin Wong, and Chunping Liu. 2021. User-Guided Line Art Flat Filling with Split Filling Mechanism. In IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR).",
      "doi": ""
    },
    {
      "text": "Lvmin Zhang, Chengze Li, Tien-Tsin Wong, Yi Ji, and Chunping Liu. 2018. Two-Stage Sketch Colorization. ACM Trans. Graph. 37, 6, Article 261 (Dec. 2018), 14 pages. https://doi.org/10.1145/3272127.3275090",
      "doi": "10.1145/3272127.3275090"
    },
    {
      "text": "Richard Zhang, Jun Yan Zhu, Phillip Isola, Xinyang Geng, Angela S. Lin, Tianhe Yu, and Alexei A. Efros. 2017. Real-time user-guided image colorization with learned deep priors. ACM Transactions on Graphics 36, 4 (may 2017). https://doi.org/10.1145/3072959.3073703 arXiv:1705.02999",
      "doi": "10.1145/3072959.3073710"
    },
    {
      "text": "Song Hai Zhang, Tao Chen, Yi Fei Zhang, Shi Min Hu, and Ralph R Martin. 2009. Vectorizing cartoon animations. IEEE Transactions on Visualization and Computer Graphics 15, 4(2009), 618–629. https://doi.org/10.1109/TVCG.2009.9",
      "doi": "10.1109/TVCG.2009.9"
    },
    {
      "text": "Nanxuan Zhao, Nam Wook Kim, Laura Mariah Herman, Hanspeter Pfister, Rynson WH Lau, Jose Echevarria, and Zoya Bylinskii. 2020. Iconate: Automatic compound icon generation and ideation. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376618"
    }
  ]
}