{
  "doi": "10.1145/3491102.3501957",
  "title": "Recruiting Participants With Programming Skills: A Comparison of Four Crowdsourcing Platforms and a CS Student Mailing List",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Reliably recruiting participants with programming skills is an ongoing challenge for empirical studies involving software development technologies, often leading to the use of crowdsourcing platforms and computer science (CS) students. In this work, we use five existing survey instruments to explore the programming skills, privacy and security attitudes, and secure development self-efficacy of participants from a CS student mailing list and four crowdsourcing platforms (Appen, Clickworker, MTurk, and Prolific). We recruited 613 participants who claimed to have programming skills and assessed recruitment channels regarding costs, quality, programming skills, as well as privacy and security attitudes. We find that 27% of crowdsourcing participants, 40% of crowdsourcing participants who self-report to be developers, and 89% of CS students answered all programming skill questions correctly. CS students were the most cost-effective recruitment channel and rated themselves lower than crowdsourcing participants about secure development self-efficacy.",
  "tags": [
    "crowdsourcing",
    "datasets",
    "usable privacy and security",
    "programming",
    "developers",
    "recruitment",
    "empirical software engineering"
  ],
  "authors": [
    {
      "name": "Mohammad Tahaei",
      "institution": "Department of Computer Science, University of Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-99659444566/rel-imgonly/aa6a4598.jpeg",
      "acmid": "99659444566",
      "orcid": "0000-0001-9666-2663"
    },
    {
      "name": "Kami Vaniea",
      "institution": "School of Informatics, University of Edinburgh, United Kingdom",
      "img": "/do/10.1145/contrib-81335498861/rel-imgonly/81335498861.jpg",
      "acmid": "81335498861",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Julio Angulo and Martin Ortlieb. 2015. “WTH..!?!” Experiences, Reactions, and Expectations Related to Online Privacy Panic Situations. In Eleventh Symposium On Usable Privacy and Security (SOUPS 2015). USENIX Association, Ottawa, 19–38. https://www.usenix.org/conference/soups2015/proceedings/presentation/angulo",
      "doi": ""
    },
    {
      "text": "Appen. 2021. Confidence to Deploy AI with World-Class Training Data. Retrieved August 2021 from https://appen.com",
      "doi": ""
    },
    {
      "text": "Antonio A. Arechar and David G. Rand. 2021. Turking in the time of COVID. Behavior Research Methods 53, 6 (Dec. 2021), 2591–2595. https://doi.org/10.3758/s13428-021-01588-4",
      "doi": ""
    },
    {
      "text": "Hala Assal and Sonia Chiasson. 2019. ‘Think Secure from the Beginning’: A Survey with Software Developers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300519",
      "doi": "10.1145/3290605.3300519"
    },
    {
      "text": "Steven Bellman, Eric J. Johnson, Stephen J. Kobrin, and Gerald L. Lohse. 2004. International Differences in Information Privacy Concerns: A Global Survey of Consumers. The Information Society 20, 5 (2004), 313–324. https://doi.org/10.1080/01972240490507956",
      "doi": ""
    },
    {
      "text": "Karoline Busse, Mohammad Tahaei, Katharina Krombholz, Emanuel von Zezschwitz, Matthew Smith, Jing Tian, and Wenyuan Xu. 2020. Cash, Cards or Cryptocurrencies? A Study of Payment Culture in Four Countries. In 2020 IEEE European Symposium on Security and Privacy Workshops (EuroS PW). IEEE, 200–209. https://doi.org/10.1109/EuroSPW51379.2020.00035",
      "doi": ""
    },
    {
      "text": "James Carifio and Rocco Perla. 2008. Resolving the 50-year debate around using and misusing Likert scales. Medical Education 42, 12 (Dec. 2008), 1150–1152. https://doi.org/10.1111/j.1365-2923.2008.03172.x",
      "doi": ""
    },
    {
      "text": "Technische Universität Chemnitz. 2021. Measuring Programming Experience. Retrieved September 2021 from https://www.tu-chemnitz.de/informatik/ST/research/material/PE/",
      "doi": ""
    },
    {
      "text": "Clickworker. 2021. AI Training Data and other Data Management Services. Retrieved August 2021 from https://clickworker.com",
      "doi": ""
    },
    {
      "text": "Anastasia Danilova, Alena Naiakshina, Stefan Horstmann, and Matthew Smith. 2021. Do you Really Code? Designing and Evaluating Screening Questions for Online Surveys with Programmers. In 2021 IEEE/ACM 43rd International Conference on Software Engineering (ICSE). IEEE Computer Society, Los Alamitos, CA, USA, 537–548. https://doi.org/10.1109/ICSE43902.2021.00057",
      "doi": ""
    },
    {
      "text": "Anastasia Danilova, Alena Naiakshina, and Matthew Smith. 2020. One Size Does Not Fit All: A Grounded Theory and Online Survey Study of Developer Preferences for Security Warning Types. In Proceedings of the 42nd International Conference on Software Engineering(ICSE ’20). Association for Computing Machinery, 13 pages. https://doi.org/10.1145/3377811.3380387",
      "doi": "10.1145/3377811.3380387"
    },
    {
      "text": "Times Higher Education. 2021. World University Rankings 2021 by subject: computer science. Retrieved September 2021 from https://www.timeshighereducation.com/world-university-rankings/2021/subject-ranking/computer-science",
      "doi": ""
    },
    {
      "text": "Serge Egelman, Marian Harbach, and Eyal Peer. 2016. Behavior Ever Follows Intention? A Validation of the Security Behavior Intentions Scale (SeBIS). Association for Computing Machinery, New York, NY, USA, 5257–5261. https://doi.org/10.1145/2858036.2858265",
      "doi": ""
    },
    {
      "text": "Serge Egelman and Eyal Peer. 2015. Scaling the Security Wall: Developing a Security Behavior Intentions Scale (SeBIS). In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2873–2882. https://doi.org/10.1145/2702123.2702249",
      "doi": "10.1145/2702123.2702249"
    },
    {
      "text": "Davide Falessi, Natalia Juristo, Claes Wohlin, Burak Turhan, Jürgen Münch, Andreas Jedlitschka, and Markku Oivo. 2018. Empirical software engineering experts on the use of students and professionals in experiments. Empirical Software Engineering 23, 1 (Feb. 2018), 452–489. https://doi.org/10.1007/s10664-017-9523-3",
      "doi": "10.1007/s10664-017-9523-3"
    },
    {
      "text": "Janet Feigenspan, Christian Kästner, Jörg Liebig, Sven Apel, and Stefan Hanenberg. 2012. Measuring programming experience. In 2012 20th IEEE International Conference on Program Comprehension (ICPC). IEEE, Passau, Germany, 73–82. https://doi.org/10.1109/ICPC.2012.6240511",
      "doi": ""
    },
    {
      "text": "Robert Feldt, Thomas Zimmermann, Gunnar R. Bergersen, Davide Falessi, Andreas Jedlitschka, Natalia Juristo, Jürgen Münch, Markku Oivo, Per Runeson, Martin Shepperd, Dag I. K. Sjøberg, and Burak Turhan. 2018. Four commentaries on the use of students and professionals in empirical software engineering experiments. Empirical Software Engineering 23, 6 (Dec. 2018), 3801–3820. https://doi.org/10.1007/s10664-018-9655-0",
      "doi": "10.1007/s10664-018-9655-0"
    },
    {
      "text": "The R Foundation. 2021. Fitting Generalized Linear Models. Retrieved August 2021 from https://search.r-project.org/R/refmans/stats/html/glm.html",
      "doi": ""
    },
    {
      "text": "Sandra Gabriele and Sonia Chiasson. 2020. Understanding Fitness Tracker Users’ Security and Privacy Knowledge, Attitudes and Behaviours. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376651",
      "doi": "10.1145/3313831.3376651"
    },
    {
      "text": "GitHub. 2021. GitHub Acceptable Use Policies - GitHub Docs. Retrieved November 2021 from https://docs.github.com/en/github/site-policy/github-acceptable-use-policies#6-information-usage-restrictions",
      "doi": ""
    },
    {
      "text": "GitHub. 2021. GitHub Privacy Statement - GitHub Docs. Retrieved November 2021 from https://docs.github.com/en/github/site-policy/github-privacy-statement#public-information-on-github",
      "doi": ""
    },
    {
      "text": "Peter Leo Gorski, Luigi Lo Iacono, Dominik Wermke, Christian Stransky, Sebastian Möller, Yasemin Acar, and Sascha Fahl. 2018. Developers Deserve Security Warnings, Too: On the Effect of Integrated Security Advice on Cryptographic API Misuse. In Fourteenth Symposium on Usable Privacy and Security (SOUPS 2018). USENIX Association, Baltimore, MD, 265–281. https://www.usenix.org/conference/soups2018/presentation/gorski",
      "doi": "10.5555/3291228.3291250"
    },
    {
      "text": "Margaret Gratian, Sruthi Bandi, Michel Cukier, Josiah Dykstra, and Amy Ginther. 2018. Correlating human traits and cyber security behavior intentions. Computers & Security 73(2018), 345–358. https://doi.org/10.1016/j.cose.2017.11.015",
      "doi": ""
    },
    {
      "text": "Lee Hadlington. 2017. Human factors in cybersecurity; examining the link between Internet addiction, impulsivity, attitudes towards cybersecurity, and risky cybersecurity behaviours. Heliyon 3, 7 (2017), e00346. https://doi.org/10.1016/j.heliyon.2017.e00346",
      "doi": ""
    },
    {
      "text": "Joseph Hallett, Nikhil Patnaik, Benjamin Shreeve, and Awais Rashid. 2021. “Do this! Do that!, and Nothing will Happen” Do Specifications Lead to Securely Stored Passwords?. In 2021 IEEE/ACM 43rd International Conference on Software Engineering (ICSE). IEEE, 486–498. https://doi.org/10.1109/ICSE43902.2021.00053",
      "doi": "10.1109/ICSE43902.2021.00053"
    },
    {
      "text": "Roberto Hoyle, Srijita Das, Apu Kapadia, Adam J. Lee, and Kami Vaniea. 2017. Was My Message Read? Privacy and Signaling on Facebook Messenger. Association for Computing Machinery, New York, NY, USA, 3838–3842. https://doi.org/10.1145/3025453.3025925",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman. 2011. Thinking, fast and slow. Farrar, Straus and Giroux, New York.",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Stephanie Brown, Laura Dabbish, and Sara Kiesler. 2014. Privacy Attitudes of Mechanical Turk Workers and the U.S. Public. In Proceedings of the Tenth USENIX Conference on Usable Privacy and Security (Menlo Park, CA) (SOUPS ’14). USENIX Association, USA, 37–49. https://www.usenix.org/conference/soups2014/proceedings/presentation/kang",
      "doi": "10.5555/3235838.3235842"
    },
    {
      "text": "Maurits Clemens Kaptein, Clifford Nass, and Panos Markopoulos. 2010. Powerful and Consistent Analysis of Likert-Type Ratingscales. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 2391–2394. https://doi.org/10.1145/1753326.1753686",
      "doi": "10.1145/1753326.1753686"
    },
    {
      "text": "Amy J. Ko, Robin Abraham, Laura Beckwith, Alan Blackwell, Margaret Burnett, Martin Erwig, Chris Scaffidi, Joseph Lawrance, Henry Lieberman, Brad Myers, Mary Beth Rosson, Gregg Rothermel, Mary Shaw, and Susan Wiedenbeck. 2011. The State of the Art in End-User Software Engineering. Comput. Surveys 43, 3, Article 21 (April 2011), 44 pages. https://doi.org/10.1145/1922649.1922658",
      "doi": ""
    },
    {
      "text": "Amy J. Ko, Thomas D. LaToza, and Margaret M. Burnett. 2015. A practical guide to controlled experiments of software engineering tools with human participants. Empirical Software Engineering 20, 1 (Feb. 2015), 110–141. https://doi.org/10.1007/s10664-013-9279-3",
      "doi": "10.1007/s10664-013-9279-3"
    },
    {
      "text": "Amy J. Ko, Brad A. Myers, Michael J. Coblenz, and Htet Htet Aung. 2006. An Exploratory Study of How Developers Seek, Relate, and Collect Relevant Information during Software Maintenance Tasks. IEEE Transactions on Software Engineering 32, 12 (2006), 971–987. https://doi.org/10.1109/TSE.2006.116",
      "doi": "10.1109/TSE.2006.116"
    },
    {
      "text": "Oksana Kulyk, Benjamin Reinheimer, Lukas Aldag, Peter Mayer, Nina Gerber, and Melanie Volkamer. 2020. Security and Privacy Awareness in Smart Environments – A Cross-Country Investigation. In Financial Cryptography and Data Security, Matthew Bernhard, Andrea Bracciali, L. Jean Camp, Shin’ichiro Matsuo, Alana Maurushat, Peter B. Rønne, and Massimiliano Sala (Eds.). Springer International Publishing, Cham, 84–101. https://doi.org/10.1007/978-3-030-54455-3_7",
      "doi": ""
    },
    {
      "text": "Naresh K. Malhotra, Sung S. Kim, and James Agarwal. 2004. Internet Users’ Information Privacy Concerns (IUIPC): The Construct, the Scale, and a Causal Model. Information Systems Research 15, 4 (2004), 336–355. https://doi.org/10.1287/isre.1040.0032",
      "doi": "10.1287/isre.1040.0032"
    },
    {
      "text": "Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon’s Mechanical Turk. Behavior Research Methods 44, 1 (March 2012), 1–23. https://doi.org/10.3758/s13428-011-0124-6",
      "doi": ""
    },
    {
      "text": "Peter Mayer, Nina Gerber, Benjamin Reinheimer, Philipp Rack, Kristoffer Braun, and Melanie Volkamer. 2019. I (Don’t) See What You Typed There! Shoulder-Surfing Resistant Password Entry on Gamepads. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300779",
      "doi": ""
    },
    {
      "text": "Hendrik Meutzner, Santosh Gupta, and Dorothea Kolossa. 2015. Constructing Secure Audio CAPTCHAs by Exploiting Differences between Humans and Machines. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2335–2338. https://doi.org/10.1145/2702123.2702127",
      "doi": "10.1145/2702123.2702127"
    },
    {
      "text": "Jenny Morales, Cristian Rusu, Federico Botella, and Daniela Quiñones. 2019. Programmer eXperience: A Systematic Literature Review. IEEE Access 7(2019), 71079–71094. https://doi.org/10.1109/ACCESS.2019.2920124",
      "doi": ""
    },
    {
      "text": "Brad A. Myers, Amy J. Ko, Thomas D. LaToza, and YoungSeok Yoon. 2016. Programmers Are Users Too: Human-Centered Methods for Improving Programming Tools. Computer 49, 7 (2016), 44–52. https://doi.org/10.1109/MC.2016.200",
      "doi": ""
    },
    {
      "text": "Alena Naiakshina, Anastasia Danilova, Eva Gerlitz, and Matthew Smith. 2020. On Conducting Security Developer Studies with CS Students: Examining a Password-Storage Study with CS Students, Freelancers, and Company Developers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376791",
      "doi": "10.1145/3313831.3376791"
    },
    {
      "text": "Alena Naiakshina, Anastasia Danilova, Eva Gerlitz, Emanuel von Zezschwitz, and Matthew Smith. 2019. “If You Want, I Can Store the Encrypted Password”: A Password-Storage Field Study with Freelance Developers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland UK) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300370",
      "doi": "10.1145/3290605.3300370"
    },
    {
      "text": "Alena Naiakshina, Anastasia Danilova, Christian Tiefenau, Marco Herzog, Sergej Dechand, and Matthew Smith. 2017. Why Do Developers Get Password Storage Wrong? A Qualitative Usability Study. In Proceedings of the 2017 ACM SIGSAC Conference on Computer and Communications Security(Dallas, Texas, USA) (CCS ’17). Association for Computing Machinery, New York, NY, USA, 311–328. https://doi.org/10.1145/3133956.3134082",
      "doi": "10.1145/3133956.3134082"
    },
    {
      "text": "Alena Naiakshina, Anastasia Danilova, Christian Tiefenau, and Matthew Smith. 2018. Deception Task Design in Developer Password Studies: Exploring a Student Sample. In Fourteenth Symposium on Usable Privacy and Security (SOUPS 2018). USENIX Association, Baltimore, MD, 297–313. https://www.usenix.org/conference/soups2018/presentation/naiakshina",
      "doi": ""
    },
    {
      "text": "Eyal Peer, Laura Brandimarte, Sonam Samat, and Alessandro Acquisti. 2017. Beyond the Turk: Alternative platforms for crowdsourcing behavioral research. Journal of Experimental Social Psychology 70 (2017), 153–163. https://doi.org/10.1016/j.jesp.2017.01.006",
      "doi": ""
    },
    {
      "text": "Eyal Peer, Joachim Vosgerau, and Alessandro Acquisti. 2014. Reputation as a sufficient condition for data quality on Amazon Mechanical Turk. Behavior Research Methods 46, 4 (Dec. 2014), 1023–1031. https://doi.org/10.3758/s13428-013-0434-y",
      "doi": ""
    },
    {
      "text": "Prolific. 2021. Online participant recruitment for surveys and market research. Retrieved August 2021 from https://www.prolific.co",
      "doi": ""
    },
    {
      "text": "Qualtrics. 2021. Fraud Detection. Retrieved September 2021 from https://www.qualtrics.com/support/survey-platform/survey-module/survey-checker/fraud-detection/#RelevantID",
      "doi": ""
    },
    {
      "text": "Qualtrics. 2021. Qualtrics XM - The Leading Experience Management Software. Retrieved September 2021 from https://www.qualtrics.com",
      "doi": ""
    },
    {
      "text": "Jonathan Robinson, Cheskie Rosenzweig, Aaron J. Moss, and Leib Litman. 2019. Tapped out or barely tapped? Recommendations for how to harness the vast and largely unused potential of the Mechanical Turk participant pool. PLOS ONE 14, 12 (12 2019), 1–29. https://doi.org/10.1371/journal.pone.0226394",
      "doi": ""
    },
    {
      "text": "Manaswi Saha, Michael Saugstad, Hanuma Teja Maddali, Aileen Zeng, Ryan Holland, Steven Bower, Aditya Dash, Sage Chen, Anthony Li, Kotaro Hara, and Jon Froehlich. 2019. Project Sidewalk: A Web-Based Crowdsourcing Tool for Collecting Sidewalk Accessibility Data At Scale. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300292",
      "doi": "10.1145/3290605.3300292"
    },
    {
      "text": "Iflaah Salman, Ayse Tosun Misirli, and Natalia Juristo. 2015. Are Students Representatives of Professionals in Software Engineering Experiments?. In 2015 IEEE/ACM 37th IEEE International Conference on Software Engineering, Vol. 1. IEEE, 666–676. https://doi.org/10.1109/ICSE.2015.82",
      "doi": ""
    },
    {
      "text": "Shruti Sannon and Dan Cosley. 2019. Privacy, Power, and Invisible Labor on Amazon Mechanical Turk. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300512",
      "doi": ""
    },
    {
      "text": "Yukiko Sawaya, Mahmood Sharif, Nicolas Christin, Ayumu Kubota, Akihiro Nakarai, and Akira Yamada. 2017. Self-Confidence Trumps Knowledge: A Cross-Cultural Study of Security Behavior. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 2202–2214. https://doi.org/10.1145/3025453.3025926",
      "doi": "10.1145/3025453.3025926"
    },
    {
      "text": "Yukiko Sawaya, Mahmood Sharif, Nicolas Christin, Ayumu Kubota, Akihiro Nakarai, and Akira Yamada. 2017. Self-Confidence Trumps Knowledge: A Cross-Cultural Study of Security Behavior. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2202–2214. https://doi.org/10.1145/3025453.3025926",
      "doi": "10.1145/3025453.3025926"
    },
    {
      "text": "Ben Shneiderman. 2017. Revisiting the Astonishing Growth of Human-Computer Interaction Research. Computer 50, 10 (Oct 2017), 8–11. https://doi.org/10.1109/MC.2017.3641625",
      "doi": "10.1109/MC.2017.3641625"
    },
    {
      "text": "Janet Siegmund, Norbert Siegmund, and Sven Apel. 2015. Views on Internal and External Validity in Empirical Software Engineering. In 2015 IEEE/ACM 37th IEEE International Conference on Software Engineering, Vol. 1. IEEE, 9–19. https://doi.org/10.1109/ICSE.2015.24",
      "doi": ""
    },
    {
      "text": "Edward Smith, Robert Loftin, Emerson Murphy-Hill, Christian Bird, and Thomas Zimmermann. 2013. Improving developer participation rates in surveys. In 2013 6th International Workshop on Cooperative and Human Aspects of Software Engineering (CHASE). IEEE, 89–92. https://doi.org/10.1109/CHASE.2013.6614738",
      "doi": ""
    },
    {
      "text": "Statista. 2020. Software developer gender distribution worldwide. Retrieved September 2021 from https://www.statista.com/statistics/1126823/worldwide-developer-gender/",
      "doi": ""
    },
    {
      "text": "Mohammad Tahaei, Alisa Frik, and Kami Vaniea. 2021. Deciding on Personalized Ads: Nudging Developers About User Privacy. In Seventeenth Symposium on Usable Privacy and Security (SOUPS 2021). USENIX Association, 573–596. https://www.usenix.org/conference/soups2021/presentation/tahaei",
      "doi": ""
    },
    {
      "text": "Mohammad Tahaei, Alisa Frik, and Kami Vaniea. 2021. Privacy Champions in Software Teams: Understanding Their Motivations, Strategies, and Challenges. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). ACM, 1–15. https://doi.org/10.1145/3411764.3445768",
      "doi": "10.1145/3411764.3445768"
    },
    {
      "text": "Mohammad Tahaei, Adam Jenkins, Kami Vaniea, and Maria K. Wolters. 2021. “I Don’t Know Too Much About It”: On the Security Mindsets of Computer Science Students. In Socio-Technical Aspects in Security and Trust (first edition ed.), Thomas Groß and Tryfonas Theo (Eds.). Springer International Publishing. https://doi.org/10.1007/978-3-030-55958-8",
      "doi": ""
    },
    {
      "text": "Mohammad Tahaei, Tianshi Li, and Kami Vaniea. 2022. Understanding Privacy-Related Advice on Stack Overflow. Proceedings on Privacy Enhancing Technologies 2022, 2(2022), 18 pages.",
      "doi": ""
    },
    {
      "text": "Mohammad Tahaei and Kami Vaniea. 2019. A Survey on Developer-Centred Security. In 2019 IEEE European Symposium on Security and Privacy Workshops (EuroS&PW). IEEE, 129–138. https://doi.org/10.1109/EuroSPW.2019.00021",
      "doi": ""
    },
    {
      "text": "Mohammad Tahaei and Kami Vaniea. 2021. “Developers Are Responsible”: What Ad Networks Tell Developers About Privacy. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems Extended Abstracts(CHI ’21 Extended Abstracts). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3411763.3451805",
      "doi": "10.1145/3411763.3451805"
    },
    {
      "text": "Mohammad Tahaei, Kami Vaniea, Beznosov Konstantin, and Maria K. Wolters. 2021. Security Notifications in Static Analysis Tools: Developers’ Attitudes, Comprehension, and Ability to Act on Them. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–17. https://doi.org/10.1145/3411764.3445616",
      "doi": "10.1145/3411764.3445616"
    },
    {
      "text": "Mohammad Tahaei, Kami Vaniea, and Naomi Saphra. 2020. Understanding Privacy-Related Questions on Stack Overflow. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376768",
      "doi": "10.1145/3313831.3376768"
    },
    {
      "text": "Phillip Merlin Uesbeck, Andreas Stefik, Stefan Hanenberg, Jan Pedersen, and Patrick Daleiden. 2016. An Empirical Study on the Impact of C++ Lambdas and Programmer Experience. In Proceedings of the 38th International Conference on Software Engineering (Austin, Texas) (ICSE ’16). Association for Computing Machinery, New York, NY, USA, 760–771. https://doi.org/10.1145/2884781.2884849",
      "doi": "10.1145/2884781.2884849"
    },
    {
      "text": "Daniel Votipka, Desiree Abrokwa, and Michelle L. Mazurek. 2020. Building and Validating a Scale for Secure Software Development Self-Efficacy. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–20. https://doi.org/10.1145/3313831.3376754",
      "doi": "10.1145/3313831.3376754"
    },
    {
      "text": "Jing Xie, Bill Chu, Heather Richter Lipford, and John T. Melton. 2011. ASIDE: IDE Support for Web Application Security. In Proceedings of the 27th Annual Computer Security Applications Conference (Orlando, Florida, USA) (ACSAC ’11). Association for Computing Machinery, New York, NY, USA, 267–276. https://doi.org/10.1145/2076732.2076770",
      "doi": "10.1145/2076732.2076770"
    },
    {
      "text": "Aiko Yamashita and Leon Moonen. 2013. Surveying developer knowledge and interest in code smells through online freelance marketplaces. In 2013 2nd International Workshop on User Evaluations for Software Engineering Researchers (USER). IEEE, 5–8. https://doi.org/10.1109/USER.2013.6603077",
      "doi": ""
    },
    {
      "text": "Yixin Zou, Kevin Roundy, Acar Tamersoy, Saurabh Shintre, Johann Roturier, and Florian Schaub. 2020. Examining the Adoption and Abandonment of Security, Privacy, and Identity Theft Protection Practices. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376570",
      "doi": "10.1145/3313831.3376570"
    }
  ]
}