{
  "doi": "10.1145/3491102.3517726",
  "title": "Understanding Social Influence in Collective Product Ratings Using Behavioral and Cognitive Metrics",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "Online platforms commonly collect and display user-generated information to support subsequent users’ decision-making. However, studies have noticed that presenting collective information can pose social influences on individuals’ opinions and alter their preferences accordingly. It is essential to deepen understanding of people’s preferences when exposed to others’ opinions and the underlying cognitive mechanisms to address potential biases. Hence, we conducted a laboratory study to investigate how products’ ratings and reviews influence participants’ stated preferences and cognitive responses assessed by their Electroencephalography (EEG) signals. The results showed that social ratings and reviews could alter participants’ preferences and affect their status of attention, working memory, and emotion. We further conducted predictive analyses to show that participants’ Electroencephalography-based measures can achieve higher power than behavioral measures to discriminate how collective information is displayed to users. We discuss the design implications informed by the results to shed light on the design of collective rating systems.",
  "tags": [
    "EEG",
    "Social Influence",
    "Social Conformity",
    "Online Rating",
    "Brain-Computer Interface"
  ],
  "authors": [
    {
      "name": "Fu-Yin Cherng",
      "institution": "Department of Computer Science and Information Engineering, National Chung Cheng University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959160457",
      "orcid": "missing"
    },
    {
      "name": "Jingchao Fang",
      "institution": "Department of Computer Science, UC Davis, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702192",
      "orcid": "missing"
    },
    {
      "name": "Yinhao Jiang",
      "institution": "Department of Computer Science, University of California, Davis, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660232910",
      "orcid": "missing"
    },
    {
      "name": "Xin Chen",
      "institution": "University of California, Davis, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659810360",
      "orcid": "missing"
    },
    {
      "name": "Taejun Choi",
      "institution": "Looxid Labs US Inc., United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239382",
      "orcid": "missing"
    },
    {
      "name": "Hao-Chuan Wang",
      "institution": "Department of Computer Science, UC Davis, United States",
      "img": "/do/10.1145/contrib-81553656356/rel-imgonly/14188307_10154380982350185_145248478587239185_o.jpg",
      "acmid": "81553656356",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Gediminas Adomavicius, Jesse Bockstedt, Shawn Curley, and Jingjing Zhang. 2011. Recommender systems, consumer preferences, and anchoring effects. In RecSys 2011 Workshop on Human Decision Making in Recommender Systems. 35–42.",
      "doi": ""
    },
    {
      "text": "Gediminas Adomavicius, Jesse Bockstedt, Shawn Curley, and Jingjing Zhang. 2014. De-biasing user preference ratings in recommender systems. In RecSys 2014 Workshop on Interfaces and Human Decision Making for Recommender Systems (IntRS 2014). 2–9.",
      "doi": ""
    },
    {
      "text": "Jennifer J Argo, Darren W Dahl, and Rajesh V Manchanda. 2005. The influence of a mere social presence in a retail context. Journal of consumer research 32, 2 (2005), 207–212.",
      "doi": ""
    },
    {
      "text": "Solomon E Asch. 1956. Studies of independence and conformity: I. A minority of one against a unanimous majority.Psychological monographs: General and applied 70, 9 (1956), 1.",
      "doi": ""
    },
    {
      "text": "Nathaniel JS Ashby, Lukasz Walasek, and Andreas Glöckner. 2015. The effect of consumer ratings and attentional allocation on product valuations.Judgment & Decision Making 10, 2 (2015).",
      "doi": ""
    },
    {
      "text": "Alan Baddeley. 2010. Working memory. Current biology4(2010), R136–R140.",
      "doi": ""
    },
    {
      "text": "William O Bearden, Stephen E Calcich, Richard Netemeyer, and Jesse E Teel. 1986. An exploratory investigation of consumer innovativeness and interpersonal influences. ACR North American Advances(1986).",
      "doi": ""
    },
    {
      "text": "Gregory Berns, Jonathan Chappelow, Caroline F Zink, Giuseppe Pagnoni, Megan E Martin-Skurski, and Jim Richards. 2005. Neurobiological correlates of social conformity and independence during mental rotation. Biological psychiatry 58, 3 (2005), 245–253.",
      "doi": ""
    },
    {
      "text": "Mustafa Bilgic and Raymond J Mooney. 2005. Explaining recommendations: Satisfaction vs. promotion. In Beyond personalization workshop, IUI, Vol. 5. 153.",
      "doi": ""
    },
    {
      "text": "John S. Breese, David Heckerman, and Carl Myers Kadie. 1998. Empirical Analysis of Predictive Algorithms for Collaborative Filtering. In UAI.",
      "doi": ""
    },
    {
      "text": "Clara Caldeira, Yu Chen, Lesley Chan, Vivian Pham, Yunan Chen, and Kai Zheng. 2017. Mobile apps for mood tracking: an analysis of features and user reviews. In AMIA Annual Symposium Proceedings, Vol. 2017. American Medical Informatics Association, 495.",
      "doi": ""
    },
    {
      "text": "Daniel K Campbell-Meiklejohn, Dominik Bach, Andreas Roepstorff, Raymond J Dolan, and Chris D Frith. 2010. How the opinion of others affects our valuation of objects. Current Biology (2010), 1165–1170.",
      "doi": ""
    },
    {
      "text": "Daniel K Campbell-Meiklejohn, Ryota Kanai, Bahador Bahrami, Dominik R Bach, Raymond J Dolan, Andreas Roepstorff, and Chris D Frith. 2012. Structure of orbitofrontal cortex predicts social influence. Current Biology 22, 4 (2012), R123–R124.",
      "doi": ""
    },
    {
      "text": "Gretchen B Chapman and Eric J Johnson. 2002. Incorporating the irrelevant: Anchors in judgments of belief and value. Heuristics and biases: The psychology of intuitive judgment (2002), 120–138.",
      "doi": ""
    },
    {
      "text": "Andrew Chen, Weijia Feng, Huixuan Zhao, Yanling Yin, and Peipei Wang. 2008. EEG default mode network in the human brain: spectral regional field powers. Neuroimage 41, 2 (2008), 561–574.",
      "doi": ""
    },
    {
      "text": "Pei-Yu Chen, Samita Dhanasobhon, and Michael D Smith. 2008. All reviews are not created equal: The disaggregate impact of reviews and reviewers at amazon. com. Com (2008).",
      "doi": ""
    },
    {
      "text": "Fu-Yin Cherng, Yi-Chen Lee, Jung-Tai King, and Wen-Chieh Lin. 2019. Measuring the Influences of Musical Parameters on Cognitive and Behavioral Responses to Audio Notifications Using EEG and Large-scale Online Studies. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 409.",
      "doi": "10.1145/3290605.3300639"
    },
    {
      "text": "Fu-Yin Cherng, Wen-Chieh Lin, Jung-Tai King, and Yi-Chen Lee. 2016. An EEG-based approach for evaluating graphic icons from the perspective of semantic distance. In Proceedings of the 2016 CHI conference on human factors in computing systems. ACM, 4378–4389.",
      "doi": "10.1145/2858036.2858133"
    },
    {
      "text": "Vincent Cho and Desmond Chan. 2019. How social influence through information adoption from online review sites affects collective decision making. Enterprise Information Systems(2019), 1–25.",
      "doi": ""
    },
    {
      "text": "Woo Jin Choi, Haoying Sun, Yan Liu, and Haipeng Chen. 2020. Guess Who Buys Cheap? The effect of consumers’ goal orientation on product preference. Journal of Consumer Psychology 30, 3 (2020), 506–514.",
      "doi": ""
    },
    {
      "text": "Robert B. Cialdini and Noah J. Goldstein. 2004. Social influence: Compliance and conformity. Annual Review of Psychology 55 (2004), 591–621.",
      "doi": ""
    },
    {
      "text": "HTC Corp.2016. HTC VIVE. http://vive.com/en/.",
      "doi": ""
    },
    {
      "text": "Dan Cosley, Shyong K Lam, Istvan Albert, Joseph A Konstan, and John Riedl. 2003. Is Seeing Believing? How Recommender Interfaces Affect Users’ Opinions. ACM CHI, 5–10.",
      "doi": ""
    },
    {
      "text": "Richard L Daft and Robert H Lengel. 1986. Organizational information requirements, media richness and structural design. Management science 32, 5 (1986), 554–571.",
      "doi": ""
    },
    {
      "text": "Morton Deutsch and Harold B Gerard. 1955. A study of normative and informational social influences upon individual judgment.The journal of abnormal and social psychology 51, 3(1955), 629.",
      "doi": ""
    },
    {
      "text": "Adele Diamond. 2013. Executive functions. Annual review of psychology 64 (2013), 135–168.",
      "doi": ""
    },
    {
      "text": "Micah G Edelson, Yadin Dudai, Raymond J Dolan, and Tali Sharot. 2014. Brain substrates of recovery from misleading influence. Journal of Neuroscience(2014), 7744–7753.",
      "doi": ""
    },
    {
      "text": "Anne Edland and Ola Svenson. 1993. Judgment and decision making under time pressure. In Time pressure and stress in human judgment and decision making. Springer, 27–40.",
      "doi": ""
    },
    {
      "text": "Leon Festinger. 1957. A theory of cognitive dissonance. Stanford university press.",
      "doi": ""
    },
    {
      "text": "Ronald A Fisher. 1936. The use of multiple measurements in taxonomic problems. Annals of eugenics 7, 2 (1936), 179–188.",
      "doi": ""
    },
    {
      "text": "Julia Natascha Frey, Philipp Ruhnau, and Nathan Weisz. 2015. Not so different after all: The same oscillatory processes support different types of attention. Brain research 1626(2015), 183–197.",
      "doi": ""
    },
    {
      "text": "Lukas Gehrke, Sezen Akman, Pedro Lopes, Albert Chen, Avinash Kumar Singh, Hsiang-Ting Chen, Chin-Teng Lin, and Klaus Gramann. 2019. Detecting visuo-haptic mismatches in virtual reality using the prediction error negativity of event-related brain potentials. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1–11.",
      "doi": "10.1145/3290605.3300657"
    },
    {
      "text": "Alexandre Gramfort, Martin Luessi, and Eric Larson. 2013. MEG and EEG Data Analysis with MNE-Python. Frontiers in Neuroscience267 (2013).",
      "doi": ""
    },
    {
      "text": "Bernard Guerin. 1986. Mere presence effects in humans: A review. Journal of experimental social psychology 22, 1 (1986), 38–77.",
      "doi": ""
    },
    {
      "text": "F Maxwell Harper, Xin Li, Yan Chen, and Joseph A Konstan. 2005. An economic model of user rating in an online recommender system. In International conference on user modeling. Springer, 307–316.",
      "doi": "10.1007/11527886_40"
    },
    {
      "text": "Vera M Hesslinger, Claus-Christian Carbon, and Heiko Hecht. 2017. Social Factors in Aesthetics: Social Conformity Pressure and a Sense of Being Watched Affect Aesthetic Judgments. i-Perception 8, 6 (2017), 2041669517736322.",
      "doi": ""
    },
    {
      "text": "Hunter Hoffman, Todd Richards, Barbara Coda, Anne Richards, and Sam Sharar. 2003. The illusion of presence in immersive virtual reality during an fMRI brain scan. CyberPsychology & Behavior(2003), 127–131.",
      "doi": ""
    },
    {
      "text": "Nan Hu, Paul A Pavlou, and Jennifer Zhang. 2006. Can online reviews reveal a product’s true quality? Empirical findings and analytical modeling of online word-of-mouth communication. In Proceedings of the 7th ACM conference on Electronic commerce. 324–330.",
      "doi": ""
    },
    {
      "text": "Chang-Hwan Im. 2018. Computational EEG Analysis. Springer.",
      "doi": ""
    },
    {
      "text": "Looxid Labs US Inc.2019. Looxid Pro. http://pro.looxidlabs.com/.",
      "doi": ""
    },
    {
      "text": "Keise Izuma and Ralph Adolphs. 2013. Social manipulation of preference in the human brain. Neuron (5 2013), 563–573.",
      "doi": ""
    },
    {
      "text": "Yohan Jo and Alice H Oh. 2011. Aspect and sentiment unification model for online review analysis. In Proceedings of the fourth ACM international conference on Web search and data mining. 815–824.",
      "doi": "10.1145/1935826.1935932"
    },
    {
      "text": "Iason Kastanis and Mel Slater. 2012. Reinforcement learning utilizes proxemics: An avatar learns to manipulate the position of people in immersive virtual reality. ACM Transactions on Applied Perception(2012).",
      "doi": ""
    },
    {
      "text": "Do-Won Kim and Chang-Hwan Im. 2018. EEG Spectral Analysis. Springer Singapore, Singapore, 35–53. https://doi.org/10.1007/978-981-13-0908-3_3",
      "doi": ""
    },
    {
      "text": "Wolfgang Klimesch. 1999. EEG alpha and theta oscillations reflect cognitive and memory performance: a review and analysis. Brain research reviews 29, 2-3 (1999), 169–195.",
      "doi": ""
    },
    {
      "text": "Vasily Klucharev, Kaisa Hytönen, Mark Rijpkema, Ale Smidts, and Guillén Fernández. 2009. Reinforcement learning signal predicts social conformity. Neuron 61, 1 (2009), 140–151.",
      "doi": ""
    },
    {
      "text": "Kevin Kuan, Yingqin Zhong, and Patrick Chau. 2014. Informational and normative social influence in group-buying: Evidence from self-reported and EEG data. Journal of Management Information Systems 30, 4 (2014), 151–178.",
      "doi": ""
    },
    {
      "text": "Yi-Chieh Lee, Wen-Chieh Lin, Jung-Tai King, Li-Wei Ko, Yu-Ting Huang, and Fu-Yin Cherng. 2014. An EEG-based approach for evaluating audio notifications under ambient sounds. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3817–3826.",
      "doi": "10.1145/2556288.2557076"
    },
    {
      "text": "Kenneth R Lord, Myung-Soo Lee, and Peggy Choong. 2001. Differences in normative and informational social influence. ACR North American Advances(2001).",
      "doi": ""
    },
    {
      "text": "Jan Lorenz, Heiko Rauhut, Frank Schweitzer, and Dirk Helbing. 2011. How social influence can undermine the wisdom of crowd effect. Proceedings of the national academy of sciences 108, 22(2011), 9020–9025.",
      "doi": ""
    },
    {
      "text": "Daniel J Mallinson and Peter K Hatemi. 2018. The effects of information and social conformity on opinion change. PloS one 13, 5 (2018), e0196600.",
      "doi": ""
    },
    {
      "text": "Miguel Vargas Martin, Victor Cho, and Gabriel Aversano. 2016. Detection of subconscious face recognition using consumer-grade brain-computer interfaces. ACM Transactions on Applied Perception(2016), 1–20.",
      "doi": ""
    },
    {
      "text": "Sean M McNee, John Riedl, and Joseph A Konstan. 2006. Being accurate is not enough: how accuracy metrics have hurt recommender systems. In CHI’06 extended abstracts on Human factors in computing systems. 1097–1101.",
      "doi": ""
    },
    {
      "text": "Maryam Mustafa, Stefan Guthe, and Marcus Magnor. 2012. Single-trial EEG classification of artifacts in videos. ACM Transactions on Applied Perception3 (2012), 1–15.",
      "doi": ""
    },
    {
      "text": "Risto Näätänen, Petri Paavilainen, Teemu Rinne, and Kimmo Alho. 2007. The mismatch negativity (MMN) in basic research of central auditory processing: a review. Clinical neurophysiology 118, 12 (2007), 2544–2590.",
      "doi": ""
    },
    {
      "text": "Oded Nov and Ofer Arazy. 2015. Asymmetric recommendations: The interacting effects of social ratings’ direction and strength on users’ ratings. Proceedings of the 9th ACM Conference on Recommender Systems (RecSys), 249–252.",
      "doi": "10.1145/2792838.2799667"
    },
    {
      "text": "L Orgo, Maie Bachmann, Jaanus Lass, and Hiie Hinrikus. 2015. Effect of negative and positive emotions on EEG spectral asymmetry. In 2015 37th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). IEEE, 8107–8110.",
      "doi": ""
    },
    {
      "text": "Xueni Pan, Marco Gillies, and Mel Slater. 2008. Male bodily responses during an interaction with a virtual woman. In International Workshop on Intelligent Virtual Agents. Springer, 89–96.",
      "doi": "10.1007/978-3-540-85483-8_9"
    },
    {
      "text": "Thomas D Parsons, Andrea Gaggioli, and Giuseppe Riva. 2017. Virtual reality for research in social neuroscience. Brain sciences 7, 4 (2017), 42.",
      "doi": ""
    },
    {
      "text": "Evan Peck, Beste F Yuksel, Alvitta Ottley, Robert JK Jacob, and Remco Chang. 2013. Using fNIRS brain sensing to evaluate information visualization interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 473–482.",
      "doi": "10.1145/2470654.2470723"
    },
    {
      "text": "Pearl Pu and Li Chen. 2006. Trust building with explanation interfaces. In Proceedings of the 11th international conference on Intelligent user interfaces. 93–100.",
      "doi": "10.1145/1111449.1111475"
    },
    {
      "text": "Pearl Pu, Li Chen, and Rong Hu. 2011. A user-centric evaluation framework for recommender systems. In Proceedings of the fifth ACM conference on Recommender systems. 157–164.",
      "doi": "10.1145/2043932.2043962"
    },
    {
      "text": "K Richard Ridderinkhof, Markus Ullsperger, Eveline A Crone, and Sander Nieuwenhuis. 2004. The role of the medial frontal cortex in cognitive control. science (2004), 443–447.",
      "doi": ""
    },
    {
      "text": "Catarina Sá, Paulo Veloso Gomes, António Marques, and António Correia. 2020. The Use of Portable EEG Devices in Development of Immersive Virtual Reality Environments for Converting Emotional States into Specific Commands. In Multidisciplinary Digital Publishing Institute Proceedings, Vol. 54. 43.",
      "doi": ""
    },
    {
      "text": "Maria V Sanchez-Vives and Mel Slater. 2005. From presence to consciousness through virtual reality. Nature Reviews Neuroscience(2005), 332–339.",
      "doi": ""
    },
    {
      "text": "Saeid Sanei and Jonathon A Chambers. 2013. EEG signal processing. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Michael Franklin Sanjay Krishnan, Jay Pateland Ken Goldberg. 2014. Social Influence Bias in Recommender Systems: A Methodology for Learning, Analyzing, and Mitigating Bias in Ratings. Proceedings of the 8th ACM Conference on Recommender systems (RecSys), 137–144.",
      "doi": "10.1145/2645710.2645740"
    },
    {
      "text": "Badrul Sarwar, George Karypis, Joseph Konstan, and John Riedl. 2001. Item-based collaborative filtering recommendation algorithms. In Proceedings of the 10th international conference on World Wide Web. 285–295.",
      "doi": "10.1145/371920.372071"
    },
    {
      "text": "Sylvain Senecal and Jacques Nantel. 2004. The influence of online product recommendations on consumers’ online choices. Journal of Retailing 80(2004), 159–169. Issue 2. https://doi.org/10.1016/j.jretai.2004.04.001",
      "doi": ""
    },
    {
      "text": "Amit Sharma and Dan Cosley. 2013. Do social explanations work? Studying and modeling the effects of social explanations in recommender systems. In Proceedings of the 22nd international conference on World Wide Web. 1133–1144.",
      "doi": "10.1145/2488388.2488487"
    },
    {
      "text": "Avgusta Shestyuk, Karthik Kasinathan, Viswajith Karapoondinott, Robert Knight, and Ram Gurumoorthy. 2019. Individual EEG measures of attention, memory, and motivation predict population level TV viewership and Twitter engagement. PloS one 14, 3 (2019), e0214507.",
      "doi": ""
    },
    {
      "text": "Vera Shuman, David Sander, and Klaus R. Scherer. 2013. Levels of valence. Frontiers in Psychology(2013). Issue MAY.",
      "doi": ""
    },
    {
      "text": "Paul Slovic. 1995. The Construction of Preference. American Psychological Association 50 (1995), 364–undefined.",
      "doi": ""
    },
    {
      "text": "Yasir Ali Solangi, Zulfiqar Ali Solangi, Samreen Aarain, Amna Abro, Ghulam Ali Mallah, and Asadullah Shah. 2018. Review on Natural Language Processing (NLP) and its toolkits for opinion mining and sentiment analysis. In 2018 IEEE 5th International Conference on Engineering Technologies and Applied Sciences (ICETAS). IEEE, 1–4.",
      "doi": ""
    },
    {
      "text": "Mirre Stallen and Alan G. Sanfey. 2015. The neuroscience of social conformity: Implications for fundamental and applied research. Frontiers in Neuroscience 9 (2015). Issue SEP.",
      "doi": ""
    },
    {
      "text": "Christina Steindl, Eva Jonas, Sandra Sittenthaler, Eva Traut-Mattausch, and Jeff Greenberg. 2015. Understanding psychological reactance. Zeitschrift für Psychologie(2015).",
      "doi": ""
    },
    {
      "text": "James Surowiecki. 2005. The wisdom of crowds. Anchor.",
      "doi": ""
    },
    {
      "text": "M Susan and S David. 2010. What makes a helpful online review? A study of customer reviews on amazon. com. MIS Quarterly (2010).",
      "doi": ""
    },
    {
      "text": "Jan-Philipp Tauscher, Maryam Mustafa, and Marcus Magnor. 2017. Comparative analysis of three different modalities for perception of artifacts in videos. ACM Transactions on Applied Perception(2017), 1–12.",
      "doi": ""
    },
    {
      "text": "Gregor Thut, Annika Nietzel, Stephan A Brandt, and Alvaro Pascual-Leone. 2006. α-Band electroencephalographic activity over occipital cortex indexes visuospatial attention bias and predicts visual target detection. Journal of Neuroscience 26, 37 (2006), 9494–9502.",
      "doi": ""
    },
    {
      "text": "Sina Alexa Trautmann-Lengsfeld and Christoph Siegfried Herrmann. 2013. EEG reveals an early influence of social conformity on visual processing in group pressure situations. Social neuroscience 8, 1 (2013), 75–89.",
      "doi": ""
    },
    {
      "text": "Yi-Hsuan Tseng, Tian-Jyun Lin, Tzu-Hsuan Yang, Ping-Hsuan Han, and Saiau-Yue Tsau. 2020. HEY!: Exploring Virtual Character Interaction for Immersive Storytelling via Electroencephalography. In SIGGRAPH Asia. 1–2.",
      "doi": ""
    },
    {
      "text": "Hao-Chuan Wang and Susan Fussell. 2010. Groups in groups: Conversational similarity in online multicultural multiparty brainstorming. In Proceedings of the 2010 ACM conference on Computer supported cooperative work. 351–360.",
      "doi": "10.1145/1718918.1718980"
    },
    {
      "text": "Hao Chuan Wang, Tau Heng Yeo, Syavash Nobarany, and Gary Hsieh. 2015. Problem with cross-cultural comparison of user-generated ratings on Mechanical Turk. ACM ICPS, 9–12.",
      "doi": ""
    },
    {
      "text": "Yu-Kai Wang, Tzyy-Ping Jung, and Chin-Teng Lin. 2018. Theta and alpha oscillations in attentional interaction during distracted driving. Frontiers in behavioral neuroscience 12 (2018), 3.",
      "doi": ""
    },
    {
      "text": "Fang Wu and Bernardo A. Huberman. 2010. Opinion formation under costly expression. ACM ACM Transactions on Intelligent Systems and Technology (TIST) (2010).",
      "doi": ""
    },
    {
      "text": "Ashima Yadav and Dinesh Kumar Vishwakarma. 2020. Sentiment analysis using deep learning architectures: a review. Artificial Intelligence Review 53, 6 (2020), 4335–4385.",
      "doi": "10.1007/s10462-019-09794-5"
    },
    {
      "text": "Jenny Yiend. 2010. The effects of emotion on attention: A review of attentional processing of emotional information. Cognition and Emotion 24, 1 (2010), 3–47.",
      "doi": ""
    },
    {
      "text": "Thorsten O Zander and Christian Kothe. 2011. Towards passive brain–computer interfaces: applying brain–computer interface technology to human–machine systems in general. Journal of neural engineering 8, 2 (2011), 025005.",
      "doi": ""
    },
    {
      "text": "Haiyi Zhu, Bernardo Huberman, and Yarun Luon. 2012. To switch or not to switch: understanding social influence in online choices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2257–2266.",
      "doi": "10.1145/2207676.2208383"
    }
  ]
}