{
  "doi": "10.1145/3491102.3517526",
  "title": "Compete, Collaborate, Investigate: Exploring the Social Structures of Open Source Intelligence Investigations",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "Online investigations are increasingly conducted by individuals with diverse skill levels and experiences, with mixed results. Novice investigations often result in vigilantism or doxxing, while expert investigations have greater success rates and fewer mishaps. Many of these experts are involved in a community of practice known as Open Source Intelligence (OSINT), with an ethos and set of techniques for conducting investigations using only publicly available data. Through semi-structured interviews with 14 expert OSINT investigators from nine different organizations, we examine the social dynamics of this community, including the collaboration and competition patterns that underlie their investigations. We also describe investigators’ use of and challenges with existing OSINT tools, and implications for the design of social computing systems to better support crowdsourced investigations.",
  "authors": [
    {
      "name": "Yasmine Belghith",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238958",
      "orcid": "missing"
    },
    {
      "name": "Sukrit Venkatagiri",
      "institution": "Department of Computer Science, Virginia Tech, United States",
      "img": "/do/10.1145/contrib-99659066195/rel-imgonly/99659066195.jpg",
      "acmid": "99659066195",
      "orcid": "missing"
    },
    {
      "name": "Kurt Luther",
      "institution": "Department of Computer Science, Virginia Tech, United States",
      "img": "/do/10.1145/contrib-81363592028/rel-imgonly/kurt_luther_arms_crossed.jpg",
      "acmid": "81363592028",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jesse Abdenour. 2018. Inspecting the Investigators: An Analysis of Television Investigative Journalism and Factors Leading to Its Production. Journalism & Mass Communication Quarterly 95, 4 (Dec. 2018), 1058–1078. https://doi.org/10.1177/1077699017733438 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Elena Agapie, Jaime Teevan, and Andrés Monroy-Hernández. 2015. Crowdsourcing in the Field: A Case Study Using Local Crowds for Event Reporting. In Proceedings of the Third AAAI Conference on Human Computation and Crowdsourcing (HCOMP-15). Association for the Advancement of Artificial Intelligence, 11. https://www.microsoft.com/en-us/research/publication/crowdsourcing-in-the-field-a-case-study-using-local-crowds-for-event-reporting/",
      "doi": ""
    },
    {
      "text": "Joelle Alcaidinho, Larry Freil, Taylor Kelly, Kayla Marland, Chunhui Wu, Bradley Wittenbrook, Giancarlo Valentin, and Melody Jackson. 2017. Mobile Collaboration for Human and Canine Police Explosive Detection Teams. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). Association for Computing Machinery, New York, NY, USA, 925–933. https://doi.org/10.1145/2998181.2998271",
      "doi": "10.1145/2998181.2998271"
    },
    {
      "text": "Sultan A. Alharthi, Nicolas James LaLone, Hitesh Nidhi Sharma, Igor Dolgov, and Z O. Toups. 2021. An Activity Theory Analysis of Search and; Rescue Collective Sensemaking and Planning Practices. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 146, 20 pages. https://doi.org/10.1145/3411764.3445272",
      "doi": "10.1145/3411764.3445272"
    },
    {
      "text": "Morgan G. Ames. 2018. Hackers, Computers, and Cooperation: A Critical History of Logo and Constructionist Learning. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (Nov. 2018), 1–19. https://doi.org/10.1145/3274287",
      "doi": "10.1145/3274287"
    },
    {
      "text": "Amnesty International. 2018. Troll Patrol Findings. https://decoders.amnesty.org/projects/troll-patrol/findings",
      "doi": ""
    },
    {
      "text": "Amnesty International. 2019. Large-scale Investigations Powered by Thousands of Digital Volunteers Worldwide. https://citizenevidence.org/2019/12/11/large-scale-investigations-powered-by-thousands-of-digital-volunteers-worldwide/ Section: Crowd-sourcing.",
      "doi": ""
    },
    {
      "text": "Ahmer Arif, John J. Robinson, Stephanie A. Stanek, Elodie S. Fichet, Paul Townsend, Zena Worku, and Kate Starbird. 2017. A Closer Look at the Self-Correcting Crowd: Examining Corrections in Online Rumors. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). Association for Computing Machinery, New York, NY, USA, 155–168. https://doi.org/10.1145/2998181.2998294",
      "doi": "10.1145/2998181.2998294"
    },
    {
      "text": "Elise Baker, Eric Stover, Rohini Haar, Andrea Lampros, and Alexa Koenig. 2020. Safer Viewing. Health Hum Rights 22, 1 (June 2020), 293–304. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7348432/",
      "doi": ""
    },
    {
      "text": "Bellingcat Investigation Team. 2015. Diversifying OSINT: Women Experts. https://www.bellingcat.com/resources/articles/2015/12/08/women-in-osint-diversifying-the-field/",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa Publisher: Routledge _eprint: https://www.tandfonline.com/doi/pdf/10.1191/1478088706qp063oa.",
      "doi": ""
    },
    {
      "text": "Andrea Broughton, Beth Foley, Stefanie Ledermaier, and Annette Cox. 2014. The use of social media in the recruitment process. Institute for Employment Studies 3, 13 (2014), 81.",
      "doi": ""
    },
    {
      "text": "A.J. Bernheim Brush, Jaeyeon Jung, Ratul Mahajan, and Frank Martinez. 2013. Digital neighborhood watch: investigating the sharing of camera data amongst neighbors. In Proceedings of the 2013 conference on Computer supported cooperative work(CSCW ’13). Association for Computing Machinery, New York, NY, USA, 693–700. https://doi.org/10.1145/2441776.2441853",
      "doi": "10.1145/2441776.2441853"
    },
    {
      "text": "Tanner J Burns, Samuel C Rios, Thomas K Jordan, Qijun Gu, and Trevor Underwood. 2017. Analysis and Exercises for Engaging Beginners in Online CTF Competitions for Security Education. USENIX Workshop on Advances in Security Education (ASE 17) 9 (2017), 9.",
      "doi": ""
    },
    {
      "text": "Jonathan L. Calof and Sheila Wright. 2008. Competitive intelligence: A practitioner, academic and inter‐disciplinary perspective. European Journal of Marketing 42, 7/8 (Jan. 2008), 717–730. https://doi.org/10.1108/03090560810877114 Publisher: Emerald Group Publishing Limited.",
      "doi": ""
    },
    {
      "text": "George Chin, Olga A. Kuchar, and Katherine E. Wolf. 2009. Exploring the analytical processes of intelligence analysts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Boston MA USA, 11–20. https://doi.org/10.1145/1518701.1518704",
      "doi": "10.1145/1518701.1518704"
    },
    {
      "text": "Gregorio Convertino, Helena M. Mentis, Mary Beth Rosson, Aleksandra Slavkovic, and John M. Carroll. 2009. Supporting content and process common ground in computer-supported teamwork. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’09). Association for Computing Machinery, New York, NY, USA, 2339–2348. https://doi.org/10.1145/1518701.1519059",
      "doi": "10.1145/1518701.1519059"
    },
    {
      "text": "Catherine Durnell Cramton and Pamela J. Hinds. 2014. An Embedded Model of Cultural Adaptation in Global Teams. Organization Science 25, 4 (Jan. 2014), 1056–1081. https://doi.org/10.1287/orsc.2013.0885 Publisher: INFORMS.",
      "doi": "10.1287/orsc.2013.0885"
    },
    {
      "text": "Cyber Week. 2021. OSINT for good | Cyber Week 2021. https://www.cyberweek2021.austcyber.com/event/osint-good",
      "doi": ""
    },
    {
      "text": "Dharma Dailey and Kate Starbird. 2014. Journalists as Crowdsourcerers: Responding to Crisis by Reporting with a Crowd. Computer Supported Cooperative Work (CSCW) 23, 4 (01 Dec 2014), 445–481. https://doi.org/10.1007/s10606-014-9208-z",
      "doi": "10.1007/s10606-014-9208-z"
    },
    {
      "text": "Dharma Dailey and Kate Starbird. 2015. ”It’s Raining Dispersants”: Collective Sensemaking of Complex Information in Crisis Contexts. In Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work and; Social Computing (Vancouver, BC, Canada) (CSCW’15 Companion). Association for Computing Machinery, New York, NY, USA, 155–158. https://doi.org/10.1145/2685553.2698995",
      "doi": "10.1145/2685553.2698995"
    },
    {
      "text": "Sam Dubberley, Alexa Koenig, and Daragh Murray (Eds.). 2020. Digital Witness: Using Open Source Information for Human Rights Investigation, Documentation, and Accountability. Oxford University Press, Oxford, New York.",
      "doi": ""
    },
    {
      "text": "Michaelanne Dye, David Nemer, Josiah Mangiameli, Amy S. Bruckman, and Neha Kumar. 2018. El Paquete Semanal: The Week’s Internet in Havana. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174213",
      "doi": "10.1145/3173574.3174213"
    },
    {
      "text": "Sophie Dyer and Gabriela Ivens. 2020. What would a feminist open source investigation look like?Digi War 1 (April 2020), 5–17. https://doi.org/10.1057/s42984-020-00008-9",
      "doi": ""
    },
    {
      "text": "Douglas C. Engelbart. 1990. Knowledge-domain interoperability and an open hyperdocument system. In Proceedings of the 1990 ACM conference on Computer-supported cooperative work(CSCW ’90). Association for Computing Machinery, New York, NY, USA, 143–156. https://doi.org/10.1145/99332.99351",
      "doi": "10.1145/99332.99351"
    },
    {
      "text": "Sheena L. Erete. 2015. Engaging Around Neighborhood Issues: How Online Communication Affects Offline Behavior. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing(CSCW ’15). Association for Computing Machinery, New York, NY, USA, 1590–1601. https://doi.org/10.1145/2675133.2675182",
      "doi": "10.1145/2675133.2675182"
    },
    {
      "text": "Thomas Erickson and Wendy A Kellogg. 2000. Social translucence: an approach to designing systems that support social processes. ACM transactions on computer-human interaction (TOCHI) 7, 1(2000), 59–83.",
      "doi": ""
    },
    {
      "text": "Esteban Borges. 2019. SecurityTrails | OSINT Framework: The Perfect Cybersecurity Intel Gathering Tool. https://securitytrails.com/blog/osint-framework",
      "doi": ""
    },
    {
      "text": "Europol. 2019. Stop Child Abuse – Trace an Object. Europol. https://www.europol.europa.eu/stopchildabuse",
      "doi": ""
    },
    {
      "text": "Europol. 2021. Stop Child Abuse – Trace an Object. https://www.europol.europa.eu/stopchildabuse",
      "doi": ""
    },
    {
      "text": "Ronan Farrow. 2021. An Air Force Combat Veteran Breached the Senate. https://www.newyorker.com/news/news-desk/an-air-force-combat-veteran-breached-the-senate",
      "doi": ""
    },
    {
      "text": "FBI. [n.d.]. New Agent Training. Federal Bureau of Investigation. https://www.fbi.gov/services/training-academy/new-agent-training",
      "doi": ""
    },
    {
      "text": "First Draft. 2017. CrossCheck: Our Collaborative Online Verification Newsroom. https://firstdraftnews.org:443/about/crosscheck-newsroom/",
      "doi": ""
    },
    {
      "text": "Batya Friedman. 1996. Value-sensitive design. interactions 3, 6 (1996), 16–23.",
      "doi": ""
    },
    {
      "text": "P. Ganguly and P. Ray. 2000. Software interoperability of telemedicine systems: a CSCW perspective. In Proceedings Seventh International Conference on Parallel and Distributed Systems (Cat. No.PR00568). IEEE, 349–356. https://doi.org/10.1109/ICPADS.2000.857717 ISSN: 1521-9097.",
      "doi": ""
    },
    {
      "text": "Peter Gill. 2018. The way ahead in explaining intelligence organization and process. Intelligence and National Security 33 (2018), 574–586. https://doi.org/10.1080/02684527.2018.1452566",
      "doi": ""
    },
    {
      "text": "Michael Glassman and Min Ju Kang. 2012. Intelligence in the internet age: The emergence and evolution of Open Source Intelligence (OSINT). Computers in Human Behavior 28, 2 (March 2012), 673–682. https://doi.org/10.1016/j.chb.2011.11.014",
      "doi": "10.1016/j.chb.2011.11.014"
    },
    {
      "text": "Joseph A. Gonzales, Casey Fiesler, and Amy Bruckman. 2015. Towards an Appropriable CSCW Tool Ecology: Lessons from the Greatest International Scavenger Hunt the World Has Ever Seen. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work and; Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 946–957. https://doi.org/10.1145/2675133.2675240",
      "doi": "10.1145/2675133.2675240"
    },
    {
      "text": "Hacktoria. 2021. Hacktoria – Story Based OSINT Capture The Flag Challenges. https://hacktoria.com/",
      "doi": ""
    },
    {
      "text": "Melissa Hanham and Jaewoo Shin. 2020. Ethics in the Age of OSINT Innocence. Stanley Center for Peace and Security (May 2020), 6. https://stanleycenter.org/publications/ethics-osint-innocence/",
      "doi": ""
    },
    {
      "text": "Eliot Higgins. 2021. We Are Bellingcat : An Intelligence Agency for the People. Bloomsbury Publishing, London.",
      "doi": ""
    },
    {
      "text": "Y. Linlin Huang, Kate Starbird, Mania Orand, Stephanie A. Stanek, and Heather T. Pedersen. 2015. Connected Through Crisis: Emotional Proximity and the Spread of Misinformation Online. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing(CSCW ’15). Association for Computing Machinery, New York, NY, USA, 969–980. https://doi.org/10.1145/2675133.2675202",
      "doi": "10.1145/2675133.2675202"
    },
    {
      "text": "Arthur S. Hulnick. 2002. The Downside of Open Source Intelligence. International Journal of Intelligence and CounterIntelligence 15, 4 (Nov. 2002), 565–579. https://doi.org/10.1080/08850600290101767",
      "doi": ""
    },
    {
      "text": "Katja Hutter, Julia Hautz, Johann Füller, Julia Mueller, and Kurt Matzler. 2011. Communitition: The Tension between Competition and Collaboration in Community-Based Design Contests. Creativity and Innovation Management 20, 1 (2011), 3–21. https://doi.org/10.1111/j.1467-8691.2011.00589.x _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1467-8691.2011.00589.x.",
      "doi": ""
    },
    {
      "text": "Aarti Israni, Sheena Erete, and Che L. Smith. 2017. Snitches, Trolls, and Social Norms: Unpacking Perceptions of Social Media Use for Crime Prevention. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1193–1209. https://doi.org/10.1145/2998181.2998238",
      "doi": "10.1145/2998181.2998238"
    },
    {
      "text": "Aimée A Kane, Sara Kiesler, and Ruogu Kang. 2018. Inaccuracy Blindness in Collaboration Persists,. Association for Computing Machinery, New York, NY, USA, 9.",
      "doi": ""
    },
    {
      "text": "Lachlan Kermode, Jan Freyberg, Alican Akturk, Robert Trafford, Denis Kochetkov, Rafael Pardinas, Eyal Weizman, and Julien Cornebise. 2020. Objects of violence: synthetic data for practical ML in human rights investigations. arXiv:2004.01030 [cs] (April 2020), 12. http://arxiv.org/abs/2004.01030 arXiv:2004.01030.",
      "doi": ""
    },
    {
      "text": "R C Kessler, R H Price, and C B Wortman. 1985. Social Factors in Psychopathology: Stress, Social Support, and Coping Processes. Annual Review of Psychology 36, 1 (1985), 531–572. https://doi.org/10.1146/annurev.ps.36.020185.002531 _eprint: https://doi.org/10.1146/annurev.ps.36.020185.002531.",
      "doi": ""
    },
    {
      "text": "Meryl Kornfield. 2021. The wrong ID: Retired firefighter, comedian and Chuck Norris falsely accused of being Capitol rioters. Washington Post. https://www.washingtonpost.com/technology/2021/01/16/sleuths-falsely-identify-rioters/",
      "doi": ""
    },
    {
      "text": "Trace Labs. [n.d.]. Search Party Rules. https://www.tracelabs.org/about/search-party-rules",
      "doi": ""
    },
    {
      "text": "Nicolas J LaLone, Jess Kropczynski, and Andrea H Tapia. 2018. The Symbiotic Relationship of Crisis Response Professionals and Enthusiasts as Demonstrated by Reddit’s User-Interface Over Time. In ISCRAM. 13.",
      "doi": ""
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated Learning: Legitimate Peripheral Participation. Cambridge University Press, Cambridge, UK. Google-Books-ID: CAVIOrW3vYAC.",
      "doi": ""
    },
    {
      "text": "Charlotte P. Lee, Paul Dourish, and Gloria Mark. 2006. The Human Infrastructure of Cyberinfrastructure. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work (Banff, Alberta, Canada) (CSCW ’06). Association for Computing Machinery, New York, NY, USA, 483–492. https://doi.org/10.1145/1180875.1180950",
      "doi": "10.1145/1180875.1180950"
    },
    {
      "text": "Sunwha Lee, Sungho Lee, Yoojin Lee, Sanghoo Park, and Jinwoo Kim. 2014. Effect of competition and collaboration in social network game on intimacy among players. In Proceedings of HCI Korea(HCIK ’15). Hanbit Media, Inc., Seoul, KOR, 425–433.",
      "doi": ""
    },
    {
      "text": "Sheena Lewis and Dan A Lewis. 2012. Examining technology that supports community policing. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12. ACM Press, New York, NY, USA, 10.",
      "doi": "10.1145/2207676.2208595"
    },
    {
      "text": "Tianyi Li, Yasmine Belghith, Chris North, and Kurt Luther. 2020. CrowdTrace: Visualizing Provenance in Distributed Sensemaking. In 2020 IEEE Visualization Conference (VIS). IEEE, 5.",
      "doi": ""
    },
    {
      "text": "Tianyi Li, Kurt Luther, and Chris North. 2018. CrowdIA: Solving Mysteries with Crowdsourced Sensemaking. Proc. ACM Hum.-Comput. Interact. 2, CSCW (Nov. 2018), 105:1–105:29. https://doi.org/10.1145/3274374",
      "doi": "10.1145/3274374"
    },
    {
      "text": "Sean McKeown, David Maxwell, Leif Azzopardi, and William Bradley Glisson. 2014. Investigating people: a qualitative analysis of the search behaviours of open-source intelligence analysts. In Proceedings of the 5th Information Interaction in Context Symposium(IIiX ’14). Association for Computing Machinery, New York, NY, USA, 175–184. https://doi.org/10.1145/2637002.2637023",
      "doi": "10.1145/2637002.2637023"
    },
    {
      "text": "Meedan. [n.d.]. Check. https://meedan.com/check",
      "doi": ""
    },
    {
      "text": "Stephen C. Mercado. 2004. Sailing the sea of OSINT in the information age. Technical Report. American Psychological Association. https://doi.org/10.1037/e741272011-005 type: dataset.",
      "doi": ""
    },
    {
      "text": "Alexander Michael and Christof Lutteroth. 2020. Race Yourselves: A Longitudinal Exploration of Self-Competition Between Past, Present, and Future Performances in a VR Exergame. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–17. https://doi.org/10.1145/3313831.3376256",
      "doi": "10.1145/3313831.3376256"
    },
    {
      "text": "Michael W. McLaughlin. 2012. Using open source intelligence software for cybersecurity intelligence. https://www.computerweekly.com/tip/Using-open-source-intelligence-software-for-cybersecurity-intelligence",
      "doi": ""
    },
    {
      "text": "Benedikt Morschheuser, Alexander Maedche, and Dominic Walter. 2017. Designing Cooperative Gamification: Conceptualization and Prototypical Implementation. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). Association for Computing Machinery, New York, NY, USA, 2410–2421. https://doi.org/10.1145/2998181.2998272",
      "doi": "10.1145/2998181.2998272"
    },
    {
      "text": "MwOsint. 2019. Unravelling the Norton Scam. https://keyfindings.blog/2019/08/28/unravelling-the-norton-scam/",
      "doi": ""
    },
    {
      "text": "Greg Myre. 2021. How Online Sleuths Identified Rioters At The Capitol. https://www.npr.org/2021/01/11/955513539/how-online-sleuths-identified-rioters-at-the-capitol",
      "doi": ""
    },
    {
      "text": "Nina C. Müller and Jenny Wiik. 2021. From Gatekeeper to Gate-opener: Open-Source Spaces in Investigative Journalism. Journalism Practice 0, 0 (May 2021), 1–20. https://doi.org/10.1080/17512786.2021.1919543 Publisher: Routledge _eprint: https://doi.org/10.1080/17512786.2021.1919543.",
      "doi": ""
    },
    {
      "text": "Johnny Nhan, Laura Huey, and Ryan Broll. 2017. Digilantism: An analysis of crowdsourcing and the Boston marathon bombings. The British journal of criminology 57, 2 (2017), 341–361.",
      "doi": ""
    },
    {
      "text": "Tj OConnor and Christopher Stricklan. 2021. Teaching a Hands-On Mobile and Wireless Cybersecurity Course. In Proceedings of the 26th ACM Conference on Innovation and Technology in Computer Science Education V. 1. ACM, Virtual Event Germany, 296–302. https://doi.org/10.1145/3430665.3456346",
      "doi": "10.1145/3430665.3456346"
    },
    {
      "text": "Department of Homeland Security. 2010. (U//FOUO//LES) DHS Terrorist Use of Social Networking Facebook Case Study | Public Intelligence. https://publicintelligence.net/ufouoles-dhs-terrorist-use-of-social-networking-facebook-case-study/",
      "doi": ""
    },
    {
      "text": "Juhong Park, Alice Oh, and Suin Kim. 2017. Analysis of the Effect of Competition on Player Immersion and Engagement in a Mobile Game. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 6.",
      "doi": "10.1145/3027063.3053200"
    },
    {
      "text": "Nicholas J. Pioch and John O. Everett. 2006. POLESTAR: collaborative knowledge management and sensemaking tools for intelligence analysts. In Proceedings of the 15th ACM international conference on Information and knowledge management(CIKM ’06). Association for Computing Machinery, New York, NY, USA, 513–521. https://doi.org/10.1145/1183614.1183688",
      "doi": "10.1145/1183614.1183688"
    },
    {
      "text": "Ronald Poelman, Oytun Akman, Stephan Lukosch, and Pieter Jonker. 2012. As if being there: mediated reality for crime scene investigation. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work(CSCW ’12). Association for Computing Machinery, New York, NY, USA, 1267–1276. https://doi.org/10.1145/2145204.2145394",
      "doi": "10.1145/2145204.2145394"
    },
    {
      "text": "Emily Porter, Chris Bopp, Elizabeth Gerber, and Amy Voida. 2017. Reappropriating Hackathons: The Production Work of the CHI4Good Day of Service. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 5.",
      "doi": "10.1145/3025453.3025637"
    },
    {
      "text": "Melissa J. Rogerson, Martin R. Gibbs, and Wally Smith. 2018. Cooperating to Compete: the Mutuality of Cooperation and Competition in Boardgame Play. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173767",
      "doi": "10.1145/3173574.3173767"
    },
    {
      "text": "Daniel Rouach and Patrice Santi. 2001. Competitive Intelligence Adds Value:: Five Intelligence Attitudes. European Management Journal 19, 5 (Oct. 2001), 552–559. https://doi.org/10.1016/S0263-2373(01)00069-X",
      "doi": ""
    },
    {
      "text": "Amy Ru and Foaad Khosmood. 2020. Hackathons for Workforce Development: A Case Study. In International Conference on Game Jams, Hackathons and Game Creation Events 2020(ICGJ20). Association for Computing Machinery, New York, NY, USA, 30–33. https://doi.org/10.1145/3409456.3409462",
      "doi": "10.1145/3409456.3409462"
    },
    {
      "text": "Ryan Hunt. 2012. Thirty-Seven Percent of Companies Use Social Networks to Research Potential Job Candidates, According to New CareerBuilder Survey - Apr 18, 2012. http://press.careerbuilder.com/2012-04-18-Thirty-Seven-Percent-of-Companies-Use-Social-Networks-to-Research-Potential-Job-Candidates-According-to-New-CareerBuilder-Survey",
      "doi": ""
    },
    {
      "text": "Niharika Sachdeva and Ponnurangam Kumaraguru. 2017. Call for Service: Characterizing and Modeling Police Response to Serviceable Requests on Facebook. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). Association for Computing Machinery, New York, NY, USA, 336–352. https://doi.org/10.1145/2998181.2998292",
      "doi": "10.1145/2998181.2998292"
    },
    {
      "text": "Matthew J. Salganik and Duncan J. Watts. 2009. Web-Based Experiments for the Study of Collective Social Dynamics in Cultural Markets. Topics in Cognitive Science 1, 3 (July 2009), 439–468. https://doi.org/10.1111/j.1756-8765.2009.01030.x",
      "doi": ""
    },
    {
      "text": "Irving Seidman. 2006. Interviewing as Qualitative Research: A Guide for Researchers in Education and the Social Sciences. Teachers College Press, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Pnina Shachaf. 2008. Cultural diversity and information and communication technology impacts on global virtual teams: An exploratory study. Information & Management 45, 2 (March 2008), 131–142. https://doi.org/10.1016/j.im.2007.12.003",
      "doi": "10.1016/j.im.2007.12.003"
    },
    {
      "text": "Dan Simon, Minwoo Ahn, Douglas M. Stenstrom, and Stephen J. Read. 2020. The adversarial mindset. Psychology, Public Policy, and Law 26, 3 (Aug. 2020), 353–377. https://doi.org/10.1037/law0000226 Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Dan Simon, Doug Stenstrom, and Stephen J. Read. 2009. Adversarial and Non-Adversarial Investigations: An Experiment. SSRN Electronic Journal(2009), 23. https://doi.org/10.2139/ssrn.1401723",
      "doi": ""
    },
    {
      "text": "Kate Starbird and Leysia Palen. 2012. (How) will the revolution be retweeted? information diffusion and the 2011 Egyptian uprising. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work(CSCW ’12). Association for Computing Machinery, New York, NY, USA, 7–16. https://doi.org/10.1145/2145204.2145212",
      "doi": "10.1145/2145204.2145212"
    },
    {
      "text": "Deborah Tatar. 2007. The design tensions framework. Human–Computer Interaction 22, 4 (2007), 413–451.",
      "doi": ""
    },
    {
      "text": "Yla Tausczik and Mark Boons. 2018. Distributed Knowledge in Crowds: Crowd Performance on Hidden Profile Tasks.Proceedings of the International AAAI Conference on Web and Social Media 12, 1 (2018), 10.",
      "doi": ""
    },
    {
      "text": "Yla Tausczik and Ping Wang. 2017. To Share, or Not to Share? Community-Level Collaboration in Open Innovation Contests. Proc. ACM Hum.-Comput. Interact. 1, CSCW (Dec. 2017), 100:1–100:23. https://doi.org/10.1145/3134735",
      "doi": "10.1145/3134735"
    },
    {
      "text": "The Washington Post 2015. Crowdsourcing may have solved a 20-year-old cold case. The Washington Post (2015).",
      "doi": ""
    },
    {
      "text": "Ramine Tinati, Max Van Kleek, Elena Simperl, Markus Luczak-Rösch, Robert Simpson, and Nigel Shadbolt. 2015. Designing for Citizen Data Analysis: A Cross-Sectional Case Study of a Multi-Domain Citizen Science Platform. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 4069–4078. https://doi.org/10.1145/2702123.2702420",
      "doi": "10.1145/2702123.2702420"
    },
    {
      "text": "Ma Dolores C. Tongco. 2007. Purposive Sampling as a Tool for Informant Selection. Ethnobotany Research and Applications 5, 0 (Dec. 2007), 147–158. http://ethnobotanyjournal.org/index.php/era/article/view/126 Number: 0.",
      "doi": ""
    },
    {
      "text": "Daniel Trottier. 2017. Digital vigilantism as weaponisation of visibility. Philosophy and Technology 30, 1 (2017), 55–72.",
      "doi": ""
    },
    {
      "text": "Sukrit Venkatagiri, Aakash Gautam, and Kurt Luther. 2021. CrowdSolve: Managing Tensions in an Expert-Led Crowdsourced Investigation. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–30.",
      "doi": "10.1145/3449192"
    },
    {
      "text": "Sukrit Venkatagiri, Aakash Gautam, and Kurt Luther. 2021. CrowdSolve: Managing Tensions in an Expert-Led Crowdsourced Investigation. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 118 (apr 2021), 30 pages. https://doi.org/10.1145/3449192",
      "doi": "10.1145/3449192"
    },
    {
      "text": "Sukrit Venkatagiri, Jacob Thebault-Spieker, Rachel Kohler, John Purviance, Rifat Sabbir Mansur, and Kurt Luther. 2019. GroundTruth: Augmenting Expert Image Geolocation with Crowdsourcing and Shared Representations. Proc. ACM Hum.-Comput. Interact. 3, CSCW (Nov. 2019), 107:1–107:30. https://doi.org/10.1145/3359209",
      "doi": "10.1145/3359209"
    },
    {
      "text": "Daniel Votipka, Eric Zhang, and Michelle L. Mazurek. 2021. HackEd: A Pedagogical Analysis of Online Vulnerability Discovery Exercises. In 2021 IEEE Symposium on Security and Privacy (SP). IEEE, San Francisco, CA, USA, 1268–1285. https://doi.org/10.1109/SP40001.2021.00092",
      "doi": ""
    },
    {
      "text": "Andrea Wiggins and Yurong He. 2016. Community-Based Data Validation Practices in Citizen Science. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work and Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 1548–1559. https://doi.org/10.1145/2818048.2820063",
      "doi": "10.1145/2818048.2820063"
    },
    {
      "text": "Heather J Williams and Ilana Blum. 2018. Defining second generation open source intelligence (OSINT) for the defense enterprise. Technical Report. RAND Corporation Santa Monica United States.",
      "doi": ""
    },
    {
      "text": "Anita Williams Woolley, Christopher F. Chabris, Alex Pentland, Nada Hashmi, and Thomas W. Malone. 2010. Evidence for a Collective Intelligence Factor in the Performance of Human Groups. Science 330, 6004 (Oct. 2010), 686–688. https://doi.org/10.1126/science.1193147 Publisher: American Association for the Advancement of Science Section: Report.",
      "doi": ""
    },
    {
      "text": "Volker Wulf, Kaoru Misaki, Meryem Atam, David Randall, and Markus Rohde. 2013. ’On the ground’ in Sidi Bouzid: investigating social media use during the tunisian revolution. In Proceedings of the 2013 conference on Computer supported cooperative work(CSCW ’13). Association for Computing Machinery, New York, NY, USA, 1409–1418. https://doi.org/10.1145/2441776.2441935",
      "doi": "10.1145/2441776.2441935"
    },
    {
      "text": "Elizabeth Yardley, Adam George Thomas Lynes, David Wilson, and Emma Kelly. 2018. What’s the deal with ‘websleuthing’? News media representations of amateur detectives in networked spaces. Crime, Media, Culture 14, 1 (2018), 81–109. https://doi.org/10.1177/1741659016674045",
      "doi": ""
    },
    {
      "text": "Nick Yee, Nicolas Ducheneaut, and Les Nelson. 2012. Online gaming motivations scale: development and validation. In Proceedings of the SIGCHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 4.",
      "doi": "10.1145/2207676.2208681"
    },
    {
      "text": "Lixiu Yu, Paul André, Aniket Kittur, and Robert Kraut. 2014. A comparison of social, learning, and financial strategies on crowd engagement and output quality. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing(CSCW ’14). Association for Computing Machinery, New York, NY, USA, 967–978. https://doi.org/10.1145/2531602.2531729",
      "doi": "10.1145/2531602.2531729"
    },
    {
      "text": "Lovro Šubelj, Štefan Furlan, and Marko Bajec. 2011. An expert system for detecting automobile insurance fraud using social network analysis. Expert Systems with Applications 38, 1 (Jan. 2011), 1039–1052. https://doi.org/10.1016/j.eswa.2010.07.143",
      "doi": "10.1016/j.eswa.2010.07.143"
    }
  ]
}