{
  "doi": "10.1145/3491102.3502109",
  "title": "Critical-Playful Speculations with Cameras in the Home",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-22",
  "year": 2022,
  "badges": [],
  "abstract": "Smart home cameras present new challenges for understanding behaviors and relationships surrounding always-on, domestic recording systems. We designed a series of discursive activities involving 16 individuals from ten households for six weeks in their everyday settings. These activities functioned as speculative probes—prompting participants to reflect on themes of privacy and power through filming with cameras in their households. Our research design foregrounded critical-playful enactments that allowed participants to speculate potentials for relationships with cameras in the home beyond everyday use. We present four key dynamics with participants and home cameras by examining their relationships to: the camera's eye, filming, their data, and camera's societal contexts. We contribute discussions about the mundane, information privacy, and post-hoc reflection with one's camera footage. Overall, our findings reveal the camera as a strange, yet banal entity in the home—interrogating how participants compose and handle their own and others’ video data.",
  "tags": [
    "smart cameras",
    "speculative",
    "domestic technology",
    "enactments",
    "home",
    "personal data",
    "privacy",
    "Design research",
    "Internet of Things"
  ],
  "authors": [
    {
      "name": "Neilly H. Tan",
      "institution": "Human Centered Design & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659897752",
      "orcid": "missing"
    },
    {
      "name": "Brian Kinnee",
      "institution": "Human Centered Design & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237548",
      "orcid": "0000-0002-1177-6942"
    },
    {
      "name": "Dana Langseth",
      "institution": "Human Centered Design & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239980",
      "orcid": "missing"
    },
    {
      "name": "Sean A. Munson",
      "institution": "Human Centered Design & Engineering, University of Washington, United States",
      "img": "/do/10.1145/contrib-81416604516/rel-imgonly/12239463_533957215446_4643031366914155723_n.jpg",
      "acmid": "81416604516",
      "orcid": "0000-0002-0472-6138"
    },
    {
      "name": "Audrey Desjardins",
      "institution": "School of Art + Art History + Design, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484656227",
      "orcid": "0000-0002-1980-1292"
    }
  ],
  "references": [
    {
      "text": "Amelia Acker. 2017. When is a Record? Arch. Multiverse (2017).",
      "doi": ""
    },
    {
      "text": "Amazon Ring. Ring TV - Family & Friends.",
      "doi": ""
    },
    {
      "text": "Lauren Barack. 2018. Parents are using home security systems to watch their kids - Gearbrain. GearBrain.",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer. 2015. Usees. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, Seoul Republic of Korea, 3295–3298.",
      "doi": ""
    },
    {
      "text": "Jesse Josua Benjamin, Arne Berger, Nick Merrill, and James Pierce. 2021. Machine Learning Uncertainty as a Design Material: A Post-Phenomenological Inquiry. Proc. 2021 CHI Conf. Hum. Factors Comput. Syst. (May 2021), 1–14.",
      "doi": "10.1145/3411764.3445481"
    },
    {
      "text": "Jane Bennett. 2010. Vibrant matter. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Pierre Bourdieu. 1977. Outline of a theory of practice. Briggs L2003 Mother Child Race Nation Vis. Iconogr. Rescue (1977).",
      "doi": ""
    },
    {
      "text": "Lauren Bridges. 2021. Infrastructural obfuscation: unpacking the carceral logics of the Ring surveillant assemblage. Inf. Commun. Soc. 24, 6 (April 2021), 830–849.",
      "doi": ""
    },
    {
      "text": "Simone Browne. 2015. Dark Matters: On the Surveillance of Blackness. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Christopher Budd. 2019. Wyze data leak: Key takeaways from server mistake that exposed information from 2.4M customers. GeekWire.",
      "doi": ""
    },
    {
      "text": "Will Burns. 2018. The “Nestie Awards” From Nest Is A Content Idea Firing On All Cylinders. Forbes.",
      "doi": ""
    },
    {
      "text": "Judith Butler. 1993. Endangered/Endangering: Schematic Racism and White Paranoia. In Reading Rodney King/Reading Urban Uprising (1st ed.). Routledge, 15–22.",
      "doi": ""
    },
    {
      "text": "Stuart Candy and Jake Dunagan. 2017. Designing an experiential scenario: The People Who Vanished. Futures 86, (February 2017), 136–153.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory: A practical guide through qualitative analysis. sage.",
      "doi": ""
    },
    {
      "text": "Yu-Ting Cheng, Mathias Funk, Wenn-Chieh Tsai, and Lin-Lin Chen. 2019. Peekaboo Cam: Designing an Observational Camera for Home Ecologies Concerning Privacy. In Proceedings of the 2019 on Designing Interactive Systems Conference, ACM, San Diego CA USA, 823–836.",
      "doi": "10.1145/3322276.3323699"
    },
    {
      "text": "Marshini Chetty, Ja-Young Sung, and Rebecca E. Grinter. 2007. How Smart Homes Learn: The Evolution of the Networked Home and Household. In UbiComp 2007: Ubiquitous Computing, John Krumm, Gregory D. Abowd, Aruna Seneviratne and Thomas Strang (eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 127–144.",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Sunny Consolvo, Jaeyeon Jung, Beverly Harrison, Shwetak N. Patel, and Julie A. Kientz. 2012. Investigating receptiveness to sensing and inference in the home using sensor proxies. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing - UbiComp ’12, ACM Press, Pittsburgh, Pennsylvania, 61.",
      "doi": "10.1145/2370216.2370226"
    },
    {
      "text": "Audrey Desjardins and Aubree Ball. 2018. Revealing tensions in autobiographical design in HCI. In proceedings of the 2018 designing interactive systems conference, 753–764.",
      "doi": "10.1145/3196709.3196781"
    },
    {
      "text": "Audrey Desjardins, Heidi R. Biggs, Cayla Key, and Jeremy E. Viny. 2020. IoT Data in the Home: Observing Entanglements and Drawing New Encounters. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, ACM, Honolulu HI USA, 1–13.",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins and Cayla Key. 2020. Parallels, Tangents, and Loops: Reflections on the “Through” Part of RtD. In Proceedings of the 2020 ACM Designing Interactive Systems Conference, ACM, Eindhoven Netherlands, 2133–2147.",
      "doi": "10.1145/3357236.3395586"
    },
    {
      "text": "Audrey Desjardins, Cayla Key, Heidi R. Biggs, and Kelsey Aschenbeck. 2019. Bespoke Booklets: A Method for Situated Co-Speculation. In Proceedings of the 2019 on Designing Interactive Systems Conference, ACM, San Diego CA USA, 697–709.",
      "doi": "10.1145/3322276.3322311"
    },
    {
      "text": "Audrey Desjardins, Jeremy E. Viny, Cayla Key, and Nouela Johnston. 2019. Alternative Avenues for IoT: Designing with Non-Stereotypical Homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, ACM Press, Glasgow, Scotland Uk, 1–13.",
      "doi": "10.1145/3290605.3300581"
    },
    {
      "text": "Audrey Desjardins, Ron Wakkary, and William Odom. 2016. Behind the Lens: A Visual Exploration of Epistemological Commitments in HCI Research on the Home. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems, ACM, Brisbane QLD Australia, 360–376.",
      "doi": "10.1145/2901790.2901910"
    },
    {
      "text": "Laura Devendorf, Kristina Andersen, Daniela K. Rosner, Ron Wakkary, and James Pierce. 2019. From HCI to HCI-Amusement: Strategies for Engaging what New Technology Makes Old. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, Glasgow Scotland Uk, 1–12.",
      "doi": "10.1145/3290605.3300265"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2001. Design noir: The secret life of electronic objects. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative everything: design, fiction, and social dreaming. MIT press.",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Chris Elsden, David Chatting, Abigail C. Durrant, Andrew Garbett, Bettina Nissen, John Vines, and David S. Kirk. 2017. On Speculative Enactments. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, ACM, Denver Colorado USA, 5386–5399.",
      "doi": ""
    },
    {
      "text": "Mary Flanagan. 2009. Critical play: Radical game design. MIT press.",
      "doi": ""
    },
    {
      "text": "Sarah E. Fox, Rafael M.L. Silva, and Daniela K. Rosner. 2018. Beyond the Prototype: Maintenance, Collective Responsibility, and Public IoT. In Proceedings of the 2018 Designing Interactive Systems Conference, ACM, Hong Kong China, 21–32.",
      "doi": ""
    },
    {
      "text": "Sarah Fox and Daniela K. Rosner. 2016. Continuing the Dialogue: Bringing Research Accounts Back into the Field. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, San Jose California USA, 1426–1430.",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger. 2020. Entanglement HCI The Next Wave? ACM Trans. Comput.-Hum. Interact. 27, 1 (January 2020), 1–27.",
      "doi": "10.1145/3364998"
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2018. “A Stalker's Paradise”: How Intimate Partner Abusers Exploit Technology. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–13.",
      "doi": "10.1145/3173574.3174241"
    },
    {
      "text": "Ester Fritsch, Irina Shklovski, and Rachel Douglas-Jones. 2018. Calling for a Revolution: An Analysis of IoT Manifestos. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–13.",
      "doi": "10.1145/3173574.3173876"
    },
    {
      "text": "William W Gaver. 2006. The video window: my life with a ludic system. Pers. Ubiquitous Comput. 10, 2–3 (2006), 60–65.",
      "doi": "10.1007/s00779-005-0002-2"
    },
    {
      "text": "William W. Gaver, John Bowers, Andrew Boucher, Hans Gellerson, Sarah Pennington, Albrecht Schmidt, Anthony Steed, Nicholas Villars, and Brendan Walker. 2004. The drift table: designing for ludic engagement. In Extended abstracts of the 2004 conference on Human factors and computing systems - CHI ’04, ACM Press, Vienna, Austria, 885.",
      "doi": "10.1145/985921.985947"
    },
    {
      "text": "Christine Geeng and Anonymous Author. 2020. EGregor: An Eldritch Privacy Mental Model for Smart Assistants. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems, ACM, Honolulu HI USA, 1–9.",
      "doi": ""
    },
    {
      "text": "Chris Gilliard and David Golumbia. 2021. Luxury Surveillance. Real Life.",
      "doi": ""
    },
    {
      "text": "Mili Godio. 2021. Why the Furbo is ideal for dedicated pet owners. NBC News.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1978. The presentation of self in everyday life. Harmondsworth London.",
      "doi": ""
    },
    {
      "text": "Charles Goodwin. 1994. Professional Vision. Am. Anthropol. New Ser. 96, 3 (1994), 606–633.",
      "doi": ""
    },
    {
      "text": "Benjamin Goold, Ian Loader, and Angélica Thumala. 2013. THE BANALITY OF SECURITY: The Curious Case of Surveillance Cameras. Br. J. Criminol. 53, 6 (2013), 977–996.",
      "doi": ""
    },
    {
      "text": "Stephen Graham and David Wood. 2003. Digitizing Surveillance: Categorization, Space, Inequality. Crit. Soc. Policy 23, 2 (May 2003), 227–248.",
      "doi": ""
    },
    {
      "text": "Jeffrey T Hancock, Mor Naaman, and Karen Levy. 2020. AI-Mediated Communication: Definition, Research Agenda, and Ethical Considerations. J. Comput.-Mediat. Commun. 25, 1 (March 2020), 89–100.",
      "doi": ""
    },
    {
      "text": "Lone Koefoed Hansen, Julie Rico, Giulio Jacucci, Stephen Brewster, and Daniel Ashbrook. 2011. Performative interaction in public space. In Proceedings of the 2011 annual conference on Human factors in computing systems (CHI EA ’11), Association for Computing Machinery, United States, 49–52.",
      "doi": "10.1145/1979742.1979595"
    },
    {
      "text": "John Helmes, Caroline Hummels, and Abigail Sellen. 2009. The other brother: re-experiencing spontaneous moments from domestic life. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction - TEI ’09, ACM Press, Cambridge, United Kingdom, 233.",
      "doi": "10.1145/1517664.1517715"
    },
    {
      "text": "Yasamin Heshmat, Carman Neustaedter, and Brendan DeBrincat. 2017. The Autobiographical Design and Long Term Usage of an Always-On Video Recording System for the Home. In Proceedings of the 2017 Conference on Designing Interactive Systems, ACM, Edinburgh United Kingdom, 675–687.",
      "doi": "10.1145/3064663.3064759"
    },
    {
      "text": "Steve Hodges, Lyndsay Williams, Emma Berry, Shahram Izadi, James Srinivasan, Alex Butler, Gavin Smyth, Narinder Kapur, and Ken Wood. 2006. SenseCam: A Retrospective Memory Aid. In UbiComp 2006: Ubiquitous Computing, Paul Dourish and Adrian Friday (eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 177–193.",
      "doi": ""
    },
    {
      "text": "Sun-ha Hong. 2020. Technologies of Speculation. New York University Press.",
      "doi": ""
    },
    {
      "text": "Heather A Horst, Cherry Baylosis, and Sheba Mohammid. 2021. Looking professional: How women decide what to wear with and through automated technologies. Convergence 27, 5 (October 2021), 1250–1263.",
      "doi": ""
    },
    {
      "text": "David Howard and Edward Mabley. 1995. The tools of screenwriting: A writer's guide to the craft and elements of a screenplay. Macmillan.",
      "doi": ""
    },
    {
      "text": "Dorothy Howard and Lilly Irani. 2019. Ways of Knowing When Research Subjects Care. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, Glasgow Scotland Uk, 1–16.",
      "doi": "10.1145/3290605.3300327"
    },
    {
      "text": "Jane Im, Jill Dimond, Melody Berton, Una Lee, Katherine Mustelier, Mark S. Ackerman, and Eric Gilbert. 2021. Yes: Affirmative Consent as a Theoretical Framework for Understanding and Imagining Social Platforms. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–18.",
      "doi": "10.1145/3411764.3445778"
    },
    {
      "text": "Jason Kelley and Matthew Guariglia. 2020. Amazon Ring Must End Its Dangerous Partnerships With Police. Electronic Frontier Foundation.",
      "doi": ""
    },
    {
      "text": "Jennifer King and Jael Makagon. 2020. The fallacy behind private surveillance cameras in San Francisco. CalMatters.",
      "doi": ""
    },
    {
      "text": "Josephine Klefeker, libi striegl, and Laura Devendorf. 2020. What HCI Can Learn from ASMR: Becoming Enchanted with the Mundane. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, ACM, Honolulu HI USA, 1–12.",
      "doi": "10.1145/3313831.3376741"
    },
    {
      "text": "Sandjar Kozubaev, Fernando Rochaix, Carl DiSalvo, and Christopher A. Le Dantec. 2019. Spaces and Traces: Implications of Smart Technology in Public Housing. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, Glasgow Scotland Uk, 1–13.",
      "doi": ""
    },
    {
      "text": "Martin J. Kraemer. 2018. Preserving Privacy in Smart Homes: A Socio-Cultural Approach. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–4.",
      "doi": "10.1145/3170427.3173018"
    },
    {
      "text": "Rob van Kranenburg. 2017. How to run a country (I know where that door is). The State of Responsible Internet of Things (IoT).",
      "doi": ""
    },
    {
      "text": "Rahim Kurwa. 2019. Building the Digitally Gated Community: The Case of Nextdoor. Surveill. Soc. 17, 1/2 (March 2019), 111–117.",
      "doi": ""
    },
    {
      "text": "Albrecht Kurze, Andreas Bischof, Sören Totzauer, Michael Storz, Maximilian Eibl, Margot Brereton, and Arne Berger. 2020. Guess the Data: Data Work to Understand How People Make Sense of and Use Simple Sensor Data from Homes. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, 1–12.",
      "doi": "10.1145/3313831.3376273"
    },
    {
      "text": "Bruno Latour. 1992. “‘Where Are the Missing Masses? The Sociology of a Few Mundane Artifacts.’” In Shaping Technology, Building Society: Studies in Sociotechnological Change. MIT Press, Cambridge, Massachusetts, 225–258.",
      "doi": ""
    },
    {
      "text": "Josephine Lau, Benjamin Zimmerman, and Florian Schaub. 2018. Alexa, Are You Listening?: Privacy Perceptions, Concerns and Privacy-seeking Behaviors with Smart Speakers. Proc. ACM Hum.-Comput. Interact. 2, CSCW (November 2018), 1–31.",
      "doi": "10.1145/3274371"
    },
    {
      "text": "Roxanne Leitão. 2018. Digital Technologies and their Role in Intimate Partner Violence. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–6.",
      "doi": "10.1145/3170427.3180305"
    },
    {
      "text": "Karen E C Levy. 2014. Intimate Surveillance. Ida. Law Rev. 51, (2014), 679.",
      "doi": ""
    },
    {
      "text": "Calvin A. Liang, Katie Albertson, Florence Williams, David Inwards-Breland, Sean A. Munson, Julie A. Kientz, and Kym Ahrens. 2020. Designing an online sex education resource for gender-diverse youth. In Proceedings of the Interaction Design and Children Conference, ACM, London United Kingdom, 108–120.",
      "doi": "10.1145/3392063.3394404"
    },
    {
      "text": "Ben Lovejoy. 2021. Huge Eufy privacy breach shows live and recorded cam feeds to strangers. 9to5Mac.",
      "doi": ""
    },
    {
      "text": "Haley MacLeod, Ben Jelen, Annu Prabhakar, Lora Oehlberg, Katie Siek, and Kay Connelly. 2016. Asynchronous Remote Communities (ARC) for Researching Distributed Populations. In Proceedings of the 10th EAI International Conference on Pervasive Computing Technologies for Healthcare, ACM, Cancun, Mexico.",
      "doi": "10.5555/3021319.3021320"
    },
    {
      "text": "Steve Mann. 2013. Veillance and Reciprocal Transparency: Surveillance versus Sousveillance, AR Glass, Lifeglogging, and Wearable Computing. IEEE Int. Symp. Technol. Soc. (2013), 12.",
      "doi": ""
    },
    {
      "text": "Steve Mann, Jason Nolan, and Barry Wellman. 2003. Sousveillance: Inventing and Using Wearable Computing Devices for Data Collection in Surveillance Environments. Surveill. Soc. 1, 3 (2003), 331–355.",
      "doi": ""
    },
    {
      "text": "Nora McDonald and Andrea Forte. 2020. The Politics of Privacy Theories: Moving from Norms to Vulnerabilities. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, ACM, Honolulu HI USA, 1–14.",
      "doi": "10.1145/3313831.3376167"
    },
    {
      "text": "Heather McKinnon. 2016. Finding Design Value in Modern Mundanity. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems, ACM, Brisbane QLD Australia, 1059–1071.",
      "doi": "10.1145/2901790.2901906"
    },
    {
      "text": "Emily McReynolds, Sarah Hubbard, Timothy Lau, Aditya Saraf, Maya Cakmak, and Franziska Roesner. 2017. Toys that Listen: A Study of Parents, Children, and Internet-Connected Toys. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, ACM, Denver Colorado USA, 5197–5207.",
      "doi": "10.1145/3025453.3025735"
    },
    {
      "text": "Rebecca Michelson, Akeiylah DeWitt, Ria Nagar, Alexis Hiniker, Jason Yip, Sean A. Munson, and Julie A. Kientz. 2021. Parenting in a Pandemic: Juggling Multiple Roles and Managing Technology Use in Family Life During COVID-19 in the United States. Proc. ACM Hum.-Comput. Interact. 5, CSCW2 (October 2021), 1–39.",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2004. Privacy as contextual integrity. Wash Rev 79, (2004), 119.",
      "doi": ""
    },
    {
      "text": "Clive Norris and Gary Armstrong. 1999. CCTV and the Rise of Mass Surveillance Society. In Crime Unlimited? Questions for the 21st Century, Pat Carlen and Rod Morgan (eds.). Palgrave Macmillan UK, London, 76–98.",
      "doi": ""
    },
    {
      "text": "William Odom, Sumeet Anand, Doenja Oogjes, and Jo Shin. 2019. Diversifying the Domestic: A Design Inquiry into Collective and Mobile Living. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS ’19), Association for Computing Machinery, New York, NY, USA, 1377–1390.",
      "doi": "10.1145/3322276.3323687"
    },
    {
      "text": "William Odom and Tijs Duel. 2018. On the Design of OLO Radio: Investigating Metadata as a Design Material. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–9.",
      "doi": "10.1145/3173574.3173678"
    },
    {
      "text": "William T. Odom, Abigail J. Sellen, Richard Banks, David S. Kirk, Tim Regan, Mark Selby, Jodi L. Forlizzi, and John Zimmerman. 2014. Designing for slowness, anticipation and re-visitation: a long term field study of the photobox. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’14), Association for Computing Machinery, New York, NY, USA, 1961–1970.",
      "doi": "10.1145/2556288.2557178"
    },
    {
      "text": "Emmi Parviainen and Marie Louise Juul Søndergaard. 2020. Experiential Qualities of Whispering with Voice Assistants. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, ACM, Honolulu HI USA, 1–13.",
      "doi": "10.1145/3313831.3376187"
    },
    {
      "text": "Firaz Peer and Carl DiSalvo. 2019. Workshops as Boundary Objects for Data Infrastructure Literacy and Design. In Proceedings of the 2019 on Designing Interactive Systems Conference, ACM, San Diego CA USA, 1363–1375.",
      "doi": ""
    },
    {
      "text": "James Pierce. 2019. Smart Home Security Cameras and Shifting Lines of Creepiness: A Design-Led Inquiry. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3290605.3300275"
    },
    {
      "text": "James Pierce. 2020. Roomba+Clips Cam: Exploring Unpredictable Autonomy in Everyday Smart Systems. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference, ACM, Eindhoven Netherlands, 317–320.",
      "doi": "10.1145/3393914.3395816"
    },
    {
      "text": "James Pierce, Richmond Y. Wong, and Nick Merrill. 2020. Sensor Illumination: Exploring Design Qualities and Ethical Implications of Smart Cameras and Image/Video Analytics. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, ACM, Honolulu HI USA, 1–19.",
      "doi": "10.1145/3313831.3376347"
    },
    {
      "text": "Anuradha Reddy, A. Baki Kocaballi, Iohanna Nicenboim, Marie Louise Juul Søndergaard, Maria Luce Lupetti, Cayla Key, Chris Speed, Dan Lockton, Elisa Giaccardi, Francisca Grommé, Holly Robbins, Namrata Primlani, Paulina Yurman, Shanti Sumartojo, Thao Phan, Viktor Bedö, and Yolande Strengers. 2021. Making Everyday Things Talk: Speculative Conversations into the Future of Voice Interfaces at Home. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–16.",
      "doi": "10.1145/3411763.3450390"
    },
    {
      "text": "Jennifer A. Rode, Eleanor F. Toye, and Alan F. Blackwell. 2004. The fuzzy felt ethnography: understanding the programming patterns of domestic appliances. Pers. Ubiquitous Comput. 8, 3–4 (July 2004).",
      "doi": "10.1007/s00779-004-0272-0"
    },
    {
      "text": "Jon Rogers, Loraine Clarke, Martin Skelly, Nick Taylor, Pete Thomas, Michelle Thorne, Solana Larsen, Katarzyna Odrozek, Julia Kloiber, Peter Bihr, and others. 2019. Our friends electric: Reflections on advocacy and design research for the voice enabled internet. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1–13.",
      "doi": "10.1145/3290605.3300344"
    },
    {
      "text": "Pedro Sanches, Vasiliki Tsaknaki, Asreen Rostami, and Barry Brown. 2020. Under Surveillance: Technology Practices of those Monitored by the State. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, ACM, Honolulu HI USA, 1–13.",
      "doi": "10.1145/3313831.3376889"
    },
    {
      "text": "Phoebe Sengers. 2010. The Ideology of Modernism in HCI. ACM CHI 2010 Workshop Crit. Dialogue Interact. Exp. Theory (April 2010), 5.",
      "doi": ""
    },
    {
      "text": "William Seymour and Max Van Kleek. 2020. Does Siri Have a Soul? Exploring Voice Assistants Through Shinto Design Fictions. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems, ACM, Honolulu HI USA, 1–12.",
      "doi": ""
    },
    {
      "text": "Samarth Singhal, Carman Neustaedter, William Odom, Lyn Bartram, and Yasamin Heshmat. 2018. Time-Turner: Designing for Reflection and Remembrance of Moments in the Home. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–14.",
      "doi": "10.1145/3173574.3173753"
    },
    {
      "text": "Jo Spence and Patricia Holland. 1991. Family snaps: The meanings of domestic photography. Virago.",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star. 1998. Grounded classification: Grounded theory and faceted classification. (1998).",
      "doi": ""
    },
    {
      "text": "Hito Steyerl. 2009. In defense of the poor image. E-Flux J. 10, 11 (2009).",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1990. Basics of qualitative research. Sage publications.",
      "doi": ""
    },
    {
      "text": "Yolande Strengers, Jenny Kennedy, Paula Arcari, Larissa Nicholls, and Melissa Gregg. 2019. Protection, Productivity and Pleasure in the Smart Home: Emerging Expectations and Gendered Insights from Australian Early Adopters. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, Glasgow Scotland UK, 1–13.",
      "doi": "10.1145/3290605.3300875"
    },
    {
      "text": "Marita Sturken and Lisa Cartwright. 2001. Practices of looking. Oxford University Press Oxford.",
      "doi": ""
    },
    {
      "text": "Alex Sundby. 2019. Hacker spoke to baby, hurled obscenities at couple using Nest camera, dad says. CBS News.",
      "doi": ""
    },
    {
      "text": "Neille-Ann H. Tan, Han Sha, Eda Celen, Phucanh Tran, Kelly Wang, Gifford Cheung, Philip Hinch, and Jeff Huang. 2018. Rewind: Automatically Reconstructing Everyday Memories with First-Person Perspectives. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 4 (December 2018), 1–20.",
      "doi": "10.1145/3287069"
    },
    {
      "text": "Marc Teyssier, Marion Koelle, Paul Strohmeier, Bruno Fruchard, and Jürgen Steimle. 2021. Eyecam: Revealing Relations between Humans and Sensing Devices through an Anthropomorphic Webcam. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–13.",
      "doi": "10.1145/3411764.3445491"
    },
    {
      "text": "Bruce M Tharp and Stephanie M Tharp. 2019. Discursive design: critical, speculative, and alternative things. MIT Press.",
      "doi": ""
    },
    {
      "text": "Topp Studio. 2016. Responsible IoT: 3 Essential Design Features. The Conference.",
      "doi": ""
    },
    {
      "text": "Jennifer Turns and Judith Ramey. 2006. Active and collaborative learning in the practice of research: Credit-based directed research groups. Tech. Commun. 53, 3 (2006), 296–307.",
      "doi": ""
    },
    {
      "text": "Ron Wakkary, William Odom, Sabrina Hauser, Garnet Hertz, and Henry Lin. 2015. Material speculation: Actual artifacts for critical inquiry. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives, 97–108.",
      "doi": "10.7146/aahcc.v1i1.21299"
    },
    {
      "text": "Mark Weiser. 1991. The Computer for the 21 st Century. Sci. Am. 265, 3 (1991), 94–105.",
      "doi": ""
    },
    {
      "text": "Emily West. 2019. Amazon: Surveillance as a Service. Surveill. Soc. 17, 1/2 (March 2019), 27–33.",
      "doi": ""
    },
    {
      "text": "Cedric Deslandes Whitney, Teresa Naval, Elizabeth Quepons, Simrandeep Singh, Steven R Rick, and Lilly Irani. 2021. HCI Tactics for Politics from Below: Meeting the Challenges of Smart Cities. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–15.",
      "doi": "10.1145/3411764.3445314"
    },
    {
      "text": "Megan Wollerton. 2020. Amazon's new Ring camera is actually a flying drone – for inside your home. CNET.",
      "doi": ""
    },
    {
      "text": "Richmond Y. Wong, Ellen Van Wyk, and James Pierce. 2017. Real-Fictional Entanglements: Using Science Fiction and Design Fiction to Interrogate Sensing Technologies. In Proceedings of the 2017 Conference on Designing Interactive Systems, ACM, Edinburgh United Kingdom, 567–579.",
      "doi": "10.1145/3064663.3064682"
    },
    {
      "text": "Paweł W. Woźniak, Jakob Karolus, Florian Lang, Caroline Eckerth, Johannes Schöning, Yvonne Rogers, and Jasmin Niess. 2021. Creepy Technology:What Is It and How Do You Measure It? In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–13.",
      "doi": "10.1145/3411764.3445299"
    },
    {
      "text": "Serena Zheng, Noah Apthorpe, Marshini Chetty, and Nick Feamster. 2018. User Perceptions of Smart Home IoT Privacy. Proc. ACM Hum.-Comput. Interact. 2, CSCW (November 2018), 200:1-200:20.",
      "doi": "10.1145/3274469"
    },
    {
      "text": "Shoshana Zuboff. 2018. The Age of Surveillance Capitalism: The Fight for a Human Future at the New Frontier of Power (1st ed.).",
      "doi": ""
    }
  ]
}