{
  "doi": "10.1145/3491102.3502098",
  "title": "Psychometric Properties of the User Experience Questionnaire (UEQ)",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2022,
  "badges": [],
  "abstract": "User experience (UX) summarizes user perceptions and responses resulting from the interaction with a product, system, or service. The User Experience Questionnaire (UEQ) is one standardized instrument for measuring UX. With six scales, it identifies areas in which product improvements will have the highest impact. In this paper, we evaluate the reliability and validity of this questionnaire. The data of N = 1, 121 participants who interacted with one of 23 products indicated an acceptable to good reliability of all scales. The results show, however, that the scales were not independent of each other. Combining perspicuity, efficiency, and dependability to pragmatic aspects as well as novelty and stimulation to hedonic aspects of UX improved the model fit significantly. The systematic variations of product properties and correlations with the System Usability Scale (SUS) in a second experiment with N=499 participants supported the validity of these two factors. Practical implications of the results are discussed.",
  "tags": [
    "user experience",
    "UEQ",
    "psychometric properties"
  ],
  "authors": [
    {
      "name": "Andrea Schankin",
      "institution": "iwp / Institute of Business Psychology, FOM University of Applied Sciences, Germany and TECO / Pervasive Computing Systems, Karlsruhe Institute of Technology, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418599077",
      "orcid": "missing"
    },
    {
      "name": "Matthias Budde",
      "institution": "Disy Informationssysteme GmbH, Germany and TECO / Pervasive Computing Systems, Karlsruhe Institute of Technology, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472643333",
      "orcid": "missing"
    },
    {
      "name": "Till Riedel",
      "institution": "TECO / Pervasive Computing Systems, Karlsruhe Institute of Technology, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81312484295",
      "orcid": "missing"
    },
    {
      "name": "Michael Beigl",
      "institution": "TECO / Pervasive Computing Systems, Karlsruhe Institute of Technology, Germany",
      "img": "/do/10.1145/contrib-81100440045/rel-imgonly/beigl_300dpi_bw.jpg",
      "acmid": "81100440045",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "W. Albert and T. Tullis. 2013. Measuring the user experience: collecting, analyzing, and presenting usability metrics. Newnes.",
      "doi": ""
    },
    {
      "text": "R.W. Belk. 1988. Possessions and the extended self. Journal of consumer research 15, 2 (1988), 139–168.",
      "doi": ""
    },
    {
      "text": "D.E. Berlyne. 1966. Curiosity and exploration. Science 153, 3731 (1966), 25–33.",
      "doi": ""
    },
    {
      "text": "J. Brooke. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4–7.",
      "doi": ""
    },
    {
      "text": "M. Budde, M. Köpke, M. Berning, T. Riedel, and M. Beigl. 2013. Using a 2DST waveguide for usable, physically constrained out-of-band Wi-Fi authentication. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 221–224.",
      "doi": ""
    },
    {
      "text": "M. Budde, T. Riedel, M. Köpke, M. Berning, and M. Beigl. 2014. A Comparative Study to Evaluate the Usability of Context-based Wi-Fi Access Mechanisms. In International Conference on Universal Access in Human-Computer Interaction. Springer, 451–462.",
      "doi": ""
    },
    {
      "text": "M. Budde, A. Schankin, J. Hoffmann, M. Danz, T. Riedel, and M. Beigl. 2017. Participatory Sensing or Participatory Nonsense? – Mitigating the Effect of Human Error on Data Quality in Citizen Science. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 1–23.",
      "doi": "10.1145/3131900"
    },
    {
      "text": "M. Burmester, M. Hassenzahl, and F. Koller. 2002. Usability ist nicht alles Wege zu attraktiven Produkten (Beyond Usability Appeal of interactive Products). I-Com Zeitschrift für interaktive und kooperative Medien 1, 1/2002(2002), 32.",
      "doi": ""
    },
    {
      "text": "J.M. Carroll and J.C. Thomas. 1988. Fun. ACM SIGCHI Bulletin 19, 3 (1988), 21–24.",
      "doi": "10.1145/49108.1045604"
    },
    {
      "text": "R.B. Cattell. 1966. The scree test for the number of factors. Multivariate Behavioural Research 1 (1966), 245–276.",
      "doi": ""
    },
    {
      "text": "J. Cohen. 1988. Statistical power analysis for the behavioral sciences. Erlbaum, Hillsdale.",
      "doi": ""
    },
    {
      "text": "L.J. Cronbach and P.E. Meehl. 1955. Construct validity in psychological tests.Psychological Bulletin 52, 4 (1955), 281–302.",
      "doi": ""
    },
    {
      "text": "ISO DIN. 2009. 9241-210: 2010. Ergonomics of human system interaction-Part 210: Human-centred design for interactive systems. International Standardization Organization (ISO). Switzerland (2009).",
      "doi": ""
    },
    {
      "text": "B. D. Harper and K. L. Norman. 1993. Improving user satisfaction: The questionnaire for user interaction satisfaction version 5.5. In Proceedings of the 1st Annual Mid-Atlantic Human Factors Conference. 224–228.",
      "doi": ""
    },
    {
      "text": "M. Hassenzahl. 2001. The effect of perceived hedonic quality on product appealingness. International Journal of Human-Computer Interaction 13, 4(2001), 481–499.",
      "doi": ""
    },
    {
      "text": "M. Hassenzahl. 2003. The thing and I: understanding the relationship between user and product. In Funology. Springer, 31–42.",
      "doi": "10.5555/1139008.1139015"
    },
    {
      "text": "M. Hassenzahl. 2004. The interplay of beauty, goodness, and usability in interactive products. Human-computer interaction 19, 4 (2004), 319–349.",
      "doi": ""
    },
    {
      "text": "M. Hassenzahl, A. Beu, and M. Burmester. 2001. Engineering joy. IEEE Software 18, 1 (2001), 70.",
      "doi": "10.1109/52.903170"
    },
    {
      "text": "M. Hassenzahl, M. Burmester, and F. Koller. 2003. AttrakDiff: Ein Fragebogen zur Messung wahrgenommener hedonischer und pragmatischer Qualität. In Mensch & Computer 2003. Springer, 187–196.",
      "doi": ""
    },
    {
      "text": "M. Hassenzahl, A. Platz, M. Burmester, and K. Lehner. 2000. Hedonic and ergonomic quality aspects determine a software’s appeal. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 201–208.",
      "doi": "10.1145/332040.332432"
    },
    {
      "text": "M. Hassenzahl and N. Tractinsky. 2006. User experience-a research agenda. Behaviour & information technology 25, 2 (2006), 91–97.",
      "doi": ""
    },
    {
      "text": "P.W. Jordan. 2002. Designing pleasurable products: An introduction to the new human factors. CRC press.",
      "doi": ""
    },
    {
      "text": "B. Laugwitz, T. Held, and M. Schrepp. 2008. Construction and evaluation of a user experience questionnaire. In Symposium of the Austrian HCI and Usability Engineering Group. Springer, 63–76.",
      "doi": ""
    },
    {
      "text": "R.J. Logan. 1994. Behavioral and emotional usability: Thomson consumer electronics. In Usability in practice: how companies develop user-friendly products. 59–82.",
      "doi": ""
    },
    {
      "text": "N. Mundorf, S. Westin, and N. Dholakia. 1993. Effects of hedonic components and user’s gender on the acceptance of screen-based information services. Behaviour & Information Technology 12, 5 (1993), 293–303.",
      "doi": ""
    },
    {
      "text": "D.A. Norman. 2004. Emotional design. Ubiquity 4, 45 (2004), 1.",
      "doi": "10.1145/985600.966013"
    },
    {
      "text": "M. Rauschenberger, M. Schrepp, M.P. Cota, S. Olschner, and J. Thomaschewski. 2013. Efficient measurement of the user experience of interactive products. How to use the user experience questionnaire (ueq). example: spanish language version. IJIMAI 2, 1 (2013), 39–45.",
      "doi": ""
    },
    {
      "text": "J. Sauro. 2015. SUPR-Q: a comprehensive measure of the quality of the website user experience. Journal of Usability Studies 10, 2 (2015), 68–86.",
      "doi": "10.5555/2817315.2817317"
    },
    {
      "text": "M. Schrepp, A. Hinderks, and J. Thomaschewski. 2014. Applying the User Experience Questionnaire (UEQ) in different evaluation scenarios. In International Conference of Design, User Experience, and Usability. Springer, 383–392.",
      "doi": ""
    },
    {
      "text": "M. Schrepp, A. Hinderks, and J. Thomaschewski. 2017. Konstruktion einer Kurzversion des User Experience Questionnaire. Mensch und Computer 2017-Tagungsband(2017).",
      "doi": ""
    },
    {
      "text": "M. Thüring. 2013. Nutzererleben Komponenten, Phasen, Phänomene.. In Mensch & Computer Workshopband. 113–120.",
      "doi": ""
    },
    {
      "text": "M. Thüring and S. Mahlke. 2007. Usability, aesthetics and emotions in human–technology interaction. International Journal of Psychology 42, 4 (2007), 253–264.",
      "doi": ""
    },
    {
      "text": "N. Tractinsky, A.S. Katz, and D. Ikar. 2000. What is beautiful is usable. Interacting with computers 13, 2 (2000), 127–145.",
      "doi": ""
    }
  ]
}