{
  "doi": "10.1145/3491102.3502083",
  "title": "Privacy, Surveillance, and Power in the Gig Economy",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "This paper addresses calls for more research on privacy in the gig economy across a range of work platforms. To understand privacy risks, behaviors, and consequences from the perspective of workers, we analyzed workers’ posts about privacy and surveillance from 12 Reddit forums representing four main types of work (crowdwork, freelancing, ridesharing, and delivery). We found that workers perceive both platform companies and customers as sources of unnecessary and opaque data collection and surveillance that can threaten their privacy, safety, and economic outcomes. Workers also engage in many risk mitigation strategies, including self-protective surveillance behaviors such as video recording themselves and customers, as a costly but necessary response to power imbalances created by surveillance. Based on our multi-platform analysis, we present a guiding set of questions that workers, designers, and researchers can use to assess the privacy implications of current and future gig work platforms.",
  "authors": [
    {
      "name": "Shruti Sannon",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/do/10.1145/contrib-99659161275/rel-imgonly/ssannon.png",
      "acmid": "99659161275",
      "orcid": "0000-0002-2018-1190"
    },
    {
      "name": "Billie Sun",
      "institution": "Independent, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234831",
      "orcid": "missing"
    },
    {
      "name": "Dan Cosley",
      "institution": "National Science Foundation, United States",
      "img": "/do/10.1145/contrib-81100288358/rel-imgonly/3435035874_f9b2a1d423_o.jpg",
      "acmid": "81100288358",
      "orcid": "0000-0001-8108-1954"
    }
  ],
  "references": [
    {
      "text": "Ifeoma Ajunwa, Kate Crawford, and Jason Schultz. 2017. Limitless worker surveillance. California Law Review 105 (2017), 735–776.",
      "doi": ""
    },
    {
      "text": "Mashael Yousef Almoqbel and Donghee Yvette Wohn. 2019. Individual and collaborative behaviors of rideshare drivers in protecting their safety. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–21.",
      "doi": "10.1145/3359319"
    },
    {
      "text": "Kirstie Ball. 2010. Workplace surveillance: An overview. Labor History 51, 1 (2010), 87–106.",
      "doi": ""
    },
    {
      "text": "Jason Baumgartner, Savvas Zannettou, Brian Keegan, Megan Squire, and Jeremy Blackburn. 2020. The Pushshift Reddit dataset. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 14. AAAI, Palo Alto, CA, USA, 830–839.",
      "doi": ""
    },
    {
      "text": "William S Brown. 1996. Technology, workplace privacy and personhood. Journal of Business Ethics 15, 11 (1996), 1237–1248.",
      "doi": ""
    },
    {
      "text": "Eliane Léontine Bucher, Peter Kalum Schou, and Matthias Waldkirch. 2021. Pacifying the algorithm–Anticipatory compliance in the face of algorithmic management in the gig economy. Organization 28, 1 (2021), 44–67.",
      "doi": ""
    },
    {
      "text": "Juan Carlos Alvarez de la Vega, Marta E. Cecchinato, and John Rooksby. 2021. “Why lose control?” A study of freelancers’ experiences with gig Economy platforms. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–14.",
      "doi": "10.1145/3411764.3445305"
    },
    {
      "text": "Ann Cavoukian. 2009. Privacy by design: The 7 Foundational Principles. Technical Report. Office of the Information and Privacy Commissioner.",
      "doi": ""
    },
    {
      "text": "Roger Clarke. 2009. Privacy impact assessment: Its origins and development. Computer Law & Security Review 25, 2 (2009), 123–135.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, David W McDonald, Tammy Toscos, Mike Y Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, Ian E. Smith, and James A. Landay. 2008. Activity sensing in the wild: a field trial of UbiFit Garden. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1797–1806.",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2014. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Sage Publications, Thousand Oaks, CA, USA.",
      "doi": ""
    },
    {
      "text": "Valerio De Stefano. 2015. The rise of the just-in-time workforce: On-demand work, crowdwork, and labor protection in the gig-economy. Comparative Labor Law & Policy Journal 37, 3 (2015), 471–504.",
      "doi": ""
    },
    {
      "text": "Kurt H Decker. 1987. Employment Privacy Law for the 1990s. Pepp. L. Rev. 15(1987), 551.",
      "doi": ""
    },
    {
      "text": "Tawanna R Dillahunt, Xinyi Wang, Earnest Wheeler, Hao Fei Cheng, Brent Hecht, and Haiyi Zhu. 2017. The sharing economy in computing: A systematic literature review. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–26.",
      "doi": "10.1145/3134673"
    },
    {
      "text": "Brooke Erin Duffy, Annika Pinch, Shruti Sannon, and Megan Sawey. 2021. The nested precarities of creative labor on social media. Social Media + Society 7, 2 (2021).",
      "doi": ""
    },
    {
      "text": "Brianna Dym and Casey Fiesler. 2020. Ethical and privacy considerations for research using online fandom data. Transformative Works and Cultures 33 (2020).",
      "doi": ""
    },
    {
      "text": "Lilian Edwards, Laura Martin, and Tristan Henderson. 2018. Employee Surveillance: The road to surveillance is paved with good intentions. (2018). Available at SSRN.",
      "doi": ""
    },
    {
      "text": "Thomas Erickson and Wendy A Kellogg. 2000. Social translucence: an approach to designing systems that support social processes. ACM Transactions on Computer-Human Interaction (TOCHI) 7, 1(2000), 59–83.",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Worker Info Exchange. 2021. ADCU & WIE demand Microsoft suspend Uber’s Face API license. https://www.workerinfoexchange.org/post/adcu-wie-demand-microsoft-suspend-uber-s-face-api-license. Accessed: 2021-07-12.",
      "doi": ""
    },
    {
      "text": "Benjamin Fabian, Tatiana Ermakova, and Tino Lentz. 2017. Large-scale readability analysis of privacy policies. In Proceedings of the International Conference on Web Intelligence. ACM, New York, NY, USA, 18–25.",
      "doi": "10.1145/3106426.3106427"
    },
    {
      "text": "Alek Felstiner. 2011. Working the crowd: Employment and labor law in the crowdsourcing industry. Berkeley Journal of Employment & Labor Law 32 (2011), 143.",
      "doi": ""
    },
    {
      "text": "Joseph L Fleiss. 1971. Measuring nominal scale agreement among many raters.Psychological Bulletin 76, 5 (1971), 378.",
      "doi": ""
    },
    {
      "text": "T Marx Gary. 2017. I’ll be watching you: reflections on the new surveillance. In Surveillance, Crime and Social Control. Routledge, New York, NY, USA, 3–11.",
      "doi": ""
    },
    {
      "text": "Philippe Golle and Kurt Partridge. 2009. On the anonymity of home/work location pairs. In International Conference on Pervasive Computing. IEEE, New York, NY, USA, 390–397.",
      "doi": "10.1007/978-3-642-01516-8_26"
    },
    {
      "text": "Kotaro Hara, Abigail Adams, Kristy Milland, Saiph Savage, Chris Callison-Burch, and Jeffrey P Bigham. 2018. A data-driven analysis of workers’ earnings on Amazon Mechanical Turk. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–14.",
      "doi": "10.1145/3173574"
    },
    {
      "text": "Richard Heeks. 2017. Digital Economy and Digital Labour Terminology: Making Sense of the Gig Economy, Online Labour, Crowd Work, Microwork, Platform Labour, Etc.Working paper 70. Global Development Institute.",
      "doi": ""
    },
    {
      "text": "Jaap-Henk Hoepman. 2014. Privacy design strategies. In IFIP International Information Security Conference. Springer, Cham, Switzerland, 446–459.",
      "doi": ""
    },
    {
      "text": "Robert Howard. 1986. Brave New Workplace. Viking Press, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Ursula Huws. 2015. A Review on the Future of Work: Online Labour Exchanges, or “Crowdsourcing”: Implications for Occupational Safety and Health. Technical Report. European Agency for Safety and Health at Work (EU-OSHA).",
      "doi": ""
    },
    {
      "text": "Lilly C Irani and M Six Silberman. 2013. Turkopticon: Interrupting worker invisibility in Amazon Mechanical Turk. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 611–620.",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Rabih Jamil. 2020. Uber and the making of an Algopticon-Insights from the daily life of Montreal drivers. Capital & Class 44, 2 (2020), 241–260.",
      "doi": ""
    },
    {
      "text": "Mohammad Hossein Jarrahi, Will Sutherland, Sarah Beth Nelson, and Steve Sawyer. 2020. Platformic management, boundary resources for gig work, and worker autonomy. Computer-Supported Cooperative Work (CSCW) 29, 1 (2020), 153–189.",
      "doi": "10.1007/s10606-019-09368-7"
    },
    {
      "text": "Arne L Kalleberg and Michael Dunn. 2016. Good jobs, bad jobs in the gig economy. Perspectives on Work 20, 2 (2016), 10–14.",
      "doi": ""
    },
    {
      "text": "Thivya Kandappu, Vijay Sivaraman, Arik Friedman, and Roksana Boreli. 2013. Exposing and mitigating privacy loss in crowdsourced survey platforms. In Proceedings of the CoNEXT Student Workshop. ACM, New York, NY, USA, 13–16.",
      "doi": "10.1145/2537148.2537150"
    },
    {
      "text": "Jerry Kang, Katie Shilton, Deborah Estrin, and Jeff Burke. 2011. Self-surveillance privacy. Iowa Law Review 97(2011), 809–847.",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Stephanie Brown, Laura Dabbish, and Sara Kiesler. 2014. Privacy attitudes of Mechanical Turk workers and the US public. In 10th Symposium On Usable Privacy and Security (SOUPS 2014). USENIX, Berkeley, CA, USA, 37–49.",
      "doi": ""
    },
    {
      "text": "Tammy Katsabian. 2020. The Telework Virus: How the COVID-19 pandemic has affected telework and exposed its implications for privacy and equality. (2020). Available at SSRN.",
      "doi": ""
    },
    {
      "text": "Eliscia Kinder, Mohammad Hossein Jarrahi, and Will Sutherland. 2019. Gig platforms, tensions, alliances and ecosystems: An actor-network perspective. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–26.",
      "doi": "10.1145/3359314"
    },
    {
      "text": "Aniket Kittur, Jeffrey V Nickerson, Michael Bernstein, Elizabeth Gerber, Aaron Shaw, John Zimmerman, Matt Lease, and John Horton. 2013. The future of crowd work. In Proceedings of the 2013 Conference on Computer-Supported Cooperative Work. ACM, New York, NY, USA, 1301–1318.",
      "doi": "10.1145/2441776.2441923"
    },
    {
      "text": "Nicolas Kokkalis, Thomas Köhn, Carl Pfeiffer, Dima Chornyi, Michael S Bernstein, and Scott R Klemmer. 2013. EmailValet: Managing email overload through private, accountable crowdsourcing. In Proceedings of the 2013 Conference on Computer-Supported Cooperative Work. ACM, New York, NY, USA, 1291–1300.",
      "doi": "10.1145/2441776.2441922"
    },
    {
      "text": "Matthew Lease, Jessica Hullman, Jeffrey Bigham, Michael Bernstein, Juho Kim, Walter Lasecki, Saeideh Bakhshi, Tanushree Mitra, and Robert Miller. 2013. Mechanical Turk is not anonymous. (2013). Available at SSRN.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2014. Self-tracking cultures: towards a sociology of personal informatics. In Proceedings of the Australian Computer-Human Interaction Conference on Designing Futures. ACM, New York, NY, USA, 77–86.",
      "doi": "10.1145/2686612.2686623"
    },
    {
      "text": "Ning F Ma, Chien Wen Yuan, Moojan Ghafurian, and Benjamin V Hanrahan. 2018. Using stakeholder theory to examine drivers’ stake in Uber. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3173574.3173657"
    },
    {
      "text": "Steve Mann. 2020. Wearables and sur(over)-veillance, sous(under)-veillance, co(so)-veillance, and metaveillance (veillance of veillance) for health and well-being. Surveillance & Society 18, 2 (2020), 262–271.",
      "doi": ""
    },
    {
      "text": "Steve Mann, Jason Nolan, and Barry Wellman. 2003. Sousveillance: Inventing and using wearable computing devices for data collection in surveillance environments.Surveillance & Society 1, 3 (2003), 331–355.",
      "doi": ""
    },
    {
      "text": "James Manyika, Susan Lund, Jacques Bughin, Kelsey Robinson, Jan Mischke, and Deepa Mahajan. 2016. Independent Work: Choice, Necessity, and the Gig Economy. Technical Report. McKinsey Global Institute.",
      "doi": ""
    },
    {
      "text": "Annette Markham. 2012. Fabrication as ethical practice: Qualitative inquiry in ambiguous Internet contexts. Information, Communication & Society 15, 3 (2012), 334–353.",
      "doi": ""
    },
    {
      "text": "Randi Markussen. 1994. Constructing easiness—historical perspectives on work, computerization, and women. The Sociological Review 42, 1 (1994), 158–180.",
      "doi": ""
    },
    {
      "text": "Gary T Marx. 2015. Surveillance studies. International Encyclopedia of the Social & Behavioral Sciences 23, 2(2015), 733–741.",
      "doi": ""
    },
    {
      "text": "Nora McDonald and Helena M Mentis. 2021. Building for ‘We’: Safety settings for couples with memory concerns. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–11.",
      "doi": "10.1145/3411764.3445071"
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and inter-rater reliability in qualitative research: Norms and guidelines for CSCW and HCI practice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Brian McInnis, Dan Cosley, Chaebong Nam, and Gilly Leshed. 2016. Taking a HIT: Designing around rejection, mistrust, risk, and workers’ experiences in Amazon Mechanical Turk. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2271–2282.",
      "doi": "10.1145/2858036.2858539"
    },
    {
      "text": "Phoebe V Moore. 2017. The Quantified Self in Precarity: Work, Technology and What Counts. Routledge, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Phoebe V Moore, Martin Upchurch, and Xanthe Whittaker. 2018. Humans and machines at work: Monitoring, surveillance and automation in contemporary capitalism. In Humans and Machines at Work, Phoebe Moore, Martin Upchurch, and Xanthe Whittaker (Eds.). Springer, New York, NY, USA, 1–16.",
      "doi": ""
    },
    {
      "text": "Sarah Mosseri. 2020. Being watched and being seen: Negotiating visibility in the NYC ride-hail circuit. New Media & Society 22, 10 (2020), 1–21.",
      "doi": ""
    },
    {
      "text": "Mozilla 2020. Internet Health Report. Mozilla. https://2020.internethealthreport.org",
      "doi": ""
    },
    {
      "text": "Gemma Newlands. 2021. Algorithmic surveillance in the gig economy: The organization of work through Lefebvrian conceived space. Organization Studies 42, 5 (2021), 719–737.",
      "doi": ""
    },
    {
      "text": "Aiha Nguyen. 2021. The Constant Boss: Work under Digital Surveillance. Technical Report. Data & Society Research Institute.",
      "doi": ""
    },
    {
      "text": "Nicholas Proferes, Naiyan Jones, Sarah Gilbert, Casey Fiesler, and Michael Zimmer. 2021. Studying Reddit: A systematic overview of disciplines, approaches, methods, and ethics. Social Media + Society 7, 2 (2021).",
      "doi": ""
    },
    {
      "text": "Giulia Ranzini, Michael Etter, Christoph Lutz, and Ivar Vermeulen. 2017. Privacy in the sharing economy. (2017). Available at SSRN.",
      "doi": ""
    },
    {
      "text": "Joel R Reidenberg, Travis Breaux, Lorrie Faith Cranor, Brian French, Amanda Grannis, James T Graves, Fei Liu, Aleecia McDonald, Thomas B Norton, and Rohan Ramanath. 2015. Disagreeable privacy policies: Mismatches between meaning and users’ understanding. Berkeley Technology Law Journal 30, 1 (2015), 39.",
      "doi": ""
    },
    {
      "text": "Alex Rosenblat and Luke Stark. 2016. Algorithmic labor and information asymmetries: A case study of Uber’s drivers. International Journal of Communication 10 (2016), 3758–3784.",
      "doi": ""
    },
    {
      "text": "Shruti Sannon, Natalya N Bazarova, and Dan Cosley. 2018. Privacy lies: Understanding how, when, and why people lie to protect their privacy in multiple online contexts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–13.",
      "doi": "10.1145/3173574.3173626"
    },
    {
      "text": "Shruti Sannon and Dan Cosley. 2019. Privacy, power, and invisible labor on Amazon Mechanical Turk. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3290605.3300512"
    },
    {
      "text": "Luke Stark and Karen Levy. 2018. The surveillant consumer. Media, Culture & Society 40, 8 (2018), 1202–1220.",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1990. Basics of Qualitative Research. Sage Publications, Thousand Oaks, CA, USA.",
      "doi": ""
    },
    {
      "text": "Will Sutherland, Mohammad Hossein Jarrahi, Michael Dunn, and Sarah Beth Nelson. 2020. Work precarity and gig literacies in online freelancing. Work, Employment and Society 34, 3 (2020), 457–475.",
      "doi": ""
    },
    {
      "text": "Zhi Ming Tan, Nikita Aggarwal, Josh Cowls, Jessica Morley, Mariarosaria Taddeo, and Luciano Floridi. 2021. The ethical debate about the gig economy: A review and critical analysis. Technology in Society 65(2021), 101594.",
      "doi": ""
    },
    {
      "text": "Julia Ticona, Alexandra Mateescu, and Alex Rosenblat. 2018. Beyond Disruption: How Tech Shapes Labor across Domestic Work & Ridehailing. Technical Report. Data & Society.",
      "doi": ""
    },
    {
      "text": "Carlos Toxtli, Siddharth Suri, and Saiph Savage. 2021. Quantifying the invisible labor in crowd work. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2, Article 319 (Oct 2021), 26 pages.",
      "doi": "10.1145/3476060"
    },
    {
      "text": "Sarah Vieweg and Adam Hodges. 2016. Surveillance & modesty on social media: How Qataris navigate modernity and maintain tradition. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, New York, NY, USA, 527–538.",
      "doi": "10.1145/2818048.2819966"
    },
    {
      "text": "Alex J Wood, Mark Graham, Vili Lehdonvirta, and Isis Hjorth. 2019. Good gig, bad gig: autonomy and algorithmic control in the global gig economy. Work, Employment and Society 33, 1 (2019), 56–75.",
      "doi": ""
    },
    {
      "text": "Alex J Wood, Vili Lehdonvirta, and Mark Graham. 2018. Workers of the Internet unite? Online freelancer organisation among remote gig economy workers in six Asian and African countries. New Technology, Work and Employment 33, 2 (2018), 95–112.",
      "doi": ""
    },
    {
      "text": "David Wright. 2012. The state of the art in privacy impact assessment. Computer Law & Security Review 28, 1 (2012), 54–61.",
      "doi": ""
    },
    {
      "text": "Huichuan Xia, Yang Wang, Yun Huang, and Anuj Shah. 2017. “Our privacy needs to be protected at all costs”: Crowd workers’ privacy experiences on Amazon Mechanical Turk. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–22.",
      "doi": "10.1145/3134748"
    },
    {
      "text": "Ming Yin, Mary L Gray, Siddharth Suri, and Jennifer Wortman Vaughan. 2016. The communication network within the crowd. In Proceedings of the 25th International Conference on World Wide Web. IW3C2, Geneva, Switzerland, 1293–1303.",
      "doi": "10.1145/2872427.2883036"
    },
    {
      "text": "Shoshana Zuboff. 1988. In the Age of the Smart Machine: The Future of Work and Power. Basic Books, New York, NY, USA.",
      "doi": "10.5555/47303"
    }
  ]
}