{
  "doi": "10.1145/3491102.3502047",
  "title": "Towards Sign Language-Centric Design of ASL Survey Tools",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Questionnaires are fundamental learning and research tools for gathering insights and information from individuals, and now can be created easily using online tools. However, existing resources for creating questionnaires are designed for written languages (e.g. English) and do not support sign languages (e.g. American Sign Language). Sign languages (SLs) have unique visual characteristics that do not fit into user interface paradigms designed for written, text-based languages. Through a series of formative studies with the ASL signing community, this paper takes steps towards understanding the viability, potential benefit, challenges, and user interest in SL-centric surveys, a novel approach for creating questionnaires that meet the needs of deaf individuals using sign languages, without obligatory reliance on a written language to complete a questionnaire.",
  "tags": [
    "American Sign Language",
    "ASL"
  ],
  "authors": [
    {
      "name": "Shruti Mahajan",
      "institution": "Computer Science, Worcester Polytechnic Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659646301",
      "orcid": "missing"
    },
    {
      "name": "Zoey Walker",
      "institution": "ASL Ed Center, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659310123",
      "orcid": "missing"
    },
    {
      "name": "Rachel Boll",
      "institution": "ASL Ed Center, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659653763",
      "orcid": "missing"
    },
    {
      "name": "Michelle Santacreu",
      "institution": "Worcester Polytechnic Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238627",
      "orcid": "missing"
    },
    {
      "name": "Ally Salvino",
      "institution": "Worcester Polytechnic Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238029",
      "orcid": "missing"
    },
    {
      "name": "Michael Westfort",
      "institution": "ASL Ed Center, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240656",
      "orcid": "missing"
    },
    {
      "name": "Jeanne Reis",
      "institution": "ASL Ed Center, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658757345",
      "orcid": "missing"
    },
    {
      "name": "Erin Solovey",
      "institution": "Computer Science Department, Worcester Polytechnic Institute, United States",
      "img": "/do/10.1145/contrib-81324494052/rel-imgonly/erinsolovey.jpg",
      "acmid": "81324494052",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sedeeq Al-khazraji, Becca Dingman, Sooyeon Lee, and Matt Huenerfauth. 2021. At a Different Pace: Evaluating Whether Users Prefer Timing Parameters in American Sign Language Animations to Differ from Human Signers’ Timing. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3441852.3471214",
      "doi": ""
    },
    {
      "text": "Mrim Alnfiai and Srini Sampali. 2017. Social and Communication Apps for the Deaf and Hearing Impaired. In 2017 International Conference on Computer and Applications (ICCA). 120–126. https://doi.org/10.1109/COMAPP.2017.8079756",
      "doi": ""
    },
    {
      "text": "Melissa L Anderson, Timothy Riker, Kurt Gagne, Stephanie Hakulin, Todd Higgins, Jonah Meehan, Elizabeth Stout, Emma Pici-D’Ottavio, Kelsey Cappetta, and Kelly S Wolf Craig. 2018. Deaf qualitative health research: Leveraging technology to conduct linguistically and sociopolitically appropriate methods of inquiry. Qualitative health research 28, 11 (2018), 1813–1824.",
      "doi": ""
    },
    {
      "text": "Anonymous. 2020. Video Submission Guidelines. https://rid.org/membership/benefits/publications-overview/views/video-submission-guidelines/",
      "doi": ""
    },
    {
      "text": "Mark Aronoff, Irit Meir, Carol Padden, and Wendy Sandler. 2003. Classifier constructions and morphology in two sign languages. Perspectives on classifier constructions in sign languages (2003), 53–84.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, and Lone Koefoed Hansen. 2015. Immodest proposals: Research through design and knowledge. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2093–2102.",
      "doi": "10.1145/2702123.2702400"
    },
    {
      "text": "Larwan Berke, Matt Huenerfauth, and Kasmira Patel. 2019. Design and psychometric evaluation of American sign language translations of usability questionnaires. ACM Transactions on Accessible Computing (TACCESS) 12, 2 (2019), 1–43.",
      "doi": "10.1145/3314205"
    },
    {
      "text": "John Carlo Bertot, John T Snead, Paul T Jaeger, and Charles R McClure. 2006. Functionality, usability, and accessibility: Iterative user-centered evaluation strategies for digital libraries. Performance Measurement and Metrics(2006).",
      "doi": ""
    },
    {
      "text": "Rachel Boll, Shruti Mahajan, Jeanne Reis, and Erin T Solovey. 2020. Creating questionnaires that align with ASL linguistic principles and cultural practices within the Deaf community. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. 1–4.",
      "doi": "10.1145/3373625.3418071"
    },
    {
      "text": "Patrick Boudreault, Alicia Wolfson, Barbara Berman, Vickie L Venne, Janet S Sinsheimer, and Christina Palmer. 2018. Bilingual cancer genetic education modules for the deaf community: Development and evaluation of the online video material. Journal of genetic counseling 27, 2 (2018), 457–469.",
      "doi": ""
    },
    {
      "text": "Danielle Bragg, Oscar Koller, Mary Bellard, Larwan Berke, Patrick Boudreault, Annelies Braffort, Naomi Caselli, Matt Huenerfauth, Hernisa Kacorri, Tessa Verhoef, 2019. Sign language recognition, generation, and translation: An interdisciplinary perspective. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. 16–31.",
      "doi": "10.1145/3308561.3353774"
    },
    {
      "text": "Danielle Bragg, Raja Kushalnagar, and Richard Ladner. 2018. Designing an animated character system for American sign language. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. 282–294.",
      "doi": "10.1145/3234695.3236338"
    },
    {
      "text": "Danielle Bragg, Meredith Ringel Morris, Christian Vogler, Raja Kushalnagar, Matt Huenerfauth, and Hernisa Kacorri. 2020. Sign Language Interfaces: Discussing the Field’s Biggest Challenges. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–5.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Sambhavi Chandrashekar, Tony Stockman, Deborah Fels, and Rachel Benedyk. 2006. Using think aloud protocol with blind users: a case for inclusive usability evaluation methods. In Proceedings of the 8th international ACM SIGACCESS conference on Computers and accessibility. 251–252.",
      "doi": "10.1145/1168987.1169040"
    },
    {
      "text": "Matjaž Debevc, Primož Kosec, and Andreas Holzinger. 2011. Improving multimodal web accessibility for deaf people: sign language interpreter module. Multimedia Tools and Applications 54, 1 (2011), 181–199.",
      "doi": "10.1007/s11042-010-0529-8"
    },
    {
      "text": "Inmaculada Fajardo, Elena Parra, and Jose J Canas. 2010. Do sign language videos improve web navigation for deaf signer users?Journal of deaf studies and deaf education 15, 3 (2010), 242–262.",
      "doi": ""
    },
    {
      "text": "Daniel Fallman. 2003. Design-oriented human-computer interaction. In Proceedings of the SIGCHI conference on Human factors in computing systems. 225–232.",
      "doi": "10.1145/642611.642652"
    },
    {
      "text": "Marsha E Fonteyn, Benjamin Kuipers, and Susan J Grobe. 1993. A description of think aloud method and protocol analysis. Qualitative health research 3, 4 (1993), 430–441.",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger, Julia Makhaeva, and Katta Spiel. 2016. Designing smart objects with autistic children: Four design exposès. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 130–139.",
      "doi": "10.1145/2858036.2858050"
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design?. In Proceedings of the SIGCHI conference on human factors in computing systems. 937–946.",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Patrick Graybill, Julia Aggas, Robyn K Dean, Susan Demers, Elizabeth G Finigan, and Robert Q Pollard Jr. 2010. A community-participatory approach to adapting survey items for deaf individuals and American Sign Language. Field Methods 22, 4 (2010), 429–448.",
      "doi": ""
    },
    {
      "text": "Dhananjai Hariharan, Sedeeq Al-khazraji, and Matt Huenerfauth. 2018. Evaluation of an English word look-up tool for web-browsing with sign language video for deaf readers. In International Conference on Universal Access in Human-Computer Interaction. Springer, 205–215.",
      "doi": "10.1007/978-3-319-92049-8_15"
    },
    {
      "text": "Jennifer A Higgins, Lisa Famularo, Stephanie W Cawthon, Christopher A Kurz, Jeanne E Reis, and Lori M Moers. 2016. Development of American Sign Language guidelines for K-12 academic assessments. Journal of deaf studies and deaf education 21, 4 (2016), 383–393.",
      "doi": ""
    },
    {
      "text": "Robert Hoffmeister, S. Fish, Jonathan Henner, R. Benedict, P. Rosenburg, F Conlin-Luippold, and C. Caldwell Harris. 2014. American Sign Language Assessment Instrument (ASLAI-revision 3).",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Peter Dalsgaard, Stuart Reeves, Jeffrey Bardzell, Jonas Löwgren, Erik Stolterman, and Yvonne Rogers. 2015. Knowledge production in interaction design. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. 2429–2432.",
      "doi": "10.1145/2702613.2702653"
    },
    {
      "text": "Simon Hooper, Charles Miller, Susan Rose, and George Veletsianos. 2007. The effects of digital video quality on learner comprehension in an American Sign Language assessment environment. Sign Language Studies 8, 1 (2007), 42–58.",
      "doi": ""
    },
    {
      "text": "Matt Huenerfauth. 2005. American Sign Language spatial representations for an accessible user-interface. In 3rd International Conference on Universal Access in Human-Computer Interaction. Las Vegas, NV, USA.",
      "doi": ""
    },
    {
      "text": "Matt Huenerfauth and Vicki Hanson. 2009. Sign language in the interface: access for deaf signers. Universal Access Handbook. NJ: Erlbaum 38 (2009).",
      "doi": ""
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI conference on Human factors in computing systems. 17–24.",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Monique WM Jaspers, Thiemo Steen, Cor Van Den Bos, and Maud Geenen. 2004. The think aloud method: a guide to user interface design. International journal of medical informatics 73, 11-12(2004), 781–795.",
      "doi": ""
    },
    {
      "text": "Trevor Johnston. 1992. The realization of the linguistic metafunctions in a sign language. Social Semiotics 2, 1 (1992), 1–43.",
      "doi": ""
    },
    {
      "text": "Charles J. Kacmar and Jane M. Carey. 1991. Assessing the usability of icons in user interfaces. Behaviour & Information Technology 10, 6 (1991), 443–457. https://doi.org/10.1080/01449299108924303",
      "doi": ""
    },
    {
      "text": "Hernisa Kacorri and Matt Huenerfauth. 2015. Comparison of finite-repertoire and data-driven facial expressions for sign language avatars. In International Conference on Universal Access in Human-Computer Interaction. Springer, 393–403.",
      "doi": ""
    },
    {
      "text": "Christopher AN Kurz, Jeanne E Reis, and Barbara Spiecker. 2020. Ideologies and attitudes toward American Sign Language: Processes of academic language and academic cocabulary coinage. In Sign Language Ideologies in Practice. De Gruyter Mouton and Nijmegen: Ishara Press Berlin, 287–308.",
      "doi": ""
    },
    {
      "text": "Poorna Kushalnagar, Alina Engelman, and G Sadler. 2018. Deaf patient-provider communication and lung cancer screening: Health Information National Trends survey in American Sign Language (HINTS-ASL). Patient education and counseling 101, 7 (2018), 1232–1239.",
      "doi": ""
    },
    {
      "text": "Poorna Kushalnagar, Raychelle Harris, Raylene Paludneviciene, and TraciAnn Hoglind. 2017. Health Information National Trends Survey in American Sign Language (HINTS-ASL): protocol for the cultural adaptation and linguistic validation of a national survey. JMIR research protocols 6, 9 (2017), e172.",
      "doi": ""
    },
    {
      "text": "Poorna Kushalnagar, Joan Naturale, Raylene Paludneviciene, Scott R Smith, Emily Werfel, Richard Doolittle, Stephen Jacobs, and James DeCaro. 2015. Health websites: Accessibility and usability for American Sign Language users. Health communication 30, 8 (2015), 830–837.",
      "doi": ""
    },
    {
      "text": "Kelly Mack, Danielle Bragg, Meredith Ringel Morris, Maarten W Bos, Isabelle Albi, and Andrés Monroy-Hernández. 2020. Social App Accessibility for Deaf Signers. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–31.",
      "doi": "10.1145/3415196"
    },
    {
      "text": "Michella Maiorana-Basas and Claudia M Pagliaro. 2014. Technology use among adults who are deaf and hard of hearing: A national survey. Journal of deaf studies and deaf education 19, 3 (2014), 400–410.",
      "doi": ""
    },
    {
      "text": "Florian Mueller and Katherine Isbister. 2014. Movement-based game guidelines. In Proceedings of the sigchi conference on human factors in computing systems. 2191–2200.",
      "doi": "10.1145/2556288.2557163"
    },
    {
      "text": "Astrid Oehme, Vaishnavi Upadrasta, and Philipp Kotsch. 2020. Development of a multilingual questionnaire for the deaf community–guidelines and challenges. In International Conference on Human-Computer Interaction. Springer, 103–113.",
      "doi": "10.1007/978-3-030-60149-2_9"
    },
    {
      "text": "Christina GS Palmer, Patrick Boudreault, Barbara A Berman, Alicia Wolfson, Lionel Duarte, Vickie L Venne, and Janet S Sinsheimer. 2017. Bilingual approach to online cancer genetics education for Deaf American Sign Language users produces greater knowledge and confidence than English text only: A randomized study. Disability and health journal 10, 1 (2017), 23–32.",
      "doi": ""
    },
    {
      "text": "Jeanne Reis, Erin T Solovey, Jon Henner, Kathleen Johnson, and Robert Hoffmeister. 2015. ASL CLeaR: STEM education tools for deaf students. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. 441–442.",
      "doi": "10.1145/2700648.2811343"
    },
    {
      "text": "Oliver Sacks. 2009. Seeing voices: A journey into the world of the deaf. Pan Macmillan.",
      "doi": ""
    },
    {
      "text": "Elizabeth B-N Sanders and Pieter Jan Stappers. 2008. Co-creation and the new landscapes of design. Co-design 4, 1 (2008), 5–18.",
      "doi": ""
    },
    {
      "text": "Erik Stolterman and Mikael Wiberg. 2010. Concept-driven interaction design research. Human–Computer Interaction 25, 2 (2010), 95–118.",
      "doi": ""
    },
    {
      "text": "Philip Strain, A Dawn Shaikh, and Richard Boardman. 2007. Thinking but not seeing: think-aloud for non-sighted users. In CHI’07 Extended Abstracts on Human Factors in Computing Systems. 1851–1856.",
      "doi": ""
    },
    {
      "text": "Maaike J Van den Haak, Menno DT de Jong, and Peter Jan Schellens. 2004. Employing think-aloud protocols and constructive interaction to test the usability of online library catalogues: a methodological comparison. Interacting with computers 16, 6 (2004), 1153–1170.",
      "doi": ""
    },
    {
      "text": "MW Van Someren, YF Barnard, and JAC Sandberg. 1994. The think aloud method: a practical approach to modelling cognitive. London: AcademicPress(1994).",
      "doi": ""
    },
    {
      "text": "Silvana Veinberg. 2019. Producing sign language videos. https://www.accessibletextbooksforall.org/stories/producing-sign-language-videos",
      "doi": ""
    },
    {
      "text": "Myriam Vermeerbergen, Lorraine Leeson, and Onno Alex Crasborn. 2007. Simultaneity in signed languages: Form and function. Vol. 281. John Benjamins Publishing.",
      "doi": ""
    },
    {
      "text": "World Federation of the Deaf and World Association of Sign Language Interpreters. 2020. WFD and WASLI Issue Statement on Signing Avatars. https://wfdeaf.org/news/wfd-wasli-issue-statement-signing-avatars/.",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI conference on Human factors in computing systems. 493–502.",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}