{
  "doi": "10.1145/3491102.3517790",
  "title": "Slide-Tone and Tilt-Tone: 1-DOF Haptic Techniques for Conveying Shape Characteristics of Graphs to Blind Users",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2022,
  "badges": [],
  "abstract": "We increasingly rely on up-to-date, data-driven graphs to understand our environments and make informed decisions. However, many of the methods blind and visually impaired users (BVI) rely on to access data-driven information do not convey important shape-characteristics of graphs, are not refreshable, or are prohibitively expensive. To address these limitations, we introduce two refreshable, 1-DOF audio-haptic interfaces based on haptic cues fundamental to object shape perception. Slide-tone uses finger position with sonification, and Tilt-tone uses fingerpad contact inclination with sonification to provide shape feedback to users. Through formative design workshops (n = 3) and controlled evaluations (n = 8), we found that BVI participants appreciated the additional shape information, versatility, and reinforced understanding these interfaces provide; and that task accuracy was comparable to using interactive tactile graphics or sonification alone. Our research offers insight into the benefits, limitations, and considerations for adopting these haptic cues into a data visualization context.",
  "tags": [
    "accessibility",
    "haptic data visualization",
    "accessible data visualization"
  ],
  "authors": [
    {
      "name": "Danyang Fan",
      "institution": "Mechanical Engineering/ Stanford University / Shape Lab, Stanford University, United States",
      "img": "/do/10.1145/contrib-99659648324/rel-imgonly/15896104_10210689959879062_5425239155926964590_o.jpg",
      "acmid": "99659648324",
      "orcid": "missing"
    },
    {
      "name": "Alexa Fay Siu",
      "institution": "Stanford University, United States",
      "img": "/do/10.1145/contrib-99659214534/rel-imgonly/profile_square.jpg",
      "acmid": "99659214534",
      "orcid": "missing"
    },
    {
      "name": "Wing-Sum Adrienne Law",
      "institution": "Mechanical Engineering, Stanford University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233064",
      "orcid": "missing"
    },
    {
      "name": "Raymond Ruihong Zhen",
      "institution": "Mechanical Engineering, Stanford University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233553",
      "orcid": "missing"
    },
    {
      "name": "Sile O'Modhrain",
      "institution": "University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100106087",
      "orcid": "missing"
    },
    {
      "name": "Sean Follmer",
      "institution": "Mechanical Engineering, Stanford University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81377593653",
      "orcid": "0000-0001-5592-5949"
    }
  ],
  "references": [
    {
      "text": "[n. d.]. Apple Accessibility API. https://developer.apple.com/documentation/accessibility/audio_graphs. (Last accessed: August 24, 2021).",
      "doi": ""
    },
    {
      "text": "[n. d.]. Desmos Graphing Calculator. https://www.desmos.com/calculator. (Last accessed: August 24, 2021).",
      "doi": ""
    },
    {
      "text": "[n. d.]. Microsoft Soundscape. https://www.microsoft.com/en-us/research/product/soundscape/. (Last accessed: August 24, 2021).",
      "doi": ""
    },
    {
      "text": "[n. d.]. SAS Graphics Accelerator. https://support.sas.com/software/products/graphics-accelerator/. (Last accessed: August 24, 2021).",
      "doi": ""
    },
    {
      "text": "2020. Accessible COVID-19 Pandemic Data. https://covid.ski.org/. (Last accessed: August 27, 2020).",
      "doi": ""
    },
    {
      "text": "Amandine Afonso, Alan Blum, Christian Jacquemin, Michel Denis, and Brian FG Katz. 2005. A study of spatial cognition in an immersive virtual audio environment: Comparing blind and blindfolded individuals. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Dragan Ahmetovic, Cristian Bernareggi, João Guerreiro, Sergio Mascetti, and Anna Capietto. 2019. Audiofunctions. web: Multimodal exploration of mathematical function graphs. In Proceedings of the 16th International Web for All Conference. 1–10.",
      "doi": "10.1145/3315002.3332438"
    },
    {
      "text": "Jordan Allen et al.2020. Coronavirus in the U.S.: Latest Map and Case Count. https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html",
      "doi": ""
    },
    {
      "text": "Miguel A Alonso-Arevalo, Simon Shelley, Dik Hermes, Jacqueline Hollowood, Michael Pettitt, Sarah Sharples, and Armin Kohlrausch. 2012. Curve shape and curvature perception through interactive sonification. ACM Transactions on Applied Perception (TAP) 9, 4 (2012), 1–19.",
      "doi": "10.1145/2355598.2355600"
    },
    {
      "text": "James L Alty and Dimitrios Rigas. 2005. Exploring the use of structured musical stimuli to communicate simple diagrams: the role of context. International journal of human-computer studies 62, 1 (2005), 21–40.",
      "doi": "10.1016/j.ijhcs.2004.08.003"
    },
    {
      "text": "Apple. [n. d.]. Health. https://www.apple.com/ios/health/",
      "doi": ""
    },
    {
      "text": "Catherine M Baker, Lauren R Milne, Jeffrey Scofield, Cynthia L Bennett, and Richard E Ladner. 2014. Tactile graphics with a voice: using QR codes to access text in tactile graphics. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility. 75–82.",
      "doi": "10.1145/2661334.2661366"
    },
    {
      "text": "Sandra Bardot, Sawyer Rempel, Bradley Rey, Ali Neshati, Yumiko Sakamoto, Carlo Menon, and Pourang Irani. 2020. Eyes-free graph legibility: using skin-dragging to provide a tactile graph visualization on the arm. In Proceedings of the 11th Augmented Human International Conference. 1–8.",
      "doi": "10.1145/3396339.3396344"
    },
    {
      "text": "Dale J Barr. 2013. Random effects structure for testing interactions in linear mixed-effects models. Frontiers in psychology 4 (2013), 328.",
      "doi": ""
    },
    {
      "text": "Douglas Bates, Reinhold Kliegl, Shravan Vasishth, and Harald Baayen. 2015. Parsimonious mixed models. arXiv preprint arXiv:1506.04967(2015).",
      "doi": ""
    },
    {
      "text": "Jeremy Boy, Ronald A Rensink, Enrico Bertini, and Jean-Daniel Fekete. 2014. A principled way of assessing visualization literacy. IEEE transactions on visualization and computer graphics 20, 12(2014), 1963–1972.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Anke M Brock, Philippe Truillet, Bernard Oriola, Delphine Picard, and Christophe Jouffrais. 2015. Interactivity improves usability of geographic maps for visually impaired people. Human–Computer Interaction 30, 2 (2015), 156–194.",
      "doi": ""
    },
    {
      "text": "Lorna M Brown, Stephen A Brewster, SA Ramloll, R Burton, and Beate Riedel. 2003. Design guidelines for audio presentation of graphs and tables. International Conference on Auditory Display.",
      "doi": ""
    },
    {
      "text": "Matthew Butler, Leona M Holloway, Samuel Reinders, Cagatay Goncu, and Kim Marriott. 2021. Technology Developments in Touch-Based Accessible Graphics: A Systematic Review of Research 2010-2020. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3411764.3445207"
    },
    {
      "text": "C Melody Carswell, Cathy Emery, and Andrea M Lonon. 1993. Stimulus complexity and information integration in the spontaneous interpretations of line graphs. Applied Cognitive Psychology 7, 4 (1993), 341–357.",
      "doi": ""
    },
    {
      "text": "Andrew Crossan and Stephen Brewster. 2008. Multimodal trajectory playback for teaching shape information and trajectories to visually impaired computer users. ACM Transactions on Accessible Computing (TACCESS) 1, 2 (2008), 1–34.",
      "doi": "10.1145/1408760.1408766"
    },
    {
      "text": "Nils Dahlbäck, Arne Jönsson, and Lars Ahrenberg. 1993. Wizard of Oz studies—why and how. Knowledge-Based Systems 6, 4 (1993), 258–266.",
      "doi": "10.1016/0950-7051%2893%2990017-N"
    },
    {
      "text": "Roger T Dean and Roger T Dean. 2009. The Oxford handbook of computer music. OUP USA.",
      "doi": ""
    },
    {
      "text": "Alfred G Dietze. 1961. Kinaesthetic discrimination: The difference limen for finger span. The Journal of Psychology 51, 1 (1961), 165–168.",
      "doi": ""
    },
    {
      "text": "Hanifa Dostmohamed and Vincent Hayward. 2005. Trajectory of contact region on the fingerpad gives the illusion of haptic shape. Experimental Brain Research 164, 3 (2005), 387–394.",
      "doi": ""
    },
    {
      "text": "Melanie Ehrenkranz. 2020. Vital Coronavirus Information Is Failing the Blind and Visually Impaired. Retrieved January 14, 2021 from https://www.vice.com/en_us/article/4ag9wb/vital-coronavirus-information-is-failing-the-blind-and-visually-impaired",
      "doi": ""
    },
    {
      "text": "John H Flowers and Terry A Hauer. 1995. Musical versus visual graphs: Cross-modal equivalence in perception of time series data. Human factors 37, 3 (1995), 553–569.",
      "doi": ""
    },
    {
      "text": "American Printing House for the Blind. 2021. American Printing House for the Blind and Orbit Research Announce the World’s First Affordable Refreshable Tactile Graphics Display. https://sites.aph.org/pr/aph-and-orbit-research-announce-the-worlds-first-affordable-refreshable-tactile-graphics-display/",
      "doi": ""
    },
    {
      "text": "Peter Fox and James Hendler. 2011. Changing the equation on scientific data visualization. Science 331, 6018 (2011), 705–708.",
      "doi": ""
    },
    {
      "text": "Jason P Fritz and Kenneth E Barner. 1999. Design of a haptic data visualization system for people with visual impairments. IEEE Transactions on rehabilitation engineering 7, 3(1999), 372–384.",
      "doi": ""
    },
    {
      "text": "Giovanni Fusco and Valerie S Morash. 2015. The tactile graphics helper: providing audio clarification for tactile graphics using machine vision. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. 97–106.",
      "doi": "10.1145/2700648.2809868"
    },
    {
      "text": "John Gardner. 2014. Can mainstream graphics be accessible?Information Technology and Disabilities 14, 1 (2014).",
      "doi": ""
    },
    {
      "text": "Nicholas A Giudice, Hari Prasath Palani, Eric Brenner, and Kevin M Kramer. 2012. Learning non-visual graphical information using a touch-based vibro-audio interface. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility. 103–110.",
      "doi": "10.1145/2384916.2384935"
    },
    {
      "text": "Daniel Goldreich and Ingrid M Kanics. 2006. Performance of blind and sighted humans on a tactile grating detection task. Perception & Psychophysics 68, 8 (2006), 1363–1371.",
      "doi": ""
    },
    {
      "text": "Google. 2021. Google Trends. http://trends.google.com/trends",
      "doi": ""
    },
    {
      "text": "Jenna L Gorlewicz, Jessica Burgner, Thomas J Withrow, and Robert J Webster III. 2014. Initial experiences using vibratory touchscreens to display graphical math concepts to students with visual impairments. Journal of Special Education Technology 29, 2 (2014), 17–25.",
      "doi": ""
    },
    {
      "text": "Jenna L Gorlewicz, Jennifer L Tennison, Hari P Palani, and Nicholas A Giudice. 2018. The graphical access challenge for people with visual impairments: Positions and pathways forward. In Interactive Multimedia-Multimedia Production and Digital Storytelling. IntechOpen.",
      "doi": ""
    },
    {
      "text": "Jenna L Gorlewicz, Jennifer L Tennison, P Merlin Uesbeck, Margaret E Richard, Hari P Palani, Andreas Stefik, Derrick W Smith, and Nicholas A Giudice. 2020. Design guidelines and recommendations for multimodal, touchscreen-based graphics. ACM Transactions on Accessible Computing (TACCESS) 13, 3 (2020), 1–30.",
      "doi": "10.1145/3403933"
    },
    {
      "text": "Thomas Hermann. 2002. Sonification for exploratory data analysis. Ph. D. Dissertation. Bielefeld University.",
      "doi": ""
    },
    {
      "text": "Leona Holloway, Matthew Butler, Samuel Reinders, and Kim Marriott. 2020. Non-visual access to graphical information on COVID-19. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. 1–3.",
      "doi": "10.1145/3373625.3418015"
    },
    {
      "text": "Leona Holloway, Kim Marriott, and Matthew Butler. 2018. Accessible maps for the blind: Comparing 3D printed models with tactile graphics. In Proceedings of the 2018 chi conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3173772"
    },
    {
      "text": "Intuit. [n. d.]. Mint. https://mint.intuit.com/",
      "doi": ""
    },
    {
      "text": "Wooseob Jeong and Myke Gluck. 2002. Multimodal bivariate thematic maps: Auditory and haptic display. Proceedings of the American Society for Information Science and Technology 39, 1 (2002), 279–283.",
      "doi": ""
    },
    {
      "text": "Amy Kalia, Rose Hopkins, David Jin, Lindsay Yazzolino, Svena Verma, Lotfi Merabet, Flip Phillips, and Pawan Sinha. 2014. Perception of tactile graphics: Embossings versus cutouts. Multisensory research 27, 2 (2014), 111–125.",
      "doi": ""
    },
    {
      "text": "Astrid ML Kappers and Wouter M Bergmann Tiest. 2013. Haptic perception. Wiley Interdisciplinary Reviews: Cognitive Science 4, 4 (2013), 357–374.",
      "doi": ""
    },
    {
      "text": "Johan Kildal and Stephen A Brewster. 2006. Providing a size-independent overview of non-visual tables. In 12th International Conference on Auditory Display (ICAD2006). 8–15.",
      "doi": ""
    },
    {
      "text": "NW Kim, SC Joyner, A Riegelhuth, and Y Kim. 2021. Accessible visualization: Design space, opportunities, and challenges. In Computer Graphics Forum, Vol. 40. Wiley Online Library, 173–188.",
      "doi": ""
    },
    {
      "text": "Katherine J Kuchenbecker, William R Provancher, Günter Niemeyer, and Mark R Cutkosky. 2004. Haptic display of contact location. In 12th International Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 2004. HAPTICS’04. Proceedings. IEEE, 40–47.",
      "doi": ""
    },
    {
      "text": "Heidi Lam, Enrico Bertini, Petra Isenberg, Catherine Plaisant, and Sheelagh Carpendale. 2011. Empirical studies in information visualization: Seven scenarios. IEEE transactions on visualization and computer graphics 18, 9(2011), 1520–1536.",
      "doi": ""
    },
    {
      "text": "Rebecca Lawson and Sarah Bracken. 2011. Haptic object recognition: How important are depth cues and plane orientation?Perception 40, 5 (2011), 576–597.",
      "doi": ""
    },
    {
      "text": "Susan J Lederman and Roberta L Klatzky. 1987. Hand movements: A window into haptic object recognition. Cognitive psychology 19, 3 (1987), 342–368.",
      "doi": ""
    },
    {
      "text": "Gordon E Legge, Cindee Madison, Brenna N Vaughn, Allen MY Cheong, and Joseph C Miller. 2008. Retention of high tactile acuity throughout the life span in blindness. Perception & psychophysics 70, 8 (2008), 1471–1488.",
      "doi": ""
    },
    {
      "text": "Suresh K Lodha, John Beahan, Travis Heppe, Abigail Joseph, and Brett Zane-Ulman. 1997. Muse: A musical data sonification toolkit. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Jack M Loomis and Susan J Lederman. 1986. Tactual perception. Handbook of perception and human performances 2, 2(1986), 2.",
      "doi": ""
    },
    {
      "text": "Sergio Mascetti, Lorenzo Picinali, Andrea Gerino, Dragan Ahmetovic, and Cristian Bernareggi. 2016. Sonification of guidance data during road crossing for people with visual impairments or blindness. International Journal of Human-Computer Studies 85 (2016), 16–26.",
      "doi": "10.1016/j.ijhcs.2015.08.003"
    },
    {
      "text": "Giuseppe Melfi, Karin Müller, Thorsten Schwarz, Gerhard Jaworek, and Rainer Stiefelhagen. 2020. Understanding what you feel: A mobile audio-tactile system for graphics used at schools with students with visual impairment. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376508"
    },
    {
      "text": "Mariacarla Memeo and Luca Brayda. 2016. How geometrical descriptors help to build cognitive maps of solid geometry with a 3DOF tactile mouse. In International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, 75–85.",
      "doi": ""
    },
    {
      "text": "Mariacarla Memeo and Luca Brayda. 2016. Mind the bump: effect of geometrical descriptors on the perception of curved surfaces with a novel tactile mouse. In International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, 438–448.",
      "doi": ""
    },
    {
      "text": "Meg Miller. 2020. 2019 Novel Coronavirus COVID-19 (2019-nCoV) Data Repository: Johns Hopkins University Center for Systems Science and Engineering. Bulletin-Association of Canadian Map Libraries and Archives (ACMLA)164(2020), 47–51.",
      "doi": ""
    },
    {
      "text": "Valerie S Morash, Allison E Connell Pensky, Steven TW Tseng, and Joshua A Miele. 2014. Effects of using multiple hands and fingers on haptic performance in individuals who are blind. Perception 43, 6 (2014), 569–588.",
      "doi": ""
    },
    {
      "text": "Annika Muehlbradt, Madhur Atreya, Darren Guinness, and Shaun K Kane. 2018. Exploring the design of audio-kinetic graphics for education. In Proceedings of the 20th ACM International Conference on Multimodal Interaction. 455–463.",
      "doi": "10.1145/3242969.3243004"
    },
    {
      "text": "Chris North. 2006. Toward measuring visualization insight. IEEE computer graphics and applications 26, 3 (2006), 6–9.",
      "doi": "10.1109/MCG.2006.70"
    },
    {
      "text": "Government of Canada. 2021. 5 data visualization 5.5 line chart. https://www150.statcan.gc.ca/n1/edu/power-pouvoir/ch9/line-lineaire/5214824-eng.htm",
      "doi": ""
    },
    {
      "text": "Braille Authority of North America. 2010. Guidelines and Standards for Tactile Graphics. http://www.brailleauthority.org/tg/",
      "doi": ""
    },
    {
      "text": "Uran Oh, Shaun K Kane, and Leah Findlater. 2013. Follow that sound: using sonification and corrective verbal feedback to teach touchscreen gestures. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility. 1–8.",
      "doi": "10.1145/2513383.2513455"
    },
    {
      "text": "Sile O’Modhrain, Nicholas A Giudice, John A Gardner, and Gordon E Legge. 2015. Designing media for visually-impaired users of refreshable touch displays: Possibilities and pitfalls. IEEE Transactions on Haptics 8, 3 (2015), 248–257.",
      "doi": "10.1109/TOH.2015.2466231"
    },
    {
      "text": "Claudio Pacchierotti, Domenico Prattichizzo, and Katherine J Kuchenbecker. 2015. Displaying sensed tactile cues with a fingertip haptic device. IEEE transactions on haptics 8, 4 (2015), 384–396.",
      "doi": "10.1109/TOH.2015.2445770"
    },
    {
      "text": "Sabrina Paneels and Jonathan C Roberts. 2009. Review of designs for haptic data visualization. IEEE Transactions on Haptics 3, 2 (2009), 119–137.",
      "doi": "10.1109/TOH.2009.44"
    },
    {
      "text": "Duncan Raitt, Peter Fairhurst, Calum Michael, Zoltan Melkes, Yeongmi Kim, and Matthias Harders. 2019. OCTA Display: A Pin-Actuated Triangle-Surface Fingertip Shape Display–Design & Initial Tests. In 2019 IEEE World Haptics Conference (WHC). IEEE, 479–484.",
      "doi": ""
    },
    {
      "text": "Rameshsharma Ramloll, Stephen Brewster, Wai Yu, and Beate Riedel. 2001. Using non-speech sounds to improve access to 2D tabular numerical information for visually impaired users. In People and Computers XV—Interaction without Frontiers. Springer, 515–529.",
      "doi": ""
    },
    {
      "text": "L Penny Rosenblum, Li Cheng, and Carole R Beal. 2018. Teachers of students with visual impairments share experiences and advice for supporting students in understanding graphics. Journal of visual impairment & blindness 112, 5 (2018), 475–487.",
      "doi": ""
    },
    {
      "text": "Nik Sawe, Chris Chafe, and Jeffrey Treviño. 2020. Using Data Sonification to Overcome Science Literacy, Numeracy, and Visualization Barriers in Science Communication. Frontiers in Communication 5 (2020), 46.",
      "doi": ""
    },
    {
      "text": "Ather Sharif, Sanjana S Chintalapati, Jacob O Wobbrock, and Katharina Reinecke. 2021. Understanding Screen-Reader Users’ Experiences with Online Data Visualizations. In To Appear.",
      "doi": ""
    },
    {
      "text": "Yutaka Shimizu, Shinya Saida, and Hiroshi Shimura. 1993. Tactile pattern recognition by graphic display: Importance of 3-D information for haptic perception of familiar objects. Perception & Psychophysics 53, 1 (1993), 43–48.",
      "doi": ""
    },
    {
      "text": "Alexa F Siu, Danyang Fan, Gene SH Kim, Hrishikesh V Rao, Xavier Vazquez, Sile O’Modhrain, and Sean Follmer. 2021. COVID-19 highlights the issues facing blind and visually impaired people in accessing data on the web. In Proceedings of the 18th International Web for All Conference. 1–15.",
      "doi": "10.1145/3430263.3452432"
    },
    {
      "text": "Alexa F Siu, Son Kim, Joshua A Miele, and Sean Follmer. 2019. shapeCAD: An accessible 3D modelling workflow for the blind and visually-impaired via 2.5 D shape displays. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. 342–354.",
      "doi": "10.1145/3308561.3353782"
    },
    {
      "text": "Lee Stearns, Ruofei Du, Uran Oh, Catherine Jou, Leah Findlater, David A Ross, and Jon E Froehlich. 2016. Evaluating haptic and auditory directional guidance to assist blind people in reading printed text using finger-mounted cameras. ACM Transactions on Accessible Computing (TACCESS) 9, 1 (2016), 1–38.",
      "doi": "10.1145/2914793"
    },
    {
      "text": "Joseph C Stevens, Emerson Foulke, and Matthew Q Patterson. 1996. Tactile acuity, aging, and braille reading in long-term blindness.Journal of experimental psychology: applied 2, 2 (1996), 91.",
      "doi": ""
    },
    {
      "text": "Tony Stockman, Christopher Frauenberger, and Greg Hind. 2005. Interactive sonification of spreadsheets. In 11th International Conference on Auditory Display (ICAD2006).",
      "doi": ""
    },
    {
      "text": "Evan Strasnick, Jackie Yang, Kesler Tanner, Alex Olwal, and Sean Follmer. 2017. shiftio: Reconfigurable tactile elements for dynamic affordances and mobile interaction. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 5075–5086.",
      "doi": "10.1145/3025453.3025988"
    },
    {
      "text": "Atau Tanaka and Adam Parkinson. 2016. Haptic wave: A cross-modal interface for visually impaired audio producers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 2150–2161.",
      "doi": "10.1145/2858036.2858304"
    },
    {
      "text": "Jennifer L Tennison and Jenna L Gorlewicz. 2016. Toward non-visual graphics representations on vibratory touchscreens: Shape exploration and identification. In International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, 384–395.",
      "doi": ""
    },
    {
      "text": "Maarten Van Someren, Yvonne F Barnard, and J Sandberg. 1994. The think aloud method: a practical approach to modelling cognitive. London: AcademicPress 11(1994).",
      "doi": ""
    },
    {
      "text": "Karen Vines, Chris Hughes, Laura Alexander, Carol Calvert, Chetz Colwell, Hilary Holmes, Claire Kotecki, Kaela Parks, and Victoria Pearson. 2019. Sonification of numerical data for education. Open Learning: The Journal of Open, Distance and e-Learning 34, 1(2019), 19–39.",
      "doi": ""
    },
    {
      "text": "Bruce N Walker. 2002. Magnitude estimation of conceptual data dimensions for use in sonification.Journal of experimental psychology: Applied 8, 4 (2002), 211.",
      "doi": ""
    },
    {
      "text": "Bruce N Walker and Lisa M Mauney. 2010. Universal design of auditory graphs: a comparison of sonification mappings for visually impaired and sighted listeners. ACM Transactions on Accessible Computing (TACCESS) 2, 3 (2010), 1–16.",
      "doi": "10.1145/1714458.1714459"
    },
    {
      "text": "Bruce N Walker and Michael A Nees. 2011. Theory of sonification. In The Sonification Handbook, Thomas Hermann, Andy Hunt, and John G Neuhoff (Eds.). Logos Verlag Berlin, Chapter 2, 9–39.",
      "doi": ""
    },
    {
      "text": "Steven Wall and Stephen Brewster. 2006. Feeling what you hear: tactile feedback for navigation of audio graphs. In Proceedings of the SIGCHI conference on Human Factors in computing systems. 1123–1132.",
      "doi": "10.1145/1124772.1124941"
    },
    {
      "text": "Steven A Wall and Stephen A Brewster. 2006. Tac-tiles: multimodal pie charts for visually impaired users. In Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles. 9–18.",
      "doi": "10.1145/1182475.1182477"
    },
    {
      "text": "Maarten WA Wijntjes, Akihiro Sato, Vincent Hayward, and Astrid ML Kappers. 2009. Local surface orientation dominates haptic curvature discrimination. IEEE transactions on haptics 2, 2 (2009), 94–102.",
      "doi": "10.1109/TOH.2009.1"
    },
    {
      "text": "Steven F Wiker, Gregg Vanderheiden, Seongil Lee, and Steven Arndt. 1991. Development of tactile mice for blind access to computers: importance of stimulation locus, object size, and vibrotactile display resolution. In Proceedings of the Human Factors Society Annual Meeting, Vol. 35. SAGE Publications Sage CA: Los Angeles, CA, 708–712.",
      "doi": ""
    },
    {
      "text": "Yahoo. 2012. YAHOO! FINANCE.",
      "doi": ""
    },
    {
      "text": "Wai Yu and Stephen Brewster. 2002. Comparing two haptic interfaces for multimodal graph rendering. In Proceedings 10th Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. HAPTICS 2002. IEEE, 3–9.",
      "doi": ""
    },
    {
      "text": "Wai Yu and Stephen Brewster. 2003. Evaluation of multimodal graphs for blind people. Universal access in the information society 2, 2 (2003), 105–124.",
      "doi": ""
    },
    {
      "text": "Wai Yu, Ramesh Ramloll, and Stephen Brewster. 2000. Haptic graphs for blind computer users. In International workshop on haptic human-computer interaction. Springer, 41–51.",
      "doi": "10.5555/645443.652687"
    },
    {
      "text": "Wai Yu, Rameshsharma Ramloll, Stephen Brewster, and Beate Ridel. 2001. Exploring computer-generated line graphs through virtual touch. In Proceedings of the Sixth International Symposium on Signal Processing and its Applications (Cat. No. 01EX467), Vol. 1. IEEE, 72–75.",
      "doi": ""
    },
    {
      "text": "Jean Mary Zarate, Caroline R Ritson, and David Poeppel. 2012. Pitch-interval discrimination and musical expertise: Is the semitone a perceptual boundary?The Journal of the Acoustical Society of America 132, 2 (2012), 984–993.",
      "doi": ""
    },
    {
      "text": "Kim T Zebehazy and Adam P Wilton. 2014. Charting Success: The experience of teachers of students with visual impairments in promoting student use of graphics. Journal of Visual Impairment & Blindness 108, 4 (2014), 263–274.",
      "doi": ""
    },
    {
      "text": "Kim T Zebehazy and Adam P Wilton. 2014. Quality, importance, and instruction: The perspectives of teachers of students with visual impairments on graphics use by students. Journal of Visual Impairment & Blindness 108, 1 (2014), 5–16.",
      "doi": ""
    },
    {
      "text": "Benjamin Rich Zendel and Claude Alain. 2012. Musicians experience less age-related decline in central auditory processing.Psychology and aging 27, 2 (2012), 410.",
      "doi": ""
    },
    {
      "text": "Haixia Zhao. 2006. Interactive Sonification of Abstract Data-Framework, Design Space, Evaluation, and User Tool. Ph. D. Dissertation. University of Maryland (College Park, Md.).",
      "doi": ""
    },
    {
      "text": "Haixia Zhao, Catherine Plaisant, Ben Shneiderman, and Jonathan Lazar. 2008. Data sonification for users with visual impairment: a case study with georeferenced data. ACM Transactions on Computer-Human Interaction (TOCHI) 15, 1(2008), 1–28.",
      "doi": "10.1145/1352782.1352786"
    }
  ]
}