{
  "doi": "10.1145/3491102.3501943",
  "title": "‘It Is Not Always Discovery Time’: Four Pragmatic Approaches in Designing AI Systems",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2022,
  "badges": [],
  "abstract": "While systems that use Artificial Intelligence (AI) are increasingly becoming part of everyday technology use, we do not fully understand how AI changes design processes. A structured understanding of how designers work with AI is needed to improve the design process and educate future designers. To that end, we conducted interviews with designers who participated in projects which used AI. While past work focused on AI systems created by experienced designers, we focus on the perspectives of a diverse sample of interaction designers. Our results show that the design process of an interactive system is affected when AI is integrated and that design teams adapt their processes to accommodate AI. Based on our data, we contribute four approaches adopted by interaction designers working with AI: a priori, post-hoc, model-centric, and competence-centric. Our work contributes a pragmatic account of how design processes for AI systems are enacted.",
  "authors": [
    {
      "name": "Maximiliane Windl",
      "institution": "LMU Munich, Germany",
      "img": "/do/10.1145/contrib-99659463901/rel-imgonly/banner_side_quadrat.jpg",
      "acmid": "99659463901",
      "orcid": "0000-0002-9743-3819"
    },
    {
      "name": "Sebastian S. Feger",
      "institution": "LMU Munich, Germany",
      "img": "/do/10.1145/contrib-99659365234/rel-imgonly/portrait_2019_closer.jpg",
      "acmid": "99659365234",
      "orcid": "0000-0002-0287-0945"
    },
    {
      "name": "Lara Zijlstra",
      "institution": "Utrecht University, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660232813",
      "orcid": "missing"
    },
    {
      "name": "Albrecht Schmidt",
      "institution": "LMU Munich, Germany",
      "img": "/do/10.1145/contrib-81100588072/rel-imgonly/albrecht.jpg",
      "acmid": "81100588072",
      "orcid": "0000-0003-3890-1990"
    },
    {
      "name": "Pawel W. Wozniak",
      "institution": "Chalmers University of Technology, Sweden",
      "img": "/do/10.1145/contrib-87958813957/rel-imgonly/pawel_cropped.jpg",
      "acmid": "87958813957",
      "orcid": "0000-0003-3670-1813"
    }
  ],
  "references": [
    {
      "text": "Ashraf Abdul, Jo Vermeulen, Danding Wang, Brian Y. Lim, and Mohan Kankanhalli. 2018. Trends and Trajectories for Explainable, Accountable and Intelligible Systems: An HCI Research Agenda. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–18. https://doi.org/10.1145/3173574.3174156",
      "doi": "10.1145/3173574.3174156"
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300233",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Ann Blandford, Dominic Furniss, and Stephann Makri. 2016. Qualitative HCI Research: Going Behind the Scenes. Morgan & Claypool Publishers, 51–60. https://doi.org/10.2200/S00706ED1V01Y201602HCI034",
      "doi": ""
    },
    {
      "text": "Justin Cranshaw, Emad Elwany, Todd Newman, Rafal Kocielnik, Bowen Yu, Sandeep Soni, Jaime Teevan, and Andrés Monroy-Hernández. 2017. Calendar.Help: Designing a Workflow-Based Scheduling Agent with Humans in the Loop. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2382–2393. https://doi.org/10.1145/3025453.3025780",
      "doi": "10.1145/3025453.3025780"
    },
    {
      "text": "Graham Dove, Kim Halskov, Jodi Forlizzi, and John Zimmerman. 2017. UX Design Innovation: Challenges for Working with Machine Learning as a Design Material. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 278–288. https://doi.org/10.1145/3025453.3025739",
      "doi": "10.1145/3025453.3025739"
    },
    {
      "text": "Jonas Frich, Midas Nouwens, Kim Halskov, and Peter Dalsgaard. 2021. How Digital Tools Impact Convergent and Divergent Thinking in Design Ideation. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 431, 11 pages. https://doi.org/10.1145/3411764.3445062",
      "doi": "10.1145/3411764.3445062"
    },
    {
      "text": "Fabien Girardin and Neal Lathia. 2017. When User Experience Designers Partner with Data Scientists. https://www.aaai.org/ocs/index.php/SSS/SSS17/paper/view/15364",
      "doi": ""
    },
    {
      "text": "Lars Erik Holmquist. 2017. Intelligence on Tap: Artificial Intelligence as a New Design Material. Interactions 24, 4 (June 2017), 28–33. https://doi.org/10.1145/3085571",
      "doi": "10.1145/3085571"
    },
    {
      "text": "Claire Kayacik, Sherol Chen, Signe Noerly, Jess Holbrook, Adam Roberts, and Douglas Eck. 2019. Identifying the Intersections: User Experience + Research Scientist Collaboration in a Generative Machine Learning Interface. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3290607.3299059",
      "doi": "10.1145/3290607.3299059"
    },
    {
      "text": "Scott R. Klemmer, Anoop K. Sinha, Jack Chen, James A. Landay, Nadeem Aboobaker, and Annie Wang. 2000. Suede: A Wizard of Oz Prototyping Tool for Speech User Interfaces. In Proceedings of the 13th Annual ACM Symposium on User Interface Software and Technology (San Diego, California, USA) (UIST ’00). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/354401.354406",
      "doi": "10.1145/354401.354406"
    },
    {
      "text": "Jeff Larson, Julia Angwin, Surya Mattu, and Lauren Kirchner. 2016. Machine bias. https://www.propublica.org/article/machine-bias-risk-assessments-in-criminal-sentencing",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research Methods in Human-Computer Interaction (2 ed.). Morgan Kaufmann, Cambridge, MA. https://www.safaribooksonline.com/library/view/research-methods-in/9780128093436/",
      "doi": ""
    },
    {
      "text": "Fei-Fei Li and John Etchemendy. 2021. Welcome to the Stanford Institute for Human-Centered Artificial Intelligence. https://hai.stanford.edu/about/welcome",
      "doi": ""
    },
    {
      "text": "Michael Muller, Ingrid Lange, Dakuo Wang, David Piorkowski, Jason Tsay, Q. Vera Liao, Casey Dugan, and Thomas Erickson. 2019. How Data Science Workers Work with Data: Discovery, Capture, Curation, Design, Creation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300356",
      "doi": "10.1145/3290605.3300356"
    },
    {
      "text": "Thomas Olsson and Kaisa Väänänen. 2021. How Does AI Challenge Design Practice?Interactions 28, 4 (June 2021), 62–64. https://doi.org/10.1145/3467479",
      "doi": ""
    },
    {
      "text": "Laurel D. Riek. 2012. Wizard of Oz Studies in HRI: A Systematic Review and New Reporting Guidelines. J. Hum.-Robot Interact. 1, 1 (July 2012), 119–136. https://doi.org/10.5898/JHRI.1.1.Riek",
      "doi": "10.5898/JHRI.1.1.Riek"
    },
    {
      "text": "Filippo Santoni de Sio and Jeroen van den Hoven. 2018. Meaningful Human Control over Autonomous Systems: A Philosophical Account. Frontiers in Robotics and AI 5 (2018), 15. https://doi.org/10.3389/frobt.2018.00015",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2020. Bridging the Gap Between Ethics and Practice: Guidelines for Reliable, Safe, and Trustworthy Human-Centered AI Systems. ACM Trans. Interact. Intell. Syst. 10, 4, Article 26 (Oct. 2020), 31 pages. https://doi.org/10.1145/3419764",
      "doi": "10.1145/3419764"
    },
    {
      "text": "B. Shneiderman. 2020. Design Lessons From AI’s Two Grand Goals: Human Emulation and Useful Applications. IEEE Transactions on Technology and Society 1 (2020), 73–82.",
      "doi": ""
    },
    {
      "text": "Lisa Stifelman, Adam Elman, and Anne Sullivan. 2013. Designing Natural Speech Interactions for the Living Room. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France) (CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 1215–1220. https://doi.org/10.1145/2468356.2468574",
      "doi": "10.1145/2468356.2468574"
    },
    {
      "text": "Hariharan Subramonyam, Colleen Seifert, and Eytan Adar. 2021. ProtoAI: Model-Informed Prototyping for AI-Powered Interfaces. In 26th International Conference on Intelligent User Interfaces (College Station, TX, USA) (IUI ’21). Association for Computing Machinery, New York, NY, USA, 48–58. https://doi.org/10.1145/3397481.3450640",
      "doi": "10.1145/3397481.3450640"
    },
    {
      "text": "Hariharan Subramonyam, Colleen Seifert, and Eytan Adar. 2021. Towards A Process Model for Co-Creating AI Experiences. In Designing Interactive Systems Conference 2021. Association for Computing Machinery, New York, NY, USA, 1529–1543. https://doi.org/10.1145/3461778.3462012",
      "doi": "10.1145/3461778.3462012"
    },
    {
      "text": "Philip van Allen. 2018. Prototyping Ways of Prototyping AI. Interactions 25, 6 (Oct. 2018), 46–51. https://doi.org/10.1145/3274566",
      "doi": "10.1145/3274566"
    },
    {
      "text": "Dirk Wrede, Tino Stegen, and Johann-Matthias Graf von der Schulenburg. 2020. Affirmative and silent cyber coverage in traditional insurance policies: Qualitative content analysis of selected insurance products from the German insurance market. The Geneva Papers on Risk and Insurance - Issues and Practice 45, 4 (01 Oct 2020), 657–689. https://doi.org/10.1057/s41288-020-00183-6",
      "doi": ""
    },
    {
      "text": "Wei Xu. 2019. Toward Human-Centered AI: A Perspective from Human-Computer Interaction. Interactions 26, 4 (June 2019), 42–46. https://doi.org/10.1145/3328485",
      "doi": "10.1145/3328485"
    },
    {
      "text": "Wei Xu, Dov Furie, Manjunath Mahabhaleshwar, Bala Suresh, and Hardev Chouhan. 2019. Applications of an interaction, process, integration and intelligence (IPII) design approach for ergonomics solutions. Ergonomics 62, 7 (2019), 954–980. https://doi.org/10.1080/00140139.2019.1588996 PMID: 30836051.",
      "doi": ""
    },
    {
      "text": "Qian Yang. 2020. Profiling Artificial Intelligence as a Material for User Experience Design. dissertation. Carnegie Mellon University.",
      "doi": ""
    },
    {
      "text": "Qian Yang, Nikola Banovic, and John Zimmerman. 2018. Mapping Machine Learning Advances from HCI Research to Reveal Starting Places for Design Innovation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3173704",
      "doi": "10.1145/3173574.3173704"
    },
    {
      "text": "Qian Yang, Justin Cranshaw, Saleema Amershi, Shamsi T. Iqbal, and Jaime Teevan. 2019. Sketching NLP: A Case Study of Exploring the Right Things To Design with Language Intelligence. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300415",
      "doi": "10.1145/3290605.3300415"
    },
    {
      "text": "Qian Yang, Alex Scuito, John Zimmerman, Jodi Forlizzi, and Aaron Steinfeld. 2018. Investigating How Experienced UX Designers Effectively Work with Machine Learning. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 585–596. https://doi.org/10.1145/3196709.3196730",
      "doi": "10.1145/3196709.3196730"
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, Carolyn Rosé, and John Zimmerman. 2020. Re-Examining Whether, Why, and How Human-AI Interaction Is Uniquely Difficult to Design. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376301",
      "doi": "10.1145/3313831.3376301"
    },
    {
      "text": "Qian Yang, Jina Suh, Nan-Chen Chen, and Gonzalo Ramos. 2018. Grounding Interactive Machine Learning Tool Design in How Non-Experts Actually Build Models. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 573–584. https://doi.org/10.1145/3196709.3196729",
      "doi": "10.1145/3196709.3196729"
    },
    {
      "text": "Qian Yang, John Zimmerman, Aaron Steinfeld, and Anthony Tomasic. 2016. Planning Adaptive Mobile Experiences When Wireframing. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). Association for Computing Machinery, New York, NY, USA, 565–576. https://doi.org/10.1145/2901790.2901858",
      "doi": "10.1145/2901790.2901858"
    }
  ]
}