{
  "doi": "10.1145/3491102.3517456",
  "title": "We Play and Learn Rhythmically: Gesture-based Rhythm Game for Children with Intellectual Developmental Disabilities to Learn Manual Sign",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2022,
  "badges": [],
  "abstract": "Manual sign systems have been introduced to improve the communication of children with intellectual developmental disabilities (IDD). Due to the lack of learning support tools, teachers face many practical challenges in teaching manual sign to children, such as low attention span and the need for persistent intervention. To address these issues, we collaborated with teachers to develop the Sondam Rhythm Game, a gesture-based rhythm game that assists in teaching manual sign language, and ran a four-week empirical study with five teachers and eight children with IDD. Based on video annotation and post-hoc interviews, our game-based learning approach has the potential to be effective at teaching manual sign to children with IDD. Our approach improved children attention span and motivation while also increasing the number of voluntary gestures made without the need for prompting. Other practical issues and learning challenges were also uncovered to improve teaching paradigms for children with IDD.",
  "tags": [
    "Children with intellectual and developmental disabilities",
    "Rhythm game",
    "Gamification",
    "Manual sign learning"
  ],
  "authors": [
    {
      "name": "Youjin Choi",
      "institution": "School of Integrated Technology/Soft Computing & Interaction Laboratory, Gwangju Institute of Science and Technology, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237731",
      "orcid": "missing"
    },
    {
      "name": "JooYeong Kim",
      "institution": "School of Integrated Technology/Soft Computing & Interaction Laboratory, Gwangju Institute of Science and Technology, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239862",
      "orcid": "0000-0002-4721-8475"
    },
    {
      "name": "Chan Woo Park",
      "institution": "Special Education, Dankook Univ, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239933",
      "orcid": "missing"
    },
    {
      "name": "Jeongyoun Kim",
      "institution": "Special Education, Chosun University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239861",
      "orcid": "missing"
    },
    {
      "name": "Ji Hyun Yi",
      "institution": "School of Integrated Technology/Creative Culture Technology Lab, Gwangju Institute of Science and Technology, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659888817",
      "orcid": "missing"
    },
    {
      "name": "Jin-Hyuk Hong",
      "institution": "School of Integrated Technology/Soft Computing & Interaction Laboratory, Gwangju Institute of Science and Technology, Korea, Republic of and Artificial Intelligence Graduate School, Gwangju Institute of Science and Technology, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702157",
      "orcid": "0000-0002-8838-5667"
    }
  ],
  "references": [
    {
      "text": "Heidemarie Adam. 1996. Mit Gebärden und Bildsymbolen kommunizieren: Voraussetzungen und Möglichkeiten der Kommunikation von Menschen mit geistiger Behinderung. Ed. Bentheim d. Blindeninstitutsstiftung.",
      "doi": ""
    },
    {
      "text": "Sheila R. Alber-Morgan, Terri Hessler, and Moira Konrad. 2007. Teaching Writing for Keeps. Education and Treatment of Children 30, 3 (2007), 107–128. https://doi.org/stable/42899937",
      "doi": ""
    },
    {
      "text": "Tracy Packiam Alloway, Susan Elizabeth Gathercole, Hannah Kirkwood, and Julian Elliott. 2009. The cognitive and behavioral characteristics of children with low working memory. Child development 80, 2 (2009), 606–621. https://doi.org/10.1111/j.1467-8624.2009.01282.x",
      "doi": ""
    },
    {
      "text": "Laura Bartoli, Clara Corradi, Franca Garzotto, and Matteo Valoriani. 2013. Exploring Motion-Based Touchless Games for Autistic Children’s Learning. In Proceedings of the 12th International Conference on Interaction Design and Children(IDC ’13). Association for Computing Machinery, New York, NY, USA, 102–111. https://doi.org/10.1145/2485760.2485774",
      "doi": "10.1145/2485760.2485774"
    },
    {
      "text": "Sara Bernardini, Kaśka Porayska-Pomsta, and Tim J Smith. 2014. ECHOES: An intelligent serious game for fostering social communication in children with autism. Information Sciences 264(2014), 41–60. https://doi.org/10.1016/j.ins.2013.10.027",
      "doi": "10.1016/j.ins.2013.10.027"
    },
    {
      "text": "David R Beukelman and Pat Mirenda. 2013. Augmentative & alternative communication: Supporting children and adults with complex communication needs. Paul H. Brookes Pub.",
      "doi": ""
    },
    {
      "text": "Anjana Narayan Bhat and Sudha Srinivasan. 2013. A review of “music and movement” therapies for children with autism: embodied interventions for multisystem development. Frontiers in integrative neuroscience 7 (2013), 22. https://doi.org/10.3389/fnint.2013.00022",
      "doi": ""
    },
    {
      "text": "Coleen A Boyle, Sheree Boulet, Laura A Schieve, Robin A Cohen, Stephen J Blumberg, Marshalyn Yeargin-Allsopp, Susanna Visser, and Michael D Kogan. 2011. Trends in the prevalence of developmental disabilities in US children, 1997–2008. Pediatrics 127, 6 (2011), 1034–1042. https://doi.org/10.1542/peds.2010-2989",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "David Joseph Brown, James Ley, Lindsay Evett, and Penny Standen. 2011. Can participating in games based learning improve mathematic skills in students with intellectual disabilities?. In 2011 IEEE 1st International Conference on Serious Games and Applications for Health (SeGAH). 1–9. https://doi.org/10.1109/SeGAH.2011.6165461",
      "doi": "10.1109/SeGAH.2011.6165461"
    },
    {
      "text": "Evelyn M Buday. 1995. The effects of signed and spoken words taught with music on sign and speech imitation by children with autism. Journal of Music Therapy 32, 3 (1995), 189–202. https://doi.org/10.1093/jmt/32.3.189",
      "doi": ""
    },
    {
      "text": "Elizabeth J Carter, Diane L Williams, Jessica K Hodgins, and Jill F Lehman. 2014. Are children with autism more responsive to animated characters? A study of interactions with humans and human-controlled avatars. Journal of autism and developmental disorders 44, 10(2014), 2475–2485. https://doi.org/10.1007/s10803-014-2116-8",
      "doi": ""
    },
    {
      "text": "Jeffrey Chan and Teresa Iacono. 2001. Gesture and word production in children with Down syndrome. Augmentative and Alternative Communication 17, 2 (2001), 73–87. https://doi.org/10.1080/aac.17.2.73.87",
      "doi": ""
    },
    {
      "text": "Yuh-Ming Cheng, Shi-Jer Lou, Sheng-Huang Kuo, and Ru-Chu Shih. 2013. Investigating elementary school students’ technology acceptance by applying digital game-based learning to environmental education. Australasian Journal of Educational Technology 29, 1(2013). https://doi.org/10.14742/ajet.65",
      "doi": ""
    },
    {
      "text": "Franceli L. Cibrian, Jose Mercado, Lizbeth Escobedo, and Monica Tentori. 2018. A Step towards Identifying the Sound Preferences of Children with Autism. In Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare(PervasiveHealth ’18). Association for Computing Machinery, New York, NY, USA, 158–167. https://doi.org/10.1145/3240925.3240958",
      "doi": "10.1145/3240925.3240958"
    },
    {
      "text": "Brianno D Coller and David J Shernoff. 2009. Video game-based education in mechanical engineering: A look at student engagement. International Journal of Engineering Education 25, 2 (2009), 308.",
      "doi": ""
    },
    {
      "text": "RB Dever. 1990. Defining mental retardation from an instructional perspective. Mental retardation 28, 3 (1990), 147.",
      "doi": ""
    },
    {
      "text": "Cynthia F DiCarlo, Sarintha Stricklin, Meher Banajee, and Dennis H Reid. 2001. Effects of manual signing on communicative verbalizations by toddlers with and without disabilities in inclusive classrooms. Journal of the Association for Persons with Severe Handicaps 26, 2(2001), 120–126. https://doi.org/10.2511/rpsd.26.2.120",
      "doi": ""
    },
    {
      "text": "Arzu Doganay Bilgi and E Ruya Ozmen. 2020. Effectiveness of Cumulative Repeated Storybook Reading on Word Production in Children with Developmental Disabilities. International Journal of Disability, Development and Education (2020), 1–17. https://doi.org/10.1080/1034912X.2020.1843606",
      "doi": ""
    },
    {
      "text": "Svein Eikeseth and Erik Jahr. 2001. The UCLA reading and writing program: An evaluation of the beginning stages. Research in Developmental Disabilities 22, 4 (2001), 289–307. https://doi.org/10.1016/S0891-4222(01)00073-7",
      "doi": ""
    },
    {
      "text": "Barbara Giel. 2015. Sprach-und Kommunikationsförderung bei Kindern mit Down-Syndrom: ein Ratgeber für Eltern, pädagogische Fachkräfte, Therapeuten und Ärzte. Schulz-Kirchner Verlag GmbH.",
      "doi": ""
    },
    {
      "text": "Howard Goldstein. 2002. Communication intervention for children with autism: A review of treatment efficacy. Journal of autism and Developmental Disorders 32, 5 (2002), 373–396. https://doi.org/10.1023/A:1020589821992",
      "doi": ""
    },
    {
      "text": "César González-Ferreras, David Escudero-Mancebo, Mario Corrales-Astorgano, Lourdes Aguilar-Cuevas, and Valle Flores-Lucas. 2017. Engaging Adolescents with Down Syndrome in an Educational Video Game. International Journal of Human–Computer Interaction 33, 9(2017), 693–712. https://doi.org/10.1080/10447318.2017.1278895",
      "doi": ""
    },
    {
      "text": "Julie Goodman and Bob Remington. 1993. Acquisition of expressive signing: Comparison of reinforcement strategies. Augmentative and Alternative Communication 9, 1 (1993), 26–35. https://doi.org/10.1080/07434619312331276381",
      "doi": ""
    },
    {
      "text": "Susan W Goodwyn, Linda P Acredolo, and Catherine A Brown. 2000. Impact of symbolic gesturing on early language development. Journal of Nonverbal behavior 24, 2 (2000), 81–103. https://doi.org/10.1023/A:1006653828895",
      "doi": ""
    },
    {
      "text": "Nicola Clare Grove. 2010. Current research findings to support the use of sign language with adults and children who have intellectual and communication handicaps.",
      "doi": ""
    },
    {
      "text": "Pamela Heaton. 2003. Pitch memory, labelling and disembedding in autism. Journal of Child Psychology and Psychiatry 44, 4 (2003), 543–551. https://doi.org/10.1111/1469-7610.00143",
      "doi": ""
    },
    {
      "text": "H-S. Hsiao, C-S. Chang, C-Y. Lin, and P-M. Hu. 2014. Development of children’s creativity and manual skills within digital game-based learning environment. Journal of Computer Assisted Learning 30, 4 (2014), 377–395. https://doi.org/10.1111/jcal.12057",
      "doi": "10.1111/jcal.12057"
    },
    {
      "text": "Wen-Hao Huang. 2011. Evaluating learners’ motivational and cognitive processing in an online game-based learning environment. Computers in Human Behavior 27, 2 (2011), 694–704. https://doi.org/10.1016/j.chb.2010.07.021",
      "doi": "10.1016/j.chb.2010.07.021"
    },
    {
      "text": "Robin Hunicke. 2005. The Case for Dynamic Difficulty Adjustment in Games. In Proceedings of the 2005 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology(ACE ’05). Association for Computing Machinery, New York, NY, USA, 429–433. https://doi.org/10.1145/1178477.1178573",
      "doi": "10.1145/1178477.1178573"
    },
    {
      "text": "Lisa A Kurtz. 2006. Visual perception problems in children with AD/HD, autism, and other learning disabilities: A guide for parents and professionals. Jessica Kingsley Publishers.",
      "doi": ""
    },
    {
      "text": "Dandhi Kuswardhana, Shinobu Hasegawa, Nenden Nur’Aeni, and Juhanaini. 2015. Improving concentration through picture selecting game based on kinect sensor for student with intellectual deficiencies. In 2015 International Conference on Information Communication Technology and Systems (ICTS). 133–136. https://doi.org/10.1109/ICTS.2015.7379886",
      "doi": ""
    },
    {
      "text": "Rebecca Landa. 2007. Early communication development and intervention for children with autism. Mental retardation and developmental disabilities research reviews 13, 1(2007), 16–25. https://doi.org/10.1002/mrdd.20134",
      "doi": ""
    },
    {
      "text": "Hyun-Joo Lee, Eunhye Park, Jeong-Youn Kim, Hyesun Joo, Jurnghyun Whang, Jeong-Ah Ku, and Seol-Hee Lee. 2019. Development of Simplified Manual Sign System for Students with Severe and Multiple Disabilities. Special Education Research 18, 1 (2019), 197–224. https://doi.org/10.18541/ser.2019.02.18.1.197",
      "doi": ""
    },
    {
      "text": "Janice Light and David McNaughton. 2012. Supporting the communication, language, and literacy development of children with complex communication needs: State of the science and future research priorities. Assistive Technology 24, 1 (2012), 34–44. https://doi.org/10.1080/10400435.2011.648717",
      "doi": ""
    },
    {
      "text": "Jeremy Lothian and Jungwoo Ryoo. 2013. Critical Factors and Resources in Developing a Game-Based Learning (GBL) Environment Using Free and Open Source Software (FOSS). International Journal of Emerging Technologies in Learning (iJET) 8, 6(2013), 11–20. https://doi.org/10.3991/ijet.v8i6.2918",
      "doi": ""
    },
    {
      "text": "Konstantinos Maragos and Maria Grigoriadou. 2005. Towards the design of intelligent educational gaming systems. Proc. AIED05 WORKSHOP5: Educational Games as Intelligent Learning Environments (2005), 35–38.",
      "doi": ""
    },
    {
      "text": "Henry Mintzberg. 1970. Structured observation as a method to study managerial work. Journal of management studies 7, 1 (1970), 87–104. https://doi.org/10.1111/j.1467-6486.1970.tb00484.x",
      "doi": ""
    },
    {
      "text": "Che Ku Nuraini Che Ku Mohd, Faaizah Shahbodin, Zanariah Jano, and A. H. Azni. 2019. Visual Perception Games for Autistic Learners: Design & Development. In Proceedings of the 2019 Asia Pacific Information Technology Conference(APIT 2019). Association for Computing Machinery, New York, NY, USA, 5–11. https://doi.org/10.1145/3314527.3314533",
      "doi": "10.1145/3314527.3314533"
    },
    {
      "text": "Emily Mower, Matthew P. Black, Elisa Flores, Marian Williams, and Shrikanth Narayanan. 2011. Rachel: Design of an emotionally targeted interactive agent for children with autism. In 2011 IEEE International Conference on Multimedia and Expo. 1–6. https://doi.org/10.1109/ICME.2011.6011990",
      "doi": "10.1109/ICME.2011.6011990"
    },
    {
      "text": "Pamela L Neidert, Claudia L Dozier, Brian A Iwata, and Megan Hafen. 2010. Behavior analysis in intellectual and developmental disabilities. Psychological Services 7, 2 (2010), 103. https://doi.org/10.1037/a0018791",
      "doi": ""
    },
    {
      "text": "Oluwabunmi Adewoyin Olakanmi, Gokce Akcayir, Oluwbukola Mayowa Ishola, and Carrie Demmans Epp. 2020. Using technology in special education: current practices and trends. Educational Technology Research and Development 68, 4(2020), 1711–1738. https://doi.org/10.1007/s11423-020-09795-0",
      "doi": ""
    },
    {
      "text": "Erol Ozcelik, Nergiz Ercil Cagiltay, and Nese Sahin Ozcelik. 2013. The effect of uncertainty on learning in game-like environments. Computers & Education 67 (2013), 12–20. https://doi.org/10.1016/j.compedu.2013.02.009",
      "doi": "10.5555/2753875.2753962"
    },
    {
      "text": "Eliada Pampoulou. 2017. Graphic symbols terminology: a call for a consensus. Journal of Enabling Technologies(2017). https://doi.org/10.1108/JET-02-2017-0008",
      "doi": ""
    },
    {
      "text": "Marina Papastergiou. 2009. Digital Game-Based Learning in high school Computer Science education: Impact on educational effectiveness and student motivation. Computers & Education 52, 1 (2009), 1–12. https://doi.org/10.1016/j.compedu.2008.06.004",
      "doi": "10.1016/j.compedu.2008.06.004"
    },
    {
      "text": "Manuel Pezzera and N. Alberto Borghese. 2020. Dynamic difficulty adjustment in exer-games for rehabilitation: a mixed approach. In 2020 IEEE 8th International Conference on Serious Games and Applications for Health (SeGAH). 1–7. https://doi.org/10.1109/SeGAH49190.2020.9201871",
      "doi": ""
    },
    {
      "text": "Hayo Reinders and Sorada Wattana. 2015. Affect and willingness to communicate in digital game-based learning. ReCALL 27, 1 (2015), 38–57. https://doi.org/10.1017/S0958344014000226",
      "doi": ""
    },
    {
      "text": "Miia Ronimus, Janne Kujala, Asko Tolvanen, and Heikki Lyytinen. 2014. Children’s engagement during digital game-based learning of reading: The effects of time, rewards, and challenge. Computers & Education 71 (2014), 237–246. https://doi.org/10.1016/j.compedu.2013.10.008",
      "doi": "10.1016/j.compedu.2013.10.008"
    },
    {
      "text": "Maria Saridaki, Dimitris Gouscos, and Michael G Meimaris. 2009. Digital games-based learning for students with intellectual disability. IGI Global, 304–325. https://doi.org/10.4018/978-1-60566-360-9.ch018",
      "doi": ""
    },
    {
      "text": "Ralf W. Schlosser. 2003. The efficacy of augmentative and alternative communication: Toward evidence-based practice. MA: Academic press, Boston.",
      "doi": ""
    },
    {
      "text": "Adel Shaban and Elaine Pearson. 2019. A Learning Design Framework to Support Children with Learning Disabilities Incorporating Gamification Techniques. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems(CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312806",
      "doi": "10.1145/3290607.3312806"
    },
    {
      "text": "Sumita Sharma, Saurabh Srivastava, Krishnaveni Achary, Blessin Varkey, Tomi Heimonen, Jaakko Hakulinen, Markku Turunen, and Nitendra Rajput. 2016. Gesture-Based Interaction for Individuals with Developmental Disabilities in India. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’16). Association for Computing Machinery, New York, NY, USA, 61–70. https://doi.org/10.1145/2982142.2982166",
      "doi": "10.1145/2982142.2982166"
    },
    {
      "text": "Donghoon Shin, Jaeyoon Song, Seokwoo Song, Jisoo Park, Joonhwan Lee, and Soojin Jun. 2020. TalkingBoogie: Collaborative Mobile AAC System for Non-Verbal Children with Developmental Disabilities and Their Caregivers. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376154",
      "doi": ""
    },
    {
      "text": "Signalong. (accessed August 10, 2021). Signalong The Communication Charity. https://signalong.org.uk/.",
      "doi": ""
    },
    {
      "text": "Kate Simpson, Deb Keen, and Janeen Lamb. 2013. The use of music to engage children with autism in a receptive labelling task. Research in Autism Spectrum Disorders 7, 12 (2013), 1489–1496. https://doi.org/10.1016/j.rasd.2013.08.013",
      "doi": ""
    },
    {
      "text": "Dianne Spragale and Debbie Micucci. 1990. Signs of the week: A functional approach to manual sign training. Augmentative and Alternative Communication 6, 1 (1990), 29–37. https://doi.org/10.1080/07434619012331275294",
      "doi": ""
    },
    {
      "text": "Talia Stough, Kim Ceulemans, Wim Lambrechts, and Valérie Cappuyns. 2018. Assessing sustainability in higher education curricula: A critical reflection on validity issues. Journal of Cleaner Production 172 (2018), 4456–4466. https://doi.org/10.1016/j.jclepro.2017.02.017",
      "doi": ""
    },
    {
      "text": "Andrea Tartaro and Justine Cassell. 2007. Using virtual peer technology as an intervention for children with autism. Towards universal usability: designing computer interfaces for diverse user populations 231(2007), 62.",
      "doi": ""
    },
    {
      "text": "Andrea Tartaro and Justine Cassell. 2008. Playing with virtual peers: Bootstrapping contingent discourse in children with autism. Proceedings of the International Conference of the Learning Science (ICLS), 382–389.",
      "doi": ""
    },
    {
      "text": "Steve Terrell and Paul Rendulic. 1996. Using Computer-Managed Instructional Software to Increase Motivation and Achievement in Elementary School Children. Journal of Research on Computing in Education 28, 3 (1996), 403–414. https://doi.org/10.1080/08886504.1996.10782174",
      "doi": ""
    },
    {
      "text": "Anastasiadis Theofylaktos, Lampropoulos Georgios, and Siakas Kerstin. 2018. Digital Game-based Learning and Serious Games in Education. International Journal of Advances in Scientific Research and Engineering (IJASRE), ISSN:2454-8006, DOI: 10.31695/IJASRE 4, 12(2018), 139–144. https://doi.org/10.31695/IJASRE.2018.33016",
      "doi": ""
    },
    {
      "text": "Emily J Tyler, John C Hughes, Meadhbh M Wilson, Michael Beverley, Richard P Hastings, and Bethan M Williams. 2015. Teaching early reading skills to children with intellectual and developmental disabilities using computer-delivered instruction: A pilot study. Journal of International Special Needs Education 18, 1 (2015), 1–11. https://doi.org/10.9782/2159-4341-18.1.1",
      "doi": ""
    },
    {
      "text": "Stephen Von Tetzchner, Harald Martinsen, and Stephen Von Tetzchner. 2000. Introduction to augmentative and alternative communication: Sign teaching and the use of communication aids for children, adolescents and adults with developmental disorders. Whurr London.",
      "doi": ""
    },
    {
      "text": "I-Fang Wang, Dennis Wang, Chia-Yu Chen, and Jyun-Fong Jheng. 2016. PinchFun: A Fine Motor Training Game for Preschool Children with Developmental Delay. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 152–155. https://doi.org/10.1145/2851581.2890371",
      "doi": "10.1145/2851581.2890371"
    },
    {
      "text": "Jeng-Chung Woo. 2014. Digital Game-Based Learning Supports Student Motivation, Cognitive Success, and Performance Outcomes. Journal of Educational Technology & Society 17, 3 (2014), 291–307. http://www.jstor.org/stable/jeductechsoci.17.3.291",
      "doi": ""
    }
  ]
}