{
  "doi": "10.1145/3491102.3501869",
  "title": "Field Evidence of the Effects of Privacy, Data Transparency, and Pro-social Appeals on COVID-19 App Attractiveness",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-21",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "COVID-19 exposure-notification apps have struggled to gain adoption. Existing literature posits as potential causes of this low adoption: privacy concerns, insufficient data transparency, and the type of appeal – collective- vs. individual-good – used to frame the app. As policy guidance suggests using tailored advertising to evaluate the effects of these factors, we present the first field study of COVID-19 contact tracing apps with a randomized, control trial of 14 different advertisements for CovidDefense, Louisiana’s COVID-19 exposure-notification app. We find that all three hypothesized factors – privacy, data transparency, and appeals framing – relate to app adoption, even when controlling for age, gender, and community density. Our results offer (1) the first field evidence supporting the use of collective-good appeals, (2) nuanced findings regarding the efficacy of data and privacy transparency, the effects of which are moderated by appeal framing and potential users’ demographics, and (3) field-evidence-based guidance for future efforts to encourage pro-social health technology adoption.",
  "authors": [
    {
      "name": "Samuel Dooley",
      "institution": "Department of Computer Science, University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659681821",
      "orcid": "missing"
    },
    {
      "name": "Dana Turjeman",
      "institution": "Arison School of Business, Reichman University, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237184",
      "orcid": "missing"
    },
    {
      "name": "John P Dickerson",
      "institution": "Department of Computer Science, University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479647860",
      "orcid": "missing"
    },
    {
      "name": "Elissa M. Redmiles",
      "institution": "Max Plank Institute for Software Systems, Germany",
      "img": "/do/10.1145/contrib-87258829257/rel-imgonly/2017headshot.jpg",
      "acmid": "87258829257",
      "orcid": "0000-0003-3930-8128"
    }
  ],
  "references": [
    {
      "text": "Jüri Allik and Anu Realo. 2004. Individualism-collectivism and social capital. Journal of cross-cultural psychology 35, 1 (2004), 29–49.",
      "doi": ""
    },
    {
      "text": "Susan Athey, Christian Catalini, and Catherine Tucker. 2017. The digital privacy paradox: Small money, small costs, small talk. Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "Ali Balapour, Iris Reychav, Rajiv Sabherwal, and Joseph Azuri. 2019. Mobile technology identity and self-efficacy: Implications for the adoption of clinically supported mobile health apps. International Journal of Information Management 49 (2019), 58–68.",
      "doi": "10.1016/j.ijinfomgt.2019.03.005"
    },
    {
      "text": "Delia Baldassarri and Maria Abascal. 2020. Diversity and prosocial behavior. Science 369, 6508 (2020), 1183–1187.",
      "doi": ""
    },
    {
      "text": "Matthias Baldauf, Peter Fröehlich, and Rainer Endl. 2020. Trust Me, I’ma Doctor–User Perceptions of AI-Driven Apps for Mobile Health Diagnosis. In 19th International Conference on Mobile and Ubiquitous Multimedia. 167–178.",
      "doi": ""
    },
    {
      "text": "Jack Bandy and Brent Hecht. 2021. Errors in Geotargeted Display Advertising: Good News for Local Journalism?Proceedings of the ACM on Human-Computer Interaction 5, CSCW(2021).",
      "doi": ""
    },
    {
      "text": "Sachin Banker and Joowon Park. 2020. Evaluating prosocial COVID-19 messaging frames: Evidence from a field study on Facebook. Judgment and Decision Making 15, 6 (2020), 1037–1043.",
      "doi": ""
    },
    {
      "text": "Sarah J Barber and Hyunji Kim. 2021. COVID-19 worries and behavior changes in older and younger men and women. The Journals of Gerontology: Series B 76, 2 (2021), e17–e23.",
      "doi": ""
    },
    {
      "text": "Matt Begun, Anthony T Newall, Guy B Marks, and James G Wood. 2013. Contact tracing of tuberculosis: a systematic review of transmission modelling studies. PLoS One 8, 9 (2013), e72470.",
      "doi": ""
    },
    {
      "text": "Yoshua Bengio, Daphne Ippolito, Richard Janda, Max Jarvie, Benjamin Prud’homme, Jean-François Rousseau, Abhinav Sharma, and Yun William Yu. 2021. Inherent privacy limitations of decentralized contact tracing apps. Journal of the American Medical Informatics Association 28, 1(2021), 193–195.",
      "doi": ""
    },
    {
      "text": "Laura Brandimarte, Alessandro Acquisti, and George Loewenstein. 2013. Misplaced confidences: Privacy and the control paradox. Social psychological and personality science 4, 3 (2013), 340–347.",
      "doi": ""
    },
    {
      "text": "Timothy Callaghan, Jennifer A Lueck, Kristin Lunz Trujillo, and Alva O Ferdinand. 2021. Rural and urban differences in COVID-19 prevention behaviors. The Journal of Rural Health(2021).",
      "doi": ""
    },
    {
      "text": "Dan Cassino and Yasemin Besen-Cassino. 2020. Of Masks and Men? Gender, Sex, and Protective Measures during COVID-19. Politics & Gender 16, 4 (2020), 1052–1062.",
      "doi": ""
    },
    {
      "text": "Eugene Y Chan and Najam U Saqib. 2021. Privacy concerns can explain unwillingness to download and use contact tracing apps when COVID-19 concerns are high. Computers in Human Behavior 119 (2021), 106718.",
      "doi": "10.1016/j.chb.2021.106718"
    },
    {
      "text": "Xuewei Chen and Hongliang Chen. 2020. Differences in preventive behaviors of COVID-19 between urban and rural residents: lessons learned from a cross-sectional study in China. International journal of environmental research and public health 17, 12(2020), 4437.",
      "doi": ""
    },
    {
      "text": "Mihail Cocosila and Norm Archer. 2010. Adoption of mobile ICT for health promotion: an empirical investigation. Electronic Markets 20, 3 (2010), 241–250.",
      "doi": ""
    },
    {
      "text": "Zhaohua Deng, Ziying Hong, Cong Ren, Wei Zhang, and Fei Xiang. 2018. What predicts patients’ adoption intention toward mHealth services in China: empirical study. JMIR mHealth and uHealth 6, 8 (2018), e172.",
      "doi": ""
    },
    {
      "text": "Ying Fan, A Yeşim Orhun, and Dana Turjeman. 2020. Heterogeneous actions, beliefs, constraints and risk tolerance during the COVID-19 pandemic. Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "Centers for Disease Control, Prevention, 2020. Older adult at greater risk of requiring hospitalization or dying if diagnosed with COVID-19.",
      "doi": ""
    },
    {
      "text": "Linux Foundation. [n.d.]. Linux Foundation Public Health Landscape. https://landscape.lfph.io/. (Accessed on 08/19/2021).",
      "doi": ""
    },
    {
      "text": "Jemima A. Frimpong and Stephane Helleringer. 2020. Financial Incentives for Downloading COVID–19 Digital Contact Tracing Apps. preprint. SocArXiv. https://doi.org/10.31235/osf.io/9vp7x",
      "doi": ""
    },
    {
      "text": "Thomas Fritz, Elaine M Huang, Gail C Murphy, and Thomas Zimmermann. 2014. Persuasive technology in the real world: a study of long-term use of activity sensing devices for fitness. In Proceedings of the SIGCHI conference on human factors in computing systems. 487–496.",
      "doi": "10.1145/2556288.2557383"
    },
    {
      "text": "Sarah Geber and Thomas Friemel. 2021. A Typology-Based Approach to Tracing-App Adoption During the COVID-19 Pandemic: The Case of the SwissCovid App. Journal of Quantitative Description: Digital Media 1 (April 2021). https://doi.org/10.51685/jqd.2021.007",
      "doi": ""
    },
    {
      "text": "Gilie Gefen, Omer Ben-Porat, Moshe Tennenholtz, and Elad Yom-Tov. 2020. Privacy, altruism, and experience: Estimating the perceived value of Internet data for medical uses. In Companion Proceedings of the Web Conference 2020. 552–556.",
      "doi": "10.1145/3366424.3383414"
    },
    {
      "text": "Jeremy Ginsberg, Matthew H Mohebbi, Rajan S Patel, Lynnette Brammer, Mark S Smolinski, and Larry Brilliant. 2009. Detecting influenza epidemics using search engine query data. Nature 457, 7232 (2009), 1012–1014.",
      "doi": ""
    },
    {
      "text": "Hana Habib, Pardis Emami Naeini, Summer Devlin, Maggie Oates, Chelse Swoopes, Lujo Bauer, Nicolas Christin, and Lorrie Faith Cranor. 2018. User behaviors and attitudes under password expiration policies. In Fourteenth Symposium on Usable Privacy and Security ({SOUPS} 2018). 13–30.",
      "doi": ""
    },
    {
      "text": "Michael H Haischer, Rachel Beilfuss, Meggie Rose Hart, Lauren Opielinski, David Wrucke, Gretchen Zirgaitis, Toni D Uhrich, and Sandra K Hunter. 2020. Who is wearing a mask? Gender-, age-, and location-related differences during the COVID-19 pandemic. PloS one 15, 10 (2020), e0240785.",
      "doi": ""
    },
    {
      "text": "Laszlo Horvath, Susan Banducci, and Oliver James. 2020. Citizens’ Attitudes to Contact Tracing Apps. Journal of Experimental Political Science (Sept. 2020), 1–13. https://doi.org/10.1017/XPS.2020.30",
      "doi": ""
    },
    {
      "text": "Qian Huang, Sarah Jackson, Sahar Derakhshan, Logan Lee, Erika Pham, Amber Jackson, and Susan L Cutter. 2021. Urban-rural differences in COVID-19 exposures and outcomes in the South: A preliminary analysis of South Carolina. PloS one 16, 2 (2021), e0246548.",
      "doi": ""
    },
    {
      "text": "Maia L Jacobs, James Clawson, and Elizabeth D Mynatt. 2015. Comparing health information sharing preferences of cancer patients, doctors, and navigators. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 808–818.",
      "doi": "10.1145/2675133.2675252"
    },
    {
      "text": "Hannah Julienne, Ciarán Lavin, Cameron Belton, Martina Barjaková, Shane Timmons, and Peter D Lunn. 2020. Behavioural pre-testing of COVID Tracker, Ireland’s contact-tracing app. (2020).",
      "doi": ""
    },
    {
      "text": "Gabriel Kaptchuk, Daniel G. Goldstein, Eszter Hargittai, Jake Hofman, and Elissa M. Redmiles. 2020. How good is good enough for COVID19 apps? The influence of benefits, accuracy, and privacy on willingness to adopt. arXiv:2005.04343 [cs] (May 2020). http://arxiv.org/abs/2005.04343 arXiv:2005.04343.",
      "doi": ""
    },
    {
      "text": "Maria Karampela, Sofia Ouhbi, and Minna Isomursu. 2019. Connected health user willingness to share personal health data: questionnaire study. Journal of medical Internet research 21, 11 (2019), e14537.",
      "doi": ""
    },
    {
      "text": "Yoshihisa Kashima, Susumu Yamaguchi, Uichol Kim, Sang-Chin Choi, Michele J Gelfand, and Masaki Yuki. 1995. Culture, gender, and self: a perspective from individualism-collectivism research.Journal of personality and social psychology 69, 5(1995), 925.",
      "doi": ""
    },
    {
      "text": "Markus Kemmelmeier, Edina E Jambor, and Joyce Letner. 2006. Individualism and good works: Cultural variation in giving and volunteering across the United States. Journal of Cross-Cultural Psychology 37, 3 (2006), 327–344.",
      "doi": ""
    },
    {
      "text": "Tami Kim, Kate Barasz, and Leslie K John. 2019. Why am I seeing this ad? The effect of ad transparency on ad effectiveness. Journal of Consumer Research 45, 5 (2019), 906–932.",
      "doi": ""
    },
    {
      "text": "Predrag Klasnja, Sunny Consolvo, Tanzeem Choudhury, Richard Beckwith, and Jeffrey Hightower. 2009. Exploring privacy concerns about personal sensing. In International Conference on Pervasive Computing. Springer, 176–183.",
      "doi": "10.1007/978-3-642-01516-8_13"
    },
    {
      "text": "Lars Korn, Robert Böhm, Nicolas W Meier, and Cornelia Betsch. 2020. Vaccination as a social contract. Proceedings of the National Academy of Sciences 117, 26(2020), 14890–14899.",
      "doi": ""
    },
    {
      "text": "Feng-Yang Kuo, Cathy S Lin, and Meng-Hsiang Hsu. 2007. Assessing gender differences in computer professionals’ self-regulatory efficacy concerning information privacy practices. Journal of business ethics 73, 2 (2007), 145–160.",
      "doi": ""
    },
    {
      "text": "Betty Ladyzhets. 2021. We investigated whether digital contact tracing actually worked in the US. https://www.technologyreview.com/2021/06/16/1026255/us-digital-contact-tracing-exposure-notification-analysis/",
      "doi": ""
    },
    {
      "text": "Marc Langheinrich and Florian Schaub. 2018. Privacy in mobile and pervasive computing. Synthesis Lectures on Mobile and Pervasive Computing 10, 1 (2018), 1–139.",
      "doi": ""
    },
    {
      "text": "Dyani Lewis. 2020. Why many countries failed at COVID contact-tracing-but some got it right.Nature (2020), 384–387.",
      "doi": ""
    },
    {
      "text": "Tianshi Li, Camille Cobb, Jackie Yang, Sagar Baviskar, Yuvraj Agarwal, Beibei Li, Lujo Bauer, and Jason I Hong. 2021. What makes people install a COVID-19 contact-tracing app? Understanding the influence of app design and individual difference on contact-tracing app adoption intention. Pervasive and Mobile Computing(2021), 101439.",
      "doi": ""
    },
    {
      "text": "Steven Lockey, Martin R Edwards, Matthew J Hornsey, Nicole Gillespie, Saeed Akhlaghpour, and Shannon Colville. 2021. Profiling adopters (and non-adopters) of a contact tracing mobile application: insights from Australia. International Journal of Medical Informatics 149 (2021), 104414.",
      "doi": ""
    },
    {
      "text": "Arunesh Mathur, Jessica Vitak, Arvind Narayanan, and Marshini Chetty. 2018. Characterizing the use of browser-based blocking extensions to prevent online tracking. In Fourteenth Symposium on Usable Privacy and Security ({SOUPS} 2018). 103–116.",
      "doi": ""
    },
    {
      "text": "Paul McDonald, Matt Mohebbi, and Brett Slatkin. 2012. Comparing google consumer surveys to existing probability and non-probability based internet surveys. Google White Paper (2012).",
      "doi": ""
    },
    {
      "text": "Christina Munns and Subhajit Basu. 2017. Privacy and healthcare data:‘Choice of Control’to ‘Choice’and ‘Control’. Routledge.",
      "doi": ""
    },
    {
      "text": "Simon Munzert, Peter Selb, Anita Gohdes, Lukas F Stoetzer, and Will Lowe. 2021. Tracking and promoting the usage of a COVID-19 contact tracing app. Nature Human Behaviour 5, 2 (2021), 247–255.",
      "doi": ""
    },
    {
      "text": "National Academies of Sciences, Engineering, and Medicine and others. 2020. Encouraging Adoption of Protective Behaviors to Mitigate the Spread of COVID-19: Strategies for Behavior Change.",
      "doi": ""
    },
    {
      "text": "Alfred Ng. 2021. Google Promised Its Contact Tracing App Was Completely Private - But It Wasn’t. https://themarkup.org/privacy/2021/04/27/google-promised-its-contact-tracing-app-was-completely-private-but-it-wasnt. (Accessed on 08/19/2021).",
      "doi": ""
    },
    {
      "text": "Andreia Nunes, Teresa Limpo, and São Luís Castro. 2019. Acceptance of mobile health applications: examining key determinants and moderators. Frontiers in psychology 10 (2019), 2791.",
      "doi": ""
    },
    {
      "text": "Jonathan A Obar and Anne Oeldorf-Hirsch. 2020. The biggest lie on the internet: Ignoring the privacy policies and terms of service policies of social networking services. Information, Communication & Society 23, 1 (2020), 128–147.",
      "doi": ""
    },
    {
      "text": "Aarathi Prasad, Jacob Sorber, Timothy Stablein, Denise Anthony, and David Kotz. 2012. Understanding sharing preferences and behavior for mHealth devices. In Proceedings of the 2012 ACM workshop on Privacy in the electronic society. 117–128.",
      "doi": "10.1145/2381966.2381983"
    },
    {
      "text": "Davy Preuveneers and Wouter Joosen. 2016. Privacy-enabled remote health monitoring applications for resource constrained wearable devices. In Proceedings of the 31st Annual ACM Symposium on Applied Computing. 119–124.",
      "doi": "10.1145/2851613.2851683"
    },
    {
      "text": "Nathaniel Rabb, David Glick, Attiyya Houston, Jake Bowers, and David Yokum. 2021. No evidence that collective-good appeals best promote COVID-related health behaviors. Proceedings of the National Academy of Sciences 118, 14(2021).",
      "doi": ""
    },
    {
      "text": "Ramesh Raskar, Greg Nadeau, John Werner, Rachel Barbar, Ashley Mehra, Gabriel Harp, Markus Leopoldseder, Bryan Wilson, Derrick Flakoll, Praneeth Vepakomma, 2020. COVID-19 contact-tracing mobile apps: evaluation and assessment for decision makers. arXiv preprint arXiv:2006.05812(2020).",
      "doi": ""
    },
    {
      "text": "Elissa Redmiles. 2018. Net benefits: Digital inequities in social capital, privacy preservation, and digital parenting practices of US social media users. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 12.",
      "doi": ""
    },
    {
      "text": "Elissa M. Redmiles. 2020. User Concerns & Tradeoffs in Technology-facilitated COVID-19 Response. Digital Government: Research and Practice 2, 1 (Nov. 2020), 6:1–6:12. https://doi.org/10.1145/3428093",
      "doi": "10.1145/3428093"
    },
    {
      "text": "Florian Schaub, Rebecca Balebako, and Lorrie Faith Cranor. 2017. Designing effective privacy notices and controls. IEEE Internet Computing(2017).",
      "doi": ""
    },
    {
      "text": "John S Seberger and Sameer Patil. 2021. Us and Them (and It): Social Orientation, Privacy Concerns, and Expected Use of Pandemic-Tracking Apps in the United States. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3411764.3445485"
    },
    {
      "text": "Katrina J Serrano, Mandi Yu, William T Riley, Vaishali Patel, Penelope Hughes, Kathryn Marchesini, and Audie A Atienza. 2016. Willingness to exchange health information via mobile devices: findings from a population-based survey. The Annals of Family Medicine 14, 1 (2016), 34–40.",
      "doi": ""
    },
    {
      "text": "Alessio Signorini, Alberto Maria Segre, and Philip M Polgreen. 2011. The use of Twitter to track levels of disease activity and public concern in the US during the influenza A H1N1 pandemic. PloS one 6, 5 (2011), e19467.",
      "doi": ""
    },
    {
      "text": "Lucy Simko, Jack Lucas Chang, Maggie Jiang, Ryan Calo, Franziska Roesner, and Tadayoshi Kohno. 2020. COVID-19 Contact Tracing and Privacy: A Longitudinal Study of Public Opinion. arxiv:2012.01553 [cs.CY]",
      "doi": ""
    },
    {
      "text": "Elizabeth Stowell, Mercedes C Lyson, Herman Saksono, Reneé C Wurth, Holly Jimison, Misha Pavel, and Andrea G Parker. 2018. Designing and evaluating mHealth interventions for vulnerable populations: A systematic review. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3173574.3173589"
    },
    {
      "text": "Yongqiang Sun, Nan Wang, Xitong Guo, and Zeyu Peng. 2013. Understanding the acceptance of mobile health services: a comparison and integration of alternative models. Journal of electronic commerce research 14, 2 (2013), 183.",
      "doi": ""
    },
    {
      "text": "Séverine Toussaert. 2021. Upping uptake of COVID contact tracing apps. Nature Human Behaviour 5, 2 (2021), 183–184.",
      "doi": ""
    },
    {
      "text": "Sabine Trepte, Leonard Reinecke, Nicole B Ellison, Oliver Quiring, Mike Z Yao, and Marc Ziegele. 2017. A cross-cultural perspective on the privacy calculus. Social Media+ Society 3, 1 (2017), 2056305116688035.",
      "doi": ""
    },
    {
      "text": "Catherine E Tucker. 2014. Social networks, personalized advertising, and privacy controls. Journal of marketing research 51, 5 (2014), 546–562.",
      "doi": ""
    },
    {
      "text": "Felix Velicia-Martin, Juan-Pedro Cabrera-Sanchez, Eloy Gil-Cordero, and Pedro R. Palos-Sanchez. 2021. Researching COVID-19 tracing app acceptance: incorporating theory from the technological acceptance model. PeerJ Computer Science 7 (Jan. 2021), e316. https://doi.org/10.7717/peerj-cs.316",
      "doi": ""
    },
    {
      "text": "Viswanath Venkatesh, Michael G Morris, Gordon B Davis, and Fred D Davis. 2003. User acceptance of information technology: Toward a unified view. MIS quarterly (2003), 425–478.",
      "doi": "10.5555/2017197.2017202"
    },
    {
      "text": "Michel Walrave, Cato Waeterloos, and Koen Ponnet. 2020. Adoption of a Contact Tracing App for Containing COVID-19: A Health Belief Model Approach. JMIR Public Health and Surveillance 6, 3 (Sept. 2020), e20572. https://doi.org/10.2196/20572",
      "doi": ""
    },
    {
      "text": "Mark Warner, Andreas Gutmann, M Angela Sasse, and Ann Blandford. 2018. Privacy unraveling around explicit HIV status disclosure fields in the online geosocial hookup app Grindr. Proceedings of the ACM on human-computer interaction 2, CSCW(2018), 1–22.",
      "doi": "10.1145/3274450"
    },
    {
      "text": "Alan White. 2020. Men and COVID-19: the aftermath. Postgraduate Medicine 132, sup4 (2020), 18–27.",
      "doi": ""
    },
    {
      "text": "Simon N. Williams, Christopher J. Armitage, Tova Tampe, and Kimberly Dienes. 2021. Public attitudes towards COVID‐19 contact tracing apps: A UK‐based focus group study. Health Expectations 24, 2 (April 2021), 377–385. https://doi.org/10.1111/hex.13179",
      "doi": ""
    },
    {
      "text": "Heng Xu, Hock-Hai Teo, Bernard CY Tan, and Ritu Agarwal. 2012. Research note—effects of individual self-protection, industry self-regulation, and government regulation on privacy concerns: a study of location-based services. Information Systems Research 23, 4 (2012), 1342–1363.",
      "doi": "10.1287/isre.1120.0416"
    },
    {
      "text": "Baobao Zhang, Sarah Kreps, Nina McMurry, and R. Miles McCain. 2020. Americans’ perceptions of privacy and surveillance in the COVID-19 pandemic. PLOS ONE 15, 12 (Dec. 2020), e0242652. https://doi.org/10.1371/journal.pone.0242652",
      "doi": ""
    },
    {
      "text": "Xiaofei Zhang, Xitong Guo, Kee-hung Lai, Feng Guo, and Chenlei Li. 2014. Understanding gender differences in m-health adoption: a modified theory of reasoned action model. Telemedicine and e-Health 20, 1 (2014), 39–46.",
      "doi": ""
    },
    {
      "text": "Bettina Maria Zimmermann, Amelia Fiske, Barbara Prainsack, Nora Hangel, Stuart McLennan, and Alena Buyx. 2021. Early perceptions of COVID-19 contact tracing apps in German-speaking countries: comparative mixed methods study. Journal of medical Internet research 23, 2 (2021), e25525.",
      "doi": ""
    }
  ]
}