{
  "doi": "10.1145/3491102.3517649",
  "title": "Supporting Serendipitous Discovery and Balanced Analysis of Online Product Reviews with Interaction-Driven Metrics and Bias-Mitigating Suggestions",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-24",
  "year": 2022,
  "badges": [],
  "abstract": "In this study, we investigate how supporting serendipitous discovery and analysis of online product reviews can encourage readers to explore reviews more comprehensively prior to making purchase decisions. We propose two interventions — Exploration Metrics that can help readers understand and track their exploration patterns through visual indicators and a Bias Mitigation Model that intends to maximize knowledge discovery by suggesting sentiment and semantically diverse reviews. We designed, developed, and evaluated a text analytics system called Serendyze, where we integrated these interventions. We asked 100 crowd workers to use Serendyze to make purchase decisions based on product reviews. Our evaluation suggests that exploration metrics enabled readers to efficiently cover more reviews in a balanced way, and suggestions from the bias mitigation model influenced readers to make confident data-driven decisions. We discuss the role of user agency and trust in text-level analysis systems and their applicability in domains beyond review exploration.",
  "tags": [
    "product review exploration",
    "serendipity",
    "bias mitigation model"
  ],
  "authors": [
    {
      "name": "Mahmood Jasim",
      "institution": "University of Massachusetts Amherst, United States and University of Massachusetts Amherst, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526886",
      "orcid": "missing"
    },
    {
      "name": "Christopher Collins",
      "institution": "Ontario Tech University, Canada and Ontario Tech University, Canada",
      "img": "/do/10.1145/contrib-81436596812/rel-imgonly/collins-headshot.jpg",
      "acmid": "81436596812",
      "orcid": "0000-0002-4520-7000"
    },
    {
      "name": "Ali Sarvghad",
      "institution": "University of Massachusetts Amherst, United States and University of Massachusetts Amherst, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557894156",
      "orcid": "missing"
    },
    {
      "name": "Narges Mahyar",
      "institution": "University of Massachusetts Amherst, United States and University of Massachusetts Amherst, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490689705",
      "orcid": "0000-0003-1781-0029"
    }
  ],
  "references": [
    {
      "text": "2021. Python Anywhere. Retrieved August 20, 2021 from https://www.pythonanywhere.com/",
      "doi": ""
    },
    {
      "text": "Eric Alexander, Joe Kohlmann, Robin Valenza, Michael Witmore, and Michael Gleicher. 2014. Serendip: Topic model-driven visual exploration of text corpora. In Proc. IEEE Conf. on Visual Analytics Science and Technology (VAST). IEEE, 173–182.",
      "doi": ""
    },
    {
      "text": "Mohammad Alharbi and Robert S Laramee. 2019. Sos textvis: An extended survey of surveys on text visualization. Computers 8, 1 (2019), 17.",
      "doi": ""
    },
    {
      "text": "Mehdi Allahyari, Seyedamin Pouriyeh, Mehdi Assefi, Saeid Safaei, Elizabeth D Trippe, Juan B Gutierrez, and Krys Kochut. 2017. Text summarization techniques: a brief survey. arXiv preprint arXiv:1707.02268(2017).",
      "doi": ""
    },
    {
      "text": "Amazon. 2021. Community Guidelines. Retrieved September 1, 2021 from https://www.amazon.com/gp/help/customer/display.html?nodeId=GLHXEX85MENUE4XF",
      "doi": ""
    },
    {
      "text": "Pek van Andel. 1994. Anatomy of the unsought finding. serendipity: Orgin, history, domains, traditions, appearances, patterns and programmability. The British Journal for the Philosophy of Science 45, 2 (1994), 631–648.",
      "doi": ""
    },
    {
      "text": "Ricardo Baeza-Yates and Gonzalo Navarro. 1996. A faster algorithm for approximate string matching. In Annual Symposium on Combinatorial Pattern Matching. Springer, 1–23.",
      "doi": ""
    },
    {
      "text": "Rahul Bhargava, Anna Chung, Neil S Gaikwad, Alexis Hope, Dennis Jen, Jasmin Rubinovitz, Belén Saldías-Fuentes, and Ethan Zuckerman. 2019. Gobo: A system for exploring user control of invisible algorithms in social media. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing. 151–155.",
      "doi": "10.1145/3311957.3359452"
    },
    {
      "text": "Halil Bisgin, Nitin Agarwal, and Xiaowei Xu. 2012. A study of homophily on social media. World Wide Web 15, 2 (2012), 213–232.",
      "doi": "10.1007/s11280-011-0143-3"
    },
    {
      "text": "Engin Bozdag. 2013. Bias in algorithmic filtering and personalization. Ethics and information technology 15, 3 (2013), 209–227.",
      "doi": ""
    },
    {
      "text": "Philip Burnard. 1991. A method of analysing interview transcripts in qualitative research. Nurse Education Today 11, 6 (1991), 461–466.",
      "doi": ""
    },
    {
      "text": "Giuseppe Carenini and Lucas Rizoli. 2009. A multimedia interface for facilitating comparisons of opinions. In Proceedings of the 14th international conference on Intelligent user interfaces. 325–334.",
      "doi": "10.1145/1502650.1502696"
    },
    {
      "text": "Davide Ceneda, Alessio Arleo, Theresia Gschwandtner, and Silvia Miksch. 2021. Show Me Your Face: Towards an Automated Method to Provide Timely Guidance in Visual Analytics. IEEE Trans. on Visualization and Computer Graphics (2021).",
      "doi": ""
    },
    {
      "text": "Jonathan Chang, Jordan Boyd-Graber, Chong Wang, Sean Gerrish, and David M Blei. 2009. Reading tea leaves: How humans interpret topic models. In Neural Information Processing Systems, Vol. 22. Citeseer, 288–296.",
      "doi": ""
    },
    {
      "text": "Iti Chaturvedi, Edoardo Ragusa, Paolo Gastaldo, Rodolfo Zunino, and Erik Cambria. 2018. Bayesian network based extreme learning machine for subjectivity detection. Journal of The Franklin Institute 355, 4 (2018), 1780–1797.",
      "doi": ""
    },
    {
      "text": "Chaomei Chen, Fidelia Ibekwe-SanJuan, Eric SanJuan, and Chris Weaver. 2006. Visual analysis of conflicting opinions. In 2006 IEEE Symposium On Visual Analytics Science And Technology. IEEE, 59–66.",
      "doi": ""
    },
    {
      "text": "Xu Chen, Jie Sheng, Xiaojun Wang, and Jiangshan Deng. 2016. Exploring determinants of attraction and helpfulness of online product review: A consumer behaviour perspective. Discrete Dynamics in Nature and Society 2016 (2016).",
      "doi": ""
    },
    {
      "text": "Jason Chuang, Daniel Ramage, Christopher Manning, and Jeffrey Heer. 2012. Interpretation and trust: Designing model-driven visualizations for text analysis. In Proc. SIGCHI Conf. on Human Factors in Computing Systems. 443–452.",
      "doi": "10.1145/2207676.2207738"
    },
    {
      "text": "Matteo Cinelli, Gianmarco De Francisci Morales, Alessandro Galeazzi, Walter Quattrociocchi, and Michele Starnini. 2021. The echo chamber effect on social media. Proceedings of the National Academy of Sciences 118, 9 (2021).",
      "doi": ""
    },
    {
      "text": "Christopher Collins, Natalia Andrienko, Tobias Schreck, Jing Yang, Jaegul Choo, Ulrich Engelke, Amit Jena, and Tim Dwyer. 2018. Guidance in the human–machine analytics process. Visual Informatics 2, 3 (2018), 166–180.",
      "doi": ""
    },
    {
      "text": "Courtney D Corley and Rada Mihalcea. 2005. Measuring the semantic similarity of texts. In Proc. ACL Workshop on Empirical Modeling of Semantic Equivalence and Entailment. 13–18.",
      "doi": ""
    },
    {
      "text": "David Coyle, James Moore, Per Ola Kristensson, Paul Fletcher, and Alan Blackwell. 2012. I did that! Measuring users’ experience of agency in their own actions. In Proc. SIGCHI Conf. on Human Factors in Computing Systems. 2025–2034.",
      "doi": "10.1145/2207676.2208350"
    },
    {
      "text": "Matthew JC Crump, John V McDonnell, and Todd M Gureckis. 2013. Evaluating Amazon’s Mechanical Turk as a tool for experimental behavioral research. PloS One 8, 3 (2013), e57410.",
      "doi": ""
    },
    {
      "text": "Kushal Dave, Steve Lawrence, and David M Pennock. 2003. Mining the peanut gallery: Opinion extraction and semantic classification of product reviews. In Proceedings of the 12th international conference on World Wide Web. 519–528.",
      "doi": "10.1145/775152.775226"
    },
    {
      "text": "Jenny L Davis. 2017. Curation: A theoretical treatment. Information, Communication & Society 20, 5 (2017), 770–783.",
      "doi": ""
    },
    {
      "text": "Urška Demšar and Arzu Çöltekin. 2017. Quantifying gaze and mouse interactions on spatial visual interfaces with a new movement analytics methodology. PloS One 12, 8 (2017), e0181818.",
      "doi": ""
    },
    {
      "text": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2018. Bert: Pre-training of deep bidirectional transformers for language understanding. arXiv preprint arXiv:1810.04805(2018).",
      "doi": ""
    },
    {
      "text": "Ying Ding, Changlong Yu, and Jing Jiang. 2017. A neural network model for semi-supervised review aspect identification. In Pacific-Asia Conf. on Knowledge Discovery and Data Mining. Springer, 668–680.",
      "doi": ""
    },
    {
      "text": "Marian Dörk, Patrick Feng, Christopher Collins, and Sheelagh Carpendale. 2013. Critical InfoVis: exploring the politics of visualization. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. 2189–2198.",
      "doi": ""
    },
    {
      "text": "Marian Dörk, Nathalie Henry Riche, Gonzalo Ramos, and Susan Dumais. 2012. Pivotpaths: Strolling through faceted information spaces. IEEE Trans. on Visualization and Computer Graphics 18, 12 (2012), 2709–2718.",
      "doi": "10.1109/TVCG.2012.252"
    },
    {
      "text": "Michael D Ekstrand, F Maxwell Harper, Martijn C Willemsen, and Joseph A Konstan. 2014. User perception of differences in recommender algorithms. In Proc. ACM Conf. on Recommender Systems. 161–168.",
      "doi": "10.1145/2645710.2645737"
    },
    {
      "text": "Geoffrey Ellis. 2018. Cognitive Biases in Visualizations. Springer.",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Kristen Vaccaro, Karrie Karahalios, and Kevin Hamilton. 2017. “Be careful; things can be worse than they appear”: Understanding Biased Algorithms and Users’ Behavior around Them in Rating Platforms. In Proceedings of the international AAAI conference on web and social media, Vol. 11. 62–71.",
      "doi": ""
    },
    {
      "text": "Seth Flaxman, Sharad Goel, and Justin M Rao. 2016. Filter bubbles, echo chambers, and online news consumption. Public opinion quarterly 80, S1 (2016), 298–320.",
      "doi": ""
    },
    {
      "text": "Kristopher Floyd, Ryan Freling, Saad Alhoqail, Hyun Young Cho, and Traci Freling. 2014. How online product reviews affect retail sales: A meta-analysis. Journal of Retailing 90, 2 (2014), 217–232.",
      "doi": ""
    },
    {
      "text": "Gayatree Ganu, Noemie Elhadad, and Amélie Marian. 2009. Beyond the stars: improving rating predictions using review text content.. In WebDB, Vol. 9. Citeseer, 1–6.",
      "doi": ""
    },
    {
      "text": "Wael H Gomaa, Aly A Fahmy, 2013. A survey of text similarity approaches. Int. J. Computer Applications 68, 13 (2013), 13–18.",
      "doi": ""
    },
    {
      "text": "Michelle Gregory, Nancy Chinchor, Paul Whitney, Richard Carter, Elizabeth Hetzler, and Alan Turner. 2006. User-directed sentiment analysis: Visualizing the affective content of documents. In Proceedings of the Workshop on Sentiment and Subjectivity in Text. 23–30.",
      "doi": ""
    },
    {
      "text": "Sunwoo Ha, Adam Kern, Melanie Bancilhon, and Alvitta Ottley. 2020. Expectation Versus Reality: The Failed Evaluation of a Mixed-Initiative Visualization System. In Proc. IEEE Workshop Celebrating the Scientific Value of Failure (FailFest). IEEE, 1–5.",
      "doi": ""
    },
    {
      "text": "Gerald Häubl and Valerie Trifts. 2000. Consumer decision making in online shopping environments: The effects of interactive decision aids. Marketing science 19, 1 (2000), 4–21.",
      "doi": ""
    },
    {
      "text": "Ruining He and Julian McAuley. 2016. Ups and downs: Modeling the visual evolution of fashion trends with one-class collaborative filtering. In Proc. Int. Conf. on World Wide Web. 507–517.",
      "doi": "10.1145/2872427.2883037"
    },
    {
      "text": "Jonathan L Herlocker, Joseph A Konstan, Loren G Terveen, and John T Riedl. 2004. Evaluating collaborative filtering recommender systems. ACM Trans. on Information Systems (TOIS) 22, 1 (2004), 5–53.",
      "doi": "10.1145/963770.963772"
    },
    {
      "text": "Richards J Heuer. 1999. Psychology of intelligence analysis. Center for the Study of Intelligence.",
      "doi": ""
    },
    {
      "text": "Eric Horvitz. 1999. Principles of mixed-initiative user interfaces. In Proc. SIGCHI Conf. on Human Factors in Computing Systems. 159–166.",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "Mengdie Hu, Krist Wongsuphasawat, and John Stasko. 2016. Visualizing social media content with sententree. IEEE Trans. on Visualization and Computer Graphics 23, 1 (2016), 621–630.",
      "doi": "10.1109/TVCG.2016.2598590"
    },
    {
      "text": "Mengdie Hu, Huahai Yang, Michelle X Zhou, Liang Gou, Yunyao Li, and Eben Haber. 2013. OpinionBlocks: a crowd-powered, self-improving interactive visual analytic system for understanding opinion text. In IFIP Conf. on Human-Computer Interaction. Springer, 116–134.",
      "doi": ""
    },
    {
      "text": "Nan Hu, Noi Sian Koh, and Srinivas K Reddy. 2014. Ratings lead you to the product, reviews help you clinch it? The mediating role of online review sentiments on product sales. Decision Support Systems 57 (2014), 42–53.",
      "doi": "10.1016/j.dss.2013.07.009"
    },
    {
      "text": "Nan Hu, Paul A Pavlou, and Jennifer Zhang. 2006. Can online reviews reveal a product’s true quality? Empirical findings and analytical modeling of online word-of-mouth communication. In Proceedings of the 7th ACM conference on Electronic commerce. 324–330.",
      "doi": ""
    },
    {
      "text": "Nan Hu, Jie Zhang, and Paul A Pavlou. 2009. Overcoming the J-shaped distribution of product reviews. Commun. ACM 52, 10 (2009), 144–147.",
      "doi": "10.1145/1562764.1562800"
    },
    {
      "text": "Jessica Hullman and Nick Diakopoulos. 2011. Visualization rhetoric: Framing effects in narrative visualization. IEEE Trans. on Visualization and Computer Graphics 17, 12 (2011), 2231–2240.",
      "doi": "10.1109/TVCG.2011.255"
    },
    {
      "text": "Ellen Isaacs, Kelly Damico, Shane Ahern, Eugene Bart, and Mudita Singhal. 2014. Footprints: A visual search tool that supports discovery and coverage tracking. IEEE Trans. on Visualization and Computer Graphics 20, 12 (2014), 1793–1802.",
      "doi": ""
    },
    {
      "text": "Mahmood Jasim, Enamul Hoque, Ali Sarvghad, and Narges Mahyar. 2021. CommunityPulse: Facilitating Community Input Analysis by Surfacing Hidden Insights, Reflections, and Priorities. In Proc. ACM Conf. on Designing Interactive Systems. 846–863.",
      "doi": "10.1145/3461778.3462132"
    },
    {
      "text": "Mahmood Jasim, Pooya Khaloo, Somin Wadhwa, Amy X Zhang, Ali Sarvghad, and Narges Mahyar. 2021. CommunityClick: Capturing and reporting community feedback from town halls to improve inclusivity. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–32.",
      "doi": "10.1145/3432912"
    },
    {
      "text": "Hamed Jelodar, Yongli Wang, Chi Yuan, Xia Feng, Xiahui Jiang, Yanchao Li, and Liang Zhao. 2019. Latent Dirichlet allocation (LDA) and topic modeling: models, applications, a survey. Multimedia Tools and Applications 78, 11 (2019), 15169–15211.",
      "doi": "10.1007/s11042-018-6894-4"
    },
    {
      "text": "Quentin Jones, Gilad Ravid, and Sheizaf Rafaeli. 2004. Information overload and the message dynamics of online interaction spaces: A theoretical model and empirical exploration. Information Systems Research 15, 2 (2004), 194–210.",
      "doi": "10.1287/isre.1040.0023"
    },
    {
      "text": "Iman Kamehkhosh and Dietmar Jannach. 2017. User perception of next-track music recommendations. In Proc. Conf. on User Modeling, Adaptation and Personalization. 113–121.",
      "doi": "10.1145/3079628.3079668"
    },
    {
      "text": "Marius Kaminskas and Derek Bridge. 2016. Diversity, serendipity, novelty, and coverage: a survey and empirical analysis of beyond-accuracy objectives in recommender systems. ACM Trans. on Interactive Intelligent Systems (TiiS) 7, 1 (2016), 1–42.",
      "doi": "10.1145/2926720"
    },
    {
      "text": "Gaurav Kapoor and Selwyn Piramuthu. 2009. Sequential bias in online product reviews. Journal of Organizational Computing and Electronic Commerce 19, 2(2009), 85–95.",
      "doi": ""
    },
    {
      "text": "Khairullah Khan, Baharum Baharudin, Aurnagzeb Khan, and Ashraf Ullah. 2014. Mining opinion components from unstructured reviews: A review. Journal of King Saud University-Computer and Information Sciences 26, 3(2014), 258–275.",
      "doi": "10.1016/j.jksuci.2014.03.009"
    },
    {
      "text": "Denis Kotkov, Shuaiqiang Wang, and Jari Veijalainen. 2016. A survey of serendipity in recommender systems. Knowledge-Based Systems 111 (2016), 180–192.",
      "doi": "10.1016/j.knosys.2016.08.014"
    },
    {
      "text": "Klaus Krippendorff. 2011. Computing Krippendorff’s alpha-reliability. (2011).",
      "doi": ""
    },
    {
      "text": "Kostiantyn Kucher and Andreas Kerren. 2015. Text visualization techniques: Taxonomy, visual survey, and community insights. In Proc. IEEE Pacific Visualization Symposium. IEEE, 117–121.",
      "doi": ""
    },
    {
      "text": "Dilek Küçük and Fazli Can. 2020. Stance detection: A survey. ACM Computing Surveys (CSUR) 53, 1 (2020), 1–37.",
      "doi": "10.1145/3369026"
    },
    {
      "text": "Matevž Kunaver and Tomaž Požrl. 2017. Diversity in recommender systems–A survey. Knowledge-based Systems 123 (2017), 154–162.",
      "doi": "10.1016/j.knosys.2017.02.009"
    },
    {
      "text": "Bum Chul Kwon, Sung-Hee Kim, Timothy Duket, Adrián Catalán, and Ji Soo Yi. 2015. Do people really experience information overload while reading online reviews?Int. J. Human-Computer Interaction 31, 12 (2015), 959–973.",
      "doi": ""
    },
    {
      "text": "Anja Lambrecht and Catherine Tucker. 2019. Algorithmic bias? an empirical study of apparent gender-based discrimination in the display of stem career ads. Management Science 65, 7 (2019), 2966–2981.",
      "doi": "10.1287/mnsc.2018.3093"
    },
    {
      "text": "Jey Han Lau and Timothy Baldwin. 2016. An empirical evaluation of doc2vec with practical insights into document embedding generation. arXiv preprint arXiv:1607.05368(2016).",
      "doi": ""
    },
    {
      "text": "Quoc Le and Tomas Mikolov. 2014. Distributed representations of sentences and documents. In Int. Conf. on Machine Learning. PMLR, 1188–1196.",
      "doi": ""
    },
    {
      "text": "Greg Linden, Brent Smith, and Jeremy York. 2003. Amazon. com recommendations: Item-to-item collaborative filtering. IEEE Internet Computing 7, 1 (2003), 76–80.",
      "doi": "10.1109/MIC.2003.1167344"
    },
    {
      "text": "Bing Liu, Minqing Hu, and Junsheng Cheng. 2005. Opinion observer: analyzing and comparing opinions on the web. In Proceedings of the 14th international conference on World Wide Web. 342–351.",
      "doi": "10.1145/1060745.1060797"
    },
    {
      "text": "Jie Lu, Dianshuang Wu, Mingsong Mao, Wei Wang, and Guangquan Zhang. 2015. Recommender system application developments: a survey. Decision Support Systems 74 (2015), 12–32.",
      "doi": "10.1016/j.dss.2015.03.008"
    },
    {
      "text": "Narges Mahyar, Mahmood Jasim, and Ali Sarvghad. 2020. Designing Technology for Sociotechnical Problems: Challenges and Considerations. IEEE Computer Graphics and Applications 40, 6 (2020), 76–87.",
      "doi": ""
    },
    {
      "text": "Narges Mahyar, Diana V Nguyen, Maggie Chan, Jiayi Zheng, and Steven P Dow. 2019. The Civic Data Deluge: Understanding the Challenges of Analyzing Large-Scale Community Input. In Proc. ACM Conf. on Designing Interactive Systems. 1171–1181.",
      "doi": "10.1145/3322276.3322354"
    },
    {
      "text": "Stephen Makonin, Daniel McVeigh, Wolfgang Stuerzlinger, Khoa Tran, and Fred Popowich. 2016. Mixed-initiative for big data: The intersection of human+ visual analytics+ prediction. In Proc. Hawaii Int. Conf. on System Sciences (HICSS). IEEE, 1427–1436.",
      "doi": "10.1109/HICSS.2016.181"
    },
    {
      "text": "Gary Marchionini. 2006. Exploratory search: from finding to understanding. Commun. ACM 49, 4 (2006), 41–46.",
      "doi": "10.1145/1121949.1121979"
    },
    {
      "text": "Adam Marcus, Michael S Bernstein, Osama Badar, David R Karger, Samuel Madden, and Robert C Miller. 2011. Twitinfo: aggregating and visualizing microblogs for event exploration. In Proc. SIGCHI Conf. on Human Factors in Computing Systems. 227–236.",
      "doi": "10.1145/1978942.1978975"
    },
    {
      "text": "Solomon Messing and Sean J Westwood. 2014. Selective exposure in the age of social media: Endorsements trump partisan source affiliation when selecting news online. Communication research 41, 8 (2014), 1042–1063.",
      "doi": ""
    },
    {
      "text": "Tomas Mikolov, Kai Chen, Greg Corrado, and Jeffrey Dean. 2013. Efficient estimation of word representations in vector space. arXiv preprint arXiv:1301.3781(2013).",
      "doi": ""
    },
    {
      "text": "Chris North, Remco Chang, Alex Endert, Wenwen Dou, Richard May, Bill Pike, and Glenn Fink. 2011. Analytic provenance: process+ interaction+ insight. In CHI’11 Extended Abstracts on Human Factors in Computing Systems. 33–36.",
      "doi": ""
    },
    {
      "text": "Kensuke Onuma, Hanghang Tong, and Christos Faloutsos. 2009. Tangent: a novel,’surprise me’, recommendation algorithm. In Proc. ACM SIGKDD Int. Conf. on Knowledge Discovery and Data Mining. 657–666.",
      "doi": "10.1145/1557019.1557093"
    },
    {
      "text": "Orestis Papakyriakopoulos, Juan Carlos Medina Serrano, and Simon Hegelich. 2020. Political communication on social media: A tale of hyperactive users and bias in recommender systems. Online Social Networks and Media 15 (2020), 100058.",
      "doi": ""
    },
    {
      "text": "Eli Pariser. 2011. The filter bubble: What the Internet is hiding from you. Penguin UK.",
      "doi": "10.5555/2029079"
    },
    {
      "text": "Do-Hyung Park, Jumin Lee, and Ingoo Han. 2006. Information overload and its consequences in the context of online consumer reviews. Proc. PACIS (2006), 28.",
      "doi": ""
    },
    {
      "text": "Mateus M Pereira and Fernando V Paulovich. 2020. RankViz: A visualization framework to assist interpretation of Learning to Rank algorithms. Computers & Graphics 93(2020), 25–38.",
      "doi": ""
    },
    {
      "text": "Matthew E. Peters, Mark Neumann, Mohit Iyyer, Matt Gardner, Christopher Clark, Kenton Lee, and Luke Zettlemoyer. 2018. Deep contextualized word representations. arxiv:1802.05365 [cs.CL]",
      "doi": ""
    },
    {
      "text": "Qualtrics. 2020. Online reviews statistics to know in 2021. Retrieved July 7, 2021 from https://www.qualtrics.com/blog/online-review-stats/",
      "doi": ""
    },
    {
      "text": "Toqir A Rana, Yu-N Cheah, and Tauseef Rana. 2020. Multi-level knowledge-based approach for implicit aspect identification. Applied Intelligence 50, 12 (2020), 4616–4630.",
      "doi": "10.1007/s10489-020-01817-x"
    },
    {
      "text": "Keith Rayner, Timothy J Slattery, and Nathalie N Bélanger. 2010. Eye movements, the perceptual span, and reading speed. Psychonomic Bulletin & Review 17, 6 (2010), 834–839.",
      "doi": ""
    },
    {
      "text": "Radim Řehůřek and Petr Sojka. 2010. Software Framework for Topic Modelling with Large Corpora. In Proc. LREC Workshop on New Challenges for NLP Frameworks. ELRA, Valletta, Malta, 45–50.",
      "doi": ""
    },
    {
      "text": "Francesco Ricci, Lior Rokach, and Bracha Shapira. 2011. Introduction to recommender systems handbook. In Recommender Systems Handbook. Springer, 1–35.",
      "doi": ""
    },
    {
      "text": "Kerry Rodden and Xin Fu. 2007. Exploring how mouse movements relate to eye movements on web search results pages. (2007).",
      "doi": ""
    },
    {
      "text": "Avi Rosenfeld and Ariella Richardson. 2019. Explainability in human–agent systems. Autonomous Agents and Multi-Agent Systems 33, 6 (2019), 673–705.",
      "doi": "10.1007/s10458-019-09408-y"
    },
    {
      "text": "Ali Sarvghad, Melanie Tory, and Narges Mahyar. 2016. Visualizing dimension coverage to support exploratory analysis. IEEE Trans. on Visualization and Computer Graphics 23, 1 (2016), 21–30.",
      "doi": "10.1109/TVCG.2016.2598466"
    },
    {
      "text": "Sheikh Muhammad Sarwar, Felipe Moraes, Jiepu Jiang, and James Allan. 2021. Utility of Missing Concepts in Query-biased Summarization. In Proc. 44th International ACM SIGIR Conf. on Research and Development in Information Retrieval. 2056–2060.",
      "doi": "10.1145/3404835.3463121"
    },
    {
      "text": "Jacquelyn L Schreck and Matthew G Chin. 2019. Online Product Reviews: Effects of Star Ratings and Valence on Review Perception among Those High and Low in Need for Cognition. In Proc. Human Factors and Ergonomics Society Annual Meeting, Vol. 63. SAGE Publications Sage CA: Los Angeles, CA, 401–405.",
      "doi": ""
    },
    {
      "text": "Urban Sedlar, Janez Bešter, and Andrej Kos. 2007. Tracking mouse movements for monitoring users’ interaction with websites: Implementation and applications. Elektrotehniški vestnik 1, 74 (2007), 31–36.",
      "doi": ""
    },
    {
      "text": "Bracha Shapira, Lior Rokach, and Shirley Freilikhman. 2013. Facebook single and cross domain data for recommendation systems. User Modeling and User-Adapted Interaction 23, 2-3 (2013), 211–247.",
      "doi": ""
    },
    {
      "text": "Yue Shi, Xiaoxue Zhao, Jun Wang, Martha Larson, and Alan Hanjalic. 2012. Adaptive diversification of recommendation results via latent factor portfolio. In Proc. ACM SIGIR Conf. on Research and Development in Information Retrieval. 175–184.",
      "doi": "10.1145/2348283.2348310"
    },
    {
      "text": "Ben Shneiderman. 1996. The eyes have it: A task by data type taxonomy for information visualizations. In Proc. IEEE Symp. on Visual Languages. 336–343.",
      "doi": ""
    },
    {
      "text": "Statista. 2021. Unit shipments of headphones worldwide from 2013 to 2020. Retrieved December, 2021 from https://www.statista.com/statistics/236075/revenue-of-headphone-shipments-in-the-united-states/",
      "doi": ""
    },
    {
      "text": "Alice Thudt, Uta Hinrichs, and Sheelagh Carpendale. 2012. The bohemian bookshelf: supporting serendipitous book discoveries through information visualization. In Proc. SIGCHI Conf. on Human Factors in Computing Systems. 1461–1470.",
      "doi": "10.1145/2207676.2208607"
    },
    {
      "text": "Alex SL Tsang and Gerard Prendergast. 2009. Is a “star” worth a thousand words? The interplay between product-review texts and rating valences. European Journal of Marketing(2009).",
      "doi": ""
    },
    {
      "text": "Bettina von Helversen, Katarzyna Abramczuk, Wiesław Kopeć, and Radoslaw Nielek. 2018. Influence of consumer reviews on online purchasing decisions in older and younger adults. Decision Support Systems 113 (2018), 1–10.",
      "doi": ""
    },
    {
      "text": "Emily Wall, Arup Arcalgud, Kuhu Gupta, and Andrew Jo. 2019. A markov model of users’ interactive behavior in scatterplots. In Proc. IEEE Visualization Conference (Short Papers). IEEE, 81–85.",
      "doi": ""
    },
    {
      "text": "Emily Wall, Leslie M Blaha, Lyndsey Franklin, and Alex Endert. 2017. Warning, bias may occur: A proposed approach to detecting cognitive bias in interactive visual analytics. In Proc. IEEE Conf. on Visual Analytics Science and Technology (VAST). IEEE, 104–115.",
      "doi": ""
    },
    {
      "text": "Emily Wall, Leslie M Blaha, Celeste Lyn Paul, Kristin Cook, and Alex Endert. 2018. Four perspectives on human bias in visual analytics. In Cognitive Biases in Visualizations. Springer, 29–42.",
      "doi": ""
    },
    {
      "text": "Ruolin Wang, Zixuan Chen, Mingrui Ray Zhang, Zhaoheng Li, Zhixiu Liu, Zihan Dang, Chun Yu, and Xiang’Anthony’ Chen. 2021. Revamp: Enhancing Accessible Information Seeking Experience of Online Shopping for Blind or Low Vision Users. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445547"
    },
    {
      "text": "Wesley Willett, Jeffrey Heer, and Maneesh Agrawala. 2007. Scented widgets: Improving navigation cues with embedded visualizations. IEEE Trans. on Visualization and Computer Graphics 13, 6 (2007), 1129–1136.",
      "doi": "10.1109/TVCG.2007.70589"
    },
    {
      "text": "Max Woolf. 2014. A statistical analysis of 1.2 million amazon reviews. Max Woolf’s Blog (2014).",
      "doi": ""
    },
    {
      "text": "Yingcai Wu, Nan Cao, David Gotz, Yap-Peng Tan, and Daniel A Keim. 2016. A survey on visual analytics of social media data. IEEE Transactions on Multimedia 18, 11 (2016), 2135–2148.",
      "doi": "10.1109/TMM.2016.2614220"
    },
    {
      "text": "Yingcai Wu, Furu Wei, Shixia Liu, Norman Au, Weiwei Cui, Hong Zhou, and Huamin Qu. 2010. OpinionSeer: interactive visualization of hotel customer feedback. IEEE Trans. on visualization and computer graphics 16, 6 (2010), 1109–1118.",
      "doi": ""
    },
    {
      "text": "Ashima Yadav and Dinesh Kumar Vishwakarma. 2020. Sentiment analysis using deep learning architectures: a review. Artificial Intelligence Review 53, 6 (2020), 4335–4385.",
      "doi": "10.1007/s10462-019-09794-5"
    },
    {
      "text": "Koji Yatani, Michael Novati, Andrew Trusty, and Khai N Truong. 2011. Review spotlight: a user interface for summarizing user-generated reviews using adjective-noun word pairs. In Proc. SIGCHI Conf. on Human Factors in Computing Systems. 1541–1550.",
      "doi": "10.1145/1978942.1979167"
    },
    {
      "text": "Guo Yu and Alan Blackwell. 2017. Effects of timing on users’ agency during mixed-initiative interaction. BCS.",
      "doi": ""
    },
    {
      "text": "Yi Zhang, Jamie Callan, and Thomas Minka. 2002. Novelty and redundancy detection in adaptive filtering. In Proc. ACM SIGIR Conf. on Research and Development in Information Retrieval. 81–88.",
      "doi": "10.1145/564376.564393"
    }
  ]
}