{
  "doi": "10.1145/3491102.3502112",
  "title": "Still Creepy After All These Years:The Normalization of Affective Discomfort in App Use",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2022,
  "badges": [
    "Best Paper"
  ],
  "abstract": "It is not well understood why people continue to use privacy-invasive apps they consider creepy. We conducted a scenario-based study (n = 751) to investigate how the intention to use an app is influenced by affective perceptions and privacy concerns. We show that creepiness is one facet of affective discomfort, which is becoming normalized in app use. We found that affective discomfort can be negatively associated with the intention to use a privacy-invasive app. However, the influence is mitigated by other factors, including data literacy, views regarding app data practices, and ambiguity of the privacy threat. Our findings motivate a focus on affective discomfort when designing user experiences related to privacy-invasive data practices. Treating affective discomfort as a fundamental aspect of user experience requires scaling beyond the point where the thumb meets the screen and accounting for entrenched data practices and the sociotechnical landscape within which the practices are embedded.",
  "tags": [
    "mobile apps",
    "creepiness",
    "affective discomfort",
    "data practices",
    "privacy paradox",
    "privacy",
    "creepy",
    "affect"
  ],
  "authors": [
    {
      "name": "John S. Seberger",
      "institution": "College of Communication Arts and Sciences, Michigan State University, United States",
      "img": "/do/10.1145/contrib-99659701762/rel-imgonly/jss.png",
      "acmid": "99659701762",
      "orcid": "missing"
    },
    {
      "name": "Irina Shklovski",
      "institution": "Department of Computer Science & Department of Communication, University of Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-81100288406/rel-imgonly/portraits_2019-2020_colour1.jpeg",
      "acmid": "81100288406",
      "orcid": "0000-0003-1874-0958"
    },
    {
      "name": "Emily Swiatek",
      "institution": "Department of Informatics, Indiana University Bloomington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233740",
      "orcid": "missing"
    },
    {
      "name": "Sameer Patil",
      "institution": "School of Computing, University of Utah, United States",
      "img": "/do/10.1145/contrib-81100485151/rel-imgonly/81100485151.jpg",
      "acmid": "81100485151",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisti, Laura Brandimarte, and George Loewenstein. 2015. Privacy and human behavior in the age of information. Science 347, 6221 (2015), 509–514. https://doi.org/10.1126/science.aaa1465",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti, Laura Brandimarte, and George Loewenstein. 2020. Secrets and Likes: The Drive for Privacy and the Difficulty of Achieving It in the Digital Age. Journal of Consumer Psychology 30, 4 (2020), 736–758. https://doi.org/10.1002/jcpy.1191",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti and Jens Grossklags. 2005. Privacy and rationality in individual decision making. IEEE Security & Privacy 3, 1 (2005), 26–33. https://doi.org/10.1109/MSP.2005.22",
      "doi": "10.1109/MSP.2005.22"
    },
    {
      "text": "Alessandro Acquisti, Curtis Taylor, and Liad Wagman. 2016. The Economics of Privacy. Journal of Economic Literature 54, 2 (June 2016), 442–92. https://doi.org/10.1257/jel.54.2.442",
      "doi": ""
    },
    {
      "text": "Nitin Agrawal, Reuben Binns, Max Van Kleek, Kim Laine, and Nigel Shadbolt. 2021. Exploring Design and Governance Challenges in the Development of Privacy-Preserving Computation. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 68, 13 pages. https://doi.org/10.1145/3411764.3445677",
      "doi": "10.1145/3411764.3445677"
    },
    {
      "text": "Hunt Allcott and Matthew Gentzkow. 2017. Social Media and Fake News in the 2016 Election. Journal of Economic Perspectives 31, 2 (May 2017), 211–236. https://doi.org/10.1257/jep.31.2.211",
      "doi": ""
    },
    {
      "text": "Irwin Altman. 1975. The Environment and Social Behavior: Privacy, Personal Space, Territory, and Crowding. Brooks/Cole Publishing Company, Monterey, CA, USA.",
      "doi": ""
    },
    {
      "text": "Sarah Anrijs, Koen Ponnet, and Lieven De Marez. 2020. Development and Psychometric Properties of the Digital Difficulties Scale (DDS): An Instrument to Measure who is Disadvantaged to Fulfill Basic Needs by Experiencing Difficulties in Using a Smartphone or Computer. PLOS ONE 15, 5 (2020), 15 pages. https://doi.org/10.1371/journal.pone.0233891",
      "doi": ""
    },
    {
      "text": "Sara Bannerman. 2019. Relational privacy and the networked governance of the self. Information, Communication & Society 22, 14 (2019), 2187–2202. https://doi.org/10.1080/1369118X.2018.1478982",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2015. Humanistic HCI. Synthesis Lectures on Human-Centered Informatics 8, 4 (Sep 2015), 1–185.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2016. Humanistic HCI. Interactions 23, 2 (Feb 2016), 20–29. https://doi.org/10.1145/2888576",
      "doi": "10.1145/2888576"
    },
    {
      "text": "Adam Barth, Anupam Datta, John C. Mitchell, and Helen Nissenbaum. 2006. Privacy and contextual integrity: Framework and applications. In 2006 IEEE Security and Privacy(IEEE S&P 2006). Oakland, California, 15 pages. https://doi.org/10.1109/SP.2006.32",
      "doi": ""
    },
    {
      "text": "Susanne Barth and Menno D. T. de Jong. 2017. The privacy paradox – Investigating discrepancies between expressed privacy concerns and actual online behavior – A systematic literature review. Telematics and Informatics 34, 7 (2017), 1038–1058. https://doi.org/10.1016/j.tele.2017.04.013",
      "doi": "10.1016/j.tele.2017.04.013"
    },
    {
      "text": "Laura Brandimarte, Alessandro Acquisti, and George Loewenstein. 2013. Misplaced Confidences: Privacy and the Control Paradox. Social Psychological and Personality Science 4, 3 (2013), 340–347. https://doi.org/10.1177/1948550612455931",
      "doi": ""
    },
    {
      "text": "Kimberly A. Brink, Kurt Gray, and Henry M. Wellman. 2019. Creepiness Creeps In: Uncanny Valley Feelings Are Acquired in Childhood. Child Development 90, 4 (2019), 1202–1214. https://doi.org/10.1111/cdev.12999",
      "doi": ""
    },
    {
      "text": "Barry Brown. 2001. Studying the Internet Experience. Technical Report HPL-2001-49. HP Laboratories Bristol. http://www.hpl.hp.com/techreports/2001/HPL-2001-49.pdf",
      "doi": ""
    },
    {
      "text": "Christoph Buck and Simone Burster. 2017. App Information Privacy Concerns. In Proceedings of the Twenty-third Americas Conference on Information Systems (Boston, MA, USA) (AMCIS ’17). New York, NY, USA, 1–10.",
      "doi": ""
    },
    {
      "text": "Andy Crabtree, Peter Tolmie, and Will Knight. 2017. Repacking ‘Privacy’ for a Networked World. Computer Supported Cooperative Work (CSCW) 26, 4 (2017), 453–488. https://doi.org/10.1007/s10606-017-9276-y",
      "doi": "10.1007/s10606-017-9276-y"
    },
    {
      "text": "Lorrie Faith Cranor. 2012. Necessary but not sufficient: Standardized mechanisms for privacy notice and choice. Journal on Telecommunications & High Technology Law 10 (2012), 273–308.",
      "doi": ""
    },
    {
      "text": "Nora A. Draper and Joseph Turow. 2019. The corporate cultivation of digital resignation. New Media & Society 21, 8 (2019), 1824–1839. https://doi.org/10.1177/1461444819833331",
      "doi": ""
    },
    {
      "text": "Yuanyuan Feng, Yaxing Yao, and Norman Sadeh. 2021. A Design Space for Privacy Choices: Towards Meaningful Privacy Control in the Internet of Things. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 64, 16 pages. https://doi.org/10.1145/3411764.3445148",
      "doi": "10.1145/3411764.3445148"
    },
    {
      "text": "Jodi Forlizzi and Katja Battarbee. 2004. Understanding Experience in Interactive Systems. In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques(Cambridge, MA, USA) (DIS ’04). Association for Computing Machinery, New York, NY, USA, 261–268. https://doi.org/10.1145/1013115.1013152",
      "doi": "10.1145/1013115.1013152"
    },
    {
      "text": "Steven Furnell and Kerry-Lynn Thomson. 2009. Recognising and addressing ‘security fatigue’. Computer Fraud & Security 2009, 11 (2009), 7–11. https://doi.org/10.1016/S1361-3723(09)70139-3",
      "doi": ""
    },
    {
      "text": "Joseph K. Goodman, Cynthia E. Cryder, and Amar Cheema. 2013. Data Collection in a Flat World: The Strengths and Weaknesses of Mechanical Turk Samples. Journal of Behavioral Decision Making 26, 3 (2013), 213–224. https://doi.org/10.1002/bdm.1753",
      "doi": ""
    },
    {
      "text": "Jonathan Grudin. 1990. The Computer Reaches out: The Historical Continuity of Interface Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Seattle, Washington, USA) (CHI ’90). Association for Computing Machinery, New York, NY, USA, 261–268. https://doi.org/10.1145/97243.97284",
      "doi": "10.1145/97243.97284"
    },
    {
      "text": "Thilo Hagendorff. 2018. Privacy Literacy and Its Problems. Journal of Information Ethics 27, 2 (Fall 2018), 127–145.",
      "doi": ""
    },
    {
      "text": "Woodrow Hartzog. 2018. Privacy’s Blueprint: The Battle to Control the Design of New Technologies. Vol. 79. Harvard University Press, Cambridge, MA, USA. https://doi.org/10.4159/9780674985124",
      "doi": ""
    },
    {
      "text": "Sarah E. Igo. 2018. The Known Citizen. Harvard University Press, Cambridge, MA, USA. https://doi.org/10.4159/9780674985216",
      "doi": ""
    },
    {
      "text": "Nicholas A. John and Benjamin Peters. 2017. Why privacy keeps dying: The trouble with talk about the end of privacy. Information, Communication & Society 20, 2 (2017), 284–298. https://doi.org/10.1080/1369118X.2016.1167229",
      "doi": ""
    },
    {
      "text": "Anna Johnston. 2016. Creepiness Is in the Eye of the Beholder [Opinion]. IEEE Technology and Society Magazine 35, 1 (2016), 27–28. https://doi.org/10.1109/MTS.2016.2518254",
      "doi": ""
    },
    {
      "text": "Alisa Kalegina, Grace Schroeder, Aidan Allchin, Keara Berlin, and Maya Cakmak. 2018. Characterizing the Design Space of Rendered Robot Faces. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction (Chicago, IL, USA) (HRI ’18). Association for Computing Machinery, New York, NY, USA, 96–104. https://doi.org/10.1145/3171221.3171286",
      "doi": "10.1145/3171221.3171286"
    },
    {
      "text": "Flavius Kehr, Tobias Kowatsch, Daniel Wentzel, and Elgar Fleisch. 2015. Blissfully ignorant: The effects of general privacy concerns, general institutional trust, and affect in the privacy calculus. Information Systems Journal 25, 6 (2015), 607–635. https://doi.org/10.1111/isj.12062",
      "doi": "10.1111/isj.12062"
    },
    {
      "text": "Norene Kelly and Stephen Gilbert. 2016. The WEAR Scale: Developing a Measure of the Social Acceptability of a Wearable Device. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 2864–2871. https://doi.org/10.1145/2851581.2892331",
      "doi": "10.1145/2851581.2892331"
    },
    {
      "text": "Spyros Kokolakis. 2017. Privacy attitudes and privacy behaviour: A review of current research on the privacy paradox phenomenon. Computers & Security 64(2017), 122–134. https://doi.org/10.1016/j.cose.2015.07.002",
      "doi": "10.1016/j.cose.2015.07.002"
    },
    {
      "text": "Markus Langer and Cornelius J. König. 2018. Introducing and Testing the Creepiness of Situation Scale (CRoSS). Frontiers in Psychology 9, Article 2220(2018), 17 pages. https://doi.org/10.3389/fpsyg.2018.02220",
      "doi": ""
    },
    {
      "text": "Kirsten Martin. 2020. Breaking the Privacy Paradox: The Value of Privacy and Associated Duty of Firms. Business Ethics Quarterly 30, 1 (2020), 65–96. https://doi.org/10.1017/beq.2019.24",
      "doi": ""
    },
    {
      "text": "Philipp Masur. 2020. How Online Privacy Literacy Supports Self-Data Protection and Self-Determination in the Age of Information. Media and Communication 8, 2 (2020), 258–269. https://doi.org/10.17645/mac.v8i2.2855",
      "doi": ""
    },
    {
      "text": "Francis T. McAndrew and Sara S. Koehnke. 2016. On the nature of creepiness. New Ideas in Psychology 43 (2016), 10–15. https://doi.org/10.1016/j.newideapsych.2016.03.003",
      "doi": ""
    },
    {
      "text": "Nora McDonald and Andrea Forte. 2020. The Politics of Privacy Theories: Moving from Norms to Vulnerabilities. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376167",
      "doi": "10.1145/3313831.3376167"
    },
    {
      "text": "Sascha Meinert. 2020. Field Manual: Scenario Building. European Trade Union Institute, 32 pages. https://www.etui.org/publications/guides/field-manual-scenario-building",
      "doi": ""
    },
    {
      "text": "Jennifer Nedelsky. 2020. Law, Boundaries, and the Bounded Self. In Law and the Order of Culture, Robert Post (Ed.). University of California Press, 162–190. https://doi.org/10.1525/9780520314542-008",
      "doi": ""
    },
    {
      "text": "Tao Ni, Amy K. Karlson, and Daniel Wigdor. 2011. AnatOnMe: Facilitating Doctor-Patient Communication Using a Projection-Based Handheld Device. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 3333–3342. https://doi.org/10.1145/1978942.1979437",
      "doi": "10.1145/1978942.1979437"
    },
    {
      "text": "Christena E. Nippert-Eng. 2010. Islands of privacy. University of Chicago Press, Chicago, IL.",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2004. Privacy as Contextual Integrity. Washington Law Review 79, 1 (2004), 119–158.",
      "doi": ""
    },
    {
      "text": "Abu Saleh Md Noman, Sanchari Das, and Sameer Patil. 2019. Techies Against Facebook: Understanding Negative Sentiment Toward Facebook via User Generated Content. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300698",
      "doi": ""
    },
    {
      "text": "Martha C. Nussbaum. 2003. Upheavals of thought: The intelligence of emotions. Cambridge University Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Paul Ohm. 2009. Broken Promises of Privacy: Responding to the Surprising Failure of Anonymization. UCLA Law Review 57, 6 (Aug 2009), 1701–1778.",
      "doi": ""
    },
    {
      "text": "Emmi Parviainen and Marie Louise Juul Søndergaard. 2020. Experiential Qualities of Whispering with Voice Assistants. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376187",
      "doi": "10.1145/3313831.3376187"
    },
    {
      "text": "Chanda Phelan, Cliff Lampe, and Paul Resnick. 2016. It’s Creepy, But It Doesn’t Bother Me. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 5240–5251. https://doi.org/10.1145/2858036.2858381",
      "doi": "10.1145/2858036.2858381"
    },
    {
      "text": "James Pierce. 2019. Smart Home Security Cameras and Shifting Lines of Creepiness: A Design-Led Inquiry. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300275",
      "doi": "10.1145/3290605.3300275"
    },
    {
      "text": "Willard. V. Quine. 1976. The ways of paradox and other essays. Harvard University Press, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Elissa M. Redmiles, Sean Kross, and Michelle L. Mazurek. 2019. How Well Do My Results Generalize? Comparing Security and Privacy Survey Results from MTurk, Web, and Telephone Samples. In IEEE Symposium on Security and Privacy(IEEE S&P 2019). 1326–1343. https://doi.org/10.1109/SP.2019.00014",
      "doi": ""
    },
    {
      "text": "Daniel Reinhardt, Johannes Borchard, and Jörn Hurtienne. 2021. Visual Interactive Privacy Policy: The Better Choice?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 66, 12 pages. https://doi.org/10.1145/3411764.3445465",
      "doi": "10.1145/3411764.3445465"
    },
    {
      "text": "Sonny Rosenthal, Ole-Christian Wasenden, Gorm-Andreas Gronnevet, and Rich Ling. 2020. A tripartite model of trust in Facebook: Acceptance of information personalization, privacy concern, and privacy literacy. Media Psychology 23, 6 (2020), 840–864. https://doi.org/10.1080/15213269.2019.1648218",
      "doi": ""
    },
    {
      "text": "Ina Sander. 2020. What is critical big data literacy and how can it be implemented?Internet Policy Review 9, 2 (2020), 22 pages. https://doi.org/10.14763/2020.2.1479",
      "doi": ""
    },
    {
      "text": "Valentin Schwind, Pascal Knierim, Lewis Chuang, and Niels Henze. 2017. “Where’s Pinky?”: The Effects of a Reduced Number of Fingers in Virtual Reality. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Amsterdam, The Netherlands) (CHI PLAY ’17). Association for Computing Machinery, New York, NY, USA, 507–515. https://doi.org/10.1145/3116595.3116596",
      "doi": "10.1145/3116595.3116596"
    },
    {
      "text": "John S. Seberger and Geoffrey C. Bowker. 2021. Humanistic infrastructure studies: Hyper-functionality and the experience of the absurd. Information, Communication & Society 24, 12 (2021), 1712–1727. https://doi.org/10.1080/1369118X.2020.1726985",
      "doi": ""
    },
    {
      "text": "John S. Seberger, Marissel Llavore, Nicholas Nye Wyant, Irina Shklovski, and Sameer Patil. 2021. Empowering Resignation: There’s an App for That. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 552, 18 pages. https://doi.org/10.1145/3411764.3445293",
      "doi": "10.1145/3411764.3445293"
    },
    {
      "text": "Kim Bartel Sheehan. 2018. Crowdsourcing research: Data collection with Amazon’s Mechanical Turk. Communication Monographs 85, 1 (2018), 140–156. https://doi.org/10.1080/03637751.2017.1342043",
      "doi": ""
    },
    {
      "text": "Frank M. Shipman and Catherine C. Marshall. 2020. Ownership, Privacy, and Control in the Wake of Cambridge Analytica: The Relationship between Attitudes and Awareness. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376662",
      "doi": "10.1145/3313831.3376662"
    },
    {
      "text": "Irina Shklovski, Scott D. Mainwaring, Halla Hrund Skúladóttir, and Höskuldur Borgthorsson. 2014. Leakiness and Creepiness in App Space: Perceptions of Privacy and Mobile App Use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2347–2356. https://doi.org/10.1145/2556288.2557421",
      "doi": "10.1145/2556288.2557421"
    },
    {
      "text": "Daniel J. Solove. 2012. Introduction: Privacy Self-Management and the Consent Dilemma. Harvard Law Review 126, 7 (2012), 1880–1903.",
      "doi": ""
    },
    {
      "text": "Daniel J. Solove. 2021. The Myth of the Privacy Paradox. George Washington Law Review 89, 1 (2021), 1–51.",
      "doi": ""
    },
    {
      "text": "Sowmya Somanath, Ehud Sharlin, and Mario Costa Sousa. 2013. Integrating a robot in a tabletop reservoir engineering application. In 8th ACM/IEEE International Conference on Human-Robot Interaction(HRI 2013). 229–230. https://doi.org/10.1109/HRI.2013.6483585",
      "doi": ""
    },
    {
      "text": "Brian Stanton, Mary F. Theofanos, Sandra Spickard Prettyman, and Susanne Furman. 2016. Security Fatigue. IT Professional 18, 5 (2016), 26–32. https://doi.org/10.1109/MITP.2016.84",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star and Karen Ruhleder. 1996. Steps Toward an Ecology of Infrastructure: Design and Access for Large Information Spaces. Information Systems Research 7, 1 (1996), 111–134. https://doi.org/10.1287/isre.7.1.111",
      "doi": "10.1287/isre.7.1.111"
    },
    {
      "text": "Luke Stark. 2016. The emotional context of information privacy. The Information Society 32, 1 (2016), 14–27. https://doi.org/10.1080/01972243.2015.1107167",
      "doi": "10.1080/01972243.2015.1107167"
    },
    {
      "text": "Luke Stark, Jen King, Xinru Page, Airi Lampinen, Jessica Vitak, Pamela Wisniewski, Tara Whalen, and Nathaniel Good. 2016. Bridging the Gap between Privacy by Design and Privacy in Practice. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems(San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 3415–3422. https://doi.org/10.1145/2851581.2856503",
      "doi": "10.1145/2851581.2856503"
    },
    {
      "text": "Arlonda Stevens and Casey Newmeyer. 2017. Creepy and intrusive: A consumer’s perspective of online personalized communications. In Contemporary Issues in Social Media Marketing. Routledge, Milton Park, UK, 172–183.",
      "doi": ""
    },
    {
      "text": "Simone Stumpf, Anicia Peters, Shaowen Bardzell, Margaret Burnett, Daniela Busse, Jessica Cauchard, and Elizabeth Churchill. 2020. Gender-Inclusive HCI Research and Design: A Conceptual Review. Foundations and Trends in Human-Computer Interaction 13, 1 (March 2020), 1–69. https://doi.org/10.1561/1100000056",
      "doi": "10.1561/1100000056"
    },
    {
      "text": "Charles Taylor. 2002. Modern social imaginaries. Public Culture 14, 1 (2002), 91–124. https://muse.jhu.edu/article/26276",
      "doi": ""
    },
    {
      "text": "Omer Tene and Jules Polonetsky. 2013. A Theory of Creepy: Technology, Privacy and Shifting Social Norms. Yale Journal of Law and Technology 16 (2013), 59–102.",
      "doi": ""
    },
    {
      "text": "Blase Ur, Pedro Giovanni Leon, Lorrie Faith Cranor, Richard Shay, and Yang Wang. 2012. Smart, Useful, Scary, Creepy: Perceptions of Online Behavioral Advertising. In Proceedings of the Eighth Symposium on Usable Privacy and Security (Washington, D.C.) (SOUPS ’12). Association for Computing Machinery, New York, NY, USA, Article 4, 15 pages. https://doi.org/10.1145/2335356.2335362",
      "doi": "10.1145/2335356.2335362"
    },
    {
      "text": "David Vincent. 2016. Privacy: A Short History. Polity Press, Malden, MA, USA.",
      "doi": ""
    },
    {
      "text": "Paul Virilio. 2007. The Original Accident. Polity Press, Malden, MA, USA.",
      "doi": ""
    },
    {
      "text": "Jeffrey Warshaw, Tara Matthews, Steve Whittaker, Chris Kau, Mateo Bengualid, and Barton A. Smith. 2015. Can an Algorithm Know the “Real You”? Understanding People’s Reactions to Hyper-Personal Analytics Systems. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 797–806. https://doi.org/10.1145/2702123.2702274",
      "doi": "10.1145/2702123.2702274"
    },
    {
      "text": "Margo C. Watt, Rebecca A. Maitland, and Catherine E. Gallagher. 2017. A case of the “heeby jeebies”: An examination of intuitive judgements of “creepiness”. Canadian Journal of Behavioural Science / Revue canadienne des sciences du comportement 49, 1 (2017), 58–69. https://doi.org/10.1037/cbs0000066",
      "doi": ""
    },
    {
      "text": "Alan F. Westin. 1967. Privacy and Freedom. Atheneum Books, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Bianca D. M. Wilson and Ilan H. Meyer. 2021. Nonbinary LGBTQ Adults in the United States. The Williams Institute, Los Angeles, CA, USA. https://williamsinstitute.law.ucla.edu/wp-content/uploads/Nonbinary-LGBTQ-Adults-Jun-2021.pdf",
      "doi": ""
    },
    {
      "text": "Richmond Y. Wong, Deirdre K. Mulligan, Ellen Van Wyk, James Pierce, and John Chuang. 2017. Eliciting Values Reflections by Engaging Privacy Futures Using Design Workbooks. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 111 (Dec 2017), 26 pages. https://doi.org/10.1145/3134746",
      "doi": "10.1145/3134746"
    },
    {
      "text": "Allison Woodruff, Vasyl Pihur, Sunny Consolvo, Laura Brandimarte, and Alessandro Acquisti. 2014. Would a Privacy Fundamentalist Sell Their DNA for $1000...If Nothing Bad Happened as a Result? The Westin Categories, Behavioral Intentions, and Consequences. In 10th Symposium On Usable Privacy and Security(SOUPS 2014). USENIX Association, Menlo Park, CA, 1–18. https://www.usenix.org/conference/soups2014/proceedings/presentation/woodruff",
      "doi": ""
    },
    {
      "text": "Paweł W. Woźniak, Jakob Karolus, Florian Lang, Caroline Eckerth, Johannes Schöning, Yvonne Rogers, and Jasmin Niess. 2021. Creepy Technology: What Is It and How Do You Measure It?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 719, 13 pages. https://doi.org/10.1145/3411764.3445299",
      "doi": ""
    },
    {
      "text": "Heng Xu, Xin (Robert) Luo, John M. Carroll, and Mary Beth Rosson. 2011. The personalization privacy paradox: An exploratory study of decision making process for location-aware marketing. Decision Support Systems 51, 1 (2011), 42–52. https://doi.org/10.1016/j.dss.2010.11.017",
      "doi": "10.1016/j.dss.2010.11.017"
    },
    {
      "text": "Jason C. Yip, Kiley Sobel, Xin Gao, Allison Marie Hishikawa, Alexis Lim, Laura Meng, Romaine Flor Ofiana, Justin Park, and Alexis Hiniker. 2019. Laughing is Scary, but Farting is Cute: A Conceptual Model of Children’s Perspectives of Creepy Technologies. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300303",
      "doi": "10.1145/3290605.3300303"
    },
    {
      "text": "Hui Zhang, Munmun De Choudhury, and Jonathan Grudin. 2014. Creepy but Inevitable? The Evolution of Social Networking. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing(Baltimore, Maryland, USA) (CSCW ’14). Association for Computing Machinery, New York, NY, USA, 368–378. https://doi.org/10.1145/2531602.2531685",
      "doi": "10.1145/2531602.2531685"
    }
  ]
}