{
  "doi": "10.1145/3491102.3517580",
  "title": "Strategies for Fostering a Genuine Feeling of Connection in Technologically Mediated Systems",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-26",
  "year": 2022,
  "badges": [],
  "abstract": "Human connection is essential for our personal well-being and a building block for a well-functioning society. There is a prominent interest in the potential of technology for mediating social connection, with a wealth of systems designed to foster the feeling of connection between strangers, friends, and family. By surveying this design landscape we present a transitional definition of mediated genuine connection and nine design strategies embodied within 50 design artifacts: affective self-disclosure, reflection on unity, shared embodied experience, transcendent emotions, embodied metaphors, interpersonal distance, touch, provocations, and play. In addition to drawing on design practice-based knowledge we also identify underlying psychological theories that can inform these strategies. We discuss design considerations pertaining to sensory modalities, vulnerability–comfort trade-offs, consent, situatedness in context, supporting diverse relationships, reciprocity, attention directedness, pursuing generalized knowledge, and questions of ethics. We hope to inspire and enrich designers’ understanding of the possibilities of technology to better support a mediated genuine feeling of connection.",
  "tags": [
    "belonging",
    "design strategies",
    "intimacy",
    "design considerations",
    "genuine connection",
    "social connection",
    "review"
  ],
  "authors": [
    {
      "name": "Ekaterina R. Stepanova",
      "institution": "School of Interactive Arts and Technology, Simon Fraser University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658740496",
      "orcid": "0000-0002-1983-1512"
    },
    {
      "name": "John Desnoyers-Stewart",
      "institution": "School of Interactive Arts and Technology, Simon Fraser University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659219959",
      "orcid": "missing"
    },
    {
      "name": "Kristina Höök",
      "institution": "Media Technology and Interaction Design, KTH Royal Institute of Technology, Sweden",
      "img": "/do/10.1145/contrib-81341491415/rel-imgonly/rigakiafeb2017.jpg",
      "acmid": "81341491415",
      "orcid": "0000-0002-0002-4825"
    },
    {
      "name": "Bernhard E. Riecke",
      "institution": "School of Interactive Arts + Technology (SIAT), Simon Fraser University, Canada",
      "img": "/do/10.1145/contrib-81100113270/rel-imgonly/bernhardriecke-hikingstawamuschief_small.jpg",
      "acmid": "81100113270",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Joshua M Ackerman, Christopher C Nocera, and John A Bargh. 2010. Incidental haptic sensations influence social judgments and decisions. Science 328, 5986 (2010), 1712–1715.",
      "doi": ""
    },
    {
      "text": "Peter Andersen, Jillian Gannon, and Jessica Kalchik. 2013. Proxemic and haptic interaction: the closeness continuum. In Nonverbal communication. De Gruyter Mouton, Berlin, Chapter Chapter 11, 295–330.",
      "doi": ""
    },
    {
      "text": "Michael Argyle and Janet Dean. 1965. Eye-Contact, Distance and Affiliation. Sociometry 28, 3 (1965), 289–304. https://doi.org/10.2307/2786027 Publisher: [American Sociological Association, Sage Publications, Inc.].",
      "doi": ""
    },
    {
      "text": "Arthur Aron and Elaine N Aron. 1997. Self-expansion motivation and including other in the self. In Handbook of personal relationships: Theory, research and interventions. John Wiley & Sons Inc, New York, 251–270.",
      "doi": ""
    },
    {
      "text": "Arthur Aron, Elaine N Aron, and Christina Norman. 2004. Self-expansion Model of Motivation and Cognition in Close Relationships and Beyond.In Self and social identity, M. B. Brewer & M. Hewstone (Ed.). Blackwell Publishing, New York, 99–123.",
      "doi": ""
    },
    {
      "text": "Philip J Auter and Donald M Davis. 1991. When characters speak directly to viewers: Breaking the fourth wall in television. Journalism Quarterly 68, 1-2 (1991), 165–171.",
      "doi": ""
    },
    {
      "text": "Lisa Feldman Barrett. 2006. Are emotions natural kinds?Perspectives on psychological science 1, 1 (2006), 28–58.",
      "doi": ""
    },
    {
      "text": "Lisa Feldman Barrett, Batja Mesquita, Kevin N Ochsner, and James J Gross. 2007. The experience of emotion. Annu. Rev. Psychol. 58(2007), 373–403.",
      "doi": ""
    },
    {
      "text": "Lisa Feldman Barrett and Christiana Westlin. 2021. Navigating the science of emotion. In Emotion measurement. Elsevier, Amsterdam, 39–84.",
      "doi": ""
    },
    {
      "text": "Jennifer A Bartz, Jamil Zaki, Niall Bolger, and Kevin N Ochsner. 2011. Social effects of oxytocin in humans: context and person matter. Trends in cognitive sciences 15, 7 (2011), 301–309.",
      "doi": ""
    },
    {
      "text": "Roy F Baumeister and Mark R Leary. 1995. The need to belong: desire for interpersonal attachments as a fundamental human motivation.Psychological bulletin 117, 3 (1995), 497.",
      "doi": ""
    },
    {
      "text": "BeAnotherLab. 2012. The Machine to be Another. Retrieved September 8, 2021 from http://beanotherlab.org/",
      "doi": ""
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall, and Tom Rodden. 2012. Uncomfortable interactions. In Proceedings of the sigchi conference on human factors in computing systems (CHI’12). 2005–2014.",
      "doi": "10.1145/2207676.2208347"
    },
    {
      "text": "Philippe Bertrand, Jérôme Guegan, Léonore Robieux, Cade Andrew McCall, and Franck Zenasni. 2018. Learning empathy through virtual reality: multiple strategies for training empathy-related abilities using body ownership illusions in embodied virtual reality. Frontiers in Robotics and AI 5 (2018), 26.",
      "doi": ""
    },
    {
      "text": "Frank Biocca, Chad Harms, and Judee K Burgoon. 2003. Toward a more robust theory and measure of social presence: Review and suggested criteria. Presence: Teleoperators & virtual environments 12, 5(2003), 456–480.",
      "doi": ""
    },
    {
      "text": "Paul Bloom. 2017. Empathy and its discontents. Trends in cognitive sciences 21, 1 (2017), 24–31.",
      "doi": ""
    },
    {
      "text": "John Bowlby. 1978. Attachment theory and its therapeutic implications.Adolescent psychiatry(1978).",
      "doi": ""
    },
    {
      "text": "Marilynn B Brewer. 1979. In-group bias in the minimal intergroup situation: A cognitive-motivational analysis.Psychological bulletin 86, 2 (1979), 307.",
      "doi": ""
    },
    {
      "text": "Brené Brown. 2012. Daring greatly: How the courage to be vulnerable transforms the way we live, love, parent, and lead. Penguin.",
      "doi": ""
    },
    {
      "text": "Sophia Brueckner. 2018. Empathy amulet: a wearable to connect with strangers. In Proceedings of the 2018 ACM International Symposium on Wearable Computers. 248–253.",
      "doi": "10.1145/3267242.3267301"
    },
    {
      "text": "Kathleen Glascott Burriss and Ling-Ling Tsao. 2002. Review of research: How much do we know about the importance of play in child development?Childhood Education 78, 4 (2002), 230–233.",
      "doi": ""
    },
    {
      "text": "David Byrne. 2017. Eliminating the human. MIT Technol. Rev. 120, 5 (2017), 8–10.",
      "doi": ""
    },
    {
      "text": "John T Cacioppo and Louise C Hawkley. 2009. Perceived social isolation and cognition. Trends in cognitive sciences 13, 10 (2009), 447–454.",
      "doi": ""
    },
    {
      "text": "Stephanie Cacioppo and John T Cacioppo. 2012. Decoding the invisible forces of social connections. Frontiers in integrative neuroscience 6 (2012), 51.",
      "doi": ""
    },
    {
      "text": "T. Nikki Cesare Schotzko. 2020. A year (in five months) of living dangerously: hidden intimacies in Zoom exigencies. International Journal of Performance Arts and Digital Media 16, 3 (Sept. 2020), 269–289. https://doi.org/10.1080/14794713.2020.1827206",
      "doi": ""
    },
    {
      "text": "Adrian David Cheok. 2010. Huggy pajama: A remote interactive touch and hugging system. In Art and technology of entertainment computing and communication. Springer, 161–194.",
      "doi": ""
    },
    {
      "text": "Alice Chirico, Francesco Ferrise, Lorenzo Cordella, and Andrea Gaggioli. 2018. Designing awe in virtual reality: An experimental study. Frontiers in psychology 8 (2018), 2351.",
      "doi": ""
    },
    {
      "text": "Anna Ciaunica, Luke McEllin, Julian Kiverstein, Vittorio Gallese, Jakob Hohwy, and Mateusz WoÅºniak. 2022. Zoomed out: digital media use and depersonalization experiences during the COVID-19 lockdown. Scientific Reports 12, 1 (March 2022), 3888. https://doi.org/10.1038/s41598-022-07657-8 Number: 1 Publisher: Nature Publishing Group.",
      "doi": ""
    },
    {
      "text": "Emma EA Cohen, Robin Ejsmond-Frey, Nicola Knight, and Robin IM Dunbar. 2010. Rowers’ high: behavioural synchrony is correlated with elevated pain thresholds. Biology letters 6, 1 (2010), 106–108.",
      "doi": ""
    },
    {
      "text": "John W Creswell and J David Creswell. 2017. Research design: Qualitative, quantitative, and mixed methods approaches. Sage publications, Thousand Oaks.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi and Mihaly Csikzentmihaly. 1990. Flow: The psychology of optimal experience. Vol. 1990. Harper & Row New York.",
      "doi": ""
    },
    {
      "text": "Antonio R Damasio. 1994. Descartes’ error: Emotion, rationality and the human brain. New York: Putnam 352(1994).",
      "doi": ""
    },
    {
      "text": "Martin Davies. 2011. Concept mapping, mind mapping and argument mapping: what are the differences and do they matter?Higher education 62, 3 (2011), 279–301.",
      "doi": ""
    },
    {
      "text": "Frederique de Vignemont and Tania Singer. 2006. The empathic brain: how, when and why?Trends in Cognitive Sciences 10, 10 (Oct. 2006), 435–441. https://doi.org/10.1016/j.tics.2006.08.008",
      "doi": ""
    },
    {
      "text": "Emilie Delaherche, Mohamed Chetouani, Ammar Mahdhaoui, Catherine Saint-Georges, Sylvie Viaux, and David Cohen. 2012. Interpersonal synchrony: A survey of evaluation methods across disciplines. IEEE Transactions on Affective Computing 3, 3 (2012), 349–365.",
      "doi": "10.1109/T-AFFC.2012.12"
    },
    {
      "text": "John Desnoyers-Stewart. 2018. Transcending Perception. Ph.D. Dissertation. Faculty of Media, Art, and Performance, University of Regina.",
      "doi": ""
    },
    {
      "text": "John Desnoyers-Stewart, Ekaterina R. Stepanova, and Bernhard E. Riecke. 2022. Methods for Investigating Social Connection in Technologically Mediated Experiences. ACM Transactions on Computer-Human Interaction (TOCHI) (2022). (in preparation).",
      "doi": ""
    },
    {
      "text": "John Desnoyers-Stewart, Ekaterina R Stepanova, Bernhard E Riecke, and Patrick Pennefather. 2020. Body RemiXer: extending bodies to stimulate social connection in an immersive installation. Leonardo 53, 4 (2020), 394–400.",
      "doi": ""
    },
    {
      "text": "Ed Diener and Martin EP Seligman. 2002. Very happy people. Psychological science 13, 1 (2002), 81–84.",
      "doi": ""
    },
    {
      "text": "Suzanne Dikker, Sean Montgomery, and Suzan Tunca. 2019. Using synchrony-based neurofeedback in search of human connectedness. In Brain Art. Springer, 161–206.",
      "doi": ""
    },
    {
      "text": "Donald G Dutton and Arthur P Aron. 1974. Some evidence for heightened sexual attraction under conditions of high anxiety.Journal of personality and social psychology 30, 4(1974), 510.",
      "doi": ""
    },
    {
      "text": "Ryan J Dwyer, Kostadin Kushlev, and Elizabeth W Dunn. 2018. Smartphone use undermines enjoyment of face-to-face social interactions. Journal of Experimental Social Psychology 78 (2018), 233–239.",
      "doi": ""
    },
    {
      "text": "Abdallah El Ali, Xingyu Yang, Swamy Ananthanarayan, Thomas Röggla, Jack Jansen, Jess Hartcher-O’Brien, Kaspar Jansen, and Pablo Cesar. 2020. ThermalWear: Exploring Wearable On-chest Thermal Displays to Augment Voice Messages with Affect. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376682"
    },
    {
      "text": "Michiel van Elk, M. Andrea Arciniegas Gomez, Wietske van der Zwaag, Hein T. van Schie, and Disa Sauter. 2019. The neural correlates of the awe experience: Reduced default mode network activity during feelings of awe. Human Brain Mapping 40, 12 (2019), 3561–3574. https://doi.org/10.1002/hbm.24616",
      "doi": ""
    },
    {
      "text": "Nicholas Epley and Juliana Schroeder. 2014. Mistakenly seeking solitude.Journal of Experimental Psychology: General 143, 5 (2014), 1980.",
      "doi": ""
    },
    {
      "text": "Sara Eriksson, Åsa Unander-Scharin, Vincent Trichon, Carl Unander-Scharin, Hedvig Kjellström, and Kristina Höök. 2019. Dancing with drones: Crafting novel artistic expressions through intercorporeality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300847"
    },
    {
      "text": "John Desnoyers-Stewart et al.2020. Body RemiXer [online]. Retrieved September 8, 2021 from http://ispace.iat.sfu.ca/project/body-remixer/",
      "doi": ""
    },
    {
      "text": "Milou A Feijt, Joyce HDM Westerink, Yvonne AW De Kort, and Wijnand A IJsselsteijn. 2021. Sharing biosignals: An analysis of the experiential and communication properties of interpersonal psychophysiology. Human–Computer Interaction(2021), 1–30.",
      "doi": ""
    },
    {
      "text": "Lawrence K Frank. 1958. Tactile communication. ETC: a Review of General Semantics(1958), 31–79.",
      "doi": ""
    },
    {
      "text": "Jérémy Frey, May Grabli, Ronit Slyper, and Jessica R Cauchard. 2018. Breeze: Sharing biofeedback through wearable technologies. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3174219"
    },
    {
      "text": "Thomas Fuchs. 2016. Intercorporeality and interaffectivity. Intercorporeality: Emerging socialities in interaction (2016), 194–209.",
      "doi": ""
    },
    {
      "text": "Shaun Gallagher, Bruce Janz, Lauren Reinerman, Jörg Trempler, and Patricia Bockelman. 2015. A neurophenomenology of awe and wonder: Towards a non-reductionist cognitive science. Springer.",
      "doi": ""
    },
    {
      "text": "Vittorio Gallese. 2007. Before and below ‘theory of mind’: embodied simulation and the neural correlates of social cognition. Philosophical Transactions of the Royal Society B: Biological Sciences 362, 1480 (2007), 659–669.",
      "doi": ""
    },
    {
      "text": "Liridona Gashi, Sveinung Sandberg, and Willy Pedersen. 2021. Making “bad trips” good: How users of psychedelics narratively transform challenging trips into valuable experiences. International Journal of Drug Policy 87 (2021), 102997.",
      "doi": ""
    },
    {
      "text": "Renaud Gervais, Jérémy Frey, Alexis Gay, Fabien Lotte, and Martin Hachet. 2016. Tobe: Tangible out-of-body experience. In Proceedings of the TEI’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction. 227–235.",
      "doi": "10.1145/2839462.2839486"
    },
    {
      "text": "David R Glowacki, Mark D Wonnacott, Rachel Freire, Becca R Glowacki, Ella M Gale, James E Pike, Tiu de Haan, Mike Chatziapostolou, and Oussama Metatla. 2020. Isness: using multi-person VR to design peak mystical type experiences comparable to psychedelics. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376649"
    },
    {
      "text": "Daniel Gooch and Leon Watts. 2012. YourGloves, hothands and hotmits: devices to hold hands at a distance. In Proceedings of the 25th annual ACM symposium on User Interface Software and Technology. 157–166.",
      "doi": "10.1145/2380116.2380138"
    },
    {
      "text": "Amie M Gordon, Jennifer E Stellar, Craig L Anderson, Galen D McNeil, Daniel Loew, and Dacher Keltner. 2017. The dark side of the sublime: Distinguishing a threat-based variant of awe.Journal of personality and social psychology 113, 2(2017), 310.",
      "doi": ""
    },
    {
      "text": "Colin M Gray, Yubo Kou, Bryan Battles, Joseph Hoggatt, and Austin L Toombs. 2018. The dark (patterns) side of UX design. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3173574.3174108"
    },
    {
      "text": "Roland R Griffiths, Matthew W Johnson, William A Richards, Brian D Richards, Robert Jesse, Katherine A MacLean, Frederick S Barrett, Mary P Cosimano, and Maggie A Klinedinst. 2018. Psilocybin-occasioned mystical-type experience in combination with meditation and other spiritual practices produces enduring positive changes in psychological functioning and in trait measures of prosocial attitudes and behaviors. Journal of Psychopharmacology 32, 1 (2018), 49–69.",
      "doi": ""
    },
    {
      "text": "Jens Emil Grønbæk, Mille Skovhus Knudsen, Kenton O’Hara, Peter Gall Krogh, Jo Vermeulen, and Marianne Graves Petersen. 2020. Proxemics beyond proximity: Designing for flexible social interaction through cross-device interaction. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376379"
    },
    {
      "text": "Antal Haans and Wijnand IJsselsteijn. 2006. Mediated social touch: a review of current research and future directions. Virtual Reality 9, 2-3 (2006), 149–159.",
      "doi": "10.5555/3227221.3227398"
    },
    {
      "text": "Edward Twitchell Hall. 1966. The hidden dimension. Vol. 609. Doubleday, Garden City, NY.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 2006. A cyborg manifesto: Science, technology, and socialist-feminism in the late 20th century. In The international handbook of virtual learning environments. Springer, 117–158.",
      "doi": ""
    },
    {
      "text": "Ido Hartogsohn. 2016. Set and setting, psychedelics and the placebo response: an extra-pharmacological perspective on psychopharmacology. Journal of Psychopharmacology 30, 12 (2016), 1259–1267.",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl, Stephanie Heidecker, Kai Eckoldt, Sarah Diefenbach, and Uwe Hillmann. 2012. All you need is love: Current strategies of mediating intimate relationships through technology. ACM Transactions on Computer-Human Interaction (TOCHI) 19, 4(2012), 1–19.",
      "doi": "10.1145/2395131.2395137"
    },
    {
      "text": "Louise C Hawkley and John T Cacioppo. 2010. Loneliness matters: A theoretical and empirical review of consequences and mechanisms. Annals of behavioral medicine 40, 2 (2010), 218–227.",
      "doi": ""
    },
    {
      "text": "Jeppe Hein. 2005. Modified Social Benches 1-10. Retrieved September 8, 2021 from https://www.jeppehein.net/project_id.php?path=works&id=126",
      "doi": ""
    },
    {
      "text": "Annabell Ho, Jeff Hancock, and Adam S Miner. 2018. Psychological, relational, and emotional effects of self-disclosure after conversations with a chatbot. Journal of Communication 68, 4 (2018), 712–733.",
      "doi": ""
    },
    {
      "text": "Mads Hobye and Jonas Löwgren. 2011. Touching a stranger: Designing for engaging experience in embodied interaction. International Journal of Design 5, 3 (2011), 31–48.",
      "doi": ""
    },
    {
      "text": "Katie Hoemann, Zulqarnain Khan, Mallory J Feldman, Catie Nielson, Madeleine Devlin, Jennifer Dy, Lisa Feldman Barrett, Jolie B Wormwood, and Karen S Quigley. 2020. Context-aware experience sampling reveals the scale of variation in affective experience. Scientific reports 10, 1 (2020), 1–16.",
      "doi": ""
    },
    {
      "text": "Kristina Höök. 2018. Designing with the body: Somaesthetic interaction design. MIT Press.",
      "doi": ""
    },
    {
      "text": "Noura Howell, Greg Niemeyer, and Kimiko Ryokai. 2019. Life-affirming biosensing in public: Sounding heartbeats on a red bench. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3290605.3300910"
    },
    {
      "text": "Cendri A Hutcherson, Emma M Seppala, and James J Gross. 2015. The neural correlates of social connection. Cognitive, Affective, & Behavioral Neuroscience 15, 1(2015), 1–14.",
      "doi": ""
    },
    {
      "text": "Don Ihde. 2009. Postphenomenology and technoscience: The Peking university lectures. Suny Press.",
      "doi": "10.5555/3203951"
    },
    {
      "text": "Tristen K Inagaki and Lauren P Ross. 2020. A body-to-mind perspective on social connection: Physical warmth potentiates brain activity to close others and subsequent feelings of social connection.Emotion (2020).",
      "doi": ""
    },
    {
      "text": "Katherine Isbister, Suzanne Kirkpatrick, Syed Salahuddin, Raybit Tang, Gang Cao, Xiaofeng Chen, and Elena Márquez Segura. 2016. Yamove! A movement synchrony game that choreographs social interaction.Human technology 12, 1 (2016).",
      "doi": ""
    },
    {
      "text": "Valerie J Janesick. 2015. ” Stretching” exercises for qualitative researchers. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Joris H Janssen, Jeremy N Bailenson, Wijnand A IJsselsteijn, and Joyce HDM Westerink. 2010. Intimate heartbeats: Opportunities for affective communication technology. IEEE Transactions on Affective Computing 1, 2 (2010), 72–80.",
      "doi": "10.1109/T-AFFC.2010.13"
    },
    {
      "text": "Joris H Janssen, Wijnand A Ijsselsteijn, and Joyce HDM Westerink. 2014. How affective technologies can influence intimate interactions and improve social connectedness. International Journal of Human-Computer Studies 72, 1 (2014), 33–43.",
      "doi": "10.1016/j.ijhcs.2013.09.007"
    },
    {
      "text": "Simo Järvelä, Benjamin Cowley, Mikko Salminen, Giulio Jacucci, Juho Hamari, and Niklas Ravaja. 2021. Augmented Virtual Reality Meditation: Shared Dyadic Biofeedback Increases Social Presence Via Respiratory Synchrony. ACM Transactions on Social Computing 4, 2 (2021), 1–19.",
      "doi": "10.1145/3449358"
    },
    {
      "text": "Daniel Kahneman, Alan B Krueger, David A Schkade, Norbert Schwarz, and Arthur A Stone. 2004. A survey method for characterizing daily life experience: The day reconstruction method. Science 306, 5702 (2004), 1776–1780.",
      "doi": ""
    },
    {
      "text": "Joseph ‘Jofish’ Kaye, Mariah K Levitt, Jeffrey Nevins, Jessica Golden, and Vanessa Schmidt. 2005. Communicating intimacy one bit at a time. In CHI’05 extended abstracts on Human factors in computing systems. 1529–1532.",
      "doi": ""
    },
    {
      "text": "Dacher Keltner and Alan Cowen. 2021. A taxonomy of positive emotions. Current Opinion in Behavioral Sciences 39 (2021), 216–221.",
      "doi": ""
    },
    {
      "text": "Dacher Keltner and Jonathan Haidt. 2003. Approaching awe, a moral, spiritual, and aesthetic emotion. Cognition and emotion 17, 2 (2003), 297–314.",
      "doi": ""
    },
    {
      "text": "Matthew A Killingsworth and Daniel T Gilbert. 2010. A wandering mind is an unhappy mind. Science 330, 6006 (2010), 932–932.",
      "doi": ""
    },
    {
      "text": "Alexandra Kitson, Alice Chirico, Andrea Gaggioli, and Bernhard E. Riecke. 2020. A Review on Research and Evaluation Methods for Investigating Self-transcendence. Frontiers in Psychology(2020). Research Topic: Towards a Science of Complex Experiences.",
      "doi": ""
    },
    {
      "text": "Alexandra Kitson, Mirjana Prpa, and Bernhard E Riecke. 2018. Immersive interactive technologies for positive change: a scoping review and design considerations. Frontiers in psychology 9 (2018), 1354.",
      "doi": ""
    },
    {
      "text": "Alexandra Kitson, Ekaterina R Stepanova, Ivan A Aguilar, Natasha Wainwright, and Bernhard E Riecke. 2020. Designing Mind (set) and Setting for Profound Emotional Experiences in Virtual Reality. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 655–668.",
      "doi": "10.1145/3357236.3395560"
    },
    {
      "text": "Martijn JL Kors, Gabriele Ferri, Erik D Van Der Spek, Cas Ketel, and Ben AM Schouten. 2016. A breathtaking journey. On the design of an empathy-arousing mixed-reality game. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play. 91–104.",
      "doi": "10.1145/2967934.2968110"
    },
    {
      "text": "Zoltán Kövecses. 2000. Universality in the Conceptualization of Emotions. In Metaphor and Emotion: Language, Culture, and Body in Human Feeling, Raymond W. Jr. Gibbs (Ed.). Cambridge University Press, Cambridge, 380–396. https://doi.org/10.1017/CBO9780511816802.023",
      "doi": ""
    },
    {
      "text": "Kostadin Kushlev, Ryan Dwyer, and Elizabeth W Dunn. 2019. The social price of constant connectivity: Smartphones impose subtle costs on well-being. Current Directions in Psychological Science 28, 4 (2019), 347–352.",
      "doi": ""
    },
    {
      "text": "Simon Lacey, Randall Stilla, and Krish Sathian. 2012. Metaphorically feeling: comprehending textural metaphors activates somatosensory cortex. Brain and language 120, 3 (2012), 416–421.",
      "doi": ""
    },
    {
      "text": "George Lakoff and Mark Johnson. 1980. Metaphors we live by. University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Michael Larkin, Virginia Eatough, and Mike Osborn. 2011. Interpretative phenomenological analysis and embodied, active, situated cognition. Theory & Psychology 21, 3 (2011), 318–337.",
      "doi": ""
    },
    {
      "text": "Jacques Launay, Bronwyn Tarr, and Robin IM Dunbar. 2016. Synchrony as an adaptive mechanism for large-scale human social bonding. Ethology 122, 10 (2016), 779–789.",
      "doi": ""
    },
    {
      "text": "Jean-Philippe Laurenceau, Lisa Feldman Barrett, and Paula R Pietromonaco. 1998. Intimacy as an interpersonal process: The importance of self-disclosure, partner disclosure, and perceived partner responsiveness in interpersonal exchanges.Journal of personality and social psychology 74, 5(1998), 1238.",
      "doi": ""
    },
    {
      "text": "Geneviève L Lavigne, Robert J Vallerand, and Laurence Crevier-Braud. 2011. The fundamental need to belong: On the distinction between growth and deficit-reduction orientations. Personality and social psychology bulletin 37, 9 (2011), 1185–1201.",
      "doi": ""
    },
    {
      "text": "Richard M Lee and Steven B Robbins. 1995. Measuring belongingness: The social connectedness and the social assurance scales.Journal of counseling psychology 42, 2 (1995), 232.",
      "doi": ""
    },
    {
      "text": "Yi-Chieh Lee, Naomi Yamashita, Yun Huang, and Wai Fu. 2020. ” I Hear You, I Feel You”: Encouraging Deep Self-disclosure through a Chatbot. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3313831.3376175"
    },
    {
      "text": "Nicholas Leigh-Hunt, David Bagguley, Kristin Bash, Victoria Turner, Stephen Turnbull, N Valtorta, and Woody Caan. 2017. An overview of systematic reviews on the public health consequences of social isolation and loneliness. Public health 152(2017), 157–171.",
      "doi": ""
    },
    {
      "text": "Jeff Levin and Lea Steele. 2005. The transcendent experience: conceptual, theoretical, and epidemiologic perspectives. Explore 1, 2 (2005), 89–101.",
      "doi": ""
    },
    {
      "text": "Mark Levine, Amy Prosser, David Evans, and Stephen Reicher. 2005. Identity and emergency intervention: How social group membership and inclusiveness of group boundaries shape helping behavior. Personality and social psychology bulletin 31, 4 (2005), 443–453.",
      "doi": ""
    },
    {
      "text": "Hong Li, Jonna Häkkilä, and Kaisa Väänänen. 2018. Review of unconventional user interfaces for emotional communication between long-distance partners. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services. 1–10.",
      "doi": "10.1145/3229434.3229467"
    },
    {
      "text": "Jing-Jing Li, Kai Dou, Yu-Jie Wang, and Yan-Gang Nie. 2019. Why awe promotes prosocial behaviors? The mediating effects of future time perspective and self-transcendence meaning of life. Frontiers in psychology 10 (2019), 1140.",
      "doi": ""
    },
    {
      "text": "Fannie Liu, Mario Esparza, Maria Pavlovskaia, Geoff Kaufman, Laura Dabbish, and Andrés Monroy-Hernández. 2019. Animo: Sharing biosignals on a smartwatch for lightweight social connection. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 1 (2019), 1–19.",
      "doi": "10.1145/3359303"
    },
    {
      "text": "Fannie Liu, Chunjong Park, Yu Jiang Tham, Tsung-Yu Tsai, Laura Dabbish, Geoff Kaufman, and Andrés Monroy-Hernández. 2021. Significant Otter: Understanding the Role of Biosignals in Communication. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 334, 15 pages. https://doi.org/10.1145/3411764.3445200",
      "doi": "10.1145/3411764.3445200"
    },
    {
      "text": "Joan Llobera, Bernhard Spanlang, Giulio Ruffini, and Mel Slater. 2010. Proxemics with Multiple Dynamic Characters in an Immersive Virtual Environment. ACM Trans. Appl. Percept. 8, 1, Article 3 (Nov. 2010), 12 pages. https://doi.org/10.1145/1857893.1857896",
      "doi": "10.1145/1857893.1857896"
    },
    {
      "text": "Matthew Lombard and Matthew T Jones. 2015. Defining presence. In Immersed in Media. Springer, 13–34.",
      "doi": ""
    },
    {
      "text": "Gilad Lotan and Christian Croft. 2007. Impulse. In CHI’07 Extended Abstracts on Human Factors in Computing Systems. 1983–1988.",
      "doi": ""
    },
    {
      "text": "Rafael Lozano-Hemmer. 2019. Remote Pulse. Retrieved September 8, 2021 from https://www.lozano-hemmer.com/remote_pulse.php",
      "doi": ""
    },
    {
      "text": "Ewa Lux, Marc T. P. Adam, Verena Dorner, Sina Helming, Michael T. Knierim, and Christof Weinhardt. 2018. Live Biofeedback as a User Interface Design Element: A Review of the Literature. Communications of the Association for Information Systems (2018), 257–296. https://doi.org/10.17705/1CAIS.04318",
      "doi": ""
    },
    {
      "text": "Neha Mahajan and Karen Wynn. 2012. Origins of “Us” versus “Them”: Prelinguistic infants prefer similar others. Cognition 124, 2 (Aug. 2012), 227–233. https://doi.org/10.1016/j.cognition.2012.05.003",
      "doi": ""
    },
    {
      "text": "Kerry L. Marsh, Michael J. Richardson, and R. C. Schmidt. 2009. Social Connection Through Joint Action and Interpersonal Coordination. Topics in Cognitive Science 1, 2 (April 2009), 320–339. https://doi.org/10.1111/j.1756-8765.2009.01022.x",
      "doi": ""
    },
    {
      "text": "Joe Marshall and Paul Tennent. 2017. Touchomatic: Interpersonal Touch Gaming In The Wild. In Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, Edinburgh United Kingdom, 417–428. https://doi.org/10.1145/3064663.3064727",
      "doi": "10.1145/3064663.3064727"
    },
    {
      "text": "Helena M. Mentis, Jarmo Laaksolahti, and Kristina Höök. 2014. My Self and You: Tension in Bodily Sharing of Experience. ACM Transactions on Computer-Human Interaction 21, 4 (Aug. 2014), 1–26. https://doi.org/10.1145/2617945",
      "doi": "10.1145/2617945"
    },
    {
      "text": "Maurice Merleau-Ponty. 1964. Signs. Northwestern University Press.",
      "doi": ""
    },
    {
      "text": "Raphaël Millière, Robin L. Carhart-Harris, Leor Roseman, Fynn-Mathis Trautwein, and Aviva Berkovich-Ohana. 2018. Psychedelics, Meditation, and Self-Consciousness. Frontiers in Psychology 9 (2018). https://doi.org/10.3389/fpsyg.2018.01475 Publisher: Frontiers.",
      "doi": ""
    },
    {
      "text": "Hyeryung Christine Min and Tek-Jin Nam. 2014. Biosignal sharing for affective connectedness. ACM, 2191–2196. https://doi.org/10.1145/2559206.2581345",
      "doi": ""
    },
    {
      "text": "Kate E. Min, Peggy J. Liu, and Soo Kim. 2018. Sharing Extraordinary Experiences Fosters Feelings of Closeness. Personality and Social Psychology Bulletin 44, 1 (Jan. 2018), 107–121. https://doi.org/10.1177/0146167217733077",
      "doi": ""
    },
    {
      "text": "Robb Mitchell and Laurens Boer. 2017. Move Closer: Towards Design Patterns To Support Initiating Social Encounters. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 2781–2787. https://doi.org/10.1145/3027063.3053230",
      "doi": "10.1145/3027063.3053230"
    },
    {
      "text": "Jelena Mladenović, Jérémy Frey, and Jessica R. Cauchard. 2018. DiÅ¡imo: Anchoring Our Breath. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–4. https://doi.org/10.1145/3170427.3186517",
      "doi": ""
    },
    {
      "text": "Stuart Moran, Nils Jäger, Holger Schnädelbach, and Kevin Glover. 2016. ExoPranayama: a biofeedback-driven actuated environment for supporting yoga breathing practices. Personal and Ubiquitous Computing 20, 2 (Jan. 2016), 261–275. https://doi.org/10.1007/s00779-016-0910-3",
      "doi": "10.1007/s00779-016-0910-3"
    },
    {
      "text": "Katherine Moriwaki. 2002. Recoil. Retrieved September 8, 2021 from http://www.kakirine.com/?p=14",
      "doi": ""
    },
    {
      "text": "Nima Motamedi. 2007. Keep in touch: a tactile-vision intimate interface. In Proceedings of the 1st international conference on Tangible and embedded interaction. 21–22.",
      "doi": "10.1145/1226969.1226974"
    },
    {
      "text": "Florian Mueller, Sophie Stellmach, Saul Greenberg, Andreas Dippon, Susanne Boll, Jayden Garner, Rohit Khot, Amani Naseem, and David Altimira. 2014. Proxemics play: understanding proxemics for designing digital play experiences. In Proceedings of the 2014 conference on Designing interactive systems. ACM, Vancouver BC Canada, 533–542. https://doi.org/10.1145/2598510.2598532",
      "doi": "10.1145/2598510.2598532"
    },
    {
      "text": "Florian ’Floyd’ Mueller, Frank Vetere, Martin R. Gibbs, Jesper Kjeldskov, Sonja Pedell, and Steve Howard. 2005. Hug over a Distance. In CHI ’05 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’05). ACM, New York, NY, USA, 1673–1676. https://doi.org/10.1145/1056808.1056994",
      "doi": ""
    },
    {
      "text": "Craig D. Murray and Judith Sixsmith. 1999. The Corporeal Body in Virtual Reality. Ethos 27, 3 (1999), 315–343. https://www.jstor.org/stable/640592 Publisher: [American Anthropological Association, Wiley].",
      "doi": ""
    },
    {
      "text": "Rebecca Nowland, Elizabeth A. Necka, and John T. Cacioppo. 2018. Loneliness and Social Internet Use: Pathways to Reconnection in a Digital World?Perspectives on Psychological Science 13, 1 (Jan. 2018), 70–87. https://doi.org/10.1177/1745691617713052",
      "doi": ""
    },
    {
      "text": "Claudia Núñez Pacheco and Lian Loke. 2020. Getting into someone else’s soul: communicating embodied experience. Digital Creativity 31, 4 (Oct. 2020), 245–258. https://doi.org/10.1080/14626268.2020.1835987",
      "doi": ""
    },
    {
      "text": "Catherine S Oh, Jeremy N Bailenson, and Gregory F Welch. 2018. A systematic review of social presence: Definition, antecedents, and implications. Frontiers in Robotics and AI 5 (2018), 114.",
      "doi": ""
    },
    {
      "text": "Thomas Olsson, Pradthana Jarusriboonchai, Pawel Woźniak, Susanna Paasovaara, Kaisa Väänänen, and Andrés Lucero. 2020. Technologies for Enhancing Collocated Social Interaction: Review of Design Solutions and Approaches. Computer Supported Cooperative Work (CSCW) 29, 1 (April 2020), 29–83. https://doi.org/10.1007/s10606-019-09345-0",
      "doi": "10.1007/s10606-019-09345-0"
    },
    {
      "text": "Beste Özcan and Valerio Sperati. 2020. Lokahi: The Wearable Body Pillow to Foster an Intimate Interaction Between Two Users Through Their Heartbeat Awareness. In HCI International 2020 Late Breaking Posters(Communications in Computer and Information Science), Constantine Stephanidis, Margherita Antona, and Stavroula Ntoa (Eds.). Springer International Publishing, Cham, 421–429. https://doi.org/10.1007/978-3-030-60703-6_54",
      "doi": ""
    },
    {
      "text": "Susanna Paasovaara, Andrés Lucero, and Thomas Olsson. 2016. Outlining the design space of playful interactions between nearby strangers. In Proceedings of the 20th International Academic Mindtrek Conference. ACM, Tampere Finland, 216–225. https://doi.org/10.1145/2994310.2994344",
      "doi": "10.1145/2994310.2994344"
    },
    {
      "text": "Maria-Paola Paladino, Mara Mazzurega, Francesco Pavani, and Thomas W. Schubert. 2010. Synchronous Multisensory Stimulation Blurs Self-Other Boundaries. Psychological Science 21, 9 (Sept. 2010), 1202–1207. https://doi.org/10.1177/0956797610379234",
      "doi": ""
    },
    {
      "text": "Maja Petric. 2018. We are all Made of Light. Retrieved September 8, 2021 from https://www.majapetric.com/waamol1",
      "doi": ""
    },
    {
      "text": "Sydney Pratte, Anthony Tang, and Lora Oehlberg. 2021. Evoking Empathy: A Framework for Describing Empathy Tools. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction(Salzburg, Austria) (TEI ’21). Association for Computing Machinery, New York, NY, USA, Article 25, 15 pages. https://doi.org/10.1145/3430524.3440644",
      "doi": "10.1145/3430524.3440644"
    },
    {
      "text": "Sara Price, Nadia Bianchi-Berthouze, Carey Jewitt, Nikoleta Yiannoutsou, Katerina Fotopoulou, Svetlana Dajic, Juspreet Virdee, Yixin Zhao, Douglas Atkinson, and Frederik Brudy. 2022. The making of meaning through dyadic haptic affective touch. ACM Transactions on Computer-Human Interaction 29, 3(2022), 1–42.",
      "doi": "10.1145/3490494"
    },
    {
      "text": "René Proyer. 2013. The well-being of playful adults: Adult playfulness, subjective well-being, physical well-being, and the pursuit of enjoyable activities. The European Journal of Humour Research 1, 1 (March 2013), 84–98. https://doi.org/10.7592/EJHR2013.1.1.proyer Number: 1.",
      "doi": ""
    },
    {
      "text": "Mirjana Prpa, Ekaterina R. Stepanova, Thecla Schiphorst, Bernhard E. Riecke, and Philippe Pasquier. 2020. Inhaling and Exhaling: How Technologies Can Perceptually Extend Our Breath Awareness. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi-org.proxy.lib.sfu.ca/10.1145/3313831.3376183",
      "doi": ""
    },
    {
      "text": "María Puig de la Bellacasa. 2017. Matters of care: speculative ethics in more than human worlds. OCLC: 1078220020.",
      "doi": ""
    },
    {
      "text": "Chao Ying Qin, Jun-Ho Choi, Marios Constantinides, Luca Maria Aiello, and Daniele Quercia. 2020. Having a Heart Time? A Wearable-based Biofeedback System. In 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, Oldenburg Germany, 1–4. https://doi.org/10.1145/3406324.3410539",
      "doi": "10.1145/3406324.3410539"
    },
    {
      "text": "Denise Quesnel, Ekaterina R Stepanova, Ivan A Aguilar, Patrick Pennefather, and Bernhard E Riecke. 2018. Creating AWE: artistic and scientific practices in research-based design for exploring a profound immersive installation. In 2018 IEEE Games, Entertainment, Media Conference (GEM). IEEE, 1–207.",
      "doi": ""
    },
    {
      "text": "Matthew Ratcliffe. 2008. Touch and Situatedness. International Journal of Philosophical Studies 16, 3 (July 2008), 299–322. https://doi.org/10.1080/09672550802110827",
      "doi": ""
    },
    {
      "text": "Johan Redstrom. 2017. Making Design Theory. MIT Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Harry T. Reis and Shaver, Phillip. 1988. Intimacy as an interpersonal process. In Relationships, Well-Being and Behaviour. Routledge. https://doi.org/10.4324/9780203732496-5 Pages: 113-143 Publication Title: Relationships, Well-Being and Behaviour.",
      "doi": ""
    },
    {
      "text": "Harry T. Reis, Kennon M. Sheldon, Shelly L. Gable, Joseph Roscoe, and Richard M. Ryan. 2000. Daily Well-Being: The Role of Autonomy, Competence, and Relatedness. Personality and Social Psychology Bulletin 26, 4 (April 2000). https://doi.org/10.1177/0146167200266002",
      "doi": ""
    },
    {
      "text": "Miriam Rennung and Anja S. Göritz. 2016. Prosocial consequences of interpersonal synchrony: A meta-analysis. Zeitschrift für Psychologie 224, 3 (2016), 168–189. https://doi.org/10.1027/2151-2604/a000252",
      "doi": ""
    },
    {
      "text": "Raquel Breejon Robinson, Elizabeth Reid, Ansgar E. Depping, Regan Mandryk, James Collin Fey, and Katherine Isbister. 2019. ’In the Same Boat’,: A Game of Mirroring Emotions for Enhancing Social Play. ACM, INT011. https://doi.org/10.1145/3290607.3313268",
      "doi": ""
    },
    {
      "text": "Raquel Breejon Robinson, Elizabeth Reid, James Collin Fey, Ansgar E Depping, Katherine Isbister, and Regan L Mandryk. 2020. Designing and Evaluating’In the Same Boat’, A Game of Embodied Synchronization for Enhancing Social Play. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3313831.3376433"
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2000. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being.American psychologist 55, 1 (2000), 68.",
      "doi": ""
    },
    {
      "text": "M. Salminen, S. JÃ¡rvelÃ¡, A. Ruonala, V. Harjunen, G. Jacucci, J. Hamari, and N. Ravaja. 2019. Evoking Physiological Synchrony and Empathy Using Social VR with Biofeedback. IEEE Transactions on Affective Computing(2019), 1–11. https://doi.org/10.1109/TAFFC.2019.2958657 Conference Name: IEEE Transactions on Affective Computing.",
      "doi": ""
    },
    {
      "text": "Robert M. Sapolsky. 2017. Behave: The Biology of Humans at Our Best and Worst. Penguin. Google-Books-ID: sJKoDAAAQBAJ.",
      "doi": ""
    },
    {
      "text": "Robert M. Sapolsky. 2018. Doubled-Edged Swords in the Biology of Conflict. Frontiers in Psychology 9 (2018). https://doi.org/10.3389/fpsyg.2018.02625 Publisher: Frontiers.",
      "doi": ""
    },
    {
      "text": "Betty Sargeant, Justin Dwyer, and Florian ’Floyd’ Mueller. 2020. Designing for Virtual Touch: A Real-Time Co-Created Online Art Experience. In Extended Abstracts of the 2020 Annual Symposium on Computer-Human Interaction in Play. ACM, Virtual Event Canada, 129–133. https://doi.org/10.1145/3383668.3419936",
      "doi": "10.1145/3383668.3419936"
    },
    {
      "text": "Thecla Schiphorst. 2005. exhale: (breath between bodies). In SIGGRAPH ’05 Emerging technologies. ACM, Los Angeles, CA, 1.",
      "doi": ""
    },
    {
      "text": "Thecla Schiphorst. 2006. Breath, skin and clothing: Using wearable technologies as an interface into ourselves. International Journal of Performance Arts and Digital Media 2, 2 (Jan. 2006), 171–186. https://doi.org/10.1386/padm.2.2.171_1",
      "doi": ""
    },
    {
      "text": "Thecla Schiphorst and Kristina Andersen. 2004. Between Bodies: using Experience Modeling to Create Gestural Protocols for Physiological Data Transfer. Vienna, Austria, 8.",
      "doi": ""
    },
    {
      "text": "Thecla Schiphorst, Frank Nack, Michiel KauwATjoe, Simon de Bakker, Stock, Lora Aroyo, Angel Perez Rosillio, Hielke Schut, and Norm Jaffe. 2007. PillowTalk: can we afford intimacy?. In Proceedings of the 1st international conference on Tangible and embedded interaction(TEI ’07). Association for Computing Machinery, New York, NY, USA, 23–30. https://doi.org/10.1145/1226969.1226975",
      "doi": "10.1145/1226969.1226975"
    },
    {
      "text": "Raymond Scupin. 1997. The KJ method: A technique for analyzing data derived from Japanese ethnology. Human organization 56, 2 (1997), 233–237.",
      "doi": ""
    },
    {
      "text": "Samarth Singhal, Carman Neustaedter, Yee Loong Ooi, Alissa N. Antle, and Brendan Matkin. 2017. Flex-N-Feel: The Design and Evaluation of Emotive Gloves for Couples to Support Touch Over Distance. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). ACM, New York, NY, USA, 98–110. https://doi.org/10.1145/2998181.2998247",
      "doi": "10.1145/2998181.2998247"
    },
    {
      "text": "Petr Slovák, Joris Janssen, and Geraldine Fitzpatrick. 2012. Understanding heart rate sharing: towards unpacking physiosocial space. In Proceedings of the SIGCHI conference on human factors in computing systems. 859–868.",
      "doi": "10.1145/2207676.2208526"
    },
    {
      "text": "Meehae Song, Tamiko Tadeo, Ioana Sandor, Servet Ulas, and Steve DiPaola. 2019. BioFlockVR: exploring visual entrainment through amorphous nature phenomena in bio-responsive multi-immersant VR interactives. In Proceedings of the 2nd International Conference on Image and Graphics Processing - ICIGP ’19. ACM Press, Singapore, Singapore, 150–154. https://doi.org/10.1145/3313950.3313978",
      "doi": "10.1145/3313950.3313978"
    },
    {
      "text": "Dominic Spohr. 2017. Fake news and ideological polarization: Filter bubbles and selective exposure on social media. Business Information Review 34, 3 (Sept. 2017), 150–160. https://doi.org/10.1177/0266382117722446",
      "doi": ""
    },
    {
      "text": "Jaakko Stenros, Janne Paavilainen, and Frans Mäyrä. 2009. The many faces of sociability and social play in games. In Proceedings of the 13th International MindTrek Conference: Everyday Life in the Ubiquitous Era on - MindTrek ’09. ACM Press, Tampere, Finland, 82. https://doi.org/10.1145/1621841.1621857",
      "doi": "10.1145/1621841.1621857"
    },
    {
      "text": "Ekaterina R Stepanova, John Desnoyers-Stewart, Philippe Pasquier, and Bernhard E Riecke. 2020. JeL: Breathing Together to Connect with Others and Nature. In ACM DIS. ACM, Eindhoven, Netherlands, 1–14. https://youtu.be/vwb4jX4x-c4",
      "doi": ""
    },
    {
      "text": "Ekaterina R. Stepanova, Denise Quesnel, and Bernhard E. Riecke. 2019. Understanding AWE: Can a Virtual Journey, Inspired by the Overview Effect, Lead to an Increased Sense of Interconnectedness?Frontiers in Digital Humanities 6 (2019). https://doi.org/10.3389/fdigh.2019.00009",
      "doi": ""
    },
    {
      "text": "Erik Stolterman. 2008. The nature of design practice and implications for interaction design research. International Journal of Design 2, 1 (2008).",
      "doi": ""
    },
    {
      "text": "Anna Ståhl, Martin Jonsson, Johanna Mercurio, Anna Karlsson, Kristina Höök, and Eva-Carin Banka Johnson. 2016. The Soma Mat and Breathing Light. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’16). ACM, New York, NY, USA, 305–308. https://doi.org/10.1145/2851581.2889464",
      "doi": "10.1145/2851581.2889464"
    },
    {
      "text": "Xiaotian Sun and Kiyoshi Tomimatsu. 2017. Breath Is to Be Perceived - Breathing Signal Sharing Involved in Remote Emotional Communication. In Distributed, Ambient and Pervasive Interactions(Lecture Notes in Computer Science), Norbert Streitz and Panos Markopoulos (Eds.). Springer International Publishing, 472–481.",
      "doi": ""
    },
    {
      "text": "Henri Tajfel. 1970. Experiments in Intergroup Discrimination. Scientific American 223, 5 (1970), 96–103. https://www.jstor.org/stable/24927662 Publisher: Scientific American, a division of Nature America, Inc.",
      "doi": ""
    },
    {
      "text": "Shogo Tanaka. 2015. Intercorporeality as a theory of social cognition. Theory & Psychology 25, 4 (Aug. 2015), 455–472. https://doi.org/10.1177/0959354315583035",
      "doi": ""
    },
    {
      "text": "Bronwyn Tarr, Jacques Launay, and Robin I. M. Dunbar. 2014. Music and social bonding: “self-other” merging and neurohormonal mechanisms. Frontiers in Psychology 5 (2014). https://doi.org/10.3389/fpsyg.2014.01096",
      "doi": ""
    },
    {
      "text": "Alex S Taylor. 2009. Machine intelligence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2109–2118.",
      "doi": "10.1145/1518701.1519022"
    },
    {
      "text": "Nađa Terzimehić, Renate Häuslschmid, Heinrich Hussmann, and m.c. schraefel. 2019. A Review & Analysis of Mindfulness Research in HCI: Framing Current Lines of Research and Future Opportunities. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–13. https://doi.org/10.1145/3290605.3300687",
      "doi": "10.1145/3290605.3300687"
    },
    {
      "text": "National Theatre. 2020. Draw Me Closer. Retrieved September 8, 2021 from https://www.nationaltheatre.org.uk/immersive/projects/draw-me-close",
      "doi": ""
    },
    {
      "text": "Alison Tonkin and Julia Whitaker. 2021. Play and playfulness for health and wellbeing: A panacea for mitigating the impact of coronavirus (COVID 19). Social Sciences & Humanities Open 4, 1 (Jan. 2021), 100142. https://doi.org/10.1016/j.ssaho.2021.100142",
      "doi": ""
    },
    {
      "text": "Sonja Utz. 2015. The function of self-disclosure on social network sites: Not only intimate, but also positive and entertaining self-disclosures increase the feeling of connection. Computers in Human Behavior 45 (April 2015), 1–10. https://doi.org/10.1016/j.chb.2014.11.076",
      "doi": ""
    },
    {
      "text": "Josca van Houwelingen-Snippe, Thomas J. L. van Rompay, and Somaya Ben Allouch. 2020. Feeling Connected after Experiencing Digital Nature: A Survey Study. International Journal of Environmental Research and Public Health 17, 18 (Jan. 2020), 6879. https://doi.org/10.3390/ijerph17186879 Number: 18 Publisher: Multidisciplinary Digital Publishing Institute.",
      "doi": ""
    },
    {
      "text": "Julia Werner, Reto Wettach, and Eva Hornecker. 2008. United-pulse: feeling your partner’s pulse. In Proceedings of the 10th international conference on Human computer interaction with mobile devices and services. 535–538.",
      "doi": "10.1145/1409240.1409338"
    },
    {
      "text": "Mary E. Wheeler and Susan T. Fiske. 2005. Controlling Racial Prejudice: Social-Cognitive Goals Affect Amygdala and Stereotype Activation. Psychological Science 16, 1 (Jan. 2005), 56–63. https://doi.org/10.1111/j.0956-7976.2005.00780.x",
      "doi": ""
    },
    {
      "text": "Brenda K. Wiederhold. 2020. Connecting Through Technology During the Coronavirus Disease 2019 Pandemic: Avoiding “Zoom Fatigue”. Cyberpsychology, Behavior, and Social Networking 23, 7 (July 2020), 437–438. https://doi.org/10.1089/cyber.2020.29188.bkw",
      "doi": ""
    },
    {
      "text": "Valtteri Wikström, Tommi Makkonen, and Katri Saarikivi. 2017. SynKin: A Game for Intentionally Synchronizing Biosignals. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’17). Association for Computing Machinery, Denver, Colorado, USA, 3005–3011. https://doi.org/10.1145/3027063.3053195",
      "doi": "10.1145/3027063.3053195"
    },
    {
      "text": "L. E. Williams and J. A. Bargh. 2008. Experiencing Physical Warmth Promotes Interpersonal Warmth. Science 322, 5901 (Oct. 2008), 606–607. https://doi.org/10.1126/science.1162548",
      "doi": ""
    },
    {
      "text": "Harry Robert Wilson. 2020. New ways of seeing, feeling, being: intimate encounters in virtual reality performance. International Journal of Performance Arts and Digital Media 16, 2 (May 2020), 114–133. https://doi.org/10.1080/14794713.2020.1770531",
      "doi": ""
    },
    {
      "text": "R Michael Winters, Bruce N Walker, and Grace Leslie. 2021. Can You Hear My Heartbeat?: Hearing an Expressive Biosignal Elicits Empathy. (2021), 11.",
      "doi": ""
    },
    {
      "text": "Ludwig Wittgenstein. 1968. Philosophical investigations. Basil Blackwell, Oxford.",
      "doi": ""
    },
    {
      "text": "Claes Wohlin. 2014. Guidelines for snowballing in systematic literature studies and a replication in software engineering. In Proceedings of the 18th international conference on evaluation and assessment in software engineering. 1–10.",
      "doi": "10.1145/2601248.2601268"
    },
    {
      "text": "David Bryce Yaden, Jonathan Haidt, Ralph W. Hood, David R. Vago, and Andrew B. Newberg. 2017. The varieties of self-transcendent experience.Review of General Psychology 21, 2 (2017), 143–160. https://doi.org/10.1037/gpr0000102",
      "doi": ""
    },
    {
      "text": "Farnaz Zangouei, Mohammad Ali Babazadeh, Kristina Höok, Tim Tijs, Gert-Jan de Vries, and Joyce Westerink. 2010. How to Stay in the Emotional Rollercoaster: Lessons Learnt from Designing EmRoll. 10.",
      "doi": ""
    }
  ]
}