{
  "doi": "10.1145/3491102.3517512",
  "title": "Investigating Clutching Interactions for Touchless Medical Imaging Systems",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "Touchless input could transform clinical activity by allowing health professionals direct control over medical imaging systems in a sterile manner. Currently, users face the issues of being unable to directly manipulate imaging in aseptic environments, as well as needing to touch shared surfaces in other hospital areas. Unintended input is a key challenge for touchless interaction and could be especially disruptive in medical contexts. We evaluated four clutching techniques with 34 health professionals, measuring interaction performance and interviewing them to obtain insight into their views on clutching, and touchless control of medical imaging. As well as exploring the performance of the different clutching techniques, our analysis revealed an appetite for reliable touchless interfaces, a strong desire to reduce shared surface contact, and suggested potential improvements such as combined authentication and touchless control. Our findings can inform the development of novel touchless medical systems and identify challenges for future research.",
  "tags": [
    "Clutching",
    "Midas Touch",
    "Touchless Interaction",
    "Medical Imaging Systems",
    "Gestures",
    "PACS"
  ],
  "authors": [
    {
      "name": "Sean Cronin",
      "institution": "Trinity College Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239467",
      "orcid": "missing"
    },
    {
      "name": "Euan Freeman",
      "institution": "School of Computing Science, University of Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548012975",
      "orcid": "missing"
    },
    {
      "name": "Gavin Doherty",
      "institution": "School of Computer Science and Statistics, Trinity College Dublin, Ireland",
      "img": "/do/10.1145/contrib-81100175529/rel-imgonly/81100175529.jpg",
      "acmid": "81100175529",
      "orcid": "0000-0002-9617-7008"
    }
  ],
  "references": [
    {
      "text": "Mohamed Asni, Daniel Shapiro, Miodrag Bolic, Tony Mathew, and Leor Grebler. 2018. Speaker Differentiation Using a Convolutional Autoencoder. 2018 IEEE International Conference on the Science of Electrical Engineering in Israel (ICSEE), 1–5. https://doi.org/10.1109/ICSEE.2018.8646307",
      "doi": ""
    },
    {
      "text": "Thomas Baudel and Michel Beaudouin-Lafon. 1993. Charade: Remote Control of Objects Using Free-Hand Gestures. Commun. ACM 36, 7 (1993), 28–35. https://doi.org/10.1145/159544.159562",
      "doi": "10.1145/159544.159562"
    },
    {
      "text": "Victoria Bellotti, Maribeth Back, W. Keith Edwards, Rebecca E. Grinter, Austin Henderson, and Cristina Lopes. 2002. Making Sense of Sensing Systems: Five Questions for Designers and Researchers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’02. ACM Press, 415–422. https://doi.org/10.1145/503376.503450",
      "doi": "10.1145/503376.503450"
    },
    {
      "text": "Richard A. Bolt. 1980. ”Put-That-There”: Voice and Gesture at the Graphics Interface. ACM SIGGRAPH Computer Graphics 14, 3 (1980), 262–270. https://doi.org/10.1145/800250.807503",
      "doi": "10.1145/965105.807503"
    },
    {
      "text": "Seán Cronin and Gavin Doherty. 2019. Touchless computer interfaces in hospitals: A review. Health Informatics Journal 25, 4 (2019), 1325–1342. https://doi.org/10.1177/1460458217748342",
      "doi": ""
    },
    {
      "text": "Séan Cronin, Bridget Kane, and Gavin Doherty. 2021. A Qualitative Analysis of the Needs and Experiences of Hospital-based Clinicians when Accessing Medical Imaging. Journal of Digital Imaging (4 2021). https://doi.org/10.1007/s10278-021-00446-1",
      "doi": ""
    },
    {
      "text": "David Fleer and Christian Leichsenring. 2012. MISO: A Context-Sensitive Multimodal Interface for Smart Objects Based on Hand Gestures and Finger Snaps. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology - UIST ’12. ACM Press, 93–94. https://doi.org/10.1145/2380296.2380338",
      "doi": "10.1145/2380296.2380338"
    },
    {
      "text": "Euan Freeman, Stephen Brewster, and Vuokko Lantz. 2016. Do That, There: An Interaction Technique for Addressing In-Air Gesture Systems. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16. ACM Press, 2319–2331. https://doi.org/10.1145/2858036.2858308",
      "doi": "10.1145/2858036.2858308"
    },
    {
      "text": "Euan Freeman, Gareth Griffiths, and Stephen Brewster. 2017. Rhythmic Micro-Gestures: Discreet Interaction On-the-Go. In Proceedings of 19th ACM International Conference on Multimodal Interaction - ICMI ’17. ACM, 115–119. https://doi.org/10.1145/3136755.3136815",
      "doi": "10.1145/3136755.3136815"
    },
    {
      "text": "Euan Freeman, Dong-Bach Vo, and Stephen Brewster. 2019. HaptiGlow: Helping Users Position their Hands for Better Mid-Air Gestures and Ultrasound Haptic Feedback. In Proceedings of the IEEE World Haptics Conference(WHC ’19). IEEE, 289–294. https://doi.org/10.1109/WHC.2019.8816092",
      "doi": ""
    },
    {
      "text": "Euan Freeman, Julie Williamson, Sriram Subramanian, and Stephen Brewster. 2018. Point-and-Shake: Selecting from Levitating Object Displays. In Proceedings of the 36th Annual ACM Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Paper 18. https://doi.org/10.1145/3173574.3173592",
      "doi": "10.1145/3173574.3173592"
    },
    {
      "text": "Nicola K Gale, Gemma Heath, Elaine Cameron, Sabina Rashid, and Sabi Redwood. 2013. Using the framework method for the analysis of qualitative data in multi-disciplinary health research. BMC Medical Research Methodology 13 (12 2013). Issue 1. https://doi.org/10.1186/1471-2288-13-117",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A. Hancock and Najmedin Meshkati (Eds.). Advances in Psychology, Vol. 52. North-Holland, 139–183. https://doi.org/10.1016/S0166-4115(08)62386-9",
      "doi": ""
    },
    {
      "text": "Benjamin Hatscher and Christian Hansen. 2018. Hand, Foot or Voice: Alternative Input Modalities for Touchless Interaction in the Medical Domain. In Proceedings of the 20th ACM International Conference on Multimodal Interaction (Boulder, CO, USA) (ICMI ’18). Association for Computing Machinery, New York, NY, USA, 145–153. https://doi.org/10.1145/3242969.3242971",
      "doi": "10.1145/3242969.3242971"
    },
    {
      "text": "Julian Hettig, Patrick Saalfeld, Maria Luz, Mathias Becker, Martin Skalej, and Christian Hansen. 2017. Comparison of gesture and conventional interaction techniques for interventional neuroradiology. International Journal of Computer Assisted Radiology and Surgery 12 (9 2017). Issue 9. https://doi.org/10.1007/s11548-017-1523-7",
      "doi": ""
    },
    {
      "text": "Julian Hettig, Patrick Saalfeld, Maria Luz, Mathias Becker, Martin Skalej, and Christian Hansen. 2017. Comparison of gesture and conventional interaction techniques for interventional neuroradiology. International journal of computer assisted radiology and surgery 12, 9(2017), 1643–1653.",
      "doi": ""
    },
    {
      "text": "Ken Hinckley, Randy Pausch, John C. Goble, and Neal F. Kassell. 1994. A Survey of Design Issues in Spatial Input. In Proceedings of the 7th Annual ACM Symposium on User Interface Software and Technology - UIST ’94. ACM Press, 213–222. https://doi.org/10.1145/192426.192501",
      "doi": "10.1145/192426.192501"
    },
    {
      "text": "Ken Hinckley, Randy Pausch, John C. Goble, and Neal F. Kassell. 1994. Passive real-world interface props for neurosurgical visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’94. ACM Press, 452–458. https://doi.org/10.1145/259963.260443",
      "doi": "10.1145/191666.191821"
    },
    {
      "text": "Behrang Homayoon, John Chung, Ripal T. Gandhi, and David M. Liu. 2020. Early clinical experience with a touchless image navigation interface for the endovascular suite. Minimally Invasive Therapy & Allied Technologies 29 (6 2020). Issue 3. https://doi.org/10.1080/13645706.2019.1612440",
      "doi": ""
    },
    {
      "text": "Mithun Jacob, Christopher Cange, Rebecca Packer, and Juan P Wachs. 2012. Intention, context and gesture recognition for sterile MRI navigation in the operating room. In Progress in Pattern Recognition, Image Analysis, Computer Vision, and Applications - CIARP ’12. Springer, 220–227. https://doi.org/10.1007/978-3-642-33275-3_27",
      "doi": ""
    },
    {
      "text": "Mithun George Jacob, Juan Pablo Wachs, and Rebecca A Packer. 2012. Hand-gesture-based sterile interface for the operating room using contextual cues for the navigation of radiological images. Journal of the American Medical Informatics Association 20, e1 (12 2012), e183–e186. https://doi.org/10.1136/amiajnl-2012-001212",
      "doi": ""
    },
    {
      "text": "Shahram Jalaliniya, Jeremiah Smith, Miguel Sousa, Lars Büthe, and Thomas Pederson. 2013. Touch-Less Interaction with Medical Images Using Hand & Foot Gestures. In Proceedings of the 2013 ACM Conference on Pervasive and Ubiquitous Computing Adjunct Publication(Zurich, Switzerland) (UbiComp ’13 Adjunct). Association for Computing Machinery, New York, NY, USA, 1265–1274. https://doi.org/10.1145/2494091.2497332",
      "doi": "10.1145/2494091.2497332"
    },
    {
      "text": "Rose Johnson, Kenton O’Hara, Abigail Sellen, Claire Cousins, and Antonio Criminisi. 2011. Exploring the Potential for Touchless Interaction in Image-Guided Interventional Radiology. Association for Computing Machinery, New York, NY, USA, 3323–3332. https://doi.org/10.1145/1978942.1979436",
      "doi": ""
    },
    {
      "text": "Rick Kjeldsen and Jacob Hartman. 2001. Design issues for vision-based computer interaction systems. In Proceedings of the 2001 workshop on Perceptive User Interfaces - PUI ’01. ACM Press, 1–8. https://doi.org/10.1145/971478.971511",
      "doi": "10.1145/971478.971511"
    },
    {
      "text": "Hannah Limerick. 2020. Call to Interact: Communicating Interactivity and Affordances for Contactless Gesture Controlled Public Displays. In Proceedings of the 9TH ACM International Symposium on Pervasive Displays (Manchester, United Kingdom) (PerDis ’20). Association for Computing Machinery, New York, NY, USA, 63–70. https://doi.org/10.1145/3393712.3395338",
      "doi": "10.1145/3393712.3395338"
    },
    {
      "text": "Naveen Madapana, Glebys Gonzalez, Rahul Taneja, Richard Rodgers, Lingsong Zhang, and Juan Wachs. 2019. Preference elicitation: Obtaining gestural guidelines for PACS in neurosurgery. International Journal of Medical Informatics 130 (10 2019). https://doi.org/10.1016/j.ijmedinf.2019.07.013",
      "doi": ""
    },
    {
      "text": "Helena M. Mentis, Kenton O’Hara, Gerardo Gonzalez, Abigail Sellen, Robert Corish, Antonio Criminisi, Rikin Trivedi, and Pierre Theodore. 2015. Voice or Gesture in the Operating Room. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI EA ’15). Association for Computing Machinery, New York, NY, USA, 773–780. https://doi.org/10.1145/2702613.2702963",
      "doi": "10.1145/2702613.2702963"
    },
    {
      "text": "Helena M. Mentis, Kenton O’Hara, Abigail Sellen, and Rikin Trivedi. 2012. Interaction Proxemics and Image Use in Neurosurgery. Association for Computing Machinery, New York, NY, USA, 927–936. https://doi.org/10.1145/2207676.2208536",
      "doi": ""
    },
    {
      "text": "Andre Mewes, Bennet Hensen, Frank Wacker, and Christian Hansen. 2017. Touchless interaction with software in interventional radiology and surgery: a systematic literature review. International journal of computer assisted radiology and surgery 12, 2(2017), 291–305.",
      "doi": ""
    },
    {
      "text": "Kenton O’Hara, Gerardo Gonzalez, Graeme Penney, Abigail Sellen, Robert Corish, Helena Mentis, Andreas Varnavas, Antonio Criminisi, Mark Rouncefield, Neville Dastur, 2014. Interactional order and constructed ways of seeing with touchless imaging systems in surgery. Computer Supported Cooperative Work (CSCW) 23, 3 (2014), 299–337.",
      "doi": "10.1007/s10606-014-9203-4"
    },
    {
      "text": "Kenton O’Hara, Gerardo Gonzalez, Abigail Sellen, Graeme Penney, Andreas Varnavas, Helena Mentis, Antonio Criminisi, Robert Corish, Mark Rouncefield, Neville Dastur, and Tom Carrell. 2014. Touchless Interaction in Surgery. CACM 57, 1 (2014), 70–77. https://doi.org/10.1145/2541883.2541899",
      "doi": "10.1145/2541883.2541899"
    },
    {
      "text": "Jonathan A. Otter, Saber Yezli, and Gary L. French. 2014. The Role of Contaminated Surfaces in the Transmission of Nosocomial Pathogens. Springer International Publishing, Cham, 27–58. https://doi.org/10.1007/978-3-319-08057-4_3",
      "doi": ""
    },
    {
      "text": "Stefanie TL Pöhlmann, Elaine F Harkness, Christopher J Taylor, and Susan M Astley. 2016. Evaluation of Kinect 3D sensor for healthcare imaging. Journal of medical and biological engineering 36, 6(2016), 857–870.",
      "doi": ""
    },
    {
      "text": "Julia Schwarz, Charles Claudius Marais, Tommer Leyvand, Scott E. Hudson, and Jennifer Mankoff. 2014. Combining Body Pose, Gaze, and Gesture to Determine Intention to Interact in Vision-Based Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’14. ACM Press, 3443–3452. https://doi.org/10.1145/2556288.2556989",
      "doi": "10.1145/2556288.2556989"
    },
    {
      "text": "Matt Strickland, Jamie Tremaine, Greg Brigley, and Calvin Law. 2013. Using a depth-sensing infrared camera system to access and manipulate medical imaging from within the sterile operating field. Canadian Journal of Surgery 56, 3 (2013), E1. https://doi.org/10.1503/cjs.035311",
      "doi": ""
    },
    {
      "text": "Hemant Bhaskar Surale, Fabrice Matulic, and Daniel Vogel. 2019. Experimental Analysis of Barehand Mid-Air Mode-Switching Techniques in Virtual Reality. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300426",
      "doi": ""
    },
    {
      "text": "Justin H. Tan, Cherng Chao, Mazen Zawaideh, Anne C. Roberts, and Thomas B. Kinney. 2013. Informatics in Radiology: Developing a Touchless User Interface for Intraoperative Image Control during Interventional Radiology Procedures. RadioGraphics 33, 2 (2013), E61–E70. https://doi.org/10.1148/rg.332125101",
      "doi": ""
    },
    {
      "text": "Robert Walter, Gilles Bailly, and Jörg Müller. 2013. StrikeAPose: Revealing Mid-Air Gestures on Public Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’13. ACM Press, 841–850. https://doi.org/10.1145/2470654.2470774",
      "doi": "10.1145/2470654.2470774"
    },
    {
      "text": "Andrew D. Wilson. 2008. Robust computer vision-based detection of pinching for one and two-handed gesture input. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology - UIST ’06. ACM Press, 255–258. https://doi.org/10.1145/1166253.1166292",
      "doi": ""
    },
    {
      "text": "Andrew D. Wilson and Hrvoje Benko. 2010. Combining Multiple Depth Cameras and Projectors for Interactions on, above and between Surfaces. In Proceedings of the 23nd Annual ACM Symposium on User Interface Software and Technology (New York, New York, USA) (UIST ’10). Association for Computing Machinery, New York, NY, USA, 273–282. https://doi.org/10.1145/1866029.1866073",
      "doi": "10.1145/1866029.1866073"
    },
    {
      "text": "Ambreen Zaman, Lars Reisig, Anke Verena Reinschluessel, Huseyin Bektas, Dirk Weyhe, Marc Herrlich, Tanja Döring, and Rainer Malaka. 2018. An Interactive Shoe for Surgeons: Hand-Free Interaction with Medical 2D Data. Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3170427.3188606",
      "doi": "10.1145/3170427.3188606"
    },
    {
      "text": "Tian Zhou and Juan Pablo Wachs. 2018. Early prediction for physical human robot collaboration in the operating room. Autonomous Robots 42 (6 2018), 977–995. Issue 5. https://doi.org/10.1007/s10514-017-9670-9",
      "doi": ""
    }
  ]
}