{
  "doi": "10.1145/3491102.3517712",
  "title": "RoleSeer: Understanding Informal Social Role Changes in MMORPGs via Visual Analytics",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "Massively multiplayer online role-playing games create virtual communities that support heterogeneous “social roles” determined by gameplay interaction behaviors under a specific social context. For all social roles, formal roles are pre-defined, obvious, and explicitly ascribed to the people holding the roles, whereas informal roles are not well-defined and unspoken. Identifying the informal roles and understanding their subtle changes are critical to designing sociability mechanisms. However, it is nontrivial to understand the existence and evolution of such roles due to their loosely defined, interconvertible, and dynamic characteristics. We propose a visual analytics system, RoleSeer, to investigate informal roles from the perspectives of behavioral interactions and depict their dynamic interconversions and transitions. Two cases, experts’ feedback, and a user study suggest that RoleSeer helps interpret the identified informal roles and explore the patterns behind role changes. We see our approach’s potential in investigating informal roles in a broader range of social games.",
  "authors": [
    {
      "name": "Laixin Xie",
      "institution": "School of Information Science and Technology, ShanghaiTech University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237357",
      "orcid": "missing"
    },
    {
      "name": "Ziming Wu",
      "institution": "Interactive Entertainment Group, Tencent Inc., China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161463",
      "orcid": "missing"
    },
    {
      "name": "Peng Xu",
      "institution": "User Experience Center, NetEase Inc., China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659094345",
      "orcid": "missing"
    },
    {
      "name": "Wei Li",
      "institution": "Industrial Design, Eindhoven University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659135854",
      "orcid": "missing"
    },
    {
      "name": "Xiaojuan Ma",
      "institution": "Hong Kong University of Science and Technology, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654594",
      "orcid": "0000-0002-9847-7784"
    },
    {
      "name": "Quan Li",
      "institution": "School of Information Science and Technology, ShanghaiTech University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81550194956",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bill Anderson*. 2004. Dimensions of learning and support in an online community. Open Learning: The Journal of Open, Distance and e-Learning 19, 2(2004), 183–190.",
      "doi": ""
    },
    {
      "text": "Chee Siang Ang and Panayiotis Zaphiris. 2010. Social roles of players in MMORPG guilds: A social network analytic perspective. Information, Communication & Society 13, 4 (2010), 592–614.",
      "doi": ""
    },
    {
      "text": "Daniel Archambault, Helen Purchase, and Bruno Pinaud. 2010. Animation, small multiples, and the effect of mental map preservation in dynamic graphs. IEEE transactions on visualization and computer graphics 17, 4(2010), 539–552.",
      "doi": ""
    },
    {
      "text": "Blake Ashforth. 2000. Role transitions in organizational life: An identity-based perspective. Routledge.",
      "doi": ""
    },
    {
      "text": "Benjamin Bach, Emmanuel Pietriga, and Jean-Daniel Fekete. 2013. Graphdiaries: Animated transitions andtemporal navigation for dynamic networks. IEEE transactions on visualization and computer graphics 20, 5(2013), 740–754.",
      "doi": ""
    },
    {
      "text": "Gary D Bader and Christopher WV Hogue. 2003. An automated method for finding molecular complexes in large protein interaction networks. BMC bioinformatics 4, 1 (2003), 1–27.",
      "doi": ""
    },
    {
      "text": "Richard Bartle. 1996. Hearts, clubs, diamonds, spades: Players who suit MUDs. Journal of MUD research 1, 1 (1996), 19.",
      "doi": ""
    },
    {
      "text": "Fabian Beck, Michael Burch, Stephan Diehl, and Daniel Weiskopf. 2017. A taxonomy and survey of dynamic graph visualization. In Computer Graphics Forum, Vol. 36. Wiley Online Library, 133–159.",
      "doi": ""
    },
    {
      "text": "Antoine Bordes, Nicolas Usunier, Alberto Garcia-Duran, Jason Weston, and Oksana Yakhnenko. 2013. Translating embeddings for modeling multi-relational data. In Neural Information Processing Systems (NIPS). 1–9.",
      "doi": ""
    },
    {
      "text": "Hongyun Cai, Vincent W Zheng, and Kevin Chen-Chuan Chang. 2018. A comprehensive survey of graph embedding: Problems, techniques, and applications. IEEE Transactions on Knowledge and Data Engineering 30, 9(2018), 1616–1637.",
      "doi": "10.1109/TKDE.2018.2807452"
    },
    {
      "text": "Eren Cakmak, Dominik Jäckle, Tobias Schreck, and Daniel Keim. 2020. dg2pix: Pixel-Based Visual Analysis of Dynamic Graphs1. In 2020 Visualization in Data Science (VDS). 32–41. https://doi.org/10.1109/VDS51726.2020.00008",
      "doi": ""
    },
    {
      "text": "Alessandro Canossa, Ahmad Azadvar, Casper Harteveld, Anders Drachen, and Sebastian Deterding. 2019. Influencers in multiplayer online shooters: Evidence of social contagion in playtime and social play. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3290605.3300489"
    },
    {
      "text": "Chien-Hsun Chen, Chuen-Tsai Sun, and Jilung Hsieh. 2008. Player guild dynamics and evolution in massively multiplayer online games. CyberPsychology & Behavior 11, 3 (2008), 293–301.",
      "doi": ""
    },
    {
      "text": "Alcebiades Dal Col, Paola Valdivia, Fabiano Petronetto, Fabio Dias, Claudio T Silva, and L Gustavo Nonato. 2017. Wavelet-based visual analysis of dynamic networks. IEEE transactions on visualization and computer graphics 24, 8(2017), 2456–2469.",
      "doi": ""
    },
    {
      "text": "Nicolas Ducheneaut, Nicholas Yee, Eric Nickell, and Robert J Moore. 2006. ” Alone together?” Exploring the social dynamics of massively multiplayer online games. In Proceedings of the SIGCHI conference on Human Factors in computing systems. 407–416.",
      "doi": "10.1145/1124772.1124834"
    },
    {
      "text": "Nicolas Ducheneaut, Nicholas Yee, Eric Nickell, and Robert J. Moore. 2006. ”Alone Together?”: Exploring the Social Dynamics of Massively Multiplayer Online Games. Association for Computing Machinery, New York, NY, USA, 407–416. https://doi.org/10.1145/1124772.1124834",
      "doi": ""
    },
    {
      "text": "Nicolas Ducheneaut, Nicholas Yee, Eric Nickell, and Robert J Moore. 2007. The life and death of online gaming communities: a look at guilds in world of warcraft. In Proceedings of the SIGCHI conference on Human factors in computing systems. 839–848.",
      "doi": "10.1145/1240624.1240750"
    },
    {
      "text": "Paolo Federico, Jürgen Pfeffer, Wolfgang Aigner, Silvia Miksch, and Lukas Zenk. 2012. Visual analysis of dynamic networks using change centrality. In 2012 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining. IEEE, 179–183.",
      "doi": "10.1109/ASONAM.2012.39"
    },
    {
      "text": "Malcolm Gladwell. 2006. The tipping point: How little things can make a big difference. Little, Brown.",
      "doi": ""
    },
    {
      "text": "Michael Gleicher, Danielle Albers, Rick Walker, Ilir Jusufi, Charles D Hansen, and Jonathan C Roberts. 2011. Visual comparison for information visualization. Information Visualization 10, 4 (2011), 289–309.",
      "doi": "10.1177/1473871611416549"
    },
    {
      "text": "Scott A Golder and Judith Donath. 2004. Social roles in electronic communities. Internet Research 5, 1 (2004), 19–22.",
      "doi": ""
    },
    {
      "text": "Palash Goyal, Sujit Rokka Chhetri, and Arquimedes Canedo. 2020. dyngraph2vec: Capturing network dynamics using dynamic graph representation learning. Knowledge-Based Systems 187 (2020), 104816.",
      "doi": ""
    },
    {
      "text": "Georg Groh, Holger Hanstein, and Wolfgang Wörndl. 2009. Interactively visualizing dynamic social networks with dyson. In Proc. of the IUI’09 Workshop on Visual Interfaces to the Social and the Semantic Web, Vol. 2.",
      "doi": ""
    },
    {
      "text": "Aditya Grover and Jure Leskovec. 2016. node2vec: Scalable feature learning for networks. In Proceedings of the 22nd ACM SIGKDD international conference on Knowledge discovery and data mining. 855–864.",
      "doi": "10.1145/2939672.2939754"
    },
    {
      "text": "Thomas Herrmann, Isa Jahnke, and Kai-Uwe Loser. 2004. The role concept as a basis for designing community systems.. In Coop. 163–178.",
      "doi": ""
    },
    {
      "text": "Jorge E Hirsch. 2005. An index to quantify an individual’s scientific research output. Proceedings of the National academy of Sciences 102, 46(2005), 16569–16572.",
      "doi": ""
    },
    {
      "text": "Tobias Isenberg, Petra Isenberg, Jian Chen, Michael Sedlmair, and Torsten Möller. 2013. A Systematic Review on the Practice of Evaluating Visualization. IEEE Transactions on Visualization and Computer Graphics 19, 12(2013), 2818–2827. https://doi.org/10.1109/TVCG.2013.126",
      "doi": "10.1109/TVCG.2013.126"
    },
    {
      "text": "Richard Jenkins. 2000. Categorization: Identity, social process and epistemology. Current sociology 48, 3 (2000), 7–25.",
      "doi": ""
    },
    {
      "text": "Adele Lu Jia, Siqi Shen, Ruud Van De Bovenkamp, Alexandru Iosup, Fernando Kuipers, and Dick HJ Epema. 2015. Socializing by gaming: Revealing social relationships in multiplayer online games. ACM Transactions on Knowledge Discovery from Data (TKDD) 10, 2(2015), 1–29.",
      "doi": ""
    },
    {
      "text": "Minjeong Kim, Minsuk Choi, Sunwoong Lee, Jian Tang, Haesun Park, and Jaegul Choo. 2016. Pixelsne: Visualizing fast with just enough precision via pixel-aligned stochastic neighbor embedding. arXiv preprint arXiv:1611.02568(2016).",
      "doi": ""
    },
    {
      "text": "Ben Kirman, Shaun Lawson, and Conor Linehan. 2009. Gaming on and off the social graph: The social structure of facebook games. In 2009 International Conference on Computational Science and Engineering, Vol. 4. IEEE, 627–632.",
      "doi": "10.1109/CSE.2009.266"
    },
    {
      "text": "Linda SL Lai and Efraim Turban. 2008. Groups formation and operations in the Web 2.0 environment and social networks. Group Decision and negotiation 17, 5 (2008), 387–402.",
      "doi": ""
    },
    {
      "text": "H. Lam, E. Bertini, P. Isenberg, Catherine Plaisant, and S. Carpendale. 2011. Seven guiding scenarios for information visualization evaluation. 2011-992-04 (2011/// 2011).",
      "doi": ""
    },
    {
      "text": "Quoc Le and Tomas Mikolov. 2014. Distributed representations of sentences and documents. In International conference on machine learning. PMLR, 1188–1196.",
      "doi": ""
    },
    {
      "text": "Quan Li, Kristanto Sean Njotoprawiro, Hammad Haleem, Qiaoan Chen, Chris Yi, and Xiaojuan Ma. 2018. Embeddingvis: A visual analytics approach to comparative network embedding inspection. In 2018 IEEE Conference on Visual Analytics Science and Technology (VAST). IEEE, 48–59.",
      "doi": ""
    },
    {
      "text": "Quan Li, Qiaomu Shen, Yao Ming, Peng Xu, Yun Wang, Xiaojuan Ma, and Huamin Qu. 2017. A visual analytics approach for understanding egocentric intimacy network evolution and impact propagation in MMORPGs. In 2017 IEEE Pacific Visualization Symposium (PacificVis). IEEE, 31–40.",
      "doi": ""
    },
    {
      "text": "Junhua Lu, Xiao Xie, Ji Lan, Tai-Quan Peng, Wei Chen, and Yingcai Wu. 2019. Visual Analytics of Dynamic Interplay Between Behaviors in MMORPGs. In 2019 IEEE Pacific Visualization Symposium (PacificVis). IEEE, 112–121.",
      "doi": ""
    },
    {
      "text": "Christopher Manning and Hinrich Schutze. 1999. Foundations of statistical natural language processing. MIT press.",
      "doi": "10.5555/311445"
    },
    {
      "text": "Richard L Moreland and John M Levine. 1982. Socialization in small groups: Temporal changes in individual-group relations. In Advances in experimental social psychology. Vol. 15. Elsevier, 137–192.",
      "doi": ""
    },
    {
      "text": "Elizabeth Wolfe Morrison. 2002. Newcomers’ relationships: The role of social network ties during socialization. Academy of management Journal 45, 6 (2002), 1149–1160.",
      "doi": ""
    },
    {
      "text": "Randall Munroe. 2009. Movie narrative charts. Diagram available at https://xkcd. com/657(2009).",
      "doi": ""
    },
    {
      "text": "Dan Pelleg and Andrew W. Moore. 2000. X-Means: Extending K-Means with Efficient Estimation of the Number of Clusters. In Proceedings of the Seventeenth International Conference on Machine Learning(ICML ’00). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, 727–734.",
      "doi": ""
    },
    {
      "text": "Adam Perer and Jimeng Sun. 2012. Matrixflow: temporal network visual analytics to track symptom evolution during disease progression. In AMIA annual symposium proceedings, Vol. 2012. American Medical Informatics Association, 716.",
      "doi": ""
    },
    {
      "text": "Bryan Perozzi, Rami Al-Rfou, and Steven Skiena. 2014. Deepwalk: Online learning of social representations. In Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining. 701–710.",
      "doi": "10.1145/2623330.2623732"
    },
    {
      "text": "Mathias Pohl, Florian Reitz, and Peter Birke. 2008. As time goes by: integrated visualization and analysis of dynamic networks. In Proceedings of the working conference on Advanced visual interfaces. 372–375.",
      "doi": "10.1145/1385569.1385636"
    },
    {
      "text": "Leonardo FR Ribeiro, Pedro HP Saverese, and Daniel R Figueiredo. 2017. struc2vec: Learning node representations from structural identity. In Proceedings of the 23rd ACM SIGKDD international conference on knowledge discovery and data mining. 385–394.",
      "doi": "10.1145/3097983.3098061"
    },
    {
      "text": "Ben Shneiderman. 2003. The eyes have it: A task by data type taxonomy for information visualizations. In The craft of information visualization. Elsevier, 364–371.",
      "doi": ""
    },
    {
      "text": "Daniel Smilkov, Nikhil Thorat, Charles Nicholson, Emily Reif, Fernanda B Viégas, and Martin Wattenberg. 2016. Embedding projector: Interactive visualization and interpretation of embeddings. arXiv preprint arXiv:1611.05469(2016).",
      "doi": ""
    },
    {
      "text": "William M Smith. 1966. Observations over the lifetime of a small isolated group: Structure, danger, boredom, and vision. Psychological reports 19, 2 (1966), 475–514.",
      "doi": ""
    },
    {
      "text": "Jan-Willem Strijbos, Rob L Martens, Wim MG Jochems, and Nick J Broers. 2004. The effect of functional roles on group efficiency: Using multilevel modeling and content analysis to investigate computer-supported collaboration in small groups. Small Group Research 35, 2 (2004), 195–229.",
      "doi": ""
    },
    {
      "text": "Dong Sun, Zezheng Feng, Yuanzhe Chen, Yong Wang, Jia Zeng, Mingxuan Yuan, Ting-Chuen Pong, and Huamin Qu. 2020. DFSeer: A visual analytics approach to facilitate model selection for demand forecasting. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376866"
    },
    {
      "text": "Michael Szell and Stefan Thurner. 2010. Measuring social dynamics in a massive multiplayer online game. Social networks 32, 4 (2010), 313–329.",
      "doi": ""
    },
    {
      "text": "Ka Wing Tsang, Haotian Li, Fuk Ming Lam, Yifan Mu, Yong Wang, and Huamin Qu. 2020. TradAO: A Visual Analytics System for Trading Algorithm Optimization. In 2020 IEEE Visualization Conference (VIS). IEEE, 61–65.",
      "doi": ""
    },
    {
      "text": "Stef van den Elzen, Danny Holten, Jorik Blaas, and Jarke J van Wijk. 2013. Dynamic network visualization withextended massive sequence views. IEEE transactions on visualization and computer graphics 20, 8(2013), 1087–1099.",
      "doi": ""
    },
    {
      "text": "Stef van den Elzen, Danny Holten, Jorik Blaas, and Jarke J van Wijk. 2015. Reducing snapshots to points: A visual analytics approach to dynamic network exploration. IEEE transactions on visualization and computer graphics 22, 1(2015), 1–10.",
      "doi": ""
    },
    {
      "text": "J Patrick Williams, David Kirschner, and Zahirah Suhaimi-Broder. 2014. Structural roles in massively multiplayer online games: A case study of guild and raid leaders in World of Warcraft. In Symbolic interaction and new social media. Emerald Group Publishing Limited.",
      "doi": ""
    },
    {
      "text": "D Yvette Wohn, Yu-hao Lee, Jieun Sung, and Torger Bjornrud. 2010. Building common ground and reciprocity through social network games. In CHI’10 Extended Abstracts on Human Factors in Computing Systems. 4423–4428.",
      "doi": ""
    },
    {
      "text": "Qiang Wu. 2008. The w-index: A significant improvement of the h-index. arXiv preprint arXiv:0805.4650(2008).",
      "doi": ""
    },
    {
      "text": "Meng Xia, Mingfei Sun, Huan Wei, Qing Chen, Yong Wang, Lei Shi, Huamin Qu, and Xiaojuan Ma. 2019. Peerlens: Peer-inspired interactive learning path planning in online question pool. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3290605.3300864"
    },
    {
      "text": "Jin Xu, Yubo Tao, Yuyu Yan, and Hai Lin. 2018. Exploring evolution of dynamic networks via diachronic node embeddings. IEEE transactions on visualization and computer graphics 26, 7(2018), 2387–2402.",
      "doi": ""
    },
    {
      "text": "Carl Yang, Xiaolin Shi, Luo Jie, and Jiawei Han. 2018. I know you’ll be back: Interpretable new user clustering and churn prediction on a mobile social application. In Proceedings of the 24th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining. 914–922.",
      "doi": "10.1145/3219819.3219821"
    },
    {
      "text": "Xun Zhao, Yanhong Wu, Weiwei Cui, Xinnan Du, Yuan Chen, Yong Wang, Dik Lun Lee, and Huamin Qu. 2017. Skylens: Visual analysis of skyline on multi-dimensional data. IEEE transactions on visualization and computer graphics 24, 1(2017), 246–255.",
      "doi": ""
    }
  ]
}