{
  "doi": "10.1145/3491102.3517503",
  "title": "Bridging Contextual and Methodological Gaps on the “Misinformation Beat”: Insights from Journalist-Researcher Collaborations at Speed",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "As misinformation, disinformation, and conspiracy theories increase online, so does journalism coverage of these topics. This reporting is challenging, and journalists fill gaps in their expertise by utilizing external resources, including academic researchers. This paper discusses how journalists work with researchers to report on online misinformation. Through an ethnographic study of thirty collaborations, including participant-observation and interviews with journalists and researchers, we identify five types of collaborations and describe what motivates journalists to reach out to researchers — from a lack of access to data to support for understanding misinformation context. We highlight challenges within these collaborations, including misalignment in professional work practices, ethical guidelines, and reward structures. We end with a call to action for CHI researchers to attend to this intersection, develop ethical guidelines around supporting journalists with data at speed, and offer practical approaches for researchers filling a “data mediator” role between social media and journalists.",
  "tags": [],
  "authors": [
    {
      "name": "Melinda McClure Haughey",
      "institution": "Human Centered Design and Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659588529",
      "orcid": "missing"
    },
    {
      "name": "Martina Povolo",
      "institution": "University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234825",
      "orcid": "missing"
    },
    {
      "name": "Kate Starbird",
      "institution": "Human Centered Design & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456637076",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anton Abilov, Yiqing Hua, Hana Mataov, and Mor Naaman. VoterFraud2020. Retrieved from https://github.com/sTechLab/VoterFraud2020",
      "doi": ""
    },
    {
      "text": "Paul Atkinson, Amanda Coffey, Sara Delamont, John Lofland, and Lyn Lofland. 2001. Handbook of Ethnography. SAGE Publications Ltd, 1 Oliver's Yard, 55 City Road, London England EC1Y 1SP United Kingdom. DOI:https://doi.org/10.4135/9781848608337",
      "doi": ""
    },
    {
      "text": "Karla Badillo. 2019. A Review of the CSCW 2018 “Privacy in Context” Workshop. ACM CSCW. Retrieved January 8, 2022 from https://medium.com/acm-cscw/a-review-of-the-cscw-2018-privacy-in-context-workshop-ae380040f1ec",
      "doi": ""
    },
    {
      "text": "Philip Ball and Amy Maxmen. 2020. The epic battle against coronavirus misinformation and conspiracy theories. Nature 581, 7809 (May 2020), 371–374. DOI:https://doi.org/10.1038/d41586-020-01452-z",
      "doi": ""
    },
    {
      "text": "Julian E. Barnes. 2021. Russian Disinformation Targets Vaccines and the Biden Administration. The New York Times. Retrieved September 5, 2021 from https://www.nytimes.com/2021/08/05/us/politics/covid-vaccines-russian-disinformation.html",
      "doi": ""
    },
    {
      "text": "Ladislav Bittman. 1985. The KGB and Soviet disinformation: an insider's view. Washington: Pergamon-Brassey's.",
      "doi": ""
    },
    {
      "text": "Danah Boyd and Kate Crawford. 2011. Six provocations for big data. In A decade in internet time: Symposium on the dynamics of the internet and society.",
      "doi": ""
    },
    {
      "text": "Br, y Zadrozny Br, y Zadrozny is a senior reporter for NBC News She covers misinformation, extremism, and The Internet. YouTube's recommendations still push harmful videos, crowdsourced study finds. NBC News. Retrieved September 5, 2021 from https://www.nbcnews.com/tech/tech-news/youtubes-recommendations-still-push-harmful-videos-crowdsourced-study-rcna1355",
      "doi": ""
    },
    {
      "text": "Matt Carlson and Seth C Lewis. 2019. Temporal reflexivity in journalism studies: Making sense of change in a more timely fashion. Journalism 20, 5 (May 2019), 642–650. DOI:https://doi.org/10.1177/1464884918760675",
      "doi": ""
    },
    {
      "text": "Stefan Parry Carmien and Gerhard Fischer. 2008. Design, adoption, and assessment of a socio-technical environment supporting independence for persons with cognitive disabilities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’08), Association for Computing Machinery, New York, NY, USA, 597–606. DOI:https://doi.org/10.1145/1357054.1357151",
      "doi": "10.1145/1357054.1357151"
    },
    {
      "text": "Regina Kayla Catipon. Watching Them, Watching Us: How the Misinformation Beat Redefines Journalism's Relationship with Conspiracy Theories. University of Chicago. DOI:https://doi.org/10.6082/uchicago.2922",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz and Linda Liska Belgrave. 2007. Grounded theory. Blackwell Encycl. Sociol. (2007).",
      "doi": ""
    },
    {
      "text": "Mark Coddington. 2015. Clarifying Journalism's Quantitative Turn. Digit. Journal. 3, 3 (May 2015), 331–348. DOI:https://doi.org/10.1080/21670811.2014.976400",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos. 2019. Automating the News. Harvard University Press. Retrieved September 2, 2021 from https://www.degruyter.com/document/doi/10.4159/9780674239302/html",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos, Munmun De Choudhury, and Mor Naaman. 2012. Finding and assessing social media information sources in the context of journalism. In Proceedings of the SIGCHI conference on human factors in computing systems, 2451–2460.",
      "doi": "10.1145/2207676.2208409"
    },
    {
      "text": "Joan Donovan and Brian Friedberg. 2019. Source hacking: Media manipulation in practice. Retrieved DataSociety Website Httpsdatasociety Netoutputsource-Hacking-Media-Manip.–Pract. (2019).",
      "doi": ""
    },
    {
      "text": "Declan Fahy and Matthew C. Nisbet. 2011. The science journalist online: Shifting roles and emerging practices. Journalism 12, 7 (October 2011), 778–793. DOI:https://doi.org/10.1177/1464884911412697",
      "doi": ""
    },
    {
      "text": "Casey Fiesler and Blake Hallinan. 2018. “We Are the Product”: Public Reactions to Online Data Sharing and Privacy Controversies in the Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. Retrieved January 8, 2022 from https://doi.org/10.1145/3173574.3173627",
      "doi": "10.1145/3173574.3173627"
    },
    {
      "text": "Andrew Thomas Garbett, Rob Comber, Paul Egglestone, Maxine Glancy, and Patrick Olivier. 2014. Finding “real people”: trust and diversity in the interface between professional and citizen journalists. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’14), Association for Computing Machinery, New York, NY, USA, 3015–3024. DOI:https://doi.org/10.1145/2556288.2557114",
      "doi": "10.1145/2556288.2557114"
    },
    {
      "text": "Barney Glaser. 1967. 8: Strauss, A.(1967). The discovery of grounded theory. Alsine Gruyter N. Y. (1967).",
      "doi": ""
    },
    {
      "text": "Aurore Haas. 2015. Crowding at the frontier: boundary spanners, gatekeepers and knowledge brokers. J. Knowl. Manag. 19, 5 (January 2015), 1029–1047. DOI:https://doi.org/10.1108/JKM-01-2015-0036",
      "doi": ""
    },
    {
      "text": "Thomas Hanitzsch and Tim P Vos. 2018. Journalism beyond democracy: A new look into journalistic roles in political and everyday life. Journalism 19, 2 (February 2018), 146–164. DOI:https://doi.org/10.1177/1464884916673386",
      "doi": ""
    },
    {
      "text": "Md Mahfuzul Haque, Mohammad Yousuf, Ahmed Shatil Alam, Pratyasha Saha, Syed Ishtiaque Ahmed, and Naeemul Hassan. 2020. Combating Misinformation in Bangladesh: Roles and Responsibilities as Perceived by Journalists, Fact-checkers, and Users. Proc. ACM Hum.-Comput. Interact. 4, CSCW2 (October 2020), 130:1-130:32. DOI:https://doi.org/10.1145/3415201",
      "doi": "10.1145/3415201"
    },
    {
      "text": "Steve Harrison, Deborah Tatar, and Phoebe Sengers. 2007. The three paradigms of HCI.",
      "doi": ""
    },
    {
      "text": "Bahareh R. Heravi. 2019. 3Ws of Data Journalism Education. Journal. Pract. 13, 3 (March 2019), 349–366. DOI:https://doi.org/10.1080/17512786.2018.1463167",
      "doi": ""
    },
    {
      "text": "Brant Houston. 2014. Computer-Assisted Reporting: A Practical Guide. Routledge.",
      "doi": ""
    },
    {
      "text": "Jose Luis Jimenez-Marquez, Israel Gonzalez-Carrasco, Jose Luis Lopez-Cuadrado, and Belen Ruiz-Mezcua. 2019. Towards a big data framework for analyzing social media content. Int. J. Inf. Manag. 44, (February 2019), 1–12. DOI:https://doi.org/10.1016/j.ijinfomgt.2018.09.003",
      "doi": ""
    },
    {
      "text": "Brigitte Jordan. 1996. Chapter 3 Ethnographic workplace studies and CSCW. In Human Factors in Information Technology, Dan Shapiro, Michael Tauber and Roland Traunmüller (eds.). North-Holland, 17–42. DOI:https://doi.org/10.1016/S0923-8433(96)80005-0",
      "doi": ""
    },
    {
      "text": "Joakim Karlsen and Eirik Stavelin. 2014. Computational Journalism in Norwegian Newsrooms. Journal. Pract. 8, 1 (January 2014), 34–48. DOI:https://doi.org/10.1080/17512786.2013.813190",
      "doi": ""
    },
    {
      "text": "Julie A. Kientz and Gregory D. Abowd. 2008. When the designer becomes the user: designing a system for therapists by becoming a therapist. In CHI ’08 Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2071–2078. Retrieved September 9, 2021 from https://doi.org/10.1145/1358628.1358639",
      "doi": ""
    },
    {
      "text": "Kathryn Kranhold. 2020. Social Media in 2020: A Year of Misinformation and Disinformation. Wall Street Journal. Retrieved August 31, 2021 from https://www.wsj.com/articles/social-media-in-2020-a-year-of-misinformation-and-disinformation-11607712530",
      "doi": ""
    },
    {
      "text": "B.T. Lawson. 2021. Hiding Behind Databases, Institutions and Actors: How Journalists Use Statistics in Reporting Humanitarian Crises. Journal. Pract. 0, 0 (May 2021), 1–21. DOI:https://doi.org/10.1080/17512786.2021.1930106",
      "doi": ""
    },
    {
      "text": "Becca Lewis and Alice E. Marwick. 2017. Media Manipulation and Disinformation Online. Data & Society. Retrieved March 18, 2021 from https://datasociety.net/library/media-manipulation-and-disinfo-online/",
      "doi": ""
    },
    {
      "text": "Seth C. Lewis and Oscar Westlund. 2015. Big Data and Journalism. Digit. Journal. 3, 3 (May 2015), 447–466. DOI:https://doi.org/10.1080/21670811.2014.976418",
      "doi": ""
    },
    {
      "text": "Wiebke Loosen, Julius Reimer, and Fenja De Silva-Schmidt. 2020. Data-driven reporting: An on-going (r)evolution? An analysis of projects nominated for the Data Journalism Awards 2013–2016. Journalism 21, 9 (September 2020), 1246–1263. DOI:https://doi.org/10.1177/1464884917735691",
      "doi": ""
    },
    {
      "text": "Stephen MacGregor, Amanda Cooper, Andrew Coombs, and Christopher DeLuca. 2020. A scoping review of co-production between researchers and journalists in research communication. Heliyon 6, 9 (September 2020), e04836. DOI:https://doi.org/10.1016/j.heliyon.2020.e04836",
      "doi": ""
    },
    {
      "text": "Melanie MaginMelanie Magin and Peter MaurerPeter Maurer. 2020. Beat Journalism and Reporting. In The Oxford Encyclopedia of Journalism Studies. Oxford University Press. Retrieved September 7, 2021 from http://www.oxfordreference.com/view/10.1093/acref/9780190694166.001.0001/acref-9780190694166-e-905",
      "doi": ""
    },
    {
      "text": "Melanie Magin and Peter Maurer. 2019. Beat Journalism and Reporting. Oxford Research Encyclopedia of Communication. DOI:https://doi.org/10.1093/acrefore/9780190228613.013.905",
      "doi": ""
    },
    {
      "text": "Dominique Marchetti. Sub-fields of specialized journalism. 15.",
      "doi": ""
    },
    {
      "text": "Dominick Mastrangelo. 2021. Trump supporter warns CNN reporter of “civil war” if former president not reinstated “soon.” TheHill. Retrieved September 5, 2021 from https://thehill.com/homenews/media/560681-trump-supporter-warns-cnn-reporter-of-civil-war-if-former-president-not",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Karla Badillo-Urquiola, Morgan G. Ames, Nicola Dell, Elizabeth Keneski, Manya Sleeper, and Pamela J. Wisniewski. 2020. Privacy and Power: Acknowledging the Importance of Privacy Research and Design for Vulnerable Populations. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (CHI EA ’20), Association for Computing Machinery, New York, NY, USA, 1–8. DOI:https://doi.org/10.1145/3334480.3375174",
      "doi": "10.1145/3334480.3375174"
    },
    {
      "text": "Amy Mitchell, Mark Jurkowitz, J. Baxter Oliphant, and Elisa Shearer. 2020. Political Divides, Conspiracy Theories and Divergent News Sources Heading Into 2020 Election. Pew Research Center's Journalism Project. Retrieved August 31, 2021 from https://www.pewresearch.org/journalism/2020/09/16/political-divides-conspiracy-theories-and-divergent-news-sources-heading-into-2020-election/",
      "doi": ""
    },
    {
      "text": "Abby Livingston and Shawn Mulcahy. 2020. As states count votes, some of Texas’ most prominent Republican politicians are spreading misinformation about the election. The Texas Tribune. Retrieved September 5, 2021 from https://www.texastribune.org/2020/11/06/texas-republicans-trump-results/",
      "doi": ""
    },
    {
      "text": "John Naughton. Blogging and the emerging media ecosystem. 10.",
      "doi": ""
    },
    {
      "text": "Ashley Nerbovig. Michigan's immigrant communities hit with misinformation on closed platforms. Detroit Free Press. Retrieved September 5, 2021 from https://www.freep.com/story/news/politics/elections/2020/11/27/michigan-election-misinformation-immigrant-whatsapp/6393693002/",
      "doi": ""
    },
    {
      "text": "Miles Parks. 2021. The Most Popular J&J Vaccine Story On Facebook? A Conspiracy Theorist Posted It. NPR. Retrieved September 5, 2021 from https://www.npr.org/2021/04/15/987182241/the-most-popular-j-j-vaccine-story-on-facebook-a-conspiracy-theorist-posted-it",
      "doi": ""
    },
    {
      "text": "Concha Pérez-Curiel, Ricardo Domínguez-García, and Gloria Jiménez-Marín. 2021. Public Sphere and Misinformation in the U.S. Election: Trump's Audience and Populism Indicators in the COVID-19 Context. Journal. Media 2, 3 (September 2021), 335–350. DOI:https://doi.org/10.3390/journalmedia2030020",
      "doi": ""
    },
    {
      "text": "Nathaniel Persily. OPENING A WINDOW INTO TECH: THE CHALLENGE AND OPPORTUNITY FOR DATA TRANSPARENCY. 17.",
      "doi": ""
    },
    {
      "text": "Whitney Phillips. 2018. The oxygen of amplification. Data Soc. (2018).",
      "doi": ""
    },
    {
      "text": "Zvi Reich. 2012. Different Practices, Similar Logic: Comparing News Reporting across Political, Financial, and Territorial Beats. Int. J. Press. 17, 1 (January 2012), 76–99. DOI:https://doi.org/10.1177/1940161211420868",
      "doi": ""
    },
    {
      "text": "Kjeld Schmidt and Liam Bannon. 1992. Taking CSCW seriously: Supporting Articulation Work. Comput. Support. Coop. Work 1, (March 1992), 7–40.",
      "doi": ""
    },
    {
      "text": "Ida Schultz. 2007. THE JOURNALISTIC GUT FEELING. Journal. Pract. (April 2007). DOI:https://doi.org/10.1080/17512780701275507",
      "doi": ""
    },
    {
      "text": "C. Estelle Smith, Xinyi Wang, Raghav Pavan Karumur, and Haiyi Zhu. 2018. [Un]breaking News: Design Opportunities for Enhancing Collaboration in Scientific Media Production. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. Retrieved September 7, 2021 from https://doi.org/10.1145/3173574.3173955",
      "doi": "10.1145/3173574.3173955"
    },
    {
      "text": "Sylvanna Falcón, Jessica De La Cruz, and Sydney Lark Eliot,. Black Lives Matter & Disinformation. Retrieved August 31, 2021 from https://humanrights.ucsc.edu/publications/black-lives-matter-disinformation.html",
      "doi": ""
    },
    {
      "text": "© Stanford University, Stanford, and California 94305. The Long Fuse: Misinformation and the 2020 Election. Retrieved May 28, 2021 from https://purl.stanford.edu/tr171zs0069",
      "doi": ""
    },
    {
      "text": "Sukrit Venkatagiri, Jacob Thebault-Spieker, Rachel Kohler, John Purviance, Rifat Sabbir Mansur, and Kurt Luther. 2019. GroundTruth: Augmenting Expert Image Geolocation with Crowdsourcing and Shared Representations. Proc. ACM Hum.-Comput. Interact. 3, CSCW (2019), 1–30.",
      "doi": "10.1145/3359209"
    },
    {
      "text": "Yixue Wang and Nicholas Diakopoulos. 2021. Journalistic Source Discovery: Supporting The Identification of News Sources in User Generated Content. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–18. Retrieved September 8, 2021 from https://doi.org/10.1145/3411764.3445266",
      "doi": "10.1145/3411764.3445266"
    },
    {
      "text": "District of Columbia 1100 Connecticut Ave NW Suite 1300B Washington and Dc 20036. PolitiFact - The scariest misinformation of 2020. @politifact. Retrieved August 31, 2021 from https://www.politifact.com/article/2020/oct/31/scariest-misinformation-2020/",
      "doi": ""
    },
    {
      "text": "1980. Manufacturing the News By Mark Fishman. Retrieved September 8, 2021 from https://utpress.utexas.edu/books/fishman-manufacturing-the-news",
      "doi": ""
    },
    {
      "text": "2018. I've reported on misinformation for more than a year. Here's what I've learned. Poynter. Retrieved September 5, 2021 from https://www.poynter.org/fact-checking/2018/ive-reported-on-misinformation-for-more-than-a-year-heres-what-ive-learned/",
      "doi": ""
    },
    {
      "text": "2020. How journalists can avoid spreading coronavirus misinformation. The Journalist's Resource. Retrieved September 5, 2021 from https://journalistsresource.org/politics-and-government/coronavirus-misinformation-crowdsourcing-truth-mit-david-rand/",
      "doi": ""
    },
    {
      "text": "2020. Investigative Digital Ethnography: Methods for Environmental Modeling. Media Manipulation Casebook. Retrieved May 5, 2021 from https://mediamanipulation.org/research/investigative-digital-ethnography-methods-environmental-modeling",
      "doi": ""
    },
    {
      "text": "2021. CNN's Irish reporter Donie O'Sullivan goes viral during Washington unrest. IrishCentral.com. Retrieved September 5, 2021 from https://www.irishcentral.com/news/cnn-irish-reporter-donie-o-sullivan",
      "doi": ""
    },
    {
      "text": "2021. Commission on Information Disorder Final Report. The Aspen Institute. Retrieved January 8, 2022 from https://www.aspeninstitute.org/publications/commission-on-information-disorder-final-report/",
      "doi": ""
    },
    {
      "text": "In 2020, Disinformation Broke The US. Retrieved August 31, 2021 from https://www.buzzfeednews.com/article/janelytvynenko/disinformation-broke-us",
      "doi": ""
    },
    {
      "text": "Infodemic. Retrieved August 31, 2021 from https://www.who.int/westernpacific/health-topics/infodemic",
      "doi": ""
    },
    {
      "text": "12/15/20 - THE QANON CONSPIRACY: Destroying Families, Dividing Communities, Undermining Democracy. Network Contagion Research Institute. Retrieved August 31, 2021 from https://networkcontagion.us/reports/the-qanon-conspiracy-destroying-families-dividing-communities-undermining-democracy/",
      "doi": ""
    },
    {
      "text": "Wayfair Trafficking Conspiracy Theory Spreading on TikTok - Rolling Stone. Retrieved August 31, 2021 from https://www.rollingstone.com/culture/culture-news/wayfair-child-trafficking-conspiracy-theory-tiktok-1028622/",
      "doi": ""
    },
    {
      "text": "US Social Media Usage. Insider Intelligence. Retrieved August 31, 2021 from https://www.emarketer.com/content/us-social-media-usage",
      "doi": ""
    },
    {
      "text": "On the Misinformation Beat: Understanding the Work of Investigative Journalists Reporting on Problematic Information Online: Proceedings of the ACM on Human-Computer Interaction: Vol 4, No CSCW2. Retrieved January 6, 2021 from https://dl.acm.org/doi/abs/10.1145/3415204",
      "doi": ""
    },
    {
      "text": "On the Misinformation Beat: Understanding the Work of Investigative Journalists Reporting on Problematic Information Online: Proceedings of the ACM on Human-Computer Interaction: Vol 4, No CSCW2. Retrieved January 6, 2021 from https://dl.acm.org/doi/abs/10.1145/3415204",
      "doi": ""
    },
    {
      "text": "Countering Misinformation: Tips for Journalists. Columbia Journalism Review. Retrieved August 31, 2021 from https://www.cjr.org/united_states_project/_countering_misinformation_tip.php",
      "doi": ""
    },
    {
      "text": "Prepare for US election misinformation. First Draft. Retrieved September 5, 2021 from https://firstdraftnews.org:443/long-form-article/prepare-for-us-election-misinformation/",
      "doi": ""
    },
    {
      "text": "Media Manipulation Casebook. Media Manipulation Casebook. Retrieved September 5, 2021 from https://mediamanipulation.org/homepage",
      "doi": ""
    },
    {
      "text": "MediaWise Fact-Checking Certificate (Winter 2020/21). Poynter. Retrieved September 5, 2021 from https://www.poynter.org/shop/fact-checking/mediawise-fact-checking-certificate-winter-2020/",
      "doi": ""
    },
    {
      "text": "Misinformation on Facebook got six times more clicks than factual news during the 2020 election, study says. Washington Post. Retrieved September 5, 2021 from https://www.washingtonpost.com/technology/2021/09/03/facebook-misinformation-nyu-study/",
      "doi": ""
    },
    {
      "text": "Center for an Informed Public, Digital Forensic Research Lab, Graphika, & Stanford Internet Observatory (2021). The Long Fuse: Misinformation and the 2020 Election. Stanford Digital Repository: Election Integrity Partnership. v1.3.0 Available at: https://purl.stanford.edu/tr171zs0069.",
      "doi": ""
    },
    {
      "text": "Brandy Zadrozny on Twitter. Twitter. Retrieved September 5, 2021 from https://twitter.com/BrandyZadrozny/status/1432413838025142280",
      "doi": ""
    },
    {
      "text": "Shorenstein Center on Twitter. Twitter. Retrieved September 5, 2021 from https://twitter.com/ShorensteinCtr/status/1433796196565348357",
      "doi": ""
    },
    {
      "text": "Full article: THE PROMISE OF COMPUTATIONAL JOURNALISM. Retrieved September 7, 2021 from https://www.tandfonline.com/doi/full/10.1080/17512786.2011.616655?casa_token=yMQd4goD7sgAAAAA%3AfrfI6bM1e0GPLVtJ1ISHFpPOIT65GUFc2u3rY9bObK5eCyMINNlbzFxd-0ut9-IRTxQ07qAeMBn7LQ",
      "doi": ""
    },
    {
      "text": "Supporting the Use of User Generated Content in Journalistic Practice | Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Retrieved September 7, 2021 from https://dl.acm.org/doi/10.1145/3025453.3025892",
      "doi": ""
    },
    {
      "text": "HCI for Accurate, Impartial and Transparent Journalism | Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. Retrieved September 7, 2021 from https://dl.acm.org/doi/10.1145/3290607.3299007",
      "doi": ""
    },
    {
      "text": "Making the News | Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Retrieved September 7, 2021 from https://dl.acm.org/doi/10.1145/3173574.3174049",
      "doi": ""
    },
    {
      "text": "Epilogue: Timing the study of news temporality - Barbie Zelizer, 2018. Retrieved September 8, 2021 from https://journals.sagepub.com/doi/full/10.1177/1464884916688964?casa_token=hwE0MmBdXt4AAAAA%3AO7AJHn_jMA6GysK5PzWPM1IS4blBdLfYmVghjT-uMxquXonoFlNcNHJ6fYQovq8jLvtBDuO1MIY",
      "doi": ""
    },
    {
      "text": "Op-ed: Covering science at dangerous speeds. Columbia Journalism Review. Retrieved September 7, 2021 from https://www.cjr.org/opinion/pandemic-science-publishing-journals-how-to.php",
      "doi": ""
    },
    {
      "text": "Coronavirus: Tools and guides for journalists. First Draft. Retrieved September 7, 2021 from https://firstdraftnews.org:443/long-form-article/coronavirus-tools-and-guides-for-journalists/",
      "doi": ""
    },
    {
      "text": "How NBC News Uses CrowdTangle To Source and Tell Local Stories on a National Level. Retrieved September 7, 2021 from http://help.crowdtangle.com/en/articles/4554891-how-nbc-news-uses-crowdtangle-to-source-and-tell-local-stories-on-a-national-level",
      "doi": ""
    },
    {
      "text": "Media Manipulation & Disinformation. Data & Society. Retrieved May 25, 2021 from https://datasociety.net/research/media-manipulation/",
      "doi": ""
    },
    {
      "text": "Implications for design. DOI:https://doi.org/10.1145/1124772.1124855",
      "doi": ""
    },
    {
      "text": "Being in the thick of in-the-wild studies. DOI:https://doi.org/10.1145/2207676.2208561",
      "doi": ""
    },
    {
      "text": "U.S. Senator Christopher Coons of Delaware. Retrieved January 8, 2022 from https://www.coons.senate.gov/news/press-releases/coons-portman-klobuchar-announce-legislation-to-ensure-transparency-at-social-media-platforms",
      "doi": ""
    },
    {
      "text": "“Participant” Perceptions of Twitter Research Ethics - Casey Fiesler, Nicholas Proferes, 2018. Retrieved January 8, 2022 from https://journals.sagepub.com/doi/full/10.1177/2056305118763366",
      "doi": ""
    }
  ]
}