{
  "doi": "10.1145/3491102.3501823",
  "title": "Neo: Generalizing Confusion Matrix Visualization to Hierarchical and Multi-Output Labels",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2022,
  "badges": [],
  "abstract": "The confusion matrix, a ubiquitous visualization for helping people evaluate machine learning models, is a tabular layout that compares predicted class labels against actual class labels over all data instances. We conduct formative research with machine learning practitioners at Apple and find that conventional confusion matrices do not support more complex data-structures found in modern-day applications, such as hierarchical and multi-output labels. To express such variations of confusion matrices, we design an algebra that models confusion matrices as probability distributions. Based on this algebra, we develop Neo, a visual analytics system that enables practitioners to flexibly author and interact with hierarchical and multi-output confusion matrices, visualize derived metrics, renormalize confusions, and share matrix specifications. Finally, we demonstrate Neo’s utility with three model evaluation scenarios that help people better understand model performance and reveal hidden confusions.",
  "authors": [
    {
      "name": "Jochen Görtler",
      "institution": "University of Konstanz, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236583",
      "orcid": "missing"
    },
    {
      "name": "Fred Hohman",
      "institution": "Apple, United States",
      "img": "/do/10.1145/contrib-99659161281/rel-imgonly/portrait.jpg",
      "acmid": "99659161281",
      "orcid": "0000-0002-4164-844X"
    },
    {
      "name": "Dominik Moritz",
      "institution": "Apple, United States",
      "img": "/do/10.1145/contrib-89758751957/rel-imgonly/dominik_berlin.jpg",
      "acmid": "89758751957",
      "orcid": "0000-0002-3110-1053"
    },
    {
      "name": "Kanit Wongsuphasawat",
      "institution": "Apple, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548549056",
      "orcid": "missing"
    },
    {
      "name": "Donghao Ren",
      "institution": "Apple, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526797",
      "orcid": "missing"
    },
    {
      "name": "Rahul Nair",
      "institution": "Apple, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238127",
      "orcid": "missing"
    },
    {
      "name": "Marc Kirchner",
      "institution": "Apple, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236842",
      "orcid": "missing"
    },
    {
      "name": "Kayur Patel",
      "institution": "Apple, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350576909",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bilal Alsallakh, Allan Hanbury, Helwig Hauser, Silvia Miksch, and Andreas Rauber. 2014. Visual methods for analyzing probabilistic classification data. IEEE Transactions on Visualization and Computer Graphics (2014). https://doi.org/10.1109/tvcg.2014.2346660",
      "doi": ""
    },
    {
      "text": "Bilal Alsallakh, Amin Jourabloo, Mao Ye, Xiaoming Liu, and Liu Ren. 2017. Do convolutional neural networks learn class hierarchy?IEEE Transactions on Visualization and Computer Graphics (2017). https://doi.org/10.1109/tvcg.2017.2744683",
      "doi": ""
    },
    {
      "text": "Bilal Alsallakh, Zhixin Yan, Shabnam Ghaffarzadegan, Zeng Dai, and Liu Ren. 2020. Visualizing classification structure of large-scale classifiers. In ICML Workshop on Human Interpretability in Machine Learning.",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Andrew Begel, Christian Bird, Robert DeLine, Harald Gall, Ece Kamar, Nachiappan Nagappan, Besmira Nushi, and Thomas Zimmermann. 2019. Software engineering for machine learning: A case study. In 2019 IEEE/ACM 41st International Conference on Software Engineering: Software Engineering in Practice (ICSE-SEIP). IEEE. https://doi.org/10.1109/icse-seip.2019.00042",
      "doi": "10.1109/ICSE-SEIP.2019.00042"
    },
    {
      "text": "Saleema Amershi, Max Chickering, Steven M Drucker, Bongshin Lee, Patrice Simard, and Jina Suh. 2015. Modeltracker: Redesigning performance analysis tools for machine learning. In Proceedings of the CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/2702123.2702509",
      "doi": "10.1145/2702123.2702509"
    },
    {
      "text": "Jacques Bertin. 1983. Semiology of graphics. University of Wisconsin Press.",
      "doi": "10.5555/1095597"
    },
    {
      "text": "Daniel Bruckner. 2014. ML-o-Scope: A diagnostic visualization system for deep machine learning pipelines. Technical Report. https://doi.org/10.21236/ada605112",
      "doi": ""
    },
    {
      "text": "Olivier Caelen. 2017. A Bayesian interpretation of the confusion matrix. Annals of Mathematics and Artificial Intelligence (2017). https://doi.org/10.1007/s10472-017-9564-8",
      "doi": ""
    },
    {
      "text": "Stuart K Card, Jock D Mackinlay, and Ben Shneiderman. 1999. Readings in information visualization: Using vision to think. Morgan Kaufmann Publishers Inc.",
      "doi": "10.5555/300679"
    },
    {
      "text": "Edgar Frank Codd. 1970. A relational model of data for large shared data banks. Commun. ACM (1970).",
      "doi": ""
    },
    {
      "text": "Graham R Gibbs. 2007. Thematic coding and categorizing. Analyzing Qualitative Data(2007). https://doi.org/10.4135/9781849208574.n4",
      "doi": ""
    },
    {
      "text": "Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. 2016. Identity mappings in deep residual networks. In European Conference on Computer Vision. Springer. https://doi.org/10.1007/978-3-319-46493-0_38",
      "doi": ""
    },
    {
      "text": "A. Hinterreiter, P. Ruch, H. Stitz, M. Ennemoser, J. Bernard, H. Strobelt, and M. Streit. 2020. ConfusionFlow: A model-agnostic visualization for temporal analysis of classifier confusion. IEEE Transactions on Visualization and Computer Graphics (2020). https://doi.org/10.1109/tvcg.2020.3012063",
      "doi": ""
    },
    {
      "text": "Robert Hogg and Elliot Tanis. 2020. Probability and statistical inference. Pearson.",
      "doi": ""
    },
    {
      "text": "Fred Hohman, Kanit Wongsuphasawat, Mary Beth Kery, and Kayur Patel. 2020. Understanding and visualizing data iteration in machine learning. In Proceedings of the CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3313831.3376177",
      "doi": "10.1145/3313831.3376177"
    },
    {
      "text": "Mohammad Hossin and M. N. Sulaiman. 2015. A review on evaluation metrics for data classification evaluations. International Journal of Data Mining & Knowledge Management Process (2015). https://doi.org/10.5121/ijdkp.2015.5201",
      "doi": ""
    },
    {
      "text": "Jigsaw. 2017. Toxic comment classification challenge. Kaggle (2017).",
      "doi": ""
    },
    {
      "text": "Minsuk Kahng, Pierre Y Andrews, Aditya Kalro, and Duen Horng Chau. 2017. ActiVis: Visual exploration of industry-scale deep neural network models. IEEE Transactions on Visualization and Computer Graphics (2017). https://doi.org/10.1109/tvcg.2017.2744718",
      "doi": ""
    },
    {
      "text": "Sean Kandel, Ravi Parikh, Andreas Paepcke, Joseph M Hellerstein, and Jeffrey Heer. 2012. Profiler: Integrated statistical analysis and visualization for data quality assessment. In Proceedings of the International Working Conference on Advanced Visual Interfaces. https://doi.org/10.1145/2254556.2254659",
      "doi": "10.1145/2254556.2254659"
    },
    {
      "text": "Ashish Kapoor, Bongshin Lee, Desney Tan, and Eric Horvitz. 2010. Interactive optimization for steering machine classification. In Proceedings of the CHI Conference on Human Factors in Computing Systems(CHI ’10). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/1753326.1753529",
      "doi": "10.1145/1753326.1753529"
    },
    {
      "text": "Mary Beth Kery, Donghao Ren, Fred Hohman, Dominik Moritz, Kanit Wongsuphasawat, and Kayur Patel. 2020. mage: Fluid moves between code and graphical work in computational notebooks. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. https://doi.org/10.1145/3379337.3415842",
      "doi": "10.1145/3379337.3415842"
    },
    {
      "text": "Damir Krstinić, Maja Braović, Ljiljana Šerić, and Dunja Božić-Štulić. 2020. Multi-label classifier performance evaluation with confusion matrix. In Computer Science & Information Technology. AIRCC Publishing Corporation. https://doi.org/10.5121/csit.2020.100801",
      "doi": ""
    },
    {
      "text": "George A Miller. 1995. WordNet: a lexical database for English. Commun. ACM (1995). https://doi.org/10.1145/219717.219748",
      "doi": ""
    },
    {
      "text": "Kayur Patel, Naomi Bancroft, Steven M Drucker, James Fogarty, Andrew J Ko, and James Landay. 2010. Gestalt: Integrated support for implementation and analysis in machine learning. In Proceedings of the 23nd Annual ACM Symposium on User Interface Software and Technology. https://doi.org/10.1145/1866029.1866038",
      "doi": "10.1145/1866029.1866038"
    },
    {
      "text": "Donghao Ren, Saleema Amershi, Bongshin Lee, Jina Suh, and Jason D Williams. 2016. Squares: Supporting interactive performance analysis for multiclass classifiers. IEEE Transactions on Visualization and Computer Graphics (2016). https://doi.org/10.1109/tvcg.2016.2598828",
      "doi": "10.1109/TVCG.2016.2598828"
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2016. Vega-lite: A grammar of interactive graphics. IEEE Transactions on Visualization and Computer Graphics (2016). https://doi.org/10.31219/osf.io/mqzyx",
      "doi": "10.1109/TVCG.2016.2599030"
    },
    {
      "text": "Christin Seifert and Elisabeth Lex. 2009. A novel visualization approach for data-mining-related classification. In 2009 13th International Conference Information Visualisation. IEEE. https://doi.org/10.1109/iv.2009.45",
      "doi": "10.1109/IV.2009.45"
    },
    {
      "text": "Hong Shen, Haojian Jin, Ángel Alexander Cabrera, Adam Perer, Haiyi Zhu, and Jason I Hong. 2020. Designing alternative representations of confusion matrices to support non-expert public understanding of algorithm performance. Proceedings of the ACM on Human-Computer Interaction (2020). https://doi.org/10.1145/3415224",
      "doi": "10.1145/3415224"
    },
    {
      "text": "Chris Stolte, Diane Tang, and Pat Hanrahan. 2002. Polaris: A system for query, analysis, and visualization of multidimensional relational databases. IEEE Transactions on Visualization and Computer Graphics (2002). https://doi.org/10.1109/2945.981851",
      "doi": ""
    },
    {
      "text": "Chris Stolte, Diane Tang, and Pat Hanrahan. 2002. Query, analysis, and visualization of hierarchically structured data using polaris. In Proceedings of the Eighth ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM. https://doi.org/10.1145/775047.775064",
      "doi": "10.1145/775047.775064"
    },
    {
      "text": "Aixin Sun and Ee-Peng Lim. 2001. Hierarchical text classification and evaluation. In Proceedings 2001 IEEE International Conference on Data Mining. IEEE. https://doi.org/10.1109/ICDM.2001.989560",
      "doi": "10.5555/645496.657884"
    },
    {
      "text": "Robert Susmaga. 2004. Confusion matrix visualization. In Intelligent Information Processing and Web Mining. Springer. https://doi.org/10.1007/978-3-540-39985-8_12",
      "doi": ""
    },
    {
      "text": "Justin Talbot, Bongshin Lee, Ashish Kapoor, and Desney S. Tan. 2009. EnsembleMatrix: Interactive visualization to support machine learning with multiple classifiers. In Proceedings of the CHI Conference on Human Factors in Computing Systems(CHI ’09). ACM, 10 pages. https://doi.org/10.1145/1518701.1518895",
      "doi": "10.1145/1518701.1518895"
    },
    {
      "text": "Niklas Tötsch and Daniel Hoffmann. 2021. Classifier uncertainty: Evidence, potential impact, and probabilistic treatment. PeerJ Computer Science(2021). https://doi.org/10.7717/peerj-cs.398",
      "doi": ""
    },
    {
      "text": "S. van den Elzen and J. J. van Wijk. 2011. BaobabView: Interactive construction and analysis of decision trees. In 2011 IEEE Conference on Visual Analytics Science and Technology. https://doi.org/10.1109/vast.2011.6102453",
      "doi": ""
    },
    {
      "text": "James Wexler. 2017. Facets: An open source visualization tool for machine learning training data. http://ai.googleblog.com/2017/07/facets-open-source-visualization-tool.html.",
      "doi": ""
    },
    {
      "text": "Leland Wilkinson and Michael Friendly. 2009. The history of the cluster heat map. The American Statistician(2009). https://doi.org/10.1198/tas.2009.0033",
      "doi": ""
    },
    {
      "text": "Kanit Wongsuphasawat, Zening Qu, Dominik Moritz, Riley Chang, Felix Ouk, Anushka Anand, Jock Mackinlay, Bill Howe, and Jeffrey Heer. 2017. Voyager 2: Augmenting visual analysis with partial view specifications. In Proceedings of the CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3025453.3025768",
      "doi": "10.1145/3025453.3025768"
    },
    {
      "text": "Qian Yang, Jina Suh, Nan-Chen Chen, and Gonzalo Ramos. 2018. Grounding interactive machine learning tool design in how non-experts actually build models. In Proceedings of the 2018 Designing Interactive Systems Conference. https://doi.org/10.1145/3196709.3196729",
      "doi": "10.1145/3196709.3196729"
    },
    {
      "text": "J. Zhang, Y. Wang, P. Molino, L. Li, and D. S. Ebert. 2019. Manifold: A model-agnostic framework for interpretation and diagnosis of machine learning models. IEEE Transactions on Visualization and Computer Graphics (2019). https://doi.org/10.1109/tvcg.2018.2864499",
      "doi": ""
    },
    {
      "text": "Xiaoyi Zhang, Lilian de Greef, Amanda Swearngin, Samuel White, Kyle Murray, Lisa Yu, Qi Shan, Jeffrey Nichols, Jason Wu, Chris Fleizach, Aaron Everitt, and Jeffrey P Bigham. 2021. Screen Recognition: Creating Accessibility Metadata for Mobile Applications from Pixels. Proceedings of the CHI Conference on Human Factors in Computing Systems (2021). https://doi.org/10.1145/3411764.3445186",
      "doi": "10.1145/3411764.3445186"
    }
  ]
}