{
  "doi": "10.1145/3491102.3502127",
  "title": "Paracentral and near-peripheral visualizations: Towards attention-maintaining secondary information presentation on OHMDs during in-person social interactions",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Optical see-through Head-Mounted Displays (OST HMDs, OHMDs) are known to facilitate situational awareness while accessing secondary information. However, information displayed on OHMDs can cause attention shifts, which distract users from natural social interactions. We hypothesize that information displayed in paracentral and near-peripheral vision can be better perceived while the user is maintaining eye contact during face-to-face conversations. Leveraging this idea, we designed a circular progress bar to provide progress updates in paracentral and near-peripheral vision. We compared it with textual and linear progress bars under two conversation settings: a simulated one with a digital conversation partner and a realistic one with a real partner. Results show that a circular progress bar can effectively reduce notification distractions without losing eye contact and is more preferred by users. Our findings highlight the potential of utilizing the paracentral and near-peripheral vision for secondary information presentation on OHMDs.",
  "tags": [
    "circular progress",
    "reminder notification",
    "interruption",
    "HMD",
    "social interaction",
    "conversation",
    "paracentral",
    "near-peripheral",
    "smart glasses"
  ],
  "authors": [
    {
      "name": "Nuwan Janaka",
      "institution": "NUS-HCI Lab, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658676612",
      "orcid": "0000-0003-2983-6808"
    },
    {
      "name": "Chloe Haigh",
      "institution": "NUS-HCI Lab, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700950",
      "orcid": "missing"
    },
    {
      "name": "Hyeongcheol Kim",
      "institution": "NUS-HCI Lab, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234412",
      "orcid": "missing"
    },
    {
      "name": "Shan Zhang",
      "institution": "NUS-HCI Lab, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659276284",
      "orcid": "missing"
    },
    {
      "name": "Shengdong Zhao",
      "institution": "NUS-HCI Lab, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416592901",
      "orcid": "0000-0001-7971-3107"
    }
  ],
  "references": [
    {
      "text": "Michael Argyle and Mark Cook. 1976. Gaze and mutual gaze.(1976).",
      "doi": ""
    },
    {
      "text": "Raquel Benbunan-Fich. 2012. The ethics and etiquette of multitasking in the workplace. IEEE Technology and Society Magazine 31, 3 (2012), 15–19. https://doi.org/10.1109/MTS.2012.2211391",
      "doi": ""
    },
    {
      "text": "Jean-Baptiste Bernard, Carlos Aguilar, and Eric Castet. 2016. A New Font, Specifically Designed for Peripheral Vision, Improves Peripheral Letter and Word Recognition, but Not Eye-Mediated Reading Performance. PloS One 11, 4 (2016), 25. https://doi.org/10.1371/journal.pone.0152506",
      "doi": ""
    },
    {
      "text": "Isha Chaturvedi, Farshid Hassani Bijarbooneh, Tristan Braud, and Pan Hui. 2019. Peripheral vision: a new killer app for smart glasses. In Proceedings of the 24th International Conference on Intelligent User Interfaces - IUI ’19. ACM Press, Marina del Ray, California, 625–636. https://doi.org/10.1145/3301275.3302263",
      "doi": "10.1145/3301275.3302263"
    },
    {
      "text": "Soon Hau Chua, Simon T. Perrault, Denys J. C. Matthies, and Shengdong Zhao. 2016. Positioning Glass: Investigating Display Positions of Monocular Optical See-Through Head-Mounted Display. In Proceedings of the Fourth International Symposium on Chinese CHI - ChineseCHI2016. ACM Press, San Jose, USA, 1–6. https://doi.org/10.1145/2948708.2948713",
      "doi": "10.1145/2948708.2948713"
    },
    {
      "text": "Marina Cidota, Stephan Lukosch, Dragos Datcu, and Heide Lukosch. 2016. Workspace Awareness in Collaborative AR using HMDs: A User Study Comparing Audio and Visual Notifications. In Proceedings of the 7th Augmented Human International Conference 2016 on - AH ’16. ACM Press, Geneva, Switzerland, 1–8. https://doi.org/10.1145/2875194.2875204",
      "doi": "10.1145/2875194.2875204"
    },
    {
      "text": "Enrico Costanza, Samuel A. Inverso, Elan Pavlov, Rebecca Allen, and Pattie Maes. 2006. eye-q: eyeglass peripheral display for subtle intimate notifications. In Proceedings of the 8th conference on Human-computer interaction with mobile devices and services - MobileHCI ’06. ACM Press, Helsinki, Finland, 211. https://doi.org/10.1145/1152215.1152261",
      "doi": "10.1145/1152215.1152261"
    },
    {
      "text": "Saverio Debernardis, Michele Fiorentino, Michele Gattullo, Giuseppe Monno, and Antonio Emmanuele Uva. 2014. Text Readability in Head-Worn Displays: Color and Style Optimization in Video versus Optical See-Through Devices. IEEE Transactions on Visualization and Computer Graphics 20, 1 (Jan. 2014), 125–139. https://doi.org/10.1109/TVCG.2013.86",
      "doi": "10.1109/TVCG.2013.86"
    },
    {
      "text": "docstocTV. 2014. What Kind of Business Is Crowdfunding Best For?https://www.youtube.com/watch?v=kiwvTdqRBXk",
      "doi": ""
    },
    {
      "text": "Cambridge ESOL. 2008. Speaking Test Preparation Pack for FCE Paperback with DVD. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Uwe Gruenefeld, Tim Claudius Stratmann, Jinki Jung, Hyeopwoo Lee, Jeehye Choi, Abhilasha Nanda, and Wilko Heuten. 2018. Guiding Smombies: Augmenting Peripheral Vision with Low-Cost Glasses to Shift the Attention of Smartphone Users. In 2018 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct). IEEE, Munich, Germany, 127–131. https://doi.org/10.1109/ISMAR-Adjunct.2018.00050",
      "doi": ""
    },
    {
      "text": "Carl Gutwin, Andy Cockburn, and Ashley Coveney. 2017. Peripheral Popout: The Influence of Visual Angle and Stimulus Intensity on Popout Effects. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver Colorado USA, 208–219. https://doi.org/10.1145/3025453.3025984",
      "doi": "10.1145/3025453.3025984"
    },
    {
      "text": "Edward Twitchell Hall. 1966. The hidden dimension. Vol. 609. Garden City, NY: Doubleday.",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart. 2006. Nasa-Task Load Index (NASA-TLX); 20 Years Later. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50, 9(2006), 904–908. https://doi.org/10.1177/154193120605000909",
      "doi": ""
    },
    {
      "text": "Roy S. Hessels. 2020. How does gaze to faces support face-to-face interaction? A review and perspective. Psychonomic Bulletin & Review 27, 5 (Oct. 2020), 856–881. https://doi.org/10.3758/s13423-020-01715-w",
      "doi": ""
    },
    {
      "text": "Sebastian Hobert and Matthias Schumann. 2016. Application Scenarios of Smart Glasses in the Industrial Sector: Results of an Empirical Study Among Domain Experts. i-com 15, 2 (Aug. 2016), 133–143. https://doi.org/10.1515/icom-2016-0016",
      "doi": ""
    },
    {
      "text": "Yoshio Ishiguro and Jun Rekimoto. 2011. Peripheral vision annotation: noninterference information presentation method for mobile augmented reality. In Proceedings of the 2nd Augmented Human International Conference on - AH ’11. ACM Press, Tokyo, Japan, 1–5. https://doi.org/10.1145/1959826.1959834",
      "doi": "10.1145/1959826.1959834"
    },
    {
      "text": "Kai Klinker, Lisa Berkemeier, Benedikt Zobel, H. Wüller, Veronika Huck-Fries, Manuel Wiesche, H. Remmers, Oliver Thomas, and H. Krcmar. 2018. Structure for innovations: A use case taxonomy for smart glasses in service processes.",
      "doi": ""
    },
    {
      "text": "Elisa Maria Klose, Nils Adrian Mack, Jens Hegenberg, and Ludger Schmidt. 2019. Text Presentation for Augmented Reality Applications in Dual-Task Situations. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, Osaka, Japan, 636–644. https://doi.org/10.1109/VR.2019.8797992",
      "doi": ""
    },
    {
      "text": "Marion Koelle, Matthias Kranz, and Andreas Möller. 2015. Don’t look at me that way!: Understanding User Attitudes Towards Data Glasses Usage. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, Copenhagen Denmark, 362–372. https://doi.org/10.1145/2785830.2785842",
      "doi": "10.1145/2785830.2785842"
    },
    {
      "text": "Pin-Sung Ku, Yu-Chih Lin, Yi-Hao Peng, and Mike Y. Chen. 2019. PeriText: Utilizing Peripheral Vision for Reading Text on Augmented Reality Smart Glasses. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 630–635. https://doi.org/10.1109/VR.2019.8798065",
      "doi": ""
    },
    {
      "text": "Gordon E Legge, J. Stephen Mansfield, and Susana T. L Chung. 2001. Psychophysics of reading: XX. Linking letter recognition to reading speed in central and peripheral vision. Vision Research 41, 6 (March 2001), 725–743. https://doi.org/10.1016/S0042-6989(00)00295-9",
      "doi": ""
    },
    {
      "text": "Andr\\’{e}s Lucero and Akos Vetek. 2014. NotifEye: using interactive glasses to deal with notifications while walking in public. In Proceedings of the 11th Conference on Advances in Computer Entertainment Technology - ACE ’14. ACM Press, Funchal, Portugal, 1–10. https://doi.org/10.1145/2663806.2663824",
      "doi": "10.1145/2663806.2663824"
    },
    {
      "text": "Kris Luyten, Donald Degraen, Gustavo Rovelo Ruiz, Sven Coppers, and Davy Vanacken. 2016. Hidden in Plain Sight: an Exploration of a Visual Language for Near-Eye Out-of-Focus Displays in the Peripheral View. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16. ACM Press, Santa Clara, California, USA, 487–497. https://doi.org/10.1145/2858036.2858339",
      "doi": "10.1145/2858036.2858339"
    },
    {
      "text": "Sven Mayer, Lars Lischke, Paweł W. Woźniak, and Niels Henze. 2018. Evaluating the Disruptiveness of Mobile Interactions: A Mixed-Method Approach. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–14. https://doi.org/10.1145/3173574.3173980",
      "doi": "10.1145/3173574.3173980"
    },
    {
      "text": "Gerard McAtamney and Caroline Parker. 2006. An examination of the effects of a wearable display on informal face-to-face communication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’06). Association for Computing Machinery, New York, NY, USA, 45–54. https://doi.org/10.1145/1124772.1124780",
      "doi": "10.1145/1124772.1124780"
    },
    {
      "text": "Michel Millodot. 2008. Dictionary of Optometry and Visual Science (7th edition ed.). Butterworth-Heinemann, Edinburgh ; New York.",
      "doi": ""
    },
    {
      "text": "Takuro Nakuo and Kai Kunze. 2016. Smart glasses with a peripheral vision display. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct. ACM, Heidelberg Germany, 341–344. https://doi.org/10.1145/2968219.2971393",
      "doi": ""
    },
    {
      "text": "Tien T. Nguyen, Duyen T. Nguyen, Shamsi T. Iqbal, and Eyal Ofek. 2015. The Known Stranger: Supporting Conversations between Strangers with Personalized Topic Suggestions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 555–564. https://doi.org/10.1145/2702123.2702411",
      "doi": "10.1145/2702123.2702411"
    },
    {
      "text": "Eyal Ofek, Shamsi T. Iqbal, and Karin Strauss. 2013. Reducing disruption from subtle information delivery during a conversation: mode and bandwidth investigation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). Association for Computing Machinery, New York, NY, USA, 3111–3120. https://doi.org/10.1145/2470654.2466425",
      "doi": "10.1145/2470654.2466425"
    },
    {
      "text": "Julius Panero and Martin Zelnik. 1979. Human dimension & interior space: a source book of design reference standards. Watson-Guptill.",
      "doi": ""
    },
    {
      "text": "Benjamin Poppinga, Niels Henze, Jutta Fortmann, and Wilko Heuten. 2012. AmbiGlasses – Information in the Periphery of the Visual Field. In Mensch & Computer 2012: interaktiv informiert – allgegenwärtig und allumfassend!?153–162.",
      "doi": ""
    },
    {
      "text": "K. Rayner. 1998. Eye movements in reading and information processing: 20 years of research. Psychological Bulletin 124, 3 (Nov. 1998), 372–422. https://doi.org/10.1037/0033-2909.124.3.372",
      "doi": "10.1037/0033-"
    },
    {
      "text": "Bradley James Rhodes. 2000. Just-In-Time Information Retrieval. Ph. D. Dissertation.",
      "doi": ""
    },
    {
      "text": "Ruth Rosenholtz. 2016. Capabilities and Limitations of Peripheral Vision. Annual Review of Vision Science 2, 1 (Oct. 2016), 437–457. https://doi.org/10.1146/annurev-vision-082114-035733",
      "doi": ""
    },
    {
      "text": "Rufat Rzayev, Susanne Korbely, Milena Maul, Alina Schark, Valentin Schwind, and Niels Henze. 2020. Effects of Position and Alignment of Notifications on AR Glasses during Social Interaction. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. ACM, Tallinn Estonia, 1–11. https://doi.org/10.1145/3419249.3420095",
      "doi": "10.1145/3419249.3420095"
    },
    {
      "text": "Dario D Salvucci. 2013. Multitasking.(2013).",
      "doi": ""
    },
    {
      "text": "Elizabeth R. Schotter, Bernhard Angele, and Keith Rayner. 2012. Parafoveal processing in reading. Attention, Perception, & Psychophysics 74, 1 (Jan. 2012), 5–35. https://doi.org/10.3758/s13414-011-0219-2",
      "doi": ""
    },
    {
      "text": "H. Strasburger, I. Rentschler, and M. Juttner. 2011. Peripheral vision and pattern recognition: A review. Journal of Vision 11, 5 (Dec. 2011), 13–13. https://doi.org/10.1167/11.5.13",
      "doi": ""
    },
    {
      "text": "M. Iftekhar Tanveer, Emy Lin, and Mohammed (Ehsan) Hoque. 2015. Rhema: A Real-Time In-Situ Intelligent Interface to Help People with Public Speaking. In Proceedings of the 20th International Conference on Intelligent User Interfaces - IUI ’15. ACM Press, Atlanta, Georgia, USA, 286–295. https://doi.org/10.1145/2678025.2701386",
      "doi": "10.1145/2678025.2701386"
    },
    {
      "text": "Maarten van Dantzich, Daniel Robbins, Eric Horvitz, and Mary Czerwinski. 2002. Scope: providing awareness of multiple notifications at a glance. In Proceedings of the Working Conference on Advanced Visual Interfaces - AVI ’02. ACM Press, Trento, Italy, 267. https://doi.org/10.1145/1556262.1556306",
      "doi": "10.1145/1556262.1556306"
    },
    {
      "text": "Zheng Wang and John M Tchernev. 2012. The “myth” of media multitasking: Reciprocal dynamics of media multitasking, personal needs, and gratifications. Journal of Communication 62, 3 (2012), 493–513.",
      "doi": ""
    },
    {
      "text": "Christopher D. Wickens, Justin G. Hollands, Simon Banbury, and Raja Parasuraman. 2015. Engineering psychology and human performance (4th ed.). Pearson Education.",
      "doi": ""
    },
    {
      "text": "Kristin Williams, Karyn Moffatt, Denise McCall, and Leah Findlater. 2015. Designing Conversation Cues on a Head-Worn Display to Support Persons with Aphasia. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 231–240. https://doi.org/10.1145/2702123.2702484",
      "doi": "10.1145/2702123.2702484"
    },
    {
      "text": "Zyxwv99. 2021. Field of view. https://commons.wikimedia.org/wiki/File:Field_of_view.svg Retrieved Sept 8, 2021 from https://commons.wikimedia.org/wiki/File:Field_of_view.svg.",
      "doi": ""
    }
  ]
}