{
  "doi": "10.1145/3491102.3517632",
  "title": "Investigating Potentials of Shape-Changing Displays for Sound Zones",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2022,
  "badges": [],
  "abstract": "In this paper, we investigate the use of shape-change for interaction with sound zones. A core challenge to designing interaction with sound zone systems is to support users’ understanding of the unique spatial properties of sound zones. Shape-changing interfaces present new opportunities for addressing this. We present a structured investigation into this. We leveraged the knowledge of 12 sound experts to define a set of basic shapes and movements. Then, we constructed a prototype and conducted an elicitation study with 17 novice users, investigating the experience of these shapes and movements. Our findings show that physical visualizations of sound zones can be useful in supporting users’ experience of sound zones. We present a framework of 4 basic pattern categories that prompt different sound zone experiences and outline further research directions for shape-change in supporting sound zone interaction.",
  "tags": [
    "soundscape",
    "Sound zone",
    "shape-changing interfaces"
  ],
  "authors": [
    {
      "name": "Stine S Johansen",
      "institution": "Dept. of Computer Science, Aalborg University, Denmark",
      "img": "/do/10.1145/contrib-99660113817/rel-imgonly/stine_johansen_ciesj_design_lab_id_23082022_0-8_square.jpg",
      "acmid": "99660113817",
      "orcid": "0000-0002-8451-5444"
    },
    {
      "name": "Timothy Merritt",
      "institution": "Dept. of Computer Science, Human-Centered Computing, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659635341",
      "orcid": "missing"
    },
    {
      "name": "Rune Møberg Jacobsen",
      "institution": "Department of Computer Science, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529071",
      "orcid": "0000-0002-1877-1845"
    },
    {
      "name": "Peter Axel Nielsen",
      "institution": "Dept. of Computer Science, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100582832",
      "orcid": "missing"
    },
    {
      "name": "Jesper Kjeldskov",
      "institution": "Department of Computer Science, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548020677",
      "orcid": "0000-0001-7990-4229"
    }
  ],
  "references": [
    {
      "text": "Jason Alexander, Anne Roudaut, Jürgen Steimle, Kasper Hornbæk, Miguel Bruns Alonso, Sean Follmer, and Timothy Merritt. 2018. Grand Challenges in Shape-Changing Interface Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI’18) (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173873",
      "doi": "10.1145/3173574.3173873"
    },
    {
      "text": "Terence Betlehem, Wen Zhang, Mark A Poletti, and Thushara D Abhayapala. 2015. Personal sound zones: Delivering interface-free audio to multiple listeners. IEEE Signal Processing Magazine 32, 2 (2015), 81–91.",
      "doi": ""
    },
    {
      "text": "Ji-Ho Chang, Chan-Hui Lee, Jin-Young Park, and Yang-Hann Kim. 2009. A realization of sound focused personal audio system using acoustic contrast control. The Journal of the Acoustical Society of America 125, 4 (2009), 2091–2097.",
      "doi": ""
    },
    {
      "text": "Jordan Cheer, Stephen J Elliott, and Marcos F Simón Gálvez. 2013. Design and implementation of a car cabin personal audio system. Journal of the Audio Engineering Society 61, 6 (2013), 412–424.",
      "doi": ""
    },
    {
      "text": "Joung-Woo Choi and Yang-Hann Kim. 2002. Generation of an acoustically bright zone with an illuminated region using multiple sources. The Journal of the Acoustical Society of America 111, 4 (2002), 1695–1700.",
      "doi": ""
    },
    {
      "text": "Victoria Clarke, Virginia Braun, and Nikki Hayfield. 2015. Thematic analysis. Qualitative Psychology: A Practical Guide to Research Methods (2015), 222–248.",
      "doi": ""
    },
    {
      "text": "Marcelo Coelho and Jamie Zigelbaum. 2011. Shape-Changing Interfaces. Personal Ubiquitous Comput. 15, 2 (Feb. 2011), 161–173. https://doi.org/10.1007/s00779-010-0311-y",
      "doi": "10.1007/s00779-010-0311-y"
    },
    {
      "text": "Paul Dourish. 2001. Where the action is. MIT Press Cambridge.",
      "doi": ""
    },
    {
      "text": "WF Druyvesteyn and John Garas. 1997. Personal sound. Journal of the Audio Engineering Society 45, 9 (1997), 685–701.",
      "doi": ""
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: dynamic physical affordances and constraints through shape and object actuation.. In UIST. ACM, 417–426.",
      "doi": ""
    },
    {
      "text": "Jens Emil Grønbæk, Majken Kirkegaard Rasmussen, Kim Halskov, and Marianne Graves Petersen. 2020. KirigamiTable: Designing for Proxemic Transitions with a Shape-Changing Tabletop. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–15. https://doi-org.zorac.aub.aau.dk/10.1145/3313831.3376834",
      "doi": "10.1145/3313831.3376834"
    },
    {
      "text": "John Hardy, Christian Weichel, Faisal Taher, John Vidler, and Jason Alexander. 2015. Shapeclip: towards rapid prototyping with shape-changing displays for designers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI’15). 19–28.",
      "doi": "10.1145/2702123.2702599"
    },
    {
      "text": "Franz Heuchel, Diego Caviedes Nozal, and Finn T Agerkvist. 2018. Sound field control for reduction of noise from outdoor concerts. In Audio Engineering Society Convention 145. Audio Engineering Society.",
      "doi": ""
    },
    {
      "text": "David Holman and Roel Vertegaal. 2008. Organic User Interfaces: Designing Computers in Any Way, Shape, or Form. Commun. ACM 51, 6 (June 2008), 48–55. https://doi.org/10.1145/1349026.1349037",
      "doi": "10.1145/1349026.1349037"
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI’97). ACM, 234–241.",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Sungjune Jang, Lawrence H Kim, Kesler Tanner, Hiroshi Ishii, and Sean Follmer. 2016. Haptic edge display for mobile tactile interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI’16). ACM, 3706–3716.",
      "doi": "10.1145/2858036.2858264"
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, Petra Isenberg, Jason Alexander, Abhijit Karnik, Johan Kildal, Sriram Subramanian, and Kasper Hornbæk. 2015. Opportunities and Challenges for Data Physicalization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI’15) (Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 3227–3236. https://doi.org/10.1145/2702123.2702180",
      "doi": "10.1145/2702123.2702180"
    },
    {
      "text": "Martin Kaltenbrunner and Jens Vetter. 2018. Tquencer: A tangible musical sequencer using overlays. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, 429–434.",
      "doi": "10.1145/3173225.3173233"
    },
    {
      "text": "Hyunyoung Kim, Celine Coutrix, and Anne Roudaut. 2018. Morphees+: Studying Everyday Reconfigurable Objects for the Design and Taxonomy of Reconfigurable UIs. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–14. https://doi-org.zorac.aub.aau.dk/10.1145/3173574.3174193",
      "doi": "10.1145/3173574.3174193"
    },
    {
      "text": "Nicole (L’Huillier Chaparro) L’Huillier. 2017. Spaces that perform themselves. Thesis. Massachusetts Institute of Technology. https://dspace.mit.edu/handle/1721.1/114067Accepted: 2018-03-12T19:28:27Z.",
      "doi": ""
    },
    {
      "text": "Stine S Lundgaard and Peter Axel Nielsen. 2019. Personalised soundscapes in homes. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, 813–822.",
      "doi": ""
    },
    {
      "text": "Stine S Lundgaard, Peter Axel Nielsen, and Jesper Kjeldskov. 2020. Designing for domestic sound zone interaction. Personal and Ubiquitous Computing(2020), 1–12.",
      "doi": ""
    },
    {
      "text": "Sara Nabil, Aluna Everitt, Miriam Sturdee, Jason Alexander, Simon Bowen, Peter Wright, and David Kirk. 2018. ActuEating: Designing, Studying and Exploring Actuating Decorative Artefacts. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). ACM, New York, NY, USA, 327–339. https://doi.org/10.1145/3196709.3196761",
      "doi": "10.1145/3196709.3196761"
    },
    {
      "text": "Masashi Nakatani, Hiroyuki Kajimoto, Dairokou Sekighuchi, Naoki Kawakami, and Susumu Tachi. 2004. Pop Up! a novel technology of shape display of 3D objects. In ACM SIGGRAPH 2004 Emerging Technologies. ACM, 21.",
      "doi": ""
    },
    {
      "text": "Gerard Oleksik, David Frohlich, Lorna M. Brown, and Abigail Sellen. 2008. Sonic Interventions: Understanding and Extending the Domestic Soundscape. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). ACM, New York, NY, USA, 1419–1428. https://doi.org/10.1145/1357054.1357277",
      "doi": "10.1145/1357054.1357277"
    },
    {
      "text": "Bang & Olufsen. n.d.. Beolab 28 - Wireless stereo speakers. Retrieved July 21, 2021 from https://www.bang-olufsen.com/en/us/speakers/beolab-28",
      "doi": ""
    },
    {
      "text": "Marianne Graves Petersen, Majken Kirkegaard Rasmussen, and Johan Trettvik. 2020. Affordances of Shape-Changing Interfaces: An Information Perspective on Transformability and Movement. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. ACM, New York, NY, USA, 1959–1971. https://doi-org.zorac.aub.aau.dk/10.1145/3357236.3395521",
      "doi": "10.1145/3357236.3395521"
    },
    {
      "text": "F Joseph Pompei. 1999. The use of airborne ultrasonics for generating audible sound beams. Journal of the Audio Engineering Society 47, 9 (1999), 726–731.",
      "doi": ""
    },
    {
      "text": "Zachary Pousman and John Stasko. 2006. A taxonomy of ambient information systems: four patterns of design. In Proceedings of the Working Conference on Advanced visual interfaces. ACM, 67–74.",
      "doi": "10.1145/1133265.1133277"
    },
    {
      "text": "Jussi Rämö, Lasse Christensen, Søren Bech, and Søren Jensen. 2017. Validating a perceptual distraction model using a personal two-zone sound system. In Proceedings of Meetings on Acoustics 173EAA, Vol. 30. Acoustical Society of America, 050003.",
      "doi": ""
    },
    {
      "text": "Majken K. Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk. 2012. Shape-Changing Interfaces: A Review of the Design Space and Open Research Questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI’12)(Austin, Texas, USA) (CHI ’12). ACM, New York, NY, USA, 735–744. https://doi.org/10.1145/2207676.2207781",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Majken K. Rasmussen, Giovanni M. Troiano, Marianne G. Petersen, Jakob G. Simonsen, and Kasper Hornbæk. 2016. Sketching Shape-Changing Interfaces: Exploring Vocabulary, Metaphors Use, and Affordances. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 2740–2751. https://doi.org/10.1145/2858036.2858183",
      "doi": "10.1145/2858036.2858183"
    },
    {
      "text": "Anne Roudaut, Abhijit Karnik, Markus Löchtefeld, and Sriram Subramanian. 2013. Morphees: Toward High ”Shape Resolution” in Self-Actuated Flexible Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI’13). ACM, New York, NY, USA, 593–602. https://doi-org.zorac.aub.aau.dk/10.1145/2470654.2470738",
      "doi": "10.1145/2470654.2470738"
    },
    {
      "text": "Alexa F. Siu, Son Kim, Joshua A. Miele, and Sean Follmer. 2019. ShapeCAD: An Accessible 3D Modelling Workflow for the Blind and Visually-Impaired Via 2.5D Shape Displays. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility (Pittsburgh, PA, USA) (ASSETS ’19). ACM, New York, NY, USA, 342–354. https://doi.org/10.1145/3308561.3353782",
      "doi": "10.1145/3308561.3353782"
    },
    {
      "text": "Miriam Sturdee and Jason Alexander. 2018. Analysis and Classification of Shape-Changing Interfaces for Design and Application-Based Research. ACM Comput. Surv. 51, 1, Article 2 (Jan. 2018), 32 pages. https://doi.org/10.1145/3143559",
      "doi": "10.1145/3143559"
    },
    {
      "text": "Miriam Sturdee, Aluna Everitt, Joseph Lindley, Paul Coulton, and Jason Alexander. 2019. Visual Methods for the Design of Shape-Changing Interfaces. In IFIP Conference on Human-Computer Interaction. Springer, 337–358.",
      "doi": "10.1007/s00779-010-0311-y"
    },
    {
      "text": "Miriam Sturdee, John Hardy, Nick Dunn, and Jason Alexander. 2015. A Public Ideation of Shape-Changing Applications. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (Madeira, Portugal) (ITS ’15). ACM, New York, NY, USA, 219–228. https://doi.org/10.1145/2817721.2817734",
      "doi": "10.1145/2817721.2817734"
    },
    {
      "text": "Miriam Sturdee and Joseph Lindley. 2019. Sketching & Drawing as Future Inquiry in HCI. In Proceedings of the Halfway to the Future Symposium 2019 (Nottingham, United Kingdom) (HTTF 2019). ACM, New York, NY, USA, Article 18, 10 pages. https://doi.org/10.1145/3363384.3363402",
      "doi": "10.1145/3363384.3363402"
    },
    {
      "text": "Ivan E. Sutherland. 1965. The Ultimate Display. In Proceedings of the IFIP Congress. 506–508.",
      "doi": ""
    },
    {
      "text": "Kazuki Takashima, Takafumi Oyama, Yusuke Asari, Ehud Sharlin, Saul Greenberg, and Yoshifumi Kitamura. 2016. Study and design of a shape-shifting wall display. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 796–806.",
      "doi": "10.1145/2901790.2901892"
    },
    {
      "text": "Wordlesstech. n.d.. DBEST Transformative Bluetooth Hi-Fi System. Retrieved July 21, 2021 from https://wordlesstech.com/dbest-transformative-bluetooth-hi-fi-system/",
      "doi": ""
    }
  ]
}