{
  "doi": "10.1145/3491102.3501906",
  "title": "(Dis)Appearables: A Concept and Method for Actuated Tangible UIs to Appear and Disappear based on Stages",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2022,
  "badges": [],
  "abstract": "(Dis)Appearables is an approach for actuated Tangible User Interfaces (TUIs) to appear and disappear. This technique is supported by Stages: physical platforms inspired by theatrical stages. Self-propelled TUI’s autonomously move between front and back stage allowing them to dynamically appear and disappear from users’ attention. This platform opens up a novel interaction design space for expressive displays with dynamic physical affordances.  We demonstrate and explore this approach based on a proof-of-concept implementation using two-wheeled robots, and multiple stage design examples. We have implemented a stage design pipeline which allows users to plan and design stages that are composed with front and back stages, and transition portals such as trap doors or lifts. The pipeline includes control of the robots, which guides them on and off stage. With this proof-of-concept prototype, we demonstrated a range of applications including interactive mobility simulation, self re-configuring desktops, remote hockey, and storytelling/gaming. Inspired by theatrical stage designs, this is a new take on ‘controlling the existence of matter’ for user experience design.",
  "authors": [
    {
      "name": "Ken Nakagaki",
      "institution": "MIT Media Lab, Massachusetts Institute of Technology, United States",
      "img": "/do/10.1145/contrib-81488670562/rel-imgonly/ken-profile_may2022_square.jpg",
      "acmid": "81488670562",
      "orcid": "0000-0002-1351-6976"
    },
    {
      "name": "Jordan L Tappa",
      "institution": "Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659589152",
      "orcid": "missing"
    },
    {
      "name": "Yi Zheng",
      "institution": "University of Southern California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235185",
      "orcid": "missing"
    },
    {
      "name": "Jack Forman",
      "institution": "MIT Media Lab, Massachusetts Institute of Technology, United States",
      "img": "/do/10.1145/contrib-99659366829/rel-imgonly/jack_black.jpg",
      "acmid": "99659366829",
      "orcid": "missing"
    },
    {
      "name": "Joanne Leong",
      "institution": "MIT Media Lab, Massachusetts Institute of Technology, United States",
      "img": "/do/10.1145/contrib-89558862057/rel-imgonly/joanne-grey-square-640.jpg",
      "acmid": "89558862057",
      "orcid": "0000-0001-5422-1018"
    },
    {
      "name": "Sven Koenig",
      "institution": "University of Southern California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100327499",
      "orcid": "missing"
    },
    {
      "name": "Hiroshi Ishii",
      "institution": "MIT Media Lab, Massachusetts Institute of Technology, United States",
      "img": "/do/10.1145/contrib-81100363076/rel-imgonly/120908-024.jpg",
      "acmid": "81100363076",
      "orcid": "0000-0003-4918-8908"
    }
  ],
  "references": [
    {
      "text": "Apple. [n.d.]. iOS 15 brings new ways to stay connected and powerful features that help users focus, explore, and do more with on-device intelligence. https://www.apple.com/newsroom/2021/06/ios-15-brings-powerful-new-features-to-stay-connected-focus-explore-and-more/- accessed January-6-2022.",
      "doi": ""
    },
    {
      "text": "Santiago Bedoya-Rodriguez, Cristian Gomez-Urbano, Alvaro Uribe-Quevedoy, and Christian Quintero. 2014. Augmented reality RPG card-based game. In 2014 IEEE Games Media Entertainment. IEEE, 1–4.",
      "doi": ""
    },
    {
      "text": "Sean Braley, Calvin Rubens, Timothy Merritt, and Roel Vertegaal. 2018. GridDrones: A Self-Levitating Physical Voxel Lattice for Interactive 3D Surface Deformations.. In UIST. 87–98.",
      "doi": ""
    },
    {
      "text": "Marcelo Coelho and Jamie Zigelbaum. 2011. Shape-changing interfaces. Personal and Ubiquitous Computing 15, 2 (2011), 161–173.",
      "doi": "10.1007/s00779-010-0311-y"
    },
    {
      "text": "Sony Interactive Entertainment. [n.d.]. toioTM Mat for Developers (in Japanese). https://toio.io/news/2020/20200423-1.html - accessed January-6-2022.",
      "doi": ""
    },
    {
      "text": "Sony Interactive Entertainment. [n.d.]. Toy Platform toioTM. https://www.sony.net/SonyInfo/design/stories/toio/ - accessed January-6-2022.",
      "doi": ""
    },
    {
      "text": "George W Fitzmaurice 1997. Graspable user interfaces.University of Toronto.",
      "doi": ""
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: dynamic physical affordances and constraints through shape and object actuation.. In Uist, Vol. 13. 2501988–2502032.",
      "doi": ""
    },
    {
      "text": "Phil Frei, Victor Su, Bakhtiar Mikhak, and Hiroshi Ishii. 2000. Curlybot: designing a new class of computational toys. In Proceedings of the SIGCHI conference on Human factors in computing systems. 129–136.",
      "doi": "10.1145/332040.332416"
    },
    {
      "text": "Antonio Gomes, Calvin Rubens, Sean Braley, and Roel Vertegaal. 2016. Bitdrones: Towards using 3d nanocopter displays as interactive self-levitating programmable matter. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 770–780.",
      "doi": "10.1145/2858036.2858519"
    },
    {
      "text": "Arzu Guneysu Ozgur, Maximilian J Wessel, Jennifer K Olsen, Wafa Johal, Ayberk Ozgur, Friedhelm C Hummel, and Pierre Dillenbourg. 2020. Gamified motor training with tangible robots in older adults: a feasibility study and comparison with the young. Frontiers in aging neuroscience 12 (2020), 59.",
      "doi": ""
    },
    {
      "text": "iRobot. [n.d.]. Roomba. https://www.irobot.com/roomba - accessed January-6-2022.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii, Dávid Lakatos, Leonardo Bonanni, and Jean-Baptiste Labrune. 2012. Radical atoms: beyond tangible bits, toward transformable materials. interactions 19, 1 (2012), 38–51.",
      "doi": "10.1145/2065327.2065337"
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proceedings of the ACM SIGCHI Conference on Human factors in computing systems. 234–241.",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, Petra Isenberg, Jason Alexander, Abhijit Karnik, Johan Kildal, Sriram Subramanian, and Kasper Hornbæk. 2015. Opportunities and challenges for data physicalization. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 3227–3236.",
      "doi": "10.1145/2702123.2702180"
    },
    {
      "text": "Shohei Katakura, Yuto Kuroki, and Keita Watanabe. 2019. A 3D printer head as a robotic manipulator. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 535–548.",
      "doi": "10.1145/3332165.3347885"
    },
    {
      "text": "Hyunyoung Kim, Céline Coutrix, and Anne Roudaut. 2018. KnobSlider: Design of a Shape-Changing UI for Parameter Control. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173913"
    },
    {
      "text": "Lawrence H Kim, Daniel Drew, Veronika Domova, and Sean Follmer. 2020. User-defined Swarm Robot Control. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. xx–xx.",
      "doi": "10.1145/3313831.3376814"
    },
    {
      "text": "Lawrence H Kim and Sean Follmer. 2017. Ubiswarm: Ubiquitous robotic interfaces and investigation of abstract motion as a display. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 1–20.",
      "doi": "10.1145/3130931"
    },
    {
      "text": "Lawrence H Kim and Sean Follmer. 2019. SwarmHaptics: Haptic Display with Swarm Robots. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300918"
    },
    {
      "text": "Mathieu Le Goc, Lawrence H Kim, Ali Parsaei, Jean-Daniel Fekete, Pierre Dragicevic, and Sean Follmer. 2016. Zooids: Building blocks for swarm user interfaces. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 97–109.",
      "doi": "10.1145/2984511.2984547"
    },
    {
      "text": "Jinha Lee, Rehmi Post, and Hiroshi Ishii. 2011. ZeroN: mid-air tangible interaction enabled by computer controlled magnetic levitation. In Proceedings of the 24th annual ACM symposium on User interface software and technology. 327–336.",
      "doi": "10.1145/2047196.2047239"
    },
    {
      "text": "LEGO. [n.d.]. LEGO®Mario™. https://www.lego.com/en-us/themes/super-mario - accessed January-6-2022.",
      "doi": ""
    },
    {
      "text": "Daniel Leithinger, Sean Follmer, Alex Olwal, and Hiroshi Ishii. 2014. Physical telepresence: shape capture and display for embodied, computer-mediated remote collaboration. In Proceedings of the 27th annual ACM symposium on User interface software and technology. 461–470.",
      "doi": "10.1145/2642918.2647377"
    },
    {
      "text": "Daniel Leithinger, Sean Follmer, Alex Olwal, and Hiroshi Ishii. 2015. Shape displays: Spatial interaction with dynamic physical form. IEEE computer graphics and applications 35, 5 (2015), 5–11.",
      "doi": ""
    },
    {
      "text": "Jiaoyang Li, Pavel Surynek, Ariel Felner, Hang Ma, T. K. Satish Kumar, and Sven Koenig. 2019. Multi-Agent Path Finding for Large Agents. In The Thirty-Third AAAI Conference on Artificial Intelligence, AAAI 2019, The Thirty-First Innovative Applications of Artificial Intelligence Conference, IAAI 2019, The Ninth AAAI Symposium on Educational Advances in Artificial Intelligence, EAAI 2019, Honolulu, Hawaii, USA, January 27 - February 1, 2019. AAAI Press, 7627–7634. https://doi.org/10.1609/aaai.v33i01.33017627",
      "doi": "10.1609/aaai.v33i01.33017627"
    },
    {
      "text": "Pål Liljebäck, Kristin Ytterstad Pettersen, Øyvind Stavdahl, and Jan Tommy Gravdahl. 2012. A review on modelling, implementation, and control of snake robots. Robotics and Autonomous systems 60, 1 (2012), 29–40.",
      "doi": ""
    },
    {
      "text": "David Lindlbauer, Jörg Mueller, and Marc Alexa. 2017. Changing the appearance of real-world objects by modifying their surroundings. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3954–3965.",
      "doi": "10.1145/3025453.3025795"
    },
    {
      "text": "David Lindlbauer, Jörg Müller, and Marc Alexa. 2016. Changing the appearance of physical interfaces through controlled transparency. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 425–435.",
      "doi": "10.1145/2984511.2984556"
    },
    {
      "text": "Hang Ma, Wolfgang Hönig, TK Satish Kumar, Nora Ayanian, and Sven Koenig. 2019. Lifelong path planning with kinematic constraints for multi-agent pickup and delivery. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 33. 7651–7658.",
      "doi": "10.1609/aaai.v33i01.33017651"
    },
    {
      "text": "Ken Nakagaki. 2020. Mechanical Shells: Physical Add-ons for Extending and Reconfiguring the Interactivities of Actuated TUIs. In Adjunct Publication of the 33rd Annual ACM Symposium on User Interface Software and Technology. 151–156.",
      "doi": ""
    },
    {
      "text": "Ken Nakagaki, Sean Follmer, Artem Dementyev, Joseph A Paradiso, and Hiroshi Ishii. 2017. Designing Line-Based Shape-Changing Interfaces. IEEE Pervasive Computing 16, 4 (2017), 36–46.",
      "doi": ""
    },
    {
      "text": "Ken Nakagaki, Sean Follmer, and Hiroshi Ishii. 2015. Lineform: Actuated curve interfaces for display, interaction, and constraint. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. 333–339.",
      "doi": "10.1145/2807442.2807452"
    },
    {
      "text": "Ken Nakagaki, Joanne Leong, Jordan L Tappa, João Wilbert, and Hiroshi Ishii. 2020. HERMITS: Dynamically Reconfiguring the Interactivity of Self-Propelled TUIs with Mechanical Shell Add-ons. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology.",
      "doi": "10.1145/3379337.3415831"
    },
    {
      "text": "Gian Pangaro, Dan Maynes-Aminzade, and Hiroshi Ishii. 2002. The actuated workbench: computer-controlled actuation in tabletop tangible interfaces. In Proceedings of the 15th annual ACM symposium on User interface software and technology. 181–190.",
      "doi": "10.1145/571985.572011"
    },
    {
      "text": "James Patten, Hiroshi Ishii, Jim Hines, and Gian Pangaro. 2001. Sensetable: a wireless object tracking platform for tangible user interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems. 253–260.",
      "doi": "10.1145/365024.365112"
    },
    {
      "text": "Marianne Graves Petersen, Majken Kirkegaard Rasmussen, and Johan Trettvik. 2020. Affordances of Shape-Changing Interfaces: An Information Perspective on Transformability and Movement. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 1959–1971.",
      "doi": "10.1145/3357236.3395521"
    },
    {
      "text": "Majken K Rasmussen, Esben W Pedersen, Marianne G Petersen, and Kasper Hornbæk. 2012. Shape-changing interfaces: a review of the design space and open research questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 735–744.",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "David Robert and Cynthia Breazeal. 2012. Blended reality characters. In Proceedings of the seventh annual ACM/IEEE international conference on Human-Robot Interaction. 359–366.",
      "doi": "10.1145/2157689.2157810"
    },
    {
      "text": "Simon Robinson, Céline Coutrix, Jennifer Pearson, Juan Rosso, Matheus Fernandes Torquato, Laurence Nigay, and Matt Jones. 2016. Emergeables: Deformable displays for continuous eyes-free mobile interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 3793–3805.",
      "doi": "10.1145/2858036.2858097"
    },
    {
      "text": "John W Romanishin, Kyle Gilpin, and Daniela Rus. 2013. M-blocks: Momentum-driven, magnetic modular robots. In 2013 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE, 4288–4295.",
      "doi": ""
    },
    {
      "text": "Michael Rubenstein, Alejandro Cornejo, and Radhika Nagpal. 2014. Programmable self-assembly in a thousand-robot swarm. Science 345, 6198 (2014), 795–799.",
      "doi": ""
    },
    {
      "text": "Daniela Rus. 1998. Self-reconfiguring robots. IEEE Intelligent Systems and Their Applications 13, 4(1998), 2–4.",
      "doi": "10.1109/5254.708423"
    },
    {
      "text": "Orit Shaer and Eva Hornecker. 2010. Tangible user interfaces: past, present, and future directions. Now Publishers Inc.",
      "doi": ""
    },
    {
      "text": "Guni Sharon, Roni Stern, Ariel Felner, and Nathan R Sturtevant. 2015. Conflict-based search for optimal multi-agent pathfinding. Artificial Intelligence 219 (2015), 40–66.",
      "doi": "10.1016/j.artint.2014.11.006"
    },
    {
      "text": "Shiro-A. [n.d.]. Performance: Shiro-A at TEDxTokyo. https://www.youtube.com/watch?v=PqjZFzcpUho - accessed January-6-2022.",
      "doi": ""
    },
    {
      "text": "Roni Stern, Nathan R Sturtevant, Ariel Felner, Sven Koenig, Hang Ma, Thayne T Walker, Jiaoyang Li, Dor Atzmon, Liron Cohen, TK Satish Kumar, 2019. Multi-agent pathfinding: Definitions, variants, and benchmarks. In Twelfth Annual Symposium on Combinatorial Search.",
      "doi": ""
    },
    {
      "text": "Ivan E Sutherland. 1965. The ultimate display. Multimedia: From Wagner to virtual reality 1 (1965).",
      "doi": ""
    },
    {
      "text": "Ryo Suzuki, Hooman Hedayati, Clement Zheng, James Bohn, Daniel Szafir, Ellen Yi-Luen Do, Mark D Gross, and Daniel Leithinger. 2020. RoomShift: Room-scale Dynamic Haptics for VR with Furniture-moving Swarm Robots. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. xx–xx.",
      "doi": "10.1145/3313831.3376523"
    },
    {
      "text": "Ryo Suzuki, Jun Kato, Mark D Gross, and Tom Yeh. 2018. Reactile: Programming Swarm User Interfaces through Direct Physical Manipulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173773"
    },
    {
      "text": "Ryo Suzuki, Abigale Stangl, Mark D Gross, and Tom Yeh. 2017. FluxMarker: Enhancing Tactile Graphics with Dynamic Tactile Markers. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. 190–199.",
      "doi": "10.1145/3132525.3132548"
    },
    {
      "text": "Ryo Suzuki, Junichi Yamaoka, Daniel Leithinger, Tom Yeh, Mark D Gross, Yoshihiro Kawahara, and Yasuaki Kakehi. 2018. Dynablock: Dynamic 3D Printing for Instant and Reconstructable Shape Formation. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology. 99–111.",
      "doi": "10.1145/3242587.3242659"
    },
    {
      "text": "Ryo Suzuki, Clement Zheng, Yasuaki Kakehi, Tom Yeh, Ellen Yi-Luen Do, Mark D Gross, and Daniel Leithinger. 2019. ShapeBots: Shape-changing Swarm Robots. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 493–505.",
      "doi": "10.1145/3332165.3347911"
    },
    {
      "text": "Shan-Yuan Teng, Tzu-Sheng Kuo, Chi Wang, Chi-huan Chiang, Da-Yuan Huang, Liwei Chan, and Bing-Yu Chen. 2018. Pupop: Pop-up prop on palm for virtual reality. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology. 5–17.",
      "doi": "10.1145/3242587.3242628"
    },
    {
      "text": "Shan-Yuan Teng, Cheng-Lung Lin, Chi-huan Chiang, Tzu-Sheng Kuo, Liwei Chan, Da-Yuan Huang, and Bing-Yu Chen. 2019. TilePoP: Tile-type Pop-up Prop for Virtual Reality. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 639–649.",
      "doi": "10.1145/3332165.3347958"
    },
    {
      "text": "Gary Thorne. 2011. Stage design: A practical guide. Crowood.",
      "doi": ""
    },
    {
      "text": "Tommaso Toffoli and Norman Margolus. 1991. Programmable matter: concepts and realization. Physica. D, Nonlinear phenomena 47, 1-2 (1991), 263–272.",
      "doi": ""
    },
    {
      "text": "Bruce Tognazzini. 1993. Principles, techniques, and ethics of stage magic and their application to human interface design. In Proceedings of the INTERACT’93 and CHI’93 Conference on Human Factors in Computing Systems. 355–362.",
      "doi": "10.1145/169059.169284"
    },
    {
      "text": "Brygg Ullmer and Hiroshi Ishii. 1997. The metaDESK: models and prototypes for tangible user interfaces. In Proceedings of the 10th annual ACM symposium on User interface software and technology. 223–232.",
      "doi": "10.1145/263407.263551"
    },
    {
      "text": "Brygg Ullmer and Hiroshi Ishii. 2001. Emerging frameworks for tangible user interfaces. Human-Computer Interaction in the New Millenium (2001), 579–601.",
      "doi": ""
    },
    {
      "text": "Luke Vink, Viirj Kan, Ken Nakagaki, Daniel Leithinger, Sean Follmer, Philipp Schoessler, Amit Zoran, and Hiroshi Ishii. 2015. Transform as adaptive and dynamic furniture. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. 183–183.",
      "doi": "10.1145/2702613.2732494"
    },
    {
      "text": "Junichi Yamaoka and Yasuaki Kakehi. 2017. ProtoMold: An interactive vacuum forming system for rapid prototyping. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2106–2115.",
      "doi": "10.1145/3025453.3025498"
    },
    {
      "text": "Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: pneumatically actuated soft composite materials for shape changing interfaces. In Proceedings of the 26th annual ACM symposium on User interface software and Technology. 13–22.",
      "doi": "10.1145/2501988.2502037"
    },
    {
      "text": "Mark Yim, David G Duff, and Kimon D Roufas. 2000. PolyBot: a modular reconfigurable robot. In Proceedings 2000 ICRA. Millennium Conference. IEEE International Conference on Robotics and Automation. Symposia Proceedings (Cat. No. 00CH37065), Vol. 1. IEEE, 514–520.",
      "doi": ""
    },
    {
      "text": "Yiwei Zhao, Lawrence H Kim, Ye Wang, Mathieu Le Goc, and Sean Follmer. 2017. Robotic assembly of haptic proxy objects for tangible interaction and virtual reality. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces. 82–91.",
      "doi": "10.1145/3132272.3134143"
    }
  ]
}