{
  "doi": "10.1145/3491102.3517536",
  "title": "Letters from the Future: Exploring Ethical Dilemmas in the Design of Social Agents",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2022,
  "badges": [],
  "abstract": "We present a case-study of using Ethnographic Experiential Futures (EXF) to surface underlying divergences, tensions and dilemmas implicit in views of the futures of ”social agents” among professional researchers familiar with the state of the art. Based on expert interviews, we designed three ”letters from the future,” research probes that were mailed to 15 participants working in the field, to encounter and respond to. We lay out the elements and design choices that shaped these probes, present our remote and asynchronous study design, and discuss lessons learned about the use of EXF. We find that this form of hybrid design/futures intervention has the potential to provide professional communities with opportunities to grapple with potential ethical dilemmas early on. However, the knowledge and tools for doing so are still in the making. Our contribution is a step towards advancing the potential benefits of experiential futures for technology designers and researchers.",
  "tags": [
    "foresight",
    "ethnographic experiential futures",
    "artificial intelligence",
    "robots",
    "probes",
    "speculative design",
    "ethics",
    "social agents",
    "design fiction"
  ],
  "authors": [
    {
      "name": "Michal Luria",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-99658688561/rel-imgonly/michal_luria.jpg",
      "acmid": "99658688561",
      "orcid": "missing"
    },
    {
      "name": "Stuart Candy",
      "institution": "School of Design, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233669",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "AI Google 2018. Artificial Intelligence at Google: our principles. https://www.blog.google/technology/ai/ai-principles/.",
      "doi": ""
    },
    {
      "text": "AI Microsoft 2018. The Future Computed: Artificial Intelligence and its role in society. https://news.microsoft.com/uploads/2018/01/The-Future-Computed.pdf/.",
      "doi": ""
    },
    {
      "text": "James Auger. 2014. Living with robots: A speculative design approach. Journal of Human-Robot Interaction 3, 1 (2014), 20–42.",
      "doi": "10.5898/jhri.3.1.auger"
    },
    {
      "text": "Stephanie Ballard, Karen M Chappell, and Kristen Kennedy. 2019. Judgment call the game: Using value sensitive design and design fiction to surface ethical concerns related to technology. In Proceedings of the 2019 on Designing Interactive Systems Conference. 421–433.",
      "doi": "10.1145/3322276.3323697"
    },
    {
      "text": "David N Bengston. 2016. The Futures Wheel: a method for exploring the implications of social–ecological change. Society & Natural Resources 29, 3 (2016), 374–379.",
      "doi": ""
    },
    {
      "text": "Hugh Beyer and Karen Holtzblatt. 1997. Contextual design: A customer-centered approach to systems designs.",
      "doi": ""
    },
    {
      "text": "Julian Bleecker. 2009. Design Fiction: A short essay on design, science, fact and fiction. Near future laboratory 29 (2009).",
      "doi": ""
    },
    {
      "text": "Mark A Blythe and Peter C Wright. 2006. Pastiche scenarios: Fiction as a resource for user centred design. Interacting with computers 18, 5 (2006), 1139–1164.",
      "doi": ""
    },
    {
      "text": "Petter Bae Brandtzaeg and Asbjørn Følstad. 2018. Chatbots: changing user needs and motivations. Interactions 25, 5 (2018), 38–43.",
      "doi": "10.1145/3236669"
    },
    {
      "text": "Laura Burbach, Chantal Lidynia, Philipp Brauner, and Martina Ziefle. 2019. Data protectors, benefit maximizers, or facts enthusiasts: Identifying user profiles for life-logging technologies. Computers in Human Behavior 99 (2019), 9–21.",
      "doi": "10.1016/j.chb.2019.05.004"
    },
    {
      "text": "Stuart Candy. 2010. The futures of everyday life: Politics and the design of experiential scenarios. University of (2010).",
      "doi": ""
    },
    {
      "text": "Stuart Candy. 2018. Gaming futures literacy: The thing from the future. In Transforming the Future. Routledge, 233–246.",
      "doi": ""
    },
    {
      "text": "Stuart Candy and Jake Dunagan. 2017. Designing an experiential scenario: The people who vanished. Futures 86(2017), 136–153.",
      "doi": ""
    },
    {
      "text": "Stuart Candy and Kelly Kornet. 2019. Turning foresight inside out: An introduction to ethnographic experiential futures. Journal of Futures Studies 23, 3 (2019), 3–22.",
      "doi": ""
    },
    {
      "text": "EunJeong Cheon and Norman Makoto Su. 2018. Futuristic autobiographies: Weaving participant narratives to elicit values around robots. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction. 388–397.",
      "doi": "10.1145/3171221.3171244"
    },
    {
      "text": "Scott Davidoff, Min Kyung Lee, Anind K Dey, and John Zimmerman. 2007. Rapidly exploring application design through speed dating. In International Conference on Ubiquitous Computing. Springer, 429–446.",
      "doi": ""
    },
    {
      "text": "Anthony Dunne. 2008. Hertzian tales: Electronic products, aesthetic experience, and critical design. MIT press.",
      "doi": "10.5555/1205303"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative everything: design, fiction, and social dreaming. MIT press.",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Tony Fry. 2007. Redirective practice: an elaboration. Design philosophy papers 5, 1 (2007), 5–20.",
      "doi": ""
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: cultural probes. interactions 6, 1 (1999), 21–29.",
      "doi": ""
    },
    {
      "text": "Kerstin S Haring, Michael Misha Novitzky, Paul Robinette, Ewart J De Visser, Alan Wagner, and Tom Williams. 2019. The dark side of human-robot interaction: ethical considerations and community guidelines for the field of HRI. In 2019 14th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 689–690.",
      "doi": ""
    },
    {
      "text": "Tom Jenkins, Laurens Boer, Juliane Brigitta Busboom, and Ivar Østby Simonsen. 2020. The Future Supermarket: A Case Study of Ethnographic Experiential Futures. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. 1–13.",
      "doi": "10.1145/3419249.3420130"
    },
    {
      "text": "Kelly Kornet. 2015. Causing An Effect: Activists, Uncertainty & Images of the Future. (2015).",
      "doi": ""
    },
    {
      "text": "Sandjar Kozubaev, Chris Elsden, Noura Howell, Marie Louise Juul Søndergaard, Nick Merrill, Britta Schulte, and Richmond Y Wong. 2020. Expanding Modes of Reflection in Design Futuring. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376526"
    },
    {
      "text": "Michal Luria, Judeth Oden Choi, Rachel Gita Karp, John Zimmerman, and Jodi Forlizzi. 2020. Robotic Futures: Learning about Personally-Owned Agents through Performance. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 165–177.",
      "doi": "10.1145/3357236.3395488"
    },
    {
      "text": "Michal Luria, Samantha Reig, Xiang Zhi Tan, Aaron Steinfeld, Jodi Forlizzi, and John Zimmerman. 2019. Re-Embodiment and Co-Embodiment: Exploration of social presence for robots and conversational agents. In Proceedings of the 2019 on Designing Interactive Systems Conference. 633–644.",
      "doi": "10.1145/3322276.3322340"
    },
    {
      "text": "Michal Luria, Rebecca Zheng, Bennett Huffman, Shuangni Huang, John Zimmerman, and Jodi Forlizzi. 2020. Social Boundaries for Personal Agents in the Interpersonal Space of the Home. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376311"
    },
    {
      "text": "Jennifer Manuel and Clara Crivellaro. 2020. Place-Based Policymaking and HCI: Opportunities and Challenges for Technology Design. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3313831.3376158"
    },
    {
      "text": "mccarthy2018 2018. Feeling at Home Between Human and AI. immerse.news/feeling-at-home-between-human-and-ai-6047561e7f04/.",
      "doi": ""
    },
    {
      "text": "Evgeny Morozov. 2013. To save everything, click here: The folly of technological solutionism. Public Affairs.",
      "doi": ""
    },
    {
      "text": "William Odom, John Zimmerman, Scott Davidoff, Jodi Forlizzi, Anind K Dey, and Min Kyung Lee. 2012. A fieldwork of the future with user enactments. In Proceedings of the Designing Interactive Systems Conference. 338–347.",
      "doi": "10.1145/2317956.2318008"
    },
    {
      "text": "James Pierce. 2019. Smart home security cameras and shifting lines of creepiness: A design-led inquiry. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300275"
    },
    {
      "text": "Laurel D Riek. 2012. Wizard of oz studies in hri: a systematic review and new reporting guidelines. Journal of Human-Robot Interaction 1, 1 (2012), 119–136.",
      "doi": "10.5898/JHRI.1.1.Riek"
    },
    {
      "text": "Britta F Schulte, Paul Marshall, and Anna L Cox. 2016. Homes for life: a design fiction probe. In Proceedings of the 9th nordic conference on human-computer interaction. 1–10.",
      "doi": "10.1145/2971485.2993925"
    },
    {
      "text": "Tristan Schultz, Danah Abdulla, Ahmed Ansari, Ece Canlı, Mahmoud Keshavarz, Matthew Kiem, Luiza Prado de O Martins, and Pedro JS Vieira de Oliveira. 2018. What is at stake with decolonizing design? A Roundtable. Design and Culture 10, 1 (2018), 81–101.",
      "doi": ""
    },
    {
      "text": "Reinhard Sefelin, Manfred Tscheligi, and Verena Giller. 2003. Paper prototyping-what is it good for? A comparison of paper-and computer-based low-fidelity prototyping. In CHI’03 extended abstracts on Human factors in computing systems. 778–779.",
      "doi": ""
    },
    {
      "text": "Michael Warren Skirpan, Jacqueline Cameron, and Tom Yeh. 2018. More than a show: Using personalized immersive theater to educate and engage the public in technology ethics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3174038"
    },
    {
      "text": "Bruce Sterling. 2009. Cover Story Design fiction. interactions 16, 3 (2009), 20–24.",
      "doi": ""
    },
    {
      "text": "Robert B Textor. 1995. The ethnographic futures research method: An application to Thailand. futures 27, 4 (1995), 461–471.",
      "doi": ""
    },
    {
      "text": "Bruce M Tharp and Stephanie M Tharp. 2019. Discursive design: critical, speculative, and alternative things. MIT Press.",
      "doi": ""
    },
    {
      "text": "Times 2019. Artificial Intelligence Has a Problem With Gender and Racial Bias. https://time.com/5520558/artificial-intelligence-racial-gender-bias/.",
      "doi": ""
    },
    {
      "text": "Cameron Tonkinwise. 2015. Just design. Being dogmatic about defining speculative critical design future fiction. Medium.",
      "doi": ""
    },
    {
      "text": "Sherry Turkle. 2017. Alone together: Why we expect more from technology and less from each other. Hachette UK.",
      "doi": ""
    },
    {
      "text": "Sam Wolfson. 2018. Amazon’s Alexa recorded private conversation and sent it to random contact. https://www.theguardian.com/technology/2018/may/24/amazon-alexa-recorded-conversatio.",
      "doi": ""
    },
    {
      "text": "John Zimmerman and Jodi Forlizzi. 2014. Research through design in HCI. In Ways of Knowing in HCI. Springer, 167–189.",
      "doi": ""
    }
  ]
}