{
  "doi": "10.1145/3491102.3517561",
  "title": "Sad or just jealous? Using Experience Sampling to Understand and Detect Negative Affective Experiences on Instagram",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "Social Network Services (SNSs) evoke diverse affective experiences. While most are positive, many authors have documented both the negative emotions that can result from browsing SNS and their impact: Facebook depression is a common term for the more severe results. However, while the importance of the emotions experienced on SNSs is clear, methods to catalog them, and systems to detect them, are less well developed. Accordingly, this paper reports on two studies using a novel contextually triggered Experience Sampling Method to log surveys immediately after using Instagram, a popular image-based SNS, thus minimizing recall biases. The first study improves our understanding of the emotions experienced while using SNSs. It suggests that common negative experiences relate to appearance comparison and envy. The second study captures smartphone sensor data during Instagram sessions to detect these two emotions, ultimately achieving peak accuracies of 95.78% (binary appearance comparison) and 93.95% (binary envy).",
  "authors": [
    {
      "name": "Mintra Ruensuk",
      "institution": "School of Creative Design Engineering, UNIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659319706",
      "orcid": "missing"
    },
    {
      "name": "Taewan Kim",
      "institution": "Department of Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233659",
      "orcid": "missing"
    },
    {
      "name": "Hwajung Hong",
      "institution": "Department of Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022414",
      "orcid": "0000-0001-5268-3331"
    },
    {
      "name": "Ian Oakley",
      "institution": "Department of Design, UNIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100367387",
      "orcid": "0000-0001-5834-8577"
    }
  ],
  "references": [
    {
      "text": "June Ahn and Jinyoung Kim. 2013. The Show Must Go on: The Presentation of Self During Interpersonal Conflict on Facebook. In Proceedings of the 76th ASIS&T Annual Meeting: Beyond the Cloud: Rethinking Information Boundaries (Montreal, Quebec, Canada) (ASIST ’13). American Society for Information Science, Silver Springs, MD, USA, Article 94, 10 pages. http://dl.acm.org/citation.cfm?id=2655780.2655874",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi and Justin Buss. 2020. The Human in Emotion Recognition on Social Media: Attitudes, Outcomes, Risks. Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376680",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi, Pinar Ozturk, and Andrea Forte. 2017. Sensitive Self-Disclosures, Responses, and Social Support on Instagram: The Case of #Depression. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1485–1500. https://doi.org/10.1145/2998181.2998243",
      "doi": "10.1145/2998181.2998243"
    },
    {
      "text": "Lisa Feldman Barrett. 1998. Discrete Emotions or Dimensions? The Role of Valence Focus and Arousal Focus. Cognition and Emotion 12, 4 (1998), 579–599. https://doi.org/10.1080/026999398379574 arXiv:https://doi.org/10.1080/026999398379574",
      "doi": ""
    },
    {
      "text": "Lisa Feldman Barrett and Daniel J Barrett. 2001. An introduction to computerized experience sampling in psychology. Social Science Computer Review 19, 2 (2001), 175–185.",
      "doi": "10.1177/089443930101900204"
    },
    {
      "text": "Till Beiwinkel, Stefan Hey, Olaf Bock, and Wulf Rössler. 2017. Supportive Mental Health Self-Monitoring among Smartphone Users with Psychological Distress: Protocol for a Fully Mobile Randomized Controlled Trial. Frontiers in Public Health 5 (2017), 249. https://doi.org/10.3389/fpubh.2017.00249",
      "doi": ""
    },
    {
      "text": "Shlomo Berkovsky, Ronnie Taib, Irena Koprinska, Eileen Wang, Yucheng Zeng, Jingjie Li, and Sabina Kleitman. 2019. Detecting Personality Traits Using Eye-Tracking Data. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 221, 12 pages. https://doi.org/10.1145/3290605.3300451",
      "doi": "10.1145/3290605.3300451"
    },
    {
      "text": "Jennifer L. Bevan, Jeanette Pfyl, and Brett Barclay. 2012. Negative emotional and cognitive responses to being unfriended on Facebook: An exploratory study. Computers in Human Behavior 28, 4 (2012), 1458–1464. https://doi.org/10.1016/j.chb.2012.03.008",
      "doi": "10.1016/j.chb.2012.03.008"
    },
    {
      "text": "Roberta Biolcati and Stefano Passini. 2018. Narcissism and self-esteem: Different motivations for selfie posting behaviors. Cogent Psychology 5, 1 (2018), 1437012.",
      "doi": ""
    },
    {
      "text": "danah m. boyd and Nicole B. Ellison. 2007. Social Network Sites: Definition, History, and Scholarship. Journal of Computer-Mediated Communication 13, 1 (10 2007), 210–230. https://doi.org/10.1111/j.1083-6101.2007.00393.x arXiv:https://academic.oup.com/jcmc/article-pdf/13/1/210/22316979/jjcmcom0210.pdf",
      "doi": ""
    },
    {
      "text": "Margaret M. Bradley and Peter J. Lang. 1994. Measuring emotion: The self-assessment manikin and the semantic differential. Journal of Behavior Therapy and Experimental Psychiatry 25, 1(1994), 49 – 59. https://doi.org/10.1016/0005-7916(94)90063-9",
      "doi": "10.1016/0005-"
    },
    {
      "text": "Kathryn Buchanan, Lara B Aknin, Shaaba Lotun, and Gillian M Sandstrom. 2021. Brief exposure to social media during the COVID-19 pandemic: Doom-scrolling has negative emotional consequences, but kindness-scrolling does not. Plos one 16, 10 (2021), e0257728.",
      "doi": ""
    },
    {
      "text": "Moira Burke and Robert Kraut. 2013. Using Facebook after Losing a Job: Differential Benefits of Strong and Weak Ties. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (San Antonio, Texas, USA) (CSCW ’13). Association for Computing Machinery, New York, NY, USA, 1419–1430. https://doi.org/10.1145/2441776.2441936",
      "doi": "10.1145/2441776.2441936"
    },
    {
      "text": "Pew Research Center. 2021. Social Media Fact Sheet. https://www.pewresearch.org/internet/fact-sheet/social-media/",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Jessica Annette Pater, Trustin Clear, Eric Gilbert, and Munmun De Choudhury. 2016. #thyghgapp: Instagram Content Moderation and Lexical Variation in Pro-Eating Disorder Communities. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 1201–1213. https://doi.org/10.1145/2818048.2819963",
      "doi": "10.1145/2818048.2819963"
    },
    {
      "text": "Keng-hao Chang, Drew Fisher, John Canny, and Björn Hartmann. 2011. How’s My Mood and Stress? An Efficient Speech Analysis Library for Unobtrusive Monitoring on Mobile Phones. In Proceedings of the 6th International Conference on Body Area Networks (Beijing, China) (BodyNets ’11). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), Brussels, BEL, 71–77.",
      "doi": ""
    },
    {
      "text": "Nitesh V Chawla, Kevin W Bowyer, Lawrence O Hall, and W Philip Kegelmeyer. 2002. SMOTE: synthetic minority over-sampling technique. Journal of artificial intelligence research 16 (2002), 321–357.",
      "doi": "10.5555/1622407.1622416"
    },
    {
      "text": "Justin Cheng, Michael Bernstein, Cristian Danescu-Niculescu-Mizil, and Jure Leskovec. 2017. Anyone Can Become a Troll: Causes of Trolling Behavior in Online Discussions. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1217–1230. https://doi.org/10.1145/2998181.2998213",
      "doi": "10.1145/2998181.2998213"
    },
    {
      "text": "Davide Chicco and Giuseppe Jurman. 2020. The advantages of the Matthews correlation coefficient (MCC) over F1 score and accuracy in binary classification evaluation. BMC Genomics 21, 1 (02 Jan 2020), 6. https://doi.org/10.1186/s12864-019-6413-7",
      "doi": ""
    },
    {
      "text": "Hyunsung Cho, DaEun Choi, Donghwi Kim, Wan Ju Kang, Eun Kyoung Choe, and Sung-Ju Lee. 2021. Reflect, Not Regret: Understanding Regretful Smartphone Use with App Feature-Level Analysis. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 456 (oct 2021), 36 pages. https://doi.org/10.1145/3479600",
      "doi": "10.1145/3479600"
    },
    {
      "text": "Tak Sang Chow and Hau Yan Wan. 2017. Is there any ’Facebook Depression’? Exploring the moderating roles of neuroticism, Facebook social comparison and envy. Personality and Individual Differences 119 (2017), 277–282. https://doi.org/10.1016/j.paid.2017.07.032",
      "doi": ""
    },
    {
      "text": "Rachel Cohen, Toby Newton-John, and Amy Slater. 2017. The relationship between Facebook and Instagram appearance-focused activities and body image concerns in young women. Body Image 23(2017), 183–187. https://doi.org/10.1016/j.bodyim.2017.10.002",
      "doi": ""
    },
    {
      "text": "Ahuti Das-Friebel, Anita Lenneis, Anu Realo, Adam Sanborn, Nicole KY Tang, Dieter Wolke, Adrian von Mühlenen, and Sakari Lemola. 2020. Bedtime social media use, sleep, and affective wellbeing in young adults: an experience sampling study. Journal of Child Psychology and Psychiatry 61, 10 (2020), 1138–1149.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, and Michael Gamon. 2012. Not all moods are created equal! exploring human emotional states in social media. In Proceedings of the International AAAI Conference on Web and Social Media. Association for the Advancement of Artificial Intelligence, Palo Alto, CA, USA, 8 pages.",
      "doi": ""
    },
    {
      "text": "Dian A. de Vries, A. Marthe Möller, Marieke S. Wieringa, Anniek W. Eigenraam, and Kirsten Hamelink. 2018. Social Comparison as the Thief of Joy: Emotional Consequences of Viewing Strangers’ Instagram Posts. Media Psychology 21, 2 (2018), 222–245. https://doi.org/10.1080/15213269.2016.1267647 arXiv:https://doi.org/10.1080/15213269.2016.1267647",
      "doi": ""
    },
    {
      "text": "Android Developers Documentation. 2021. Building web apps in WebView. https://developer.android.com/guide/webapps/webview. Accessed: 2021-03-29.",
      "doi": ""
    },
    {
      "text": "Android Developers Documentation. 2021. Motion sensors. https://developer.android.com/guide/topics/sensors/sensors_motion.",
      "doi": ""
    },
    {
      "text": "Android Developers Documentation. 2021. MotionEvent. https://developer.android.com/reference/android/view/MotionEvent.",
      "doi": ""
    },
    {
      "text": "Boris Egloff, Anja Tausch, Carl-Walter Kohlmann, and Heinz Walter Krohne. 1995. Relationships between time of day, day of the week, and positive mood: Exploring the role of the mood measure. Motivation and emotion 19, 2 (1995), 99–110.",
      "doi": ""
    },
    {
      "text": "Paul Ekman. 1992. An argument for basic emotions. Cognition and Emotion 6, 3-4 (1992), 169–200. https://doi.org/10.1080/02699939208411068 arXiv:https://doi.org/10.1080/02699939208411068",
      "doi": ""
    },
    {
      "text": "Nicole B. Ellison, Charles Steinfield, and Cliff Lampe. 2007. The Benefits of Facebook “Friends:” Social Capital and College Students’ Use of Online Social Network Sites. Journal of Computer-Mediated Communication 12, 4 (07 2007), 1143–1168. https://doi.org/10.1111/j.1083-6101.2007.00367.x arXiv:https://academic.oup.com/jcmc/article-pdf/12/4/1143/22316419/jjcmcom1143.pdf",
      "doi": ""
    },
    {
      "text": "Facebook. 2020. Facebook Reports Fourth Quarter and Full Year 2020 Results. https://investor.fb.com/investor-news/press-release-details/2021/Facebook-Reports-Fourth-Quarter-and-Full-Year-2020-Results/default.aspx",
      "doi": ""
    },
    {
      "text": "Lien Faelens, Kristof Hoorelbeke, Bart Soenens, Kyle Van Gaeveren, Lieven De Marez, Rudi De Raedt, and Ernst H.W. Koster. 2021. Social media use and well-being: A prospective experience-sampling study. Computers in Human Behavior 114 (2021), 106510. https://doi.org/10.1016/j.chb.2020.106510",
      "doi": "10.1016/j.chb.2020.106510"
    },
    {
      "text": "Jasmine Fardouly and Lenny R. Vartanian. 2015. Negative comparisons about one’s appearance mediate the relationship between Facebook usage and body image concerns. Body Image 12(2015), 82–88. https://doi.org/10.1016/j.bodyim.2014.10.004",
      "doi": ""
    },
    {
      "text": "Giulia Fioravanti, Alfonso Prostamo, and Silvia Casale. 2020. Taking a Short Break from Instagram: The Effects on Subjective Well-Being. Cyberpsychology, Behavior, and Social Networking 23, 2(2020), 107–112.",
      "doi": ""
    },
    {
      "text": "Joel E. Fischer and Steve Benford. 2009. Inferring Player Engagement in a Pervasive Experience. Association for Computing Machinery, New York, NY, USA, 1903–1906. https://doi.org/10.1145/1518701.1518993",
      "doi": ""
    },
    {
      "text": "Jesse Fox and Jennifer J. Moreland. 2015. The dark side of social networking sites: An exploration of the relational and psychological stressors associated with Facebook use and affordances. Computers in Human Behavior 45 (2015), 168 – 176. https://doi.org/10.1016/j.chb.2014.11.083",
      "doi": "10.1016/j.chb.2014.11.083"
    },
    {
      "text": "Yuan Gao, Nadia Bianchi-Berthouze, and Hongying Meng. 2012. What Does Touch Tell Us About Emotions in Touchscreen-Based Gameplay?ACM Trans. Comput.-Hum. Interact. 19, 4, Article 31 (Dec. 2012), 30 pages. https://doi.org/10.1145/2395131.2395138",
      "doi": "10.1145/2395131.2395138"
    },
    {
      "text": "Surjya Ghosh, Niloy Ganguly, Bivas Mitra, and Pradipta De. 2017. TapSense: Combining Self-Report Patterns and Typing Characteristics for Smartphone Based Emotion Detection. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (Vienna, Austria) (MobileHCI ’17). Association for Computing Machinery, New York, NY, USA, Article 2, 12 pages. https://doi.org/10.1145/3098279.3098564",
      "doi": "10.1145/3098279.3098564"
    },
    {
      "text": "Surjya Ghosh, Kaustubh Hiware, Niloy Ganguly, Bivas Mitra, and Pradipta De. 2019. Emotion detection from touch interactions during text entry on smartphones. Int. J. Hum.-Comput. Stud. 130 (2019), 47–57.",
      "doi": "10.1016/j.ijhcs.2019.04.005"
    },
    {
      "text": "Frederick X Gibbons and Bram P Buunk. 1999. Individual differences in social comparison: development of a scale of social comparison orientation.Journal of personality and social psychology 76, 1(1999), 129.",
      "doi": ""
    },
    {
      "text": "Amy L. Gonzales. 2014. Text-based communication influences self-esteem more than face-to-face or cellphone communication. Computers in Human Behavior 39 (2014), 197–203. https://doi.org/10.1016/j.chb.2014.07.026",
      "doi": "10.1016/j.chb.2014.07.026"
    },
    {
      "text": "Amy L Gonzales and Jeffrey T Hancock. 2011. Mirror, mirror on my Facebook wall: Effects of exposure to Facebook on self-esteem. Cyberpsychology, behavior, and social networking 14, 1-2(2011), 79–83.",
      "doi": ""
    },
    {
      "text": "Scott Griffiths, Stuart B Murray, Isabel Krug, and Sian A McLean. 2018. The contribution of social media to body dissatisfaction, eating disorder symptoms, and anabolic steroid use among sexual minority men. Cyberpsychology, Behavior, and Social Networking 21, 3(2018), 149–156.",
      "doi": ""
    },
    {
      "text": "Scott Griffiths and Ashleigh Stefanovski. 2019. Thinspiration and fitspiration in everyday life: An experience sampling study. Body Image 30(2019), 135–144. https://doi.org/10.1016/j.bodyim.2019.07.002",
      "doi": ""
    },
    {
      "text": "Sharath Chandra Guntuku, Daniel Preotiuc-Pietro, Johannes C Eichstaedt, and Lyle H Ungar. 2019. What twitter profile and posted images reveal about depression and anxiety. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 13. Association for the Advancement of Artificial Intelligence, Palo Alto, CA, USA, 236–246.",
      "doi": ""
    },
    {
      "text": "Maryam Hasan, Elke Rundensteiner, and Emmanuel Agu. 2014. Emotex: Detecting emotions in twitter messages. In Proceedings of the ASE BIGDATA/SOCIALCOM/CYBERSECURITY Conference (ASE’14). Academy of Science and Engineering (ASE), USA, 27–31.",
      "doi": ""
    },
    {
      "text": "Jan Crusius Helmut Appel and Alexander L. Gerlach. 2015. Social Comparison, Envy, and Depression on Facebook: A Study Looking at the Effects of High Comparison Standards on Depressed Individuals. Journal of Social and Clinical Psychology 34, 4 (2015), 277–289. https://doi.org/10.1521/jscp.2015.34.4.277 arXiv:https://doi.org/10.1521/jscp.2015.34.4.277",
      "doi": ""
    },
    {
      "text": "Kristin E Heron and Joshua M Smyth. 2010. Ecological momentary interventions: incorporating mobile technology into psychosocial and health behaviour treatments. British journal of health psychology 15, 1 (2010), 1–39.",
      "doi": ""
    },
    {
      "text": "Victoria Hollis, Artie Konrad, and Steve Whittaker. 2015. Change of Heart: Emotion Tracking to Promote Behavior Change. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2643–2652. https://doi.org/10.1145/2702123.2702196",
      "doi": "10.1145/2702123.2702196"
    },
    {
      "text": "Sinh Huynh, Seungmin Kim, JeongGil Ko, Rajesh Krishna Balan, and Youngki Lee. 2018. EngageMon: Multi-Modal Engagement Sensing for Mobile Games. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 1, Article 13 (March 2018), 27 pages. https://doi.org/10.1145/3191745",
      "doi": "10.1145/3191745"
    },
    {
      "text": "Ha Sung Hwang. 2019. Why social comparison on Instagram matters: Its impact on depression. KSII Transactions on Internet and Information Systems (TIIS) 13, 3(2019), 1626–1638.",
      "doi": ""
    },
    {
      "text": "Nicholas C Jacobson, Hilary Weingarden, and Sabine Wilhelm. 2019. Using digital phenotyping to accurately detect depression severity. The Journal of nervous and mental disease 207, 10 (2019), 893–896.",
      "doi": ""
    },
    {
      "text": "Shaohai Jiang and Annabel Ngien. 2020. The Effects of Instagram Use, Social Comparison, and Self-Esteem on Social Anxiety: A Survey Study in Singapore. Social Media + Society 6, 2 (2020), 2056305120912488. https://doi.org/10.1177/2056305120912488 arXiv:https://doi.org/10.1177/2056305120912488",
      "doi": ""
    },
    {
      "text": "S Venus Jin and Ehri Ryu. 2020. ”I’ll buy what she’s# wearing”: The roles of envy toward and parasocial interaction with influencers in Instagram celebrity-based brand endorsement and social commerce. Journal of Retailing and Consumer Services 55 (2020), 102121.",
      "doi": ""
    },
    {
      "text": "Caitlyn Johnston and William E. Davis. 2019. Motivating exercise through social media: Is a picture always worth a thousand words?Psychology of Sport and Exercise 41 (2019), 119–126. https://doi.org/10.1016/j.psychsport.2018.12.012",
      "doi": ""
    },
    {
      "text": "Maria Kalpidou, Dan Costin, and Jessica Morris. 2011. The relationship between Facebook and the well-being of undergraduate college students. CyberPsychology, behavior, and social networking 14, 4(2011), 183–189.",
      "doi": ""
    },
    {
      "text": "Małgorzata Karpińska-Krakowiak and Artur Modliński. 2018. The Effects of Pranks in Social Media on Brands. Journal of Computer Information Systems 58, 3 (2018), 282–290. https://doi.org/10.1080/08874417.2016.1241683 arXiv:https://doi.org/10.1080/08874417.2016.1241683",
      "doi": ""
    },
    {
      "text": "Jaejeung Kim, Hayoung Jung, Minsam Ko, and Uichin Lee. 2019. GoalKeeper: Exploring Interaction Lockout Mechanisms for Regulating Smartphone Use. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 1, Article 16 (mar 2019), 29 pages. https://doi.org/10.1145/3314403",
      "doi": "10.1145/3314403"
    },
    {
      "text": "Hsiu-Chia Ko and Dian-Han Yu. 2019. Understanding Continuance Intention to View Instagram Stories: A Perspective of Uses and Gratifications Theory. In Proceedings of the 2nd International Conference on Control and Computer Vision (Jeju, Republic of Korea) (ICCCV 2019). Association for Computing Machinery, New York, NY, USA, 127–132. https://doi.org/10.1145/3341016.3341039",
      "doi": "10.1145/3341016.3341039"
    },
    {
      "text": "Kurt Kroenke, Robert L Spitzer, and Janet BW Williams. 2001. The PHQ-9: validity of a brief depression severity measure. Journal of general internal medicine 16, 9 (2001), 606–613.",
      "doi": ""
    },
    {
      "text": "Kurt Kroenke, Robert L Spitzer, and Janet BW Williams. 2003. The Patient Health Questionnaire-2: validity of a two-item depression screener. Medical care 41, 11 (2003), 1284–1292.",
      "doi": ""
    },
    {
      "text": "Ethan Kross, Philippe Verduyn, Emre Demiralp, Jiyoung Park, David Seungjae Lee, Natalie Lin, Holly Shablack, John Jonides, and Oscar Ybarra. 2013. Facebook use predicts declines in subjective well-being in young adults. PloS one 8, 8 (2013), e69841.",
      "doi": ""
    },
    {
      "text": "Reed Larson and Mihaly Csikszentmihalyi. 2014. The Experience Sampling Method. Springer Netherlands, Dordrecht, 21–34. https://doi.org/10.1007/978-94-017-9088-8_2",
      "doi": ""
    },
    {
      "text": "Neal Lathia, Kiran K. Rachuri, Cecilia Mascolo, and Peter J. Rentfrow. 2013. Contextual Dissonance: Design Bias in Sensor-Based Experience Sampling Methods. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Zurich, Switzerland) (UbiComp ’13). Association for Computing Machinery, New York, NY, USA, 183–192. https://doi.org/10.1145/2493432.2493452",
      "doi": "10.1145/2493432.2493452"
    },
    {
      "text": "H. Lee, Young Sang Choi, Sunjae Lee, and I. P. Park. 2012. Towards unobtrusive emotion recognition for affective social communication. In 2012 IEEE Consumer Communications and Networking Conference (CCNC). IEEE, New York, NY, USA, 260–264. https://doi.org/10.1109/CCNC.2012.6181098",
      "doi": ""
    },
    {
      "text": "Robert LiKamWa, Yunxin Liu, Nicholas D. Lane, and Lin Zhong. 2013. MoodScope: Building a Mood Sensor from Smartphone Usage Patterns. In Proceeding of the 11th Annual International Conference on Mobile Systems, Applications, and Services(Taipei, Taiwan) (MobiSys ’13). Association for Computing Machinery, New York, NY, USA, 389–402. https://doi.org/10.1145/2462456.2464449",
      "doi": "10.1145/2462456.2464449"
    },
    {
      "text": "Ruoyun Lin and Sonja Utz. 2015. The emotional responses of browsing Facebook: Happiness, envy, and the role of tie strength. Computers in Human Behavior 52 (2015), 29 – 38. https://doi.org/10.1016/j.chb.2015.04.064",
      "doi": "10.1016/j.chb.2015.04.064"
    },
    {
      "text": "Ruoyun Lin, Niels van de Ven, and Sonja Utz. 2018. What triggers envy on Social Network Sites? A comparison between shared experiential and material purchases. Computers in Human Behavior 85 (2018), 271 – 281. https://doi.org/10.1016/j.chb.2018.03.049",
      "doi": ""
    },
    {
      "text": "Jiangmeng Liu, Cong Li, Nick Carcioppolo, and Michael North. 2016. Do Our Facebook Friends Make Us Feel Worse? A Study of Social Comparison and Emotion. Human Communication Research 42, 4 (10 2016), 619–640. https://doi.org/10.1111/hcre.12090 arXiv:https://academic.oup.com/hcr/article-pdf/42/4/619/19494471/jhumcom0619.pdf",
      "doi": ""
    },
    {
      "text": "Kai Lukoff, Ulrik Lyngs, Himanshu Zade, J. Vera Liao, James Choi, Kaiyue Fan, Sean A. Munson, and Alexis Hiniker. 2021. How the Design of YouTube Influences User Sense of Agency. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 368, 17 pages. https://doi.org/10.1145/3411764.3445467",
      "doi": "10.1145/3411764.3445467"
    },
    {
      "text": "Kai Lukoff, Cissy Yu, Julie Kientz, and Alexis Hiniker. 2018. What Makes Smartphone Use Meaningful or Meaningless?Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 1, Article 22 (March 2018), 26 pages. https://doi.org/10.1145/3191754",
      "doi": "10.1145/3191754"
    },
    {
      "text": "Katerina Lup, Leora Trub, and Lisa Rosenthal. 2015. Instagram #Instasad?: Exploring Associations Among Instagram Use, Depressive Symptoms, Negative Social Comparison, and Strangers Followed. Cyberpsychology, Behavior, and Social Networking 18, 5(2015), 247–252. https://doi.org/10.1089/cyber.2014.0560 arXiv:https://doi.org/10.1089/cyber.2014.0560PMID: 25965859.",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Shamsi Iqbal, Mary Czerwinski, and Paul Johns. 2014. Capturing the Mood: Facebook and Face-to-Face Encounters in the Workplace. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (Baltimore, Maryland, USA) (CSCW ’14). Association for Computing Machinery, New York, NY, USA, 1082–1094. https://doi.org/10.1145/2531602.2531673",
      "doi": "10.1145/2531602.2531673"
    },
    {
      "text": "Roberto Martinez-Pecino and Marta Garcia-Gavilán. 2019. Likes and problematic Instagram use: the moderating role of self-esteem. Cyberpsychology, Behavior, and Social Networking 22, 6(2019), 412–416.",
      "doi": ""
    },
    {
      "text": "Susan Y McGorry. 2000. Measurement in a cross-cultural environment: survey translation issues. Qualitative Market Research: An International Journal 3, 2 (2000), 74–81.",
      "doi": ""
    },
    {
      "text": "Juan Carlos Medina Serrano, Orestis Papakyriakopoulos, and Simon Hegelich. 2020. Dancing to the Partisan Beat: A First Analysis of Political Communication on TikTok. In 12th ACM Conference on Web Science (Southampton, United Kingdom) (WebSci ’20). Association for Computing Machinery, New York, NY, USA, 257–266. https://doi.org/10.1145/3394231.3397916",
      "doi": "10.1145/3394231.3397916"
    },
    {
      "text": "Adrian Meier and Svenja Schäfer. 2018. The positive side of social comparison on social network sites: How envy can drive inspiration on Instagram. Cyberpsychology, Behavior, and Social Networking 21, 7(2018), 411–417.",
      "doi": ""
    },
    {
      "text": "Aske Mottelson and Kasper Hornbæk. 2016. An Affect Detection Technique Using Mobile Commodity Sensors in the Wild. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Heidelberg, Germany) (UbiComp ’16). ACM, New York, NY, USA, 781–792. https://doi.org/10.1145/2971648.2971654",
      "doi": "10.1145/2971648.2971654"
    },
    {
      "text": "Yeamduan Narangajavana, Luis José Callarisa Fiol, Miguel Ángel Moliner Tena, Rosa María Rodríguez Artola, and Javier Sánchez García. 2017. The influence of social media in creating expectations. An empirical study for a tourist destination. Annals of Tourism Research 65 (2017), 60–70. https://doi.org/10.1016/j.annals.2017.05.002",
      "doi": ""
    },
    {
      "text": "Evangelos Niforatos and Evangelos Karapanos. 2015. EmoSnaps: a mobile application for emotion recall from facial expressions. Personal and Ubiquitous Computing 19, 2 (2015), 425–444.",
      "doi": "10.1007/s00779-014-0777-0"
    },
    {
      "text": "Pawarat Nontasil and Stephen J. Payne. 2019. Emotional Utility and Recall of the Facebook News Feed. Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3290605.3300252",
      "doi": "10.1145/3290605.3300252"
    },
    {
      "text": "Erik C Nook, Stephanie F Sasse, Hilary K Lambert, Katie A McLaughlin, and Leah H Somerville. 2018. The nonlinear development of emotion differentiation: Granular emotional experience is low in adolescence. Psychological science 29, 8 (2018), 1346–1357.",
      "doi": ""
    },
    {
      "text": "Gwenn Schurgin O’Keeffe, Kathleen Clarke-Pearson, 2011. The impact of social media on children, adolescents, and families. Pediatrics 127, 4 (2011), 800–804.",
      "doi": ""
    },
    {
      "text": "Charlotte Ottenstein and Tanja Lischetzke. 2020. Recall bias in emotional intensity ratings: investigating person-level and event-level predictors. Motivation and Emotion 44, 3 (2020), 464–473.",
      "doi": ""
    },
    {
      "text": "Galen Panger. 2018. People Tend to Wind Down, Not Up, When They Browse Social Media. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 133 (Nov. 2018), 29 pages. https://doi.org/10.1145/3274402",
      "doi": "10.1145/3274402"
    },
    {
      "text": "Fabian Pedregosa, Gaël Varoquaux, Alexandre Gramfort, Vincent Michel, Bertrand Thirion, Olivier Grisel, Mathieu Blondel, Peter Prettenhofer, Ron Weiss, Vincent Dubourg, Jake Vanderplas, Alexandre Passos, David Cournapeau, Matthieu Brucher, Matthieu Perrot, and Édouard Duchesnay. 2011. Scikit-learn: Machine Learning in Python. Journal of Machine Learning Research 12, 85 (2011), 2825–2830. http://jmlr.org/papers/v12/pedregosa11a.html",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "Matthew Pittman and Brandon Reich. 2016. Social media and loneliness: Why an Instagram picture may be worth more than a thousand Twitter words. Computers in Human Behavior 62 (2016), 155–167. https://doi.org/10.1016/j.chb.2016.03.084",
      "doi": "10.1016/j.chb.2016.03.084"
    },
    {
      "text": "Marco Polignano, Fedelucio Narducci, Marco de Gemmis, and Giovanni Semeraro. 2021. Towards Emotion-aware Recommender Systems: an Affective Coherence Model based on Emotion-driven Behaviors. Expert Systems with Applications 170 (2021), 114382. https://doi.org/10.1016/j.eswa.2020.114382",
      "doi": ""
    },
    {
      "text": "Daniel Preoţiuc-Pietro, H Andrew Schwartz, Gregory Park, Johannes Eichstaedt, Margaret Kern, Lyle Ungar, and Elisabeth Shulman. 2016. Modelling valence and arousal in facebook posts. In Proceedings of the 7th workshop on computational approaches to subjectivity, sentiment and social media analysis. Association for Computational Linguistics, San Diego, California, 9–15.",
      "doi": ""
    },
    {
      "text": "Katharina Rein and Tommaso Venturini. 2018. Ploughing digital landscapes: How Facebook influences the evolution of live video streaming. New Media & Society 20, 9 (2018), 3359–3380. https://doi.org/10.1177/1461444817748954 arXiv:https://doi.org/10.1177/1461444817748954",
      "doi": ""
    },
    {
      "text": "Andreas Reissmann, Joachim Hauser, Ewelina Stollberg, Ivo Kaunzinger, and Klaus W. Lange. 2018. The role of loneliness in emerging adults’ everyday use of facebook – An experience sampling approach. Computers in Human Behavior 88 (2018), 47–60. https://doi.org/10.1016/j.chb.2018.06.011",
      "doi": "10.1016/j.chb.2018.06.011"
    },
    {
      "text": "Kat Roemmich and Nazanin Andalibi. 2021. Data Subjects’ Conceptualizations of and Attitudes Toward Automatic Emotion Recognition-Enabled Wellbeing Interventions on Social Media. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 308 (oct 2021), 34 pages. https://doi.org/10.1145/3476049",
      "doi": "10.1145/3476049"
    },
    {
      "text": "Morris Rosenberg. 2015. Society and the adolescent self-image. Princeton University Press, Princeton, N.J., USA.",
      "doi": ""
    },
    {
      "text": "Philipp V. Rouast, Marc T. P. Adam, and Raymond Chiong. 2021. Deep Learning for Human Affect Recognition: Insights and New Developments. IEEE Transactions on Affective Computing 12, 2 (2021), 524–543. https://doi.org/10.1109/TAFFC.2018.2890471",
      "doi": "10.1109/TAFFC.2018.2890471"
    },
    {
      "text": "Mintra Ruensuk, Eunyong Cheon, Hwajung Hong, and Ian Oakley. 2020. How Do You Feel Online: Exploiting Smartphone Sensors to Detect Transitory Emotions during Social Media Use. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 4, Article 150 (dec 2020), 32 pages. https://doi.org/10.1145/3432223",
      "doi": "10.1145/3432223"
    },
    {
      "text": "James A Russell. 1980. A circumplex model of affect.Journal of personality and social psychology 39, 6(1980), 1161.",
      "doi": ""
    },
    {
      "text": "Gillian M. Sandstrom, Neal Lathia, Cecilia Mascolo, and Peter J. Rentfrow. 2017. Putting mood in context: Using smartphones to examine how people feel in different locations. Journal of Research in Personality 69 (2017), 96–101. https://doi.org/10.1016/j.jrp.2016.06.004 Within-Person Variability in Personality.",
      "doi": ""
    },
    {
      "text": "The New York Times SARAH PEREZ. 2009. New Illness: Facebook Depression?https://archive.nytimes.com/www.nytimes.com/external/readwriteweb/2009/02/02/02readwriteweb-new_illness_facebook_depression.html. Accessed: 2021-09-10.",
      "doi": ""
    },
    {
      "text": "Zhanna Sarsenbayeva, Gabriele Marini, Niels van Berkel, Chu Luo, Weiwei Jiang, Kangning Yang, Greg Wadley, Tilman Dingler, Vassilis Kostakos, and Jorge Goncalves. 2020. Does Smartphone Use Drive Our Emotions or Vice Versa? A Causal Analysis. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376163",
      "doi": "10.1145/3313831.3376163"
    },
    {
      "text": "Barbara Schneider. 2006. In the moment: The benefits of the experience sampling method. In The work and family handbook. Lawrence Erlbaum Associates, NJ, USA, 469–488.",
      "doi": ""
    },
    {
      "text": "Edmund Seto, Jenna Hua, Lemuel Wu, Aaron Bestick, Victor Shia, Sue Eom, Jay Han, May Wang, and Yan Li. 2014. The Kunming CalFit study: Modeling dietary behavioral patterns using smartphone data. In 2014 36th Annual International Conference of the IEEE Engineering in Medicine and Biology Society. IEEE, New York, NY, USA, 6884–6887. https://doi.org/10.1109/EMBC.2014.6945210",
      "doi": ""
    },
    {
      "text": "Nicolas Simonazzi, Jean-Marc Salotti, Caroline Dubois, and Dominique Seminel. 2021. Emotion Detection Based on Smartphone Using User Memory Tasks and Videos. In Human Interaction, Emerging Technologies and Future Applications III, Tareq Ahram, Redha Taiar, Karine Langlois, and Arnaud Choplin (Eds.). Springer International Publishing, Cham, 244–249.",
      "doi": ""
    },
    {
      "text": "Andrew D. Smock, Nicole B. Ellison, Cliff Lampe, and Donghee Yvette Wohn. 2011. Facebook as a toolkit: A uses and gratification approach to unbundling feature use. Computers in Human Behavior 27, 6 (2011), 2322–2329. https://doi.org/10.1016/j.chb.2011.07.011",
      "doi": "10.1016/j.chb.2011.07.011"
    },
    {
      "text": "Peta Stapleton, Gabriella Luiz, and Hannah Chatwin. 2017. Generation validation: The role of social comparison in use of Instagram among emerging adults. Cyberpsychology, Behavior, and Social Networking 20, 3(2017), 142–149.",
      "doi": ""
    },
    {
      "text": "Mai-Ly N Steers, Robert E Wickham, and Linda K Acitelli. 2014. Seeing everyone else’s highlight reels: How Facebook usage is linked to depressive symptoms. Journal of Social and Clinical Psychology 33, 8 (2014), 701–731.",
      "doi": ""
    },
    {
      "text": "Anika Stuppy, Nicole L Mead, and Stijn M J Van Osselaer. 2019. I Am, Therefore I Buy: Low Self-Esteem and the Pursuit of Self-Verifying Consumption. Journal of Consumer Research 46, 5 (06 2019), 956–973. https://doi.org/10.1093/jcr/ucz029 arXiv:https://academic.oup.com/jcr/article-pdf/46/5/956/31700831/ucz029.pdf",
      "doi": ""
    },
    {
      "text": "Edson C. Tandoc, Patrick Ferrucci, and Margaret Duffy. 2015. Facebook use, envy, and depression among college students: Is facebooking depressing?Computers in Human Behavior 43 (2015), 139 – 146. https://doi.org/10.1016/j.chb.2014.10.053",
      "doi": ""
    },
    {
      "text": "Marika Tiggemann and Belinda McGill. 2004. The role of social comparison in the effect of magazine advertisements on women’s mood and body dissatisfaction. Journal of Social and Clinical Psychology 23, 1 (2004), 23–44.",
      "doi": ""
    },
    {
      "text": "Ricvalerio Valério. 2017. ricvalerio/foregroundappchecker. https://github.com/ricvalerio/foregroundappchecker",
      "doi": ""
    },
    {
      "text": "Niels van Berkel, Denzil Ferreira, and Vassilis Kostakos. 2017. The Experience Sampling Method on Mobile Devices. ACM Comput. Surv. 50, 6, Article 93 (Dec. 2017), 40 pages. https://doi.org/10.1145/3123988",
      "doi": "10.1145/3123988"
    },
    {
      "text": "M Van den Brink, ENG Bandell-Hoekstra, and H Huijer Abu-Saad. 2001. The occurrence of recall bias in pediatric headache: a comparison of questionnaire and diary data. Headache: The Journal of Head and Face Pain 41, 1 (2001), 11–20.",
      "doi": ""
    },
    {
      "text": "Gert Van Dijck and Marc M. Van Hulle. 2006. Speeding Up the Wrapper Feature Subset Selection in Regression by Mutual Information Relevance and Redundancy Analysis. In Artificial Neural Networks – ICANN 2006, Stefanos D. Kollias, Andreas Stafylopatis, Włodzisław Duch, and Erkki Oja (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 31–40.",
      "doi": "10.1007/11840817_4"
    },
    {
      "text": "Philippe Verduyn, David Seungjae Lee, Jiyoung Park, Holly Shablack, Ariana Orvell, Joseph Bayer, Oscar Ybarra, John Jonides, and Ethan Kross. 2015. Passive Facebook usage undermines affective well-being: Experimental and longitudinal evidence.Journal of Experimental Psychology: General 144, 2 (2015), 480.",
      "doi": ""
    },
    {
      "text": "Rafael Wampfler, Severin Klingler, Barbara Solenthaler, Victor R. Schinazi, and Markus Gross. 2020. Affective State Prediction Based on Semi-Supervised Learning from Smartphone Touch Data. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376504",
      "doi": "10.1145/3313831.3376504"
    },
    {
      "text": "Georgia Wells, Jeff Horwitz, and Deepa Seetharaman. 2021. Facebook knows Instagram is toxic for teen girls, company documents show. The Wall Street Journal. https://www.wsj.com/articles/facebook-knows-instagram-is-toxic-for-teen-girls-company-documents-show-11631620739",
      "doi": ""
    },
    {
      "text": "K. Yang, C. Wang, Y. Gu, Z. Sarsenbayeva, B. Tag, T. Dingler, G. Wadley, and J. Goncalves. 2021. Behavioral and Physiological Signals-Based Deep Multimodal Approach for Mobile Emotion Recognition. IEEE Transactions on Affective Computing Preprint, 01 (Jul 2021), 17 pages. https://doi.org/10.1109/TAFFC.2021.3100868",
      "doi": ""
    },
    {
      "text": "Xiao Zhang, Wenzhong Li, Xu Chen, and Sanglu Lu. 2018. MoodExplorer: Towards Compound Emotion Detection via Smartphone Sensing. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 4, Article 176 (Jan. 2018), 30 pages. https://doi.org/10.1145/3161414",
      "doi": "10.1145/3161414"
    },
    {
      "text": "Xiao Zhang, Fuzhen Zhuang, Wenzhong Li, Haochao Ying, Hui Xiong, and Sanglu Lu. 2019. Inferring Mood Instability via Smartphone Sensing: A Multi-View Learning Approach. In Proceedings of the 27th ACM International Conference on Multimedia (Nice, France) (MM ’19). Association for Computing Machinery, New York, NY, USA, 1401–1409. https://doi.org/10.1145/3343031.3350957",
      "doi": "10.1145/3343031.3350957"
    },
    {
      "text": "S. Zhao, H. Yao, Y. Gao, G. Ding, and T. Chua. 2018. Predicting Personalized Image Emotion Perceptions in Social Networks. IEEE Transactions on Affective Computing 9, 4 (Oct 2018), 526–540. https://doi.org/10.1109/TAFFC.2016.2628787",
      "doi": "10.1109/TAFFC.2016.2628787"
    },
    {
      "text": "John Zimmerman and Jodi Forlizzi. 2017. Speed Dating: Providing a Menu of Possible Futures. She Ji: The Journal of Design, Economics, and Innovation 3, 1 (2017), 30–50. https://doi.org/10.1016/j.sheji.2017.08.003",
      "doi": ""
    }
  ]
}