{
  "doi": "10.1145/3491102.3501864",
  "title": "Understanding How eHealth Coaches Tailor Support For Weight Loss: Towards the Design of Person-Centered Coaching Systems",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "eHealth coaching is a promising approach for delivering effective, person-centered, digital health interventions. Yet, the way eHealth coaches ‘tailor’ interventions using technology is currently unclear. This study aims to understand how eHealth coaches tailor support to clients seeking to lose weight. Nine in-depth interviews with eHealth coaches were conducted. The data were analyzed using thematic analysis, deriving three themes: ‘Understanding the client,’ ‘Adapting Support,’ and ‘Navigating challenges.’ Coaches used both assessment tools and their growing relationship to understand client's needs. Coaches adapted the pace and nature of educational content, utilized their clients' preferred technologies, and adopted different personas to meet the needs of each individual. Providing tailored support also presented challenges for eHealth coaches, with technology eroding personal and professional boundaries. Our work interrogates what it means to ‘tailor’ support, through exploring coaching as a humanistic approach to behaviour change, with implications for the design of person-centered digital coaching interventions/systems.",
  "authors": [
    {
      "name": "Kathleen Ryan",
      "institution": "School of Applied Psychology, University College Cork, Ireland and S3 Connected Health, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659759207",
      "orcid": "missing"
    },
    {
      "name": "Samantha Dockray",
      "institution": "School of Applied Psychology, University College Cork, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659755221",
      "orcid": "missing"
    },
    {
      "name": "Conor Linehan",
      "institution": "School of Applied Psychology, University College Cork, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81440592407",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "WHO. 2000. Obesity: preventing and managing the global epidemic. Accessed online on 1 June, 2019 from: https://www.who.int/nutrition/publications/obesity/WHO_TRS_894/en/.",
      "doi": ""
    },
    {
      "text": "Floriana S Luppino, Leonore M de Wit, Paul F Bouvy, Theo Stijnen, Pim Cuijpers, Brenda WJH Penninx and Frans G Zitman. 2010. Overweight, obesity, and depression: a systematic review and meta-analysis of longitudinal studies. Archives of general psychiatry, 67 (3). 220-229. 10.1001/archgenpsychiatry.2010.2",
      "doi": ""
    },
    {
      "text": "Victoria L. Webb and Thomas A. Wadden. 2017. Intensive Lifestyle Intervention for Obesity: Principles, Practices, and Results. Gastroenterology, 152 (7). 1752-1764. https://doi.org/10.1053/j.gastro.2017.01.045",
      "doi": ""
    },
    {
      "text": "Rena R. Wing. 2004. Behavioral approaches to the treatment of obesity. Handbook of obesity: Clinical applications, 2. 147-167.",
      "doi": ""
    },
    {
      "text": "Michael D. Jensen, Donna H. Ryan, Caroline M. Apovian, Jamy D. Ard, Anthony G. Comuzzie, Karen A. Donato, Frank B. Hu, Van S. Hubbard, John M. Jakicic, Robert F. Kushner, Catherine M. Loria, Barbara E. Millen, Cathy A. Nonas, F. Xavier Pi-Sunyer, June Stevens, Victor J. Stevens, Thomas A. Wadden, Bruce M. Wolfe and Susan Z. Yanovski. 2014. AHA/ACC/TOS guideline for the management of overweight and obesity in adults: a report of the American College of Cardiology/American Heart Association Task Force on Practice Guidelines and The Obesity Society. Circulation, 129 (25 Suppl 2). S139-140.",
      "doi": ""
    },
    {
      "text": "Joel Kreisberg and Reggie Marra. 2017. Board-certified Health Coaches? What Integrative Physicians Need to Know. Integrative Medicine: A Clinician's Journal, 16 (6).",
      "doi": ""
    },
    {
      "text": "Ruth Q. Wolever, Leigh Ann Simmons, Gary A. Sforzo, Diana Dill, Miranda Kaye, Elizabeth M. Bechard, Mary Elaine Southard, Mary Kennedy, Justine Vosloo and Nancy Yang. 2013. A Systematic Review of the Literature on Health and Wellness Coaching: Defining a Key Behavioral intervention in Healthcare. Global advances in health and medicine, 2 (4). 38-57. 10.7453/gahmj.2013.042",
      "doi": ""
    },
    {
      "text": "Jeanette M Olsen. 2014. Health coaching: a concept analysis. in Nursing Forum, Wiley Online Library, 18-29.",
      "doi": ""
    },
    {
      "text": "Heleen Rutjes, Martijn C. Willemsen and Wijnand A. IJsselsteijn. 2019. Beyond Behavior: The Coach's Perspective on Technology in Health Coaching Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, Glasgow, Scotland Uk, 1-14.",
      "doi": ""
    },
    {
      "text": "Alanna O'Broin and Stephen Palmer. 2006. The coach-client relationship and contributions made by the coach in improving coaching outcome. The Coaching Psychologist, 2 (2). 16-20.",
      "doi": ""
    },
    {
      "text": "Penny Newman and Andrew McDowell. 2016. Health changing conversations: clinicians’ experience of health coaching in the east of England. Future hospital journal, 3 (2). 147.",
      "doi": ""
    },
    {
      "text": "Briony Hill, Ben Richardson and Helen Skouteris. 2015. Do We Know How to Design Effective Health Coaching Interventions: A Systematic Review of the State of the Literature. American Journal of Health Promotion, 29 (5). e158-e168. 10.4278/ajhp.130510-LIT-238",
      "doi": ""
    },
    {
      "text": "Kirsi Kivela, Satu Elo, Helvi Kyngas and Maria Kaariainen. 2014. The effects of health coaching on adult patients with chronic diseases: a systematic review. Patient Education and Counseling, 97 (2). 147-157. 10.1016/j.pec.2014.07.026",
      "doi": ""
    },
    {
      "text": "Sara Santarossa, Deborah Kane, Charlene Y. Senn and Sarah J. Woodruff. 2018. Exploring the Role of In-Person Components for Online Health Behavior Change Interventions: Can a Digital Person-to-Person Component Suffice? Journal of medical Internet research, 20 (4). e144-e144. 10.2196/jmir.8480",
      "doi": ""
    },
    {
      "text": "David H. Thom, Jessica Wolf, Heather Gardner, Denise DeVore, Michael Lin, Andy Ma, Ana Ibarra-Castro and George Saba. 2016. A Qualitative Study of How Health Coaches Support Patients in Making Health-Related Decisions and Behavioral Changes. Annals of family medicine, 14 (6). 509-516. 10.1370/afm.1988",
      "doi": ""
    },
    {
      "text": "Min Tao, Krishna Rangarajan, Michael Paustian, L., Elizabeth A. Wasilevich and Darline K. El Reda. 2014. Dialing in: effect of telephonic wellness coaching on weight loss. The American journal of managed care, 20 (2). e35-42.",
      "doi": ""
    },
    {
      "text": "Melinda J Hutchesson, Megan E Rollo, Rebecca Krukowski, Louisa Ells, Jean Harvey, Philip J Morgan, Robin Callister, Ronald Plotnikoff and Clare E Collins. 2015. eHealth interventions for the prevention and treatment of overweight and obesity in adults: a systematic review with meta‐analysis. Obesity reviews, 16 (5). 376-392. 10.1111/obr.12268",
      "doi": ""
    },
    {
      "text": "Stephanie Alley, Cally Jennings, Ronald C. Plotnikoff and Corneel Vandelanotte. 2016. Web-Based Video-Coaching to Assist an Automated Computer-Tailored Physical Activity Intervention for Inactive Adults: A Randomized Controlled Trial. Journal of medical Internet research, 18 (8). e223. 10.2196/jmir.5664",
      "doi": ""
    },
    {
      "text": "Anastasija Komkova, Carl Joakim Brandt, Daniel Hansen Pedersen, Martha Emneus and Camilla Sortso. 2019. Electronic Health Lifestyle Coaching Among Diabetes Patients in a Real-Life Municipality Setting: Observational Study. JMIR Diabetes, 4 (1). e12140. 10.2196/12140",
      "doi": ""
    },
    {
      "text": "Ayan Chatterjee, Martin W Gerdes and Santiago Martinez. 2019. eHealth initiatives for the promotion of healthy lifestyle and allied implementation difficulties. in 2019 International Conference on Wireless and Mobile Computing, Networking and Communications (WiMob), IEEE, 1-8.",
      "doi": ""
    },
    {
      "text": "Carl Joakim Brandt, Gabrielle Isidora Søgaard, Jane Clemensen, Jens Søndergaard and Jesper Bo Nielsen. 2018. Determinants of Successful eHealth Coaching for Consumer Lifestyle Changes: Qualitative Interview Study Among Health Care Professionals. Journal of medical Internet research, 20 (7). e237-e237. 10.2196/jmir.9791",
      "doi": ""
    },
    {
      "text": "Ayan Chatterjee, Martin Gerdes, Andreas Prinz and Santiago Martinez. 2021. Human Coaching Methodologies for Automatic Electronic Coaching (eCoaching) as Behavioral Interventions With Information and Communication Technology: Systematic Review. Journal of medical Internet research, 23 (3). e23533-e23533. 10.2196/23533",
      "doi": ""
    },
    {
      "text": "Oresti Banos and Christopher Nugent. 2018. E-coaching for health. Computer, 51 (3). 12-15.",
      "doi": ""
    },
    {
      "text": "Angela Sorgente, Giada Pietrabissa, Gian Mauro Manzoni, Federica Re, Susan Simpson, Sara Perona, Alessandro Rossi, Roberto Cattivelli, Marco Innamorati and Jeffrey B Jackson. 2017. Web-based interventions for weight loss or weight loss maintenance in overweight and obese people: a systematic review of systematic reviews. Journal of medical Internet research, 19 (6). e229.",
      "doi": ""
    },
    {
      "text": "Ludovico Boratto, Salvatore Carta, Fabrizio Mulas and Paolo Pilloni. 2017. An e-coaching ecosystem: design and effectiveness analysis of the engagement of remote coaching on athletes. Personal and Ubiquitous Computing, 21 (4). 689-704.",
      "doi": "10.1007/s00779-017-1026-0"
    },
    {
      "text": "David Mohr, Pim Cuijpers and Kenneth Lehman. 2011. Supportive accountability: a model for providing human support to enhance adherence to eHealth interventions. Journal of medical Internet research, 13 (1). e30. 10.2196/jmir.1602",
      "doi": ""
    },
    {
      "text": "Gerhard Andersson and Pim Cuijpers. 2009. Internet-based and other computerized psychological treatments for adult depression: a meta-analysis. Cognitive Behaviour Therapy, 38 (4). 196-205. 10.1080/16506070903318960",
      "doi": ""
    },
    {
      "text": "Christopher Johnson, George Saba, Jessica Wolf, Heather Gardner and David H. Thom. 2018. What do health coaches do? Direct observation of health coach activities during medical and patient-health coach visits at 3 federally qualified health centers. Patient education and counseling, 101 (5). 900-907. 10.1016/j.pec.2017.11.017",
      "doi": ""
    },
    {
      "text": "Paul Krebs, James O. Prochaska and Joseph S. Rossi. 2010. A meta-analysis of computer-tailored interventions for health behavior change. Preventive Medicine, 51 (3). 214-221. https://doi.org/10.1016/j.ypmed.2010.06.004",
      "doi": ""
    },
    {
      "text": "Mia Liza A Lustria, Seth M Noar, Juliann Cortese, Stephanie K Van Stee, Robert L Glueckauf and Junga Lee. 2013. A meta-analysis of web-delivered tailored health behavior change interventions. Journal of health communication, 18 (9). 1039-1069.",
      "doi": ""
    },
    {
      "text": "Anna Khaylis, Themis Yiaslas, Jessica Bergstrom and Cheryl Gore-Felton. 2010. A review of efficacious technology-based weight-loss interventions: five key components. Telemedicine journal and e-health, 16 (9). 931-938. 10.1089/tmj.2010.0065",
      "doi": ""
    },
    {
      "text": "Kathleen Ryan, Samantha Dockray and Conor Linehan. 2019. A systematic review of tailored eHealth interventions for weight loss. DIGITAL HEALTH, 5. 1-23. https://doi.org/10.1177/2055207619826685",
      "doi": ""
    },
    {
      "text": "Jason Tang, Charles Abraham, Colin Greaves and Tom Yates. 2014. Self-directed interventions to promote weight loss: a systematic review of reviews. Journal of medical Internet research, 16 (2). e58. 10.2196/jmir.2857",
      "doi": ""
    },
    {
      "text": "A. Sherrington, J. J. Newham, R. Bell, A. Adamson, E. McColl and V. Araujo-Soares. 2016. Systematic review and meta-analysis of internet-delivered interventions providing personalized feedback for weight loss in overweight and obese adults. Obes Rev, 17 (6). 541-551. 10.1111/obr.12396",
      "doi": ""
    },
    {
      "text": "Seth M Noar, Nancy Grant Harrington, Stephanie K Van Stee and Rosalie Shemanski Aldrich. 2011. Tailored health communication to change lifestyle behaviors. American Journal of Lifestyle Medicine, 5 (2). 112-122. https://doi.org/10.1177/1559827610387255",
      "doi": ""
    },
    {
      "text": "Inbal Nahum-Shani, Shawna N Smith, Bonnie J Spring, Linda M Collins, Katie Witkiewitz, Ambuj Tewari and Susan A Murphy. 2018. Just-in-time adaptive interventions (JITAIs) in mobile health: key components and design principles for ongoing health behavior support. Annals of Behavioral Medicine, 52 (6). 446-462.",
      "doi": ""
    },
    {
      "text": "Matthew W Kreuter, Victor J Strecher and Bernard Glassman. 1999. One size does not fit all: the case for tailoring print materials. Annals of behavioral medicine, 21 (4). 276.",
      "doi": ""
    },
    {
      "text": "Kathleen Ryan, Lisa Ellen Murphy, Conor Linehan and Samantha Dockray. 2020. Theory in practice: identifying theory-based techniques in health coaches' tailored feedback during a weight loss intervention. Psychology & Health. 1-23. 10.1080/08870446.2020.1748629",
      "doi": ""
    },
    {
      "text": "William C Knowler, Elizabeth Barrett-Connor, Sarah E Fowler, Richard F Hamman, John M Lachin, Elizabeth A Walker and David M Nathan. 2002. Reduction in the incidence of type 2 diabetes with lifestyle intervention or metformin. The New England journal of medicine, 346 (6). 393-403.",
      "doi": ""
    },
    {
      "text": "Pedro J Teixeira, Eliana V Carraça, Marta M Marques, Harry Rutter, Jean-Michel Oppert, Ilse De Bourdeaudhuij, Jeroen Lakerveld and Johannes Brug. 2015. Successful behavior change in obesity interventions in adults: a systematic review of self-regulation mediators. BMC Medicine, 13 (1). 84. 10.1186/s12916-015-0323-6",
      "doi": ""
    },
    {
      "text": "Pedro J Teixeira, Marlene N Silva, Jutta Mata, António L Palmeira and David Markland. 2012. Motivation, self-determination, and long-term weight control. International Journal of Behavioral Nutrition and Physical Activity, 9 (1). 22.",
      "doi": ""
    },
    {
      "text": "J Hartmann‐Boyce, DJ Johns, SA Jebb, P Aveyard and Behavioural Weight Management Review Group. 2014. Effect of behavioural techniques and delivery mode on effectiveness of weight management: systematic review, meta‐analysis and meta‐regression. obesity reviews, 15 (7). 598-609.",
      "doi": ""
    },
    {
      "text": "Gunther Eysenbach. 2005. The law of attrition. Journal of medical Internet research, 7 (1). e11.",
      "doi": ""
    },
    {
      "text": "Elliot G. Mitchell, Rosa Maimone, Andrea Cassells, Jonathan N. Tobin, Patricia Davidson, Arlene M. Smaldone and Lena Mamykina. 2021. Automated vs. Human Health Coaching: Exploring Participant and Practitioner Experiences. Proceedings of the ACM on Human-Computer Interaction, 5 (CSCW1). Article 99. 10.1145/3449173",
      "doi": ""
    },
    {
      "text": "Peter B Jensen, Lars J Jensen and Søren Brunak. 2012. Mining electronic health records: towards better research applications and clinical care. Nature Reviews Genetics, 13 (6). 395.",
      "doi": ""
    },
    {
      "text": "Amanda J Wagg, Margie M Callanan and Alexander Hassett. 2018. The use of computer mediated communication in providing patient support: A review of the research literature. International journal of nursing studies, 82. 68-78.",
      "doi": ""
    },
    {
      "text": "Yunan Chen, Karen Cheng, Charlotte Tang, Katie A. Siek and Jakob E. Bardram. 2013. Is my doctor listening to me?: impact of health it systems on patient-provider interaction CHI '13 Extended Abstracts on Human Factors in Computing Systems, ACM, Paris, France, 2419-2426.",
      "doi": ""
    },
    {
      "text": "Alissa N. Antle, Elgin Skye McLaren, Holly Fiedler and Naomi Johnson. 2019. Design for Mental Health: How Socio-Technological Processes Mediate Outcome Measures in a Field Study of a Wearable Anxiety App Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, Tempe, Arizona, USA, 87-96.",
      "doi": ""
    },
    {
      "text": "Chia-Fang Chung, Jonathan Cook, Elizabeth Bales, Jasmine Zia and Sean A Munson. 2015. More than telemonitoring: health provider use and nonuse of life-log data in irritable bowel syndrome and weight management. Journal of medical Internet research, 17 (8). e203.",
      "doi": ""
    },
    {
      "text": "Anne E Jamieson, Paula C Fletcher and Margaret A Schneider. 2007. Seeking control through the determination of diet: a qualitative investigation of women with irritable bowel syndrome and inflammatory bowel disease. Clinical Nurse Specialist, 21 (3). 152-160.",
      "doi": ""
    },
    {
      "text": "Chia-Fang Chung, Kristin Dew, Allison Cole, Jasmine Zia, James Fogarty, Julie A Kientz and Sean A Munson. 2016. Boundary negotiating artifacts in personal informatics: Patient-provider collaboration with patient-generated data. in Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, 770-786.",
      "doi": "10.1145/2818048.2819926"
    },
    {
      "text": "Alison Kitson, Amy Marshall, Katherine Bassett and Kathryn Zeitz. 2013. What are the core elements of patient‐centred care? A narrative review and synthesis of the literature from health policy, medicine and nursing. Journal of advanced nursing, 69 (1). 4-15.",
      "doi": ""
    },
    {
      "text": "Silje Stangeland Lie, Bjørg Karlsen, Ellen Renate Oord, Marit Graue and Bjørg Oftedal. 2017. Dropout From an eHealth Intervention for Adults With Type 2 Diabetes: A Qualitative Study. J Med Internet Res, 19 (5). e187. 10.2196/jmir.7479",
      "doi": ""
    },
    {
      "text": "Karen L Goble, Sharon M Knight, Sloane C Burke, Lena W Carawan and Ruth Q Wolever. 2017. Transformative change to ‘a new me’: a qualitative study of clients’ lived experience with integrative health coaching. Coaching: An International Journal of Theory, Research and Practice, 10 (1). 18-36.",
      "doi": ""
    },
    {
      "text": "Jane Ogden. 2016. Celebrating variability and a call to limit systematisation: the example of the Behaviour Change Technique Taxonomy and the Behaviour Change Wheel. Health Psychology Review, 10 (3). 245-250. 10.1080/17437199.2016.1190291",
      "doi": ""
    },
    {
      "text": "Amy A. Gorin, Theodore A. Powers, Richard Koestner, Rena R. Wing and Hollie A. Raynor. 2014. Autonomy support, self-regulation, and weight loss. Health psychology : official journal of the Division of Health Psychology, American Psychological Association, 33 (4). 332-339. 10.1037/a0032586",
      "doi": ""
    },
    {
      "text": "Ruth Q. Wolever, Meg Jordan, Karen Lawson and Margaret Moore. 2016. Advancing a new evidence-based professional in health care: job task analysis for health and wellness coaches. BMC Health Services Research, 16 (1). 205. 10.1186/s12913-016-1465-8",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Elizabeth Mynatt, Patricia Davidson and Daniel Greenblatt. 2008. MAHI: investigation of social scaffolding for reflective thinking in diabetes management. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 477-486.",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Julia K Kolodziejczyk, Gregory J Norman, Angelica Barrera-Ng, Lindsay Dillon, Simon Marshall, Elva Arredondo, Cheryl L Rock, Fred Raab, William G Griswold and Mark Sullivan. 2013. Feasibility and effectiveness of an automated bilingual text message intervention for weight loss: pilot study. JMIR research protocols, 2 (2). e2789.",
      "doi": ""
    },
    {
      "text": "Kendra Rothert, Victor J. Strecher, Laurie A. Doyle, William M. Caplan, Jodi S. Joyce, Holly B. Jimison, Lya M. Karm, Adrienne D. Mims and Mark A. Roth. 2006. Web-based weight management programs in an integrated health care setting: a randomized, controlled trial. Obesity (Silver Spring), 14 (2). 266-272. 10.1038/oby.2006.34",
      "doi": ""
    },
    {
      "text": "Petr Slovák, Anja Thieme, David Murphy, Paul Tennent, Patrick Olivier and Geraldine Fitzpatrick. 2015. On becoming a counsellor: Challenges and opportunities to support interpersonal skills training. in Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, 1336-1347.",
      "doi": "10.1145/2675133.2675190"
    },
    {
      "text": "Stefanie Lynn Painter, Rezwan Ahmed, Robert F Kushner, James O Hill, Richard Lindquist, Scott Brunning and Amy Margulies. 2018. Expert Coaching in Weight Loss: Retrospective Analysis. Journal of Medical Internet Research, 20 (3). e92. 10.2196/jmir.9738",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health, 11 (4). 589-597.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology, 3 (2). 77-101. https://www.tandfonline.com/doi/abs/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Moira Maguire and Brid Delahunt. 2017. Doing a thematic analysis: A practical, step-by-step guide for learning and teaching scholars. AISHE-J: The All Ireland Journal of Teaching and Learning in Higher Education, 9 (3). https://ojs.aishe.org/aishe/index.php/aishe-j/article/view/335",
      "doi": ""
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. Sage Publications, Inc, California, USA.",
      "doi": ""
    },
    {
      "text": "American Psychological Association. 2002. Ethical Principles of Psychologists and Code of Conduct. American Psychologist, 57 (12). 1060-1073. http://dx.doi.org/10.1037/0003-066X.57.12.1060",
      "doi": ""
    },
    {
      "text": "BPS. 2017. Ethics Guidelines for Internet-mediated Research., British Psychological Society: Leicester. Accessed online on 4 February, 2018 from: www.bps.org.uk/publications/policy-and-guidelines/research-guidelines-policy-documents/researchguidelines-poli.",
      "doi": ""
    },
    {
      "text": "Matthew Kreuter, David Farrell, Laura Olevitch and Laura Brennan. 2000. Tailoring health messages: Customizing communication with computer technology. Lawrence Erlbaum Associates Publishers, Mahwah, NJ, US.",
      "doi": ""
    },
    {
      "text": "Harm op den Akker, Valerie M Jones and Hermie J Hermens. 2014. Tailoring real-time physical activity coaching systems: a literature survey and model. User modeling and user-adapted interaction, 24 (5). 351-392.",
      "doi": ""
    },
    {
      "text": "Gary L Kreps. 2014. Achieving the promise of digital health information systems. Journal of public health research, 3 (3). https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4274501/",
      "doi": ""
    },
    {
      "text": "Michael Nolting, Julian Roth and Ulf Wittke. 2020. Towards Autonomous Digital Health Coaching for Scalable Chronic Disease Prevention. in Proceedings of the 14th EAI International Conference on Pervasive Computing Technologies for Healthcare, 259-262.",
      "doi": ""
    },
    {
      "text": "Anna Haste, Ashley J. Adamson, Elaine McColl, Vera Araujo-Soares and Ruth Bell. 2017. Web-Based Weight Loss Intervention for Men With Type 2 Diabetes: Pilot Randomized Controlled Trial. JMIR Diabetes, 2 (2). e14. 10.2196/diabetes.7430",
      "doi": ""
    },
    {
      "text": "Christine Lisetti, Reza Amini, Ugan Yasavur and Naphtali Rishe. 2013. I Can Help You Change! An Empathic Virtual Agent Delivers Behavior Change Health Interventions. ACM Transactions on Management Information Systems, 4 (4). Article 19. 10.1145/2544103",
      "doi": ""
    },
    {
      "text": "Robert R Morris, Kareem Kouddous, Rohan Kshirsagar and Stephen M Schueller. 2018. Towards an artificially empathic conversational agent for mental health applications: system design and user perceptions. Journal of medical Internet research, 20 (6). e10148.",
      "doi": ""
    },
    {
      "text": "Annemarie Mol. 2008. The logic of care: Health and the problem of patient choice. Routledge.",
      "doi": ""
    },
    {
      "text": "Francisco Nunes, Nervo Verdezoto, Geraldine Fitzpatrick, Morten Kyng, Erik Grönvall and Cristiano Storni. 2015. Self-care technologies in HCI: Trends, tensions, and opportunities. ACM Transactions on Computer-Human Interaction (TOCHI), 22 (6). 1-45.",
      "doi": "10.1145/2803173"
    },
    {
      "text": "Susanne BØdker. 2016. Rethinking technology on the boundaries of life and work. Personal and Ubiquitous Computing, 20 (4). 533-544. 10.1007/s00779-016-0933-9",
      "doi": "10.1007/s00779-016-0933-9"
    },
    {
      "text": "Luigina Ciolfi and Aparecido Fabiano Pinatti De Carvalho. 2014. Work practices, nomadicity and the mediational role of technology. Computer Supported Cooperative Work (CSCW), 23 (2). 119-136.",
      "doi": ""
    },
    {
      "text": "Luigina Ciolfi and Eleanor Lockley. 2017. Work-Life Strategies on the Move: Reconfiguring Boundaries. International Reports on Socio-Informatics (IRSI), 14 (3). 35-40.",
      "doi": ""
    },
    {
      "text": "Glen O. Gabbard, Kristin A. Kassaw and Gonzalo Perez-Garcia. 2011. Professional boundaries in the era of the Internet. Academic Psychiatry, 35 (3). 168-174. 10.1176/appi.ap.35.3.168",
      "doi": ""
    },
    {
      "text": "Nancy K Baym. 2015. Connect with your audience! The relational labor of connection. The communication review, 18 (1). 14-22.",
      "doi": ""
    },
    {
      "text": "Xianghua Ding, Yunan Chen, Zhaofei Ding and Yiwen Xu. 2019. Boundary Negotiation for Patient-Provider Communication via WeChat in China. Proceedings of the ACM on Human-Computer Interaction, 3 (CSCW). 1-24.",
      "doi": "10.1145/3359259"
    },
    {
      "text": "Manjulaa Narasimhan, Pascale Allotey and Anita Hardon. 2019. Self care interventions to advance health and wellbeing: a conceptual framework to inform normative guidance. British Medical Journal, 365.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. To saturate or not to saturate? Questioning data saturation as a useful concept for thematic analysis and sample-size rationales. Qualitative research in sport, exercise and health, 13 (2). 201-216.",
      "doi": ""
    }
  ]
}