{
  "doi": "10.1145/1240624.1240851",
  "title": "Keystroke-level model for advanced mobile phone interaction",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1505-1514",
  "year": 2007,
  "badges": [],
  "abstract": "The design of applications using mobile devices needs a different quality assessment than those known for desktop applications. Of the many aspects that have to be taken into account, one important criterion is the average time users need to complete a task. For interactions with the mouse, keyboard or touch screens, there exist models that predict interaction times like Fitts' law or the Keystroke-Level Model (KLM). This paper shows parallels to these models for advanced interactions with mobile phones targeted at pervasive services, including near field communication as well as built-in cameras and sensors. Applications can be evaluated with respect to user performance time without having a prototype running on the phone. To accomplish that, we extend the known KLM by identifying basic interaction elements for mobile phones and give estimates for expert user performance derived from several user tests.",
  "authors": [
    {
      "name": "Paul Holleis",
      "institution": "University of Munich, Munich, Germany",
      "img": "/do/10.1145/contrib-81331494513/rel-imgonly/paul-holleis.jpeg",
      "acmid": "81331494513",
      "orcid": "missing"
    },
    {
      "name": "Friederike Otto",
      "institution": "University of Munich, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328490003",
      "orcid": "missing"
    },
    {
      "name": "Heinrich Hussmann",
      "institution": "University of Munich, Munich, Germany",
      "img": "/do/10.1145/contrib-81100395854/rel-imgonly/heinrich-hussmann.jpg",
      "acmid": "81100395854",
      "orcid": "missing"
    },
    {
      "name": "Albrecht Schmidt",
      "institution": "University of Bonn, Munich, Germany",
      "img": "/do/10.1145/contrib-81100588072/rel-imgonly/albrecht.jpg",
      "acmid": "81100588072",
      "orcid": "0000-0003-3890-1990"
    }
  ],
  "references": [
    {
      "text": "Ailisto, H., Korhonen, I., Plomp, J., Pohjanheimo, L., Strömmer, E., Realising Physical Selection for Mobile Devices. In Proc. PI'03. 38--41. 2003.",
      "doi": ""
    },
    {
      "text": "Anderson, J. R., Lebiere, C., The Atomic Components of Thought. Lawrence Erlbaum Associates, Inc. 1998.",
      "doi": ""
    },
    {
      "text": "Ballagas, R., Borchers, J., Rohs, M., Sheridan, J.G., The Smart Phone: A Ubiquitous Input Device. IEEE Pervasive Computing 5(1). 70--77. 2006.  ",
      "doi": "10.1109/MPRV.2006.18"
    },
    {
      "text": "Ballagas, R., Rohs, M., Sheridan, J. G., Sweep and Point and Shoot: Phonecam-based Interactions for Large Public Displays. In Extended Abstracts CHI'05. ACM Press. 1200--1203. 2005.  ",
      "doi": "10.1145/1056808.1056876"
    },
    {
      "text": "Bälter, O., Keystroke Level Analysis of Email Message Organization. Proc. CHI'00. ACM Press. 105--112. 2000.  ",
      "doi": "10.1145/332040.332413"
    },
    {
      "text": "Boyd J., Here Comes the Wallet Phone, IEEE Spectrum 42(11). 2005.  ",
      "doi": "10.1109/MSPEC.2005.1526896"
    },
    {
      "text": "Card, S. K., Moran, T. P., Newell, A., The Keystroke-Level Model for User Performance Time with Interactive Systems. Comm. ACM 23, 7. 396--410. 1980.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Card, S. K., Newell, A., Moran, T. P., The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, Inc. 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Dunlop, M.D., Crossan, A., Predictive Text Entry Methods for Mobile Phones. Personal Technologies, 4(2--3), 2000.",
      "doi": ""
    },
    {
      "text": "Föckler, P., Zeidler, T., Brombach, B., Bruns, E., Bimber, O., PhoneGuide: Museum Guidance Supported by On-device Object Recognition on Mobile Phones. In Proc. MUM'05. 2005.  ",
      "doi": "10.1145/1149488.1149490"
    },
    {
      "text": "Fowler, G. A., QR Codes: In Japan, Billboards Take Code-crazy Ads to New Heights. Wall Street Journal 10.10.2005. 2005.",
      "doi": ""
    },
    {
      "text": "Gong, R., Elkerton, J., Designing Minimal Documentation Using a GOMS Model: a Usability Evaluation of an Engineering Approach. In Proc. CHI'90. ACM Press. 99--107. 1990.  ",
      "doi": "10.1145/97243.97261"
    },
    {
      "text": "Gong, R., Kieras, D., A Validation of the GOMS Model Methodology in the Development of a Specialized, Commercial Software Application. In Proc. CHI'94. ACM Press. 351--357. 1994.  ",
      "doi": "10.1145/191666.191782"
    },
    {
      "text": "Gray, W. D., John, B. E., Atwood, M. E. The Precis of Project Ernestine or an Overview of a Validation of GOMS. In Proc. CHI'92. ACM Press. 307--312.  ",
      "doi": "10.1145/142750.142821"
    },
    {
      "text": "Haunold, P., Kuhn W., A Keystroke Level Analysis of a Graphics Application: Manual Map Digitizing. In Proc. CHI'94. 337--343. 1994.  ",
      "doi": "10.1145/191666.191779"
    },
    {
      "text": "Hinckley, K., Guimbretière, F., Baudisch, P., Sarin, R., Agrawala, M., Cutrell, E., The Springboard: Multiple Modes in one Spring-loaded Control. In Proc. CHI'06. ACM Press. 181--190. 2006.  ",
      "doi": "10.1145/1124772.1124801"
    },
    {
      "text": "How Y., Kan M.Y., Optimizing Predictive Text Entry for Short Message Service on Mobile Phones. In Proc. HCII'05. 2005.",
      "doi": ""
    },
    {
      "text": "James, C. L., Reischel, K. M., Text Input for Mobile Devices: Comparing Model Prediction to Actual Performance. In Proc. CHI'01, 365--371. 2001.  ",
      "doi": "10.1145/365024.365300"
    },
    {
      "text": "John, B. E., Extensions of GOMS Analyses to Expert Performance Requiring Perception of Dynamic Visual and Auditory Information. In Proc. CHI'90. ACM Press. 107--115. 1990.  ",
      "doi": "10.1145/97243.97262"
    },
    {
      "text": "John, B. E., Vera, A. H., A GOMS Analysis of a Graphic Machine-paced, Highly Interactive Task. In Proc. CHI'92. ACM Press. 251--258. 1992.  ",
      "doi": "10.1145/142750.142805"
    },
    {
      "text": "Kieras, D., Using the Keystroke-Level Model to Estimate Execution Times. The University of Michigan, Unpublished Report, Online Version as of August 2006, http://www.pitt.edu/~cmlewis/KSM.pdf. 1993.",
      "doi": ""
    },
    {
      "text": "Kindberg, T., Barton, J., Morgan, J., Becker, G., Caswell, D., Debaty, P., Gopal, G., Frid, M., Krishnan, V., Morris, H., Schettino, J., Serra, B., Spasojevic, M., People, Places, Things: Web Presence for the Real World. Mobile Networks and Applications 7(5). 365--376. 2002.  ",
      "doi": "10.1023/A%3A1016591616731"
    },
    {
      "text": "Koester, H. H., Levine, S. P., Validation of a Keystroke-Level Model for a Text Entry System Used by People with Disabilities. In Proc. Assets'94. ACM Press. 115--122. 1994.  ",
      "doi": "10.1145/191028.191061"
    },
    {
      "text": "Luo, L., John, B. E., Predicting Task Execution Time on Handheld Devices Using the Keystroke-Level Model. In CHI'05. ACM Press. 1605--1608. 2005.  ",
      "doi": "10.1145/1056808.1056977"
    },
    {
      "text": "Manes, D., Green, P., Hunter, D., Prediction of Destination Entry and Retrieval Times Using Keystroke-Level Models. Technical Report UMTRI-96-37. The University of Michigan Transportation. 1996.",
      "doi": ""
    },
    {
      "text": "Mori, R., Matsunobe, T., Yamaoka, T., A Task Operation Prediction Time Computation Based on GOMS-KLM Improved for the Cellular Phone and the Verification of that Validity, In Proc. ADC'03. 2003.",
      "doi": ""
    },
    {
      "text": "Myers, B. A., Mobile Devices for Control. In LNCS 2411. Springer. 1--8. 2002. ",
      "doi": "10.5555/645739.666744"
    },
    {
      "text": "Myung R., Keystroke-Level Analysis of Korean Text Entry Methods on Mobile Phones, International Journal of Human-Computer Studies 60, 5-6. 545--563. 2004.",
      "doi": ""
    },
    {
      "text": "Pavlovych, A., Stuerzlinger, W., Model for Non-expert Text Entry Speed on 12-button Phone Keypads. In Proc. CHI'04. ACM Press. 351--358. 2004.  ",
      "doi": "10.1145/985692.985737"
    },
    {
      "text": "Rekimoto, J., Nagao, K., The World Through the Computer: Computer Augmented Interaction with Real World Environments. In Proc. UIST'95. 29--36. 1995.  ",
      "doi": "10.1145/215585.215639"
    },
    {
      "text": "Rohs, M., and Gfeller, B., Using Camera-equipped Mobile Phones for Interacting with Real-world Objects. Advances in Pervasive Computing. Austrian Computer Society (OCG). 265--271. 2004.",
      "doi": ""
    },
    {
      "text": "Rukzio, E., Leichtenstern, K., Callaghan, V., Schmidt, A., Holleis, P., Chin J., An Experimental Comparison of Physical Mobile Interaction Techniques: Touching, Pointing and Scanning. In Proc. Ubicomp'06. 2006.",
      "doi": ""
    },
    {
      "text": "Rukzio, E., Paolucci, M., Wagner, M., Berndt, H. H., Hamard, J., Schmidt, A., Mobile Service Interaction with the Web of Things. In Proc. ICT'06. 2006.",
      "doi": ""
    },
    {
      "text": "Rukzio, E., Schmidt, A., Hussmann, H., Physical Posters as Gateways to Context-aware Services for Mobile Devices. In Proc. WMCSA'04. 2004.  ",
      "doi": "10.1109/MCSA.2004.20"
    },
    {
      "text": "Salvucci, D. D. Modeling Driver Distraction from Cognitive Tasks. In Proc. CogSci2002, 792--797. Lawrence Erlbaum Associates, Inc. 2002.",
      "doi": ""
    },
    {
      "text": "Silfverberg M., MacKenzie, I. S., and Korhonen, P. Predicting Text Entry Speed on Mobile Phones. In Proc. CHI'00, 9--16. 2000.  ",
      "doi": "10.1145/332040.332044"
    },
    {
      "text": "Teo, L., John, B. E., Comparisons of Keystroke-Level Model Predictions to Observed Data. In Extended Abstracts CHI'06. ACM Press. 1421--1426. 2006.  ",
      "doi": "10.1145/1125451.1125713"
    },
    {
      "text": "Välkkynen, P., Korhonen, I., Plomp, J., Tuomisto, T., Cluitmans, L., Ailisto, H., Seppä, H., A User Interaction Paradigm for Physical Browsing and Near-object Control Based on Tags. In Proc. PI'03. 38--41. 2003.",
      "doi": ""
    },
    {
      "text": "Välkkynen, P., Tuomisto, T., Physical Browsing Research. In Proc. PERMID'05. 35--38. 2005.",
      "doi": ""
    },
    {
      "text": "Want, R., Fishkin, K. P., Gujar, A., Harrison, B. L., Bridging Physical and Virtual Worlds with Electronic Tags. In Proc. CHI'99. ACM Press. 370--377. 1999.  ",
      "doi": "10.1145/302979.303111"
    }
  ]
}