{
  "doi": "10.1145/1240624.1240787",
  "title": "Supporting multidisciplinary collaboration: requirements from novel HCI education",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1073-1076",
  "year": 2007,
  "badges": [],
  "abstract": "Many collaborative design tools may suffer from being too generic to address the specific complexities inherent in multidisciplinary collaboration. We provide accounts of several multidisciplinary HCI courses at our institution, elaborating on the challenges student teams face when integrating design practice from a wide variety of disciplines. Of particular interest are the distinct approaches that these multidisciplinary teams adopt that differ from more common forms of collaborative design. We suggest reasons for the poor rate of adoption of existing collaborative support tools and outline specific suggestions for directions in both ethnographic studies of multidisciplinary collaboration and collaborative systems design.",
  "authors": [
    {
      "name": "Piotr D. Adamczyk",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100324367",
      "orcid": "missing"
    },
    {
      "name": "Michael B. Twidale",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL",
      "img": "/do/10.1145/contrib-81100388948/rel-imgonly/twidale9.jpg",
      "acmid": "81100388948",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Denton, H.G. Multidisciplinary team-based project work: planning factors. Design Studies, 18, 1997. 155--170.",
      "doi": ""
    },
    {
      "text": "Detienne, F. Collaborative design: Managing task interdependencies and multiple perspectives. Interacting With Computers, 18, 2006. 1--20.  ",
      "doi": "10.1016/j.intcom.2005.05.001"
    },
    {
      "text": "Hoeben, A. and Stappers, P.J. Direct talkback in computer supported tools for the conceptual stage of design. Knowledge-Based Systems, 18, 2005. 407--413.  ",
      "doi": "10.1016/j.knosys.2005.07.003"
    },
    {
      "text": "Jennings, P., Tangible Social Interfaces: Critical Theory, Boundary Objects and Interdisciplinary Design Methods. in Creativity and Cognition, (2005), 176--186.  ",
      "doi": "10.1145/1056224.1056249"
    },
    {
      "text": "Mackay, W.E., The Interactive Thread: Exploring Methods for Multi-disciplinary Design. in Designing Interactive Systems, (2004), 103--112.  ",
      "doi": "10.1145/1013115.1013131"
    },
    {
      "text": "Mathes, A. Folksonomies -- Cooperative Classification and Communication Through Shared Metadata, April 10, 2005, http://www.adammathes.com/academic/computer-mediated-communication/folksonomies.html.",
      "doi": ""
    },
    {
      "text": "Petre, M. Team coordination through externalized mental imagery. International Journal of Human-Computer Studies, 61, 2004. 205--218.  ",
      "doi": "10.1016/j.ijhcs.2003.12.013"
    },
    {
      "text": "Sonnenwald, D.H. Communication roles that support collaboration during the design process. Design Studies, 17, 1996. 277--301.",
      "doi": ""
    },
    {
      "text": "Sonnenwald, D.H. Contested Collaboration: A descriptive model of intergroup communication in information system design. Information Processing and Management, 31 (6), 1995. 859--877.  ",
      "doi": "10.1016/0306-4573%2895%2900002-X"
    },
    {
      "text": "Star, S.L. The structure of ill-structured solutions: Boundary objects and heterogeneous distributed problem solving. in Hubs, M. and Gasser, L. eds. Readings in Distributed Artificial Intelligence 3, Morgan Kaufmann, Menlo Park, CA., 1989. ",
      "doi": "10.5555/77786.77864"
    },
    {
      "text": "Terry, M. and Mynatt, E.D. Enhancing general--purpose tools with multi-state previewing capabilities. Knowledge--Based Systems, 18, 2005. 415--425.  ",
      "doi": "10.1016/j.knosys.2005.07.004"
    }
  ]
}