{
  "doi": "10.1145/1240624.1240772",
  "title": "Why we tag: motivations for annotation in mobile and online media",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "971-980",
  "year": 2007,
  "badges": [],
  "abstract": "Why do people tag? Users have mostly avoided annotating media such as photos -- both in desktop and mobile environments -- despite the many potential uses for annotations, including recall and retrieval. We investigate the incentives for annotation in Flickr, a popular web-based photo-sharing system, and ZoneTag, a cameraphone photo capture and annotation tool that uploads images to Flickr. In Flickr, annotation (as textual tags) serves both personal and social purposes, increasing incentives for tagging and resulting in a relatively high number of annotations. ZoneTag, in turn, makes it easier to tag cameraphone photos that are uploaded to Flickr by allowing annotation and suggesting relevant tags immediately after capture. A qualitative study of ZoneTag/Flickr users exposed various tagging patterns and emerging motivations for photo annotation. We offer a taxonomy of motivations for annotation in this system along two dimensions (sociality and function), and explore the various factors that people consider when tagging their photos. Our findings suggest implications for the design of digital photo organization and sharing applications, as well as other applications that incorporate user-based annotation.",
  "tags": [
    "digital photographs",
    "motivations",
    "cameraphone",
    "annotation",
    "incentives",
    "CSCW",
    "photo sharing",
    "location-aware",
    "collection organization",
    "tagging"
  ],
  "authors": [
    {
      "name": "Morgan Ames",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100499551",
      "orcid": "missing"
    },
    {
      "name": "Mor Naaman",
      "institution": "Yahoo! Research Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100585927",
      "orcid": "0000-0002-6436-3877"
    }
  ],
  "references": [
    {
      "text": "Flickr, http://www.flickr.com",
      "doi": ""
    },
    {
      "text": "Frohlich, D., Kuchinsky, A., Pering, C., Don, A., and Ariss, S. Requirements for Photoware. In Proc. CSCW '02, ACM Press (2002).  ",
      "doi": "10.1145/587078.587102"
    },
    {
      "text": "Girgensohn, A., Adcock, J., Cooper, M., Foote, J. and Wilcox, L. Simplifying the Management of Large Photo Collections. In Proc. INTERACT '03. IOS Press (2003).",
      "doi": ""
    },
    {
      "text": "Golder, S., and Huberman, B.A. The Structure of Collaborative Tagging Systems. Tech. Report, HP Labs, 2005.",
      "doi": ""
    },
    {
      "text": "Kang, H., and Shneiderman, B. Exploring Personal Media: A Spatial Interface Supporting User-defined Semantic Regions. Tech. Report ISR 2005--51, U. Maryland, 2005.",
      "doi": ""
    },
    {
      "text": "Kindberg, T., Spasojevic, M., Fleck, R. and Sellen, A. The Ubiquitous Camera: An In-Depth Study of Camera Phone Use. In IEEE Pervasive Computing 4, 2 (2005), 42--50.  ",
      "doi": "10.1109/MPRV.2005.42"
    },
    {
      "text": "Kirk, D.S., Sellen, A.J., Rother, C., and Wood, K.R. Understanding Photowork. In Proc. CHI '06, ACM Press (2006).  ",
      "doi": "10.1145/1124772.1124885"
    },
    {
      "text": "Kuchinsky, A., Pering, C., Creech, M.L., Freeze, D., Serra, B., and Gwizdka, J. Fotofile: A Consumer Multimedia Organization and Retrieval System. In Proc. CHI '99, ACM Press (1999).  ",
      "doi": "10.1145/302979.303143"
    },
    {
      "text": "Kules, B., Kang, H., Plaisant, C., Rose, A., and Shneiderman, B. Immediate Usability: Kiosk Design Principles from the CHI 2001 Photo Library. Tech. Report CS-TR-4293, U. Maryland, 2003.",
      "doi": ""
    },
    {
      "text": "Kustanowitz, J. and Shneiderman, B. Motivating Annotation for Personal Digital Photo Libraries: Lowering Barriers while Raising Incentives. Tech. Report HCIL-2004-18, U. Maryland, 2005.",
      "doi": ""
    },
    {
      "text": "Marlow, C., Naaman, M., boyd, d., and Davis, M. HT06, Tagging Paper, Taxonomy, Flickr, Academic Article, ToRead. In Proc. Hypertext '06, ACM Press (2006).  ",
      "doi": "10.1145/1149941.1149949"
    },
    {
      "text": "Marshall, C. Toward an Ecology of Hypertext Annotation. In Proc. Hypertext '98, ACM Press (1998).  ",
      "doi": "10.1145/276627.276632"
    },
    {
      "text": "Naaman, M., Paepcke, A., and Garcia-Molina, H. From Where to What: Metadata Sharing for Digital Photographs with Geographic Coordinates. In Proc. CoopIS '03, ACM Press (2003).",
      "doi": ""
    },
    {
      "text": "Naaman, M., Yeh, R.B., Garcia-Molina, H., and Paepcke, A. Leveraging Context to Resolve Identity in Photo Albums. In Proc. JCDL '05 (June 2005).  ",
      "doi": "10.1145/1065385.1065430"
    },
    {
      "text": "Okabe, D., and Ito, M. Everyday Contexts of Camera Phone Use: Steps Toward Technosocial Ethnographic Frameworks. In Mobile Communication in Everyday Life: An Ethnographic View, forthcoming.",
      "doi": ""
    },
    {
      "text": "Rodden, K. How do People Organise their Photographs? In BCS-IRSG Colloquium on Information Retrieval, 1999. ",
      "doi": "10.5555/2228015.2228027"
    },
    {
      "text": "Rodden, K. and Wood, K. How Do People Manage Their Digital Photographs? In Proc. CHI '03, ACM Press (2003).  ",
      "doi": "10.1145/642611.642682"
    },
    {
      "text": "Salovaara, A., Jacucci, G., Oulasvirta, A., Saari, T., Kanerva, P., Kurvinen, E., and Tiitta, S. Collective Creation and Sense-Making of Mobile Media. In Proc. CHI '06, ACM Press (2006).  ",
      "doi": "10.1145/1124772.1124954"
    },
    {
      "text": "Sarvas, R., Herrarte, E., Wilhelm, A., and Davis, M. Metadata creation system for mobile images. In Proc. MobiSys '04, ACM Press (2004).  ",
      "doi": "10.1145/990064.990072"
    },
    {
      "text": "Sen, S., Lam, S.K., Rashid, A.M., Cosley, D., Frankowski, D., Osterhouse, J., Harper, F.M., Riedl. J. tagging, communities, vocabulary, evolution. In Proc. CSCW '05, ACM Press (2005).  ",
      "doi": "10.1145/1180875.1180904"
    },
    {
      "text": "Shneiderman, B. and Kang, H. Direct Annotation: A Drag-and-Drop Strategy for Labeling Photos. In Proc. INFOVIZ '00, May 2000. ",
      "doi": "10.5555/518910.850488"
    },
    {
      "text": "Van House, N., Davis, M., Ames, M., Finn, M., and Viswanathan, V. The Uses of Personal Networked Digital Imaging: An Empirical Study of Cameraphone Photos and Sharing. In Ext. Abstracts CHI '05, ACM Press (2005).  ",
      "doi": "10.1145/1056808.1057039"
    },
    {
      "text": "Van House, N. Interview Viz: Visualization-Assisted Photo Elicitation. In Ext. Abstracts CHI '06, ACM Press (2006).  ",
      "doi": "10.1145/1125451.1125720"
    },
    {
      "text": "von Ahn, L. and Dabbish, L. 2004. Labeling Images with a Computer Game. In Proc. CHI '04, ACM Press (2004).  ",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "Wenyin, L., Dumais, S., Sun, Y., Zhang, H., Czerwinski, M., and Field, B. Semi-automatic image annotation. In Proc. INTERACT '01, IOS Press (July 2001).",
      "doi": ""
    }
  ]
}