{
  "doi": "10.1145/1240624.1240756",
  "title": "Watching together: integrating text chat with video",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "877-886",
  "year": 2007,
  "badges": [],
  "abstract": "Watching video online is becoming increasingly popular, and new video streaming technologies have the potential to transform video watching from a passive, isolating experience into an active, socially engaging experience. However, the viability of an active social experience is unclear: both chatting and watching video require attention, and may interfere with one another and detract from the experience. In this paper, we empirically examine the activity of chatting while watching video online. We examine how groups of friends and strangers interact, and find that chat has a positive influence on social relationships, and people chat despite being distracted. We discuss the benefits and opportunities provided by mixing chat and video, uncover some of the attentional and social challenges inherent in this combination of media, and provide guidance for structuring the viewing experience.",
  "tags": [
    "video",
    "social TV",
    "friends",
    "strangers",
    "interactive television",
    "chat"
  ],
  "authors": [
    {
      "name": "Justin D. Weisz",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81311482644/rel-imgonly/jweisz-20-sm.jpg",
      "acmid": "81311482644",
      "orcid": "missing"
    },
    {
      "name": "Sara Kiesler",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100476487/rel-imgonly/kiesler2001.jpg",
      "acmid": "81100476487",
      "orcid": "missing"
    },
    {
      "name": "Hui Zhang",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406596512",
      "orcid": "missing"
    },
    {
      "name": "Yuqing Ren",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81323495408",
      "orcid": "missing"
    },
    {
      "name": "Robert E. Kraut",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81328489038/rel-imgonly/bob2010-head-vest-edit.jpg",
      "acmid": "81328489038",
      "orcid": "0000-0002-8554-2137"
    },
    {
      "name": "Joseph A. Konstan",
      "institution": "University of Minnesota, Minneapolis, MN",
      "img": "/do/10.1145/contrib-81100049091/rel-imgonly/konstan-award-photo.jpg",
      "acmid": "81100049091",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arkin, R. M., and Burger, J. M. Effects of unit relation tendencies on interpersonal attraction. Social Psychology Quarterly, 1980, 43, 380--391.",
      "doi": ""
    },
    {
      "text": "Brown, B., Barkhuus, L. The television will be revolutionized: effects of PVRs and filesharing on television watching. In Proc. of CHI 2006. ACM Press, New York, NY, 663--666.  ",
      "doi": "10.1145/1124772.1124870"
    },
    {
      "text": "Cartwright, D., and Zander, A. Group cohesiveness: Introduction. 1953. In D. Cartwright & A. Zander (Eds.), Group dynamics: Research and theory. Evanston, IL: Row Peterson.",
      "doi": ""
    },
    {
      "text": "Coppens, T., Trappeniers, L., Godon, M. AmigoTV: towards a social TV experience. In Proc. EuroITV 2004, University of Brighton, U.K.",
      "doi": ""
    },
    {
      "text": "Chu, Y., Ganjam, A., Ng, T. S. E., Rao, S., Sripanidkulchai, K., Zhan, J., Zhang, H. Early experience with an Internet broadcast system based on overlay multicast. In USENIX Annual Technical Conference, 2004. ",
      "doi": "10.5555/1247415.1247427"
    },
    {
      "text": "Chuah, M. Reality instant messaging: injecting a dose of reality into online chat. In CHI 2003 Extended Abstracts. ACM Press, New York, NY, 926--927.  ",
      "doi": "10.1145/765891.766074"
    },
    {
      "text": "Czerwinski, M., Cutrell, E., & Horvitz, E. Instant messaging and interruption: Influence of task type on performance. Proceedings of OZCHI 2000, Sydney, Australia, Dec. 4--8.",
      "doi": ""
    },
    {
      "text": "Deaux, K., & Major, B. (1987). Putting gender into context: An interactive model of gender-related behavior. Psychological Review, 94, 369--389.",
      "doi": ""
    },
    {
      "text": "Finn, S. and Gorr, M.B. Social isolation and social support as correlates of television viewing motivation. Communications Research, 2001, 15, 135--158.",
      "doi": ""
    },
    {
      "text": "Fuller, R. and Sheehy--Skeffington, A. Effects of group laughter on responses to humorous material: A replication and extension. Psychological Reports, 1974, 35 (1, pt. 2), 531--534.",
      "doi": ""
    },
    {
      "text": "Geerts, D. Comparing voice chat and text chat in a communication tool for interactive television. In Proc. NordiCHI 2006. ACM Press, New York, NY, 461--464.  ",
      "doi": "10.1145/1182475.1182537"
    },
    {
      "text": "Helft, M. Young Internet Producers, Bankrolled, Are Seeking Act II. The New York Times (Sept. 25, 2006), http://www.nytimes.com/2006/09/25/technology/25digg.html",
      "doi": ""
    },
    {
      "text": "Hills, P., and Argyle, M. Positive moods derived from leisure and their relationships to happiness and personality. Personality and Individual Differences, 1998, 25, 523--535.",
      "doi": ""
    },
    {
      "text": "Luyten, K., Thys, K., Huypens, S., and Connix, K. Telebuddies: social stitching with interactive television. In CHI 2006 Extended Abstracts. ACM Press, New York, NY, 1049--1054.  ",
      "doi": "10.1145/1125451.1125651"
    },
    {
      "text": "McKenna, K. Y. A., Green, A. S., & Gleason, M. E. J. Relationship formation on the Internet: What's the big attraction? Journal of Social Issues, 2002, 58(1), 9--31.",
      "doi": ""
    },
    {
      "text": "Nardi, B., and Harris, J. Strangers and friends: Collaborative play in World of Warcraft. In Proc. CSCW 2006. ACM Press, New York, NY, 149--158.  ",
      "doi": "10.1145/1180875.1180898"
    },
    {
      "text": "Oehlberg, L., Ducheneaut, N., Thornton, J. D., Moore, R. J., Nickell, E. Social TV: Designing for distributed, sociable television viewing. In Proc. EuroITV 2006, Athens, Greece.",
      "doi": ""
    },
    {
      "text": "Powazek, D. M. Design for community: The art of connecting real people in virtual places. 2002. Indianapolis, IN: New Riders Publishing. ",
      "doi": "10.5555/516336"
    },
    {
      "text": "Putnam, R. D. Tuning in, tuning out: The strange disappearance of social capital in America. PS: Political Science and Politics, 1995, 28(4), 664--683.",
      "doi": ""
    },
    {
      "text": "Regan, T., and Todd, I. Media center buddies: instant messaging around a media center. In Proc. NordiCHI 2004. ACM Press, New York, NY, 141--144.  ",
      "doi": "10.1145/1028014.1028036"
    },
    {
      "text": "Slater, M., Sadagic, A., and Schroeder, R. Small--group behavior in a virtual and real environment: A comparative study. Presence, Teleoperators and Virtual Environments, 2000, 9(1), 37--51.  ",
      "doi": "10.1162/105474600566600"
    },
    {
      "text": "Utz, S. Social identification and interpersonal attraction in MUDs. Swiss Journal of Psychology, 2003, 62(2), 91--101.",
      "doi": ""
    },
    {
      "text": "Welford, A. T. Single channel operation in the brain. Acta Psychologica, 1967, 27, 5--21.",
      "doi": ""
    },
    {
      "text": "Weisz, J. D., Erickson, T., and Kellogg, W. A. Synchronous broadcast messaging: The use of ICT. In Proc. CHI 2006. ACM Press, New York, NY, 1293--1302.  ",
      "doi": "10.1145/1124772.1124967"
    },
    {
      "text": "Wickens, C. D. Multiple resources and performance prediction. Theoretical Issues in Ergonomics Science, 2002, 3(2), 159--177.",
      "doi": ""
    }
  ]
}