{
  "doi": "10.1145/1240624.1240793",
  "title": "iStuff mobile: rapidly prototyping new mobile phone interfaces for ubiquitous computing",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1107-1116",
  "year": 2007,
  "badges": [],
  "abstract": "iStuff Mobile is the first rapid prototyping framework that helps explore new sensor-based interfaces with existing mobile phones. It focuses on sensor-enhanced physical interfaces for ubiquitous computing scenarios. The framework includes sensor network platforms, mobile phone software, and a proven rapid prototyping framework. Interaction designers can use iStuff Mobile to quickly create and test functional prototypes of novel interfaces without making internal hardware or software modifications to the handset. A visual programming paradigm provides a low threshold for prototyping activities: the system is not difficult to learn. At the same time, the range of examples built using the toolkit demonstrates a high ceiling for prototyping activities: the toolkit places few limits on prototype complexity. A user study shows that the visual programming metaphor enables prototypes to be built faster and encourages more iterations than a previous approach.",
  "tags": [
    "rapid prototyping",
    "visual programming",
    "quartz composer",
    "sensor networks",
    "cell phone",
    "mobile phone",
    "design"
  ],
  "authors": [
    {
      "name": "Rafael Ballagas",
      "institution": "RWTH Aachen University, Aachen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81405596165",
      "orcid": "missing"
    },
    {
      "name": "Faraz Memon",
      "institution": "RWTH Aachen University, Aachen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81546610856",
      "orcid": "missing"
    },
    {
      "name": "Rene Reiners",
      "institution": "RWTH Aachen University, Aachen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384599525",
      "orcid": "missing"
    },
    {
      "name": "Jan Borchers",
      "institution": "RWTH Aachen University, Aachen, Germany",
      "img": "/do/10.1145/contrib-81100443423/rel-imgonly/borchers_7154.jpg",
      "acmid": "81100443423",
      "orcid": "0000-0003-1509-3257"
    }
  ],
  "references": [
    {
      "text": "Abowd, G. D., Hayes, G. R., Iachello, G., Kientz, J. A., Patel, S. N., Stevens, M. M., and Truong, K. N. Prototypes and paratypes: Designing mobile and ubiquitous computing applications. IEEE Pervasive Computing (2005), 67--73.  ",
      "doi": "10.1109/MPRV.2005.83"
    },
    {
      "text": "Abowd, G. D., Iftode, L., and Mitchell, H. Guest editors' introduction: The smart phone--a first platform for pervasive computing. IEEE Pervasive Computing 4, 2 (2005), 18--19.  ",
      "doi": "10.1109/MPRV.2005.32"
    },
    {
      "text": "Ballagas, R., Ringel, M., Stone, M., and Borchers, J. iStuff: A Physical User Interface Toolkit for Ubiquitous Computing Environments. Proc. CHI '03. ACM Press (New York, NY, USA, 2003), 537--544.  ",
      "doi": "10.1145/642611.642705"
    },
    {
      "text": "Ballagas, R., Rohs, M., Sheridan, J. G., and Borchers, J. Sweep and Point & Shoot: Phonecam--based interactions for large public displays. Extendend abstracts of CHI '05. ACM Press (New York, NY, USA, 2005), 1200--1203.  ",
      "doi": "10.1145/1056808.1056876"
    },
    {
      "text": "Ballagas, R., Szybalski, A., and Fox, A. Patch Panel: Enabling Control--Flow Interoperability in Ubicomp Environments. PerCom '04. Proceedings of the Second IEEE Annual Conference on Pervasive Computing and Communications. IEEE (Orlando, FL, USA, 2004). ",
      "doi": "10.5555/977406.978678"
    },
    {
      "text": "Card, S. K., Newell, A., and Moran, T. P. The Psychology of Human--Computer Interaction. Lawrence Erlbaum Associates, Inc., 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Edwards, W. K., Bellotti, V., Dey, A. K., and Newman, M. W. The challenges of user--centered design and evaluation for infrastructure. Proc. CHI '03. ACM Press (New York, NY, USA, 2003), 297--304.  ",
      "doi": "10.1145/642611.642664"
    },
    {
      "text": "Gellersen, H., Kortuem, G., Schmidt, A., and Beigl, M. Physical Prototyping with Smart--Its. IEEE Pervasive Computing 3, 3 (2004), 74--82.  ",
      "doi": "10.1109/MPRV.2004.1321032"
    },
    {
      "text": "Greenberg, S., and Fitchett, C. Phidgets: Easy development of physical interfaces through physical widgets. Proc. UIST '01. ACM Press (New York, NY, USA, 2001), 209--218.  ",
      "doi": "10.1145/502348.502388"
    },
    {
      "text": "Harrison, B. L., Fishkin, K. P., Gujar, A., Mochon, C., and Want, R. Squeeze me, hold me, tilt me! An exploration of manipulative user interfaces. Proc. CHI '98. ACM Press/Addison-Wesley Publishing Co. (New York, NY, USA, 1998), 17--24.  ",
      "doi": "10.1145/274644.274647"
    },
    {
      "text": "Hartmann, B., Klemmer, S. R., Bernstein, M., Abdulla, L., Burr, B., Robinson-Mosher, A. L., and Gee, J. Reflective physical prototyping through integrated design, test, and analysis. Proc. UIST '06. ACM Press (2006), 299--308.  ",
      "doi": "10.1145/1166253.1166300"
    },
    {
      "text": "Hinckley, K., and Horvitz, E. Toward more sensitive mobile phones. Proc. UIST '01. ACM Press (New York, NY, USA, 2001), 191--192.  ",
      "doi": "10.1145/502348.502382"
    },
    {
      "text": "Hudson, S. E., and Mankoff, J. Rapid Construction of Functioning Physical Interfaces from Cardboard, Thumbtacks, Tin Foil and Masking Tape. Proc. UIST '06. ACM Press (2006), 289--297.  ",
      "doi": "10.1145/1166253.1166299"
    },
    {
      "text": "Johanson, B., and Fox, A. The Event Heap: A Coordination Infrastructure for Interactive Workspaces. WMCSA '02: Proceedings of the Fourth IEEE Workshop on Mobile Computing Systems and Applications. IEEE (2002), 83. ",
      "doi": "10.5555/832315.837560"
    },
    {
      "text": "Johanson, B., Fox, A., and Winograd, T. The interactive workspaces project: experiences with ubiquitous computing rooms. IEEE Pervasive Computing 1 (2002), 67--74.  ",
      "doi": "10.1109/MPRV.2002.1012339"
    },
    {
      "text": "Johanson, B., Hutchins, G., Winograd, T., and Stone, M. PointRight: experience with flexible input redirection in interactive workspaces. Proc. UIST '02. ACM (2002), 227--234.  ",
      "doi": "10.1145/571985.572019"
    },
    {
      "text": "Kangas, E., and Kinnunen, T. Applying user-centered design to mobile application development. Commun. ACM 48, 7 (2005), 55--59.  ",
      "doi": "10.1145/1070838.1070866"
    },
    {
      "text": "Klemmer, S. R., Li, J., Lin, J., and Landay, J. A. Papier-mâché: toolkit support for tangible input. Proc. CHI '04. ACM Press (New York, NY, USA, 2004), 399--406.  ",
      "doi": "10.1145/985692.985743"
    },
    {
      "text": "Lee, J. C., Avrahami, D., Hudson, S. E., Forlizzi, J., Dietz, P. H., and Leigh, D. The Calder toolkit: wired and wireless components for rapidly prototyping interactive devices. DIS '04: Proceedings of the 2004 Conference on designing interactive systems. ACM Press (New York, NY, USA, 2004), 167--75.  ",
      "doi": "10.1145/1013115.1013139"
    },
    {
      "text": "Li, Y., Hong, J. I., and Landay, J. A. Topiary: a tool for prototyping location--enhanced applications. Proc. UIST '04. ACM Press (New York, NY, USA, 2004), 217--226.  ",
      "doi": "10.1145/1029632.1029671"
    },
    {
      "text": "Liu, L., and Khooshabeh, P. Paper or interactive?: a study of prototyping techniques for ubiquitous computing environments. Proc. CHI '03. ACM Press (New York, NY, USA, 2003), 1030--1031.  ",
      "doi": "10.1145/765891.766132"
    },
    {
      "text": "Myers, B., Hudson, S. E., and Pausch, R. Past, present, and future of user interface software tools. ACM Trans. Comput.-Hum. Interact. 7, 1 (2000), 3--28.  ",
      "doi": "10.1145/344949.344959"
    },
    {
      "text": "Nielsen, J. Iterative user--interface design. Computer 26, 11 (1993), 32--41.  ",
      "doi": "10.1109/2.241424"
    },
    {
      "text": "Patel, S. N., Kientz, J. A., Hayes, G. R., Bhat, S., and Abowd, G. D. Farther than you may think: An empirical investigation of the proximity of users to their mobile phones. Proc. Ubicomp '06. Springer (2006), 123--140.  ",
      "doi": "10.1007/11853565_8"
    },
    {
      "text": "Reiners, R. The Patch Panel GUI: A Graphical Development Environment For Rapid Prototyping Interfaces For Ubicomp Environments. Master's thesis, RWTH Aachen University, Aachen, Germany, 2006.",
      "doi": ""
    },
    {
      "text": "Schmidt, A., Aidoo, K. A., Takaluoma, A., Tuomela, U., Laerhoven, K. V., and de Velde, W. V. Advanced interaction in context. HUC '99: Proceedings of the 1st international Symposium on Handheld and Ubiquitous Computing. Springer-Verlag (London, UK, 1999), 89--101. ",
      "doi": "10.5555/647985.743849"
    },
    {
      "text": "Villar, N., Gilleade, K., Raymundy-Ellis, D., and Gellersen., H. The VoodooIO gaming kit: a real-time adaptable gaming controller. ACE '06: Advances in Computer Entertainment. ACM Press (New York, NY, USA, 2006).  ",
      "doi": "10.1145/1178823.1178825"
    },
    {
      "text": "Wigdor, D., and Balakrishnan, R. TiltText: using tilt for text input to mobile phones. Proc. UIST '03. ACM Press (New York, NY, USA, 2003), 81--90.  ",
      "doi": "10.1145/964696.964705"
    }
  ]
}