{
  "doi": "10.1145/1240624.1240804",
  "title": "Museum guide robot based on sociological interaction analysis",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1191-1194",
  "year": 2007,
  "badges": [],
  "abstract": "We are currently working on a museum guide robot with an emphasis on \"friendly\" human-robot interaction displayed through nonverbal behaviors. In this paper, we focus on head gestures during explanations of exhibits. The outline of our research is as follows. We first examined human head gestures through an experimental, sociological approach. From this research, we have discovered how human guides coordinate their head movement along with their talk when explaining exhibits. Second, we developed a robot system based on these findings. Third, we evaluated human-robot interaction, again using an experimental, sociological approach, and then modified the robot based on the results. Our experimental results suggest that robot head turning may lead to heightened engagement of museum visitors with the robot. Based on our preliminary findings, we will describe a museum guide robot that first works autonomously and, if necessary, can turn into remote-control mode operated by a human to engage in more complex interaction with visitors.",
  "authors": [
    {
      "name": "Yoshinori Kuno",
      "institution": "Saitama University, Saitama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100082332",
      "orcid": "missing"
    },
    {
      "name": "Kazuhisa Sadazuka",
      "institution": "Saitama University, Saitama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328490317",
      "orcid": "missing"
    },
    {
      "name": "Michie Kawashima",
      "institution": "Saitama University, Saitama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488988",
      "orcid": "missing"
    },
    {
      "name": "Keiichi Yamazaki",
      "institution": "Saitama University, Saitama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100620653",
      "orcid": "missing"
    },
    {
      "name": "Akiko Yamazaki",
      "institution": "Future University-Hakodate, Hakodate, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100620449",
      "orcid": "missing"
    },
    {
      "name": "Hideaki Kuzuoka",
      "institution": "University of Tsukuba, Tsukuba, Japan",
      "img": "/do/10.1145/contrib-81100072975/rel-imgonly/kuzuoka2006.jpg",
      "acmid": "81100072975",
      "orcid": "0000-0003-1252-7814"
    }
  ],
  "references": [
    {
      "text": "Bennewitz, M., Faber, F., Joho, D., Schreiber, M., and Behnke, S. Towards a humanoid museum guide robot that interacts with multiple persons. In Proc. 5th IEEE-RAS Int. Conf. on Humanoid Robots (2005), 418--423.",
      "doi": ""
    },
    {
      "text": "Breazeal, C. Emotion and sociable humanoid robots. International Journal of Human-Computer Studies, 59 (2003), 119--155.  ",
      "doi": "10.1016/S1071-5819%2803%2900018-1"
    },
    {
      "text": "Intelligent Robotics and Communication Laboratories, http://www.irc.atr.jp/index.html.",
      "doi": ""
    },
    {
      "text": "Kuno, Y., Hiroyuki, S, Tsubota, T, Moriyama, S, Yamazaki, K., and Yamazaki, A. Museum guide robot with communicative head motion. In Proc. RO-MAN 06, (2006), 33--38.",
      "doi": ""
    },
    {
      "text": "Kuzuoka, H., Yamazaki, K., Yamazaki, A., Kosaka, J., Suga, Y., Heath, C. Dual ecologies of robot as communication media: thoughts on coordinating orientations and projectability. In Proc. CHI 2004 (2004), 183--190.  ",
      "doi": "10.1145/985692.985716"
    },
    {
      "text": "Miyauchi, D., Nakamura, A., and Kuno, Y. Bi-directional eye contact for human-robot communication. IEICE Trans. Inf. &. Syst. E88--D (2005), 2509--2516.  ",
      "doi": "10.1093/ietisy/e88-d.11.2509"
    },
    {
      "text": "Nourbakhsh, I., Kunz, C., and Willeke, T. The Mobot museum robot installations: a five year experiment. In Proc. IROS 2003 (2003), 3636--3641.",
      "doi": ""
    },
    {
      "text": "Sacks, H., Schegloff, E., and Jefferson, G. A simplest systematics for the organization of turn-taking in conversation, Language, 50 (1974), 696--735.",
      "doi": ""
    },
    {
      "text": "Shiomi, M., Kanda, T., Ishiguro, H., and Hagita, N. Interactive humanoid robots for a science museum. In Proc. HRI 2006 (2006), 305--312.  ",
      "doi": "10.1145/1121241.1121293"
    },
    {
      "text": "Sidner, C.L., Lee, C., Kidd, C.D., and Rich, C. Explorations in engagement for humans and robots. Artificial Intelligence, 166 (2005), 140--164.  ",
      "doi": "10.5555/1090725.1644610"
    }
  ]
}