{
  "doi": "10.1145/1240624.1240626",
  "title": "A meta-analysis of the impact of the inclusion and realism of human-like faces on user experiences in interfaces",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2007,
  "badges": [],
  "abstract": "The use of embodied agents, defined as visual human-like representations accompanying a computer interface, is becoming prevalent in applications ranging from educational software to advertisements. In the current work, we assimilate previous empirical studies which compare interfaces with visually embodied agents to interfaces without agents, both using an informal, descriptive technique based on experimental results (46 studies) as well as a formal statistical meta-analysis (25 studies). Results revealed significantly larger effect sizes when analyzing subjective responses (i.e., questionnaire ratings, interviews) than when analyzing behavioral responses such as task performance and memory. Furthermore, the effects of adding an agent to an interface are larger than the effects of animating an agent to behave more realistically. However, the overall effect sizes were quite small (e.g., across studies, adding a face to an interface only explains approximately 2.5% of the variance in results). We discuss the implications for both designers building interfaces as well as social scientists designing experiments to evaluate those interfaces.",
  "authors": [
    {
      "name": "Nick Yee",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319504922",
      "orcid": "missing"
    },
    {
      "name": "Jeremy N Bailenson",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100467213",
      "orcid": "missing"
    },
    {
      "name": "Kathryn Rickertsen",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328490249",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bailenson, J., Blasovich, J., Beall, A., and Loomis, J., Equilibrium Theory Revisited: Mutual Gaze and Personal Space in Virtual Environments. Presence, 2001. 10(6): p. 583--598.  ",
      "doi": "10.1162/105474601753272844"
    },
    {
      "text": "Bailenson, J., Beall, A., and Blasovich, J., Gaze and Task Performance in Shared Virtual Environments. The Journal of Visualization and Computer Animation, 2002. 13: p. 313--320.",
      "doi": ""
    },
    {
      "text": "Bailenson, J., Blasovich, J., Beall, A., and Loomis, J., Interpersonal Distance in Immersive Virtual Environments. Personality and Social Psychology Bulletin, 2003. 29: p. 1--15.",
      "doi": ""
    },
    {
      "text": "Bailenson, J., Swinth, K., Hoyt, C., Persky, S., Dimov, A., and Blascovich, J., The independent and interactive effects of embodied agent appearance and behavior on self--report, cognitive, and behavioral markers of copresence in Immersive Virtual Environments. Presence: Teleoperators and Virtual Environments, 2005. 14(379--393).  ",
      "doi": "10.1162/105474605774785235"
    },
    {
      "text": "Bailenson, J. and Yee, N., A Longitudinal Study of Task Performance, Head Movements, Subjective Report, Simulator Sickness, and Transformed Social Interaction in Collaborative Virtual Environments. Presence: Teleoperators and Virtual Environments, 2006. 15.  ",
      "doi": "10.1162/pres.15.6.699"
    },
    {
      "text": "Bartneck, C., How Convincing is Mr. Data's Smile: Affective Expressions of Machines. User Modeling and User--Adapted Interaction, 2001. 11: p. 279--295.  ",
      "doi": "10.1023/A%3A1011811315582"
    },
    {
      "text": "Bente, G., Kramer, N., Petersen, A., and Ruiter, J., Computer Animated Movement and Person Perception: Methodological Advances in Nonverbal Behavior Research. Journal of Nonverbal Behavior, 2001. 25(3): p. 151--166.",
      "doi": ""
    },
    {
      "text": "Beun, R-J., de Vos, E., and Witterman, C., Embodied conversational agents: Effects on memory performance and anthropomorphisation, in IVA 2003, Lecture Notes in Computer Science 2792, T. Rist, Editor. 2003. p. 315--319.",
      "doi": ""
    },
    {
      "text": "Blascovich, J., Loomis, J., Beall, A., Swinth, K., Hoyt, C., and Bailenson, J., Immersive virtual environment technology as a methodological tool for social psychology. Psychological Inquiry, 2002. 13: p. 103--124.",
      "doi": ""
    },
    {
      "text": "Bonito, J., Burgoon, J., and Bengtsson, B. The Role of Expectations in Human--Computer Interaction. in GROUP '99: International Conference on Supporting Group Work. 1999. Phoenix, AZ.  ",
      "doi": "10.1145/320297.320324"
    },
    {
      "text": "Burgoon, J., Bengtsson, B., Bonito, J., Ramirez, A.J., and Dunbar, N. Designing Interfaces to Maximize the Quality of Collaborative Work. in Hawaii International Conference on System Sciences. 1999. Maui, Hawaii. ",
      "doi": "10.5555/874068.875957"
    },
    {
      "text": "Burgoon, J., Bonito, J., Bengtsson, B., Cederberg, C., Lundeberg, M., and Allspach, L., Interactivity in Human--Computer Interaction: A Study of Credibility, Understanding, and Influence. Computers in Human Behavior, 2000. 16: p. 553--574.",
      "doi": ""
    },
    {
      "text": "Cassell, J., Nudge Nudge Wink Wink: Elements of Face--to--Face Conversation for Embodied Conversational Agents, in Embodied Conversational Agents, J. Cassell, Editor. 2000, MIT Press: Cambridge, MA. p. 1--27. ",
      "doi": "10.5555/371552.371554"
    },
    {
      "text": "Cassell, J., Towards a Model of Technology and Literacy Development: Story Listening Systems. Journal of Applied Developmental Psychology, 2004. 25: p. 75--105.",
      "doi": ""
    },
    {
      "text": "Chan, F.Y. and Khalid, H.M., Is Talking to an Automated Teller Machine Natural and Fun? Egronomics, 2003. 46: p. 1386--1407.",
      "doi": ""
    },
    {
      "text": "Cowell, A.J., Increasing the Credibility of Anthropomorphic Computer Characters: The Effects of Manipulating Nonverbal Interaction Style and Demographic Emodiment. 2001, University of Central Florida: Orlando, Florida.",
      "doi": ""
    },
    {
      "text": "Dehn, D. and van Mulken, S., The impact of animated interface agents: a review of empirical research. International Journal of Human Computer Studies, 2000. 52: p. 1--22.  ",
      "doi": "10.1006/ijhc.1999.0325"
    },
    {
      "text": "Fabri, M., Moore, D., and Hobbs, D. Expressive Agents: Non-Verbal Communication in Collaborative Virtual Environments. in The Autonomous Agents and Multi--Agent Systems. 2002. Bologna, Italy.",
      "doi": ""
    },
    {
      "text": "Gerhard, M., Moore, D., and Hobbs, D., Close Encounters of the Virtual Kind: Agents Simulating Copresence. Applied Artifical Intelligence, 2005. 19: p. 393--412.",
      "doi": ""
    },
    {
      "text": "Guadagno, R., Blascovich, J., Bailenson, J., and McCall, C., Virtual Humans and Persuasion: The Effects of Agency and Behavioral Realism. Media Psychology, in press.",
      "doi": ""
    },
    {
      "text": "Gulz, A., Social Enrichment by Virtual Characters -- Differential Benefits. Journal of Computer Assisted Learning, 2005. 21: p. 405--418.",
      "doi": ""
    },
    {
      "text": "Hess, T.J., Fuller, M.A., and Mathew, J., Involvement and Decision--Making Performance with a Decision Aid: The Influence of Social Multimedia, Gender, and Playfulness. Journal of Management Information Systems, 2006. 22(3): p. 15--54.  ",
      "doi": "10.2753/MIS0742-1222220302"
    },
    {
      "text": "Hongpaisanwiwat, C. and Lewis, M. Attentional Effect of Animated Character. in Human--Computer Interaction -- INTERACT. 2003. Zurich, Switzerland: IOS Press.",
      "doi": ""
    },
    {
      "text": "Hook, K., Persson, P., and Sjolinder, M., Evaluating Users' Experience of a Character--Enhanced Information Space. AI Communications, 2000. 13: p. 195--212. ",
      "doi": "10.5555/1216435.1216441"
    },
    {
      "text": "Kiesler, S., Waters, K., and Sproull, L., A Prisoner's Dilemma Experiment on Cooperation with People and Human--Like Computers. Journal of Personality and Social Psychology, 1996. 70: p. 47--65.",
      "doi": ""
    },
    {
      "text": "Koda, T. and Maes, P. Agents with Faces: The Effect of Personification of Agents. in Human--Computer Interaction. 1996. London, UK.",
      "doi": ""
    },
    {
      "text": "Koda, T., User Reactions to Anthropmorphized Interfaces. IEICE Transactions on Information and Systems, 2003. E86--D: p. 1369--1377.",
      "doi": ""
    },
    {
      "text": "Kramer, N. Social Communicative Effects of a Virtual Program Guide. in Intelligent Virtual Agents. 2005. Kos, Greece: Springer-Verlag Berlin Heidelberg.",
      "doi": "10.1007/11550617_37"
    },
    {
      "text": "Lee, E. and Nass, C., Experimental Tests of Normative Group Influence and Representation Effects in Computer-Mediated Communication: When Interacting Via Computers Differs from Interacting with Computers. Human Computer Research, 2002. 28(3): p. 349--381.",
      "doi": ""
    },
    {
      "text": "Marti, S. and Schmandt, C. Physical Embodiments for Mobile Communication Agents. in UIST. 2005. Seattle, Washington.  ",
      "doi": "10.1145/1095034.1095073"
    },
    {
      "text": "McBreen, H. and Jack, M., Evaluating humanoid synthetic agents in E-retail applications. IEEE SMC Transactions, 2001. 31: p. 394--405.  ",
      "doi": "10.1109/3468.952714"
    },
    {
      "text": "McBreen, H. and Jack, M., Evaluating Humanoid Synthetic Agents in E-Retail Applications. IEEE Transactions on Systems, Man, and Cybernetics -- Part A: Stystems and Humans, 2001. 31(5): p. 394--405.  ",
      "doi": "10.1109/3468.952714"
    },
    {
      "text": "Moreno, R., Mayer, R., Spires, H., and Lester, J., The case for social agency in computer-based teaching: Do students learn more deeply when they interact with animated pedagogical agents?. Cognition and Instruction, 2001. 19: p. 177--213.",
      "doi": ""
    },
    {
      "text": "Moreno, R., Mayer, R., Spires, H., and Lester, J., The Case for Social Agency in Computer-Based Teaching: Do Students Learn More Deeply When They Interact With Animated Pedogogical Agents? Cognition and Instruction, 2001. 19(2): p. 177--213.",
      "doi": ""
    },
    {
      "text": "Mori, M., The Uncanny Valley. Energy, 1970. 7: p. 33--35.",
      "doi": ""
    },
    {
      "text": "Mosteller, F. and Bush, R., Selected quantitative techniques, in Handbook of social psychology: Vol. 1. Theory and method, G. Lindzey, Editor. 1954, Addison-Wesley: Cambridge, MA. p. 289--334.",
      "doi": ""
    },
    {
      "text": "Moundridou, M. and Virvou, M., Evaluating the Persona Effect of an Interface Agent in an Intelligent Tutoring System. Journal of Computer Assisted Learning, 2002. 18(3): p. 253--261.",
      "doi": ""
    },
    {
      "text": "Murano, P. Effectiveness of Mapping Human-Oriented Information to Feedback From a Software Interface. in 24th International Conference Information Technology Interfaces ITI 2002. Cavtat, Croatia.",
      "doi": ""
    },
    {
      "text": "Nass, C., Moon, Y., and Carney, P., Are respondents polite to computers? Social desirability and direct responses to computers. Journal of Applied Social Psychology, 1999. 29: p. 1093--1110.",
      "doi": ""
    },
    {
      "text": "Nowak, K. and Rauh, C., The influence of the avatar on online perceptions of anthropomorphism, androgyny, credibility, homophily, and attraction. Journal of Computer-Mediated Communication, 2005. 11.",
      "doi": ""
    },
    {
      "text": "Okonkwo, C. and Vassileva, J. Affective Pedagogical Agents and User Presuasion. in Universal Access in Human-Computer Interaction. 2001. New Orleans, USA.",
      "doi": ""
    },
    {
      "text": "Oulasvirta, A. and Salovaara, A., A cognitive meta-analysis of design approaches to interruptions in intelligent environments. Proceedings of CHI 2004, 2004: p. 1155--1158.  ",
      "doi": "10.1145/985921.986012"
    },
    {
      "text": "Prendinger, H., Ma, C., and Yingzi, J. Understanding the Effect of Life-Like Interface Agents Through Users' Eye Movements. in International Conference on Multimodal Interfaces. 2005. New York: ACM Press.  ",
      "doi": "10.1145/1088463.1088484"
    },
    {
      "text": "Prendinger, H., Mori, J., and Ishizuka, M., Using Human Physiology to Evaluate Subtle Expressivity of a Virtual Quizmaster in a Mathematical Game. International Journal of Human-Computer Studies, 2005. 62: p. 231--245.  ",
      "doi": "10.1016/j.ijhcs.2004.11.009"
    },
    {
      "text": "Qvarfordt, P., Jonsson, A., and Dahlback, N. The Role of Spoken Feedback in Experiencing Multimodal Interfaces as Human-like. in ICMI '03. 2003. Vancouver, British Columbia, Canada.  ",
      "doi": "10.1145/958432.958478"
    },
    {
      "text": "Rickenberg, R. and Reeves, B. The Effects of Animated Characters on Anxiety, Task Performance, and Evaluations of User Interfaces. in CHI. 2000.  ",
      "doi": "10.1145/332040.332406"
    },
    {
      "text": "Rosenthal, R., Meta-analytic procedures for social research. 1984, Beverly Hills, CA: Sage Publications.",
      "doi": ""
    },
    {
      "text": "Rosenthal, R. and DiMatteo, M., Meta-Analysis: Recent Developments in Quantitative Methods in Literature Reviews. Annual Review of Psychology, 2001. 52: p. 59--82.",
      "doi": ""
    },
    {
      "text": "Schaumburg, H., Computers as Tools or as Social Actors? -- The Users' Perspective on Anthropomorphic Agents. International Journal of Cooperative Information Systems, 2001. 10: p. 217--234.",
      "doi": ""
    },
    {
      "text": "Slater, M., How colorful was your day? Why questionnaires cannot assess presence in virtual environments. Presence: Teleoperators and Virtual Environments, 2004. 13: p. 484--493.  ",
      "doi": "10.1162/1054746041944849"
    },
    {
      "text": "Sproull, L., Subramani, R., Kiesler, S., Walker, J., and Waters, K., When the Interface Is a Face. Human-Computer Interaction, 1996. 11: p. 97--124.  ",
      "doi": "10.1207/s15327051hci1102_1"
    },
    {
      "text": "Swartout, W., Gratch, J., Hill, R., Hovy, E., Marsella, S., Rickel, J., and Traum, D., Toward Virtual Humans, in AI. 2006. ",
      "doi": "10.5555/1167629.1167639"
    },
    {
      "text": "Takeuchi, A. and Naito, T., Situated Facial Displays: Towards Social Interaction. Proceedings of CHI 1995, 1996: p. 450--455.  ",
      "doi": "10.1145/223904.223965"
    },
    {
      "text": "Tomlinson, B., Yau, M., and Baumer, E. Embodied Mobile Agents. in Fifth International Joint Conference on Autonomous Agents and Multi Agent Systems. 2006. Hakodate, Japan.  ",
      "doi": "10.1145/1160633.1160807"
    },
    {
      "text": "Van Mulken, S., Andre, E., and Muller, J. The Persona Effect: How Substantial is It? in Human-Computer Interaction. 1998. Berlin, Germany. ",
      "doi": "10.5555/646685.702784"
    },
    {
      "text": "Van Mulken, S., Andre, E., and Muller, J. An Empiricial Study on the Trustworthiness of Life-Like Interface Agents. in Human-Computer Interaction. 1999. Mahway, New Jersey: Lawrence Erlbaum Associates. ",
      "doi": "10.5555/647944.741893"
    },
    {
      "text": "van Vugt, H., Konijn, E., Hoorn, J., Keur, I., and Eliëns, A., Realism is not all! User engagement with task-related interface characters. Interacting with Computers, in press.  ",
      "doi": "10.1016/j.intcom.2006.08.005"
    },
    {
      "text": "Vertegaal, R. and Ding, Y. Explaining Effects of Eye Gaze on Mediated Group Conversations: Amount or Synchronization. in Conference on Computer Supported Cooperative Work. 2002. New Orleans: ACM Press.  ",
      "doi": "10.1145/587078.587085"
    },
    {
      "text": "Walker, J., Sproull, L., and Subramani, R., Using a Human Face in an Interface. Proceedings of CHI 1994, 1994: p. 85--91.  ",
      "doi": "10.1145/191666.191708"
    },
    {
      "text": "Walker, J., Sproull, L., and Subramani, R. Using a Human Face in an Interface. in CHI '94 \"Celebrating Interdependence\". 1994. Boston, Massachusetts USA.  ",
      "doi": "10.1145/191666.191708"
    },
    {
      "text": "Walther, J., Anderson, J., and Park, D., Inpersonal effects in computer-mediated interactions: A meta-analysis of social and antisocial communication. Communication Research, 1994. 21: p. 460--487.",
      "doi": ""
    },
    {
      "text": "Walther, J., Slovacek, C., and Tidwell, L., Is a Picture Worth a Thousand Words?allPhotographic Images in Long-Term and Short-Term Computer-Mediated Communication. Communication Research, 2001. 28: p. 105--134.",
      "doi": ""
    },
    {
      "text": "Weisband, S. and Kiesler, S., Self-disclosure on computer forms: Meta--analysis and implications. Proceedings of CHI96, 1986.  ",
      "doi": "10.1145/238386.238387"
    },
    {
      "text": "Wexelblat, A., Don't Make that Face: A Report on Anthropomorphizing an Interface. Intelligent Environments, 1998.",
      "doi": ""
    },
    {
      "text": "Xiao, J., Stasko, J., and Catrambone, R. Embodied Conversational Agents as UI Paradigm: A Framework for Evaluation. in AAMAS02 Workshop on 'Embodied Conversational Agents -- Let's Specifiy and Evaluate Them! 2002. Bologna, Italy.",
      "doi": ""
    },
    {
      "text": "Zanbaka, C., Goolkasian, P., and Hodges, L., Can a virtual cat persuade you? The role of gender and realism in speaker persuasiveness. Proceedings of CHI 2006, 2006: p. 1153--1162.  ",
      "doi": "10.1145/1124772.1124945"
    }
  ]
}