{
  "doi": "10.1145/1240624.1240828",
  "title": "Tracking the interaction of users with AJAX applications for usability testing",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1347-1350",
  "year": 2007,
  "badges": [],
  "abstract": "In this paper, we introduce an implementation for detailed monitoring of user actions on web pages. It addresses the problem that the log data recorded by standard web servers is not sufficient for the tracking of users on AJAX websites, e.g. to conduct a usability test. Using standard web technologies, our HTTP proxy can record very detailed usage information, such as mouse movements, clicks, key presses and scrolling, together with the exact HTML DOM tree objects involved. As we show in several case studies, the tracking also works across multiple websites, none of which needs to be under our control. This approach is much less invasive than previous efforts: The test person does not need to install software on her computer, and in certain operation modes, no configuration changes at all are required on her computer. Our research indicates that if the technology described in this paper is employed, arbitrary visitors of a website are more likely to take part in a usability test offered by that site -- this facilitates recruiting test participants over the Internet.",
  "tags": [
    "UsaProxy",
    "mouse tracking",
    "AJAX application interaction logging",
    "HTTP proxy",
    "RIA",
    "website usability evaluation"
  ],
  "authors": [
    {
      "name": "Richard Atterer",
      "institution": "University of Munich, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314481260",
      "orcid": "missing"
    },
    {
      "name": "Albrecht Schmidt",
      "institution": "University of Bonn, Bonn, Germany",
      "img": "/do/10.1145/contrib-81100588072/rel-imgonly/albrecht.jpg",
      "acmid": "81100588072",
      "orcid": "0000-0003-3890-1990"
    }
  ],
  "references": [
    {
      "text": "V. Anupam, J. Freire, B. Kumar, D. Lieuwen: Automating Web Navigation with the WebVCR. In Proceedings of the 9th International World Wide Web Conference WWW9, Amsterdam, Netherlands, 2000. ",
      "doi": "10.5555/347319.346340"
    },
    {
      "text": "E. Arroyo, T. Selker, W. Wei: Usability Tool for Analysis of Web Designs Using Mouse Tracks. In CHI 2004 Work-in-Progress: Conference on Human Factors in Computing Systems, Montréal, Québec, Canada, 2006.  ",
      "doi": "10.1145/1125451.1125557"
    },
    {
      "text": "R. Atterer, M. Wnuk, A. Schmidt: Knowing the User's Every Move -- User Activity Tracking for Website Usability Evaluation and Implicit Interaction. In Proceedings of the 15th International World Wide Web Conference (WWW2006), Edinburgh, Scotland, 2006.  ",
      "doi": "10.1145/1135777.1135811"
    },
    {
      "text": "J. I. Hong, J. Heer, S. Waterson, J. A. Landay: WebQuilt: A Proxy-based Approach to Remote Web Usability Testing. In ACM Transactions on Information Systems (TOIS), Volume 19, Issue 3 (July 2001), p. 263--285.  ",
      "doi": "10.1145/502115.502118"
    },
    {
      "text": "F. Mueller, A. Lockerd: Cheese: Tracking Mouse Movement Activity on Websites, a Tool for User Modeling. In CHI 2001 Extended Abstracts: Proceedings of the Conference on Human Factors in Computing Systems, Seattle, Washington, USA, 2001.  ",
      "doi": "10.1145/634067.634233"
    },
    {
      "text": "H. Obendorf, H. Weinreich, T. Haé: Automatic Support for Web User Studies with SCONE and TEA. In CHI 2004: Conference on Human Factors in Computing Systems, Vienna, Austria, 2004.  ",
      "doi": "10.1145/985921.986007"
    },
    {
      "text": "R. W. Reeder, P. Pirolli, S. K. Card: WebEyeMapper and WebLogger: Tools for Analyzing Eye Tracking Data Collected in Web-use Studies. In CHI 2001 Extended Abstracts: Conference on Human Factors in Computing Systems, Seattle, Washington, USA, April 2001.  ",
      "doi": "10.1145/634067.634082"
    },
    {
      "text": "P. Tarasewich, S. Fillion: Discount Eye Tracking: The Enhanced Restricted Focus Viewer. In Proceedings of the Americas Conference on Information Systems AMCIS 2004, New York, NY, USA, August 2004.",
      "doi": ""
    }
  ]
}