{
  "doi": "10.1145/1240624.1240791",
  "title": "Localized iterative design for language learning in underdeveloped regions: the PACE framework",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1097-1106",
  "year": 2007,
  "badges": [],
  "abstract": "Poor literacy remains a decisive barrier to the economic empowerment of many people in the developing world. Of particular importance is literacy in a widely spoken \"world language\" such as English, which is typically a second language for these speakers. For complex reasons, schools are often not effective as vehicles for second language learning. In this paper we explore game-like language learning on cell phones. We argue that phones are an excellent technology platform in the typical ecologies of developing countries. We present the PACE framework that is intended to support the rapid, scalable development of language learning software localized for a particular community of learners. These learners are usually skeptical of formal education and of cultural biases they encounter in learning \"remote\" languages in particular. Localization of content is crucial to make the language relevant to them and to encourage them to adopt it.",
  "authors": [
    {
      "name": "Matthew Kam",
      "institution": "University of California: Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100222950",
      "orcid": "missing"
    },
    {
      "name": "Divya Ramachandran",
      "institution": "University of California: Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100153501",
      "orcid": "missing"
    },
    {
      "name": "Varun Devanathan",
      "institution": "University of California: Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488221",
      "orcid": "missing"
    },
    {
      "name": "Anuj Tewari",
      "institution": "Dhirubhai Ambani Institute of Information and Communication Technology, Gandhinagar, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328490418",
      "orcid": "missing"
    },
    {
      "name": "John Canny",
      "institution": "University of California: Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100415489",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexander, C. A Pattern Language: Towns, Buildings, Constructions. Oxford University Press, 1977.",
      "doi": ""
    },
    {
      "text": "Arora, P. Karaoke for Social and Cultural Change. ICES Volume 4: Issue 3: Paper 1. Troubador Publishing Ltd.",
      "doi": ""
    },
    {
      "text": "Azim Premji Foundation. The Social Context of Elementary Education in Rural India, 2004.",
      "doi": ""
    },
    {
      "text": "Banerjee, A., Cole, S., Duflo, E., and Lindon, L. Remedying Education: Evidence from Two Randomized Experiments in India. NBER Working Paper No. 11904, December 2005.",
      "doi": ""
    },
    {
      "text": "Bialystok, E., and Hakuta, K. In Other Words: The Science and Psychology of Second-Language Acquisition. Basic Books, 1994.",
      "doi": ""
    },
    {
      "text": "Björk, S., and Holopainen, J. Patterns in Game Design. Charles River Media, 2005.",
      "doi": ""
    },
    {
      "text": "Bruner, J. Child's Talk: Learning to Use Language. W.W. Norton and Company, New York, USA, 1983.",
      "doi": ""
    },
    {
      "text": "Clegg, J., Ogange, B., and Rodseth, V. Evaluating Digital Learning Material for English Language Development in African Primary Classrooms. IMFUNDO KnowledgeBank Paper, April 2003.",
      "doi": ""
    },
    {
      "text": "Dias, M.B., Mills-Tettey, G.A., and Mertz, J. The TechBridgeWorld Initiative: Broadening Perspectives in Computing Technology Education and Research. In Proc. of the international symposium on Women and ICT: Creating Global Transformation, ACM Press (2005).  ",
      "doi": "10.1145/1117417.1117434"
    },
    {
      "text": "Faust, D., and Nagar, R. Politics of Development in Postcolonial India: English-Medium Education and Social Fracturing. Economic and Political Weekly, India, July 28, 2001.",
      "doi": ""
    },
    {
      "text": "Gamma, E., Helm, R., Johnson, R., and Vlissides, J. Design Patterns: Elements of Reusable Object-Oriented Software. Addison-Wesley Professional, 1995. ",
      "doi": "10.5555/186897"
    },
    {
      "text": "Hallford, N., and Hallford, J. Swords & Circuitry: A Designer's Guide to Computer Role-Playing Games. Prima Publishing, Roseville, CA, USA, 2001. ",
      "doi": "10.5555/558350"
    },
    {
      "text": "Kam, M., Ramachandran, D., Sahni, U., and Canny, J. Designing Educational Technology for Developing Regions: Some Preliminary Hypotheses. IEEE 3rd International Workshop on Technology for Education in Developing Countries. In Proc. IEEE International Conference on Advanced Learning Technologies, 2005.  ",
      "doi": "10.1109/ICALT.2005.109"
    },
    {
      "text": "Kam, M., Ramachandran, D., Raghavan, A., Chiu, J., Sahni, U., and Canny, J. Practical Considerations for Participatory Design with Rural School Children in Underdeveloped Regions: Early Reflections from the Field. In Proc. IDC 2006, ACM Press, NY, USA.  ",
      "doi": "10.1145/1139073.1139085"
    },
    {
      "text": "Kishwar, M.P. Deprivations's Real Language., 2005. http://www.indianexpress.com/printerFriendly/12662.html#.",
      "doi": ""
    },
    {
      "text": "Kothari, B., and Takeda, J. Same Language Subtitling for Literacy: Small Change for Colossal Gains. Bhatnagar, S.C., and Schware, R. (Eds.), Information and Communication Technology in Development, Sage Publications, New Delhi, India, 2000, 176--186.",
      "doi": ""
    },
    {
      "text": "Krashen, S.D., and Terrell, T.D. The Natural Approach: Language Acquisition in the Classroom. Alemany Press, 1983.",
      "doi": ""
    },
    {
      "text": "Krashen, S.D. Explorations in Language Acquisition and Use. Heinnmann, Portsmouth, NH, USA, 2003.",
      "doi": ""
    },
    {
      "text": "Larsen-Freeman, D. Techniques and Principles in Language Teaching, 2nd Edition. Oxford University Press, 2000.",
      "doi": ""
    },
    {
      "text": "Liberating Voices! Pattern Language Project. http://trout.cpsr.org/program/sphere/patterns/.",
      "doi": ""
    },
    {
      "text": "Linn, M.C., and Eylon, B. Science Education: Integrating Views of Learning and Instruction. Alexander, P.A., and Winne, P.H. (Eds.), Handbook of Educational Psychology, 2nd Edition, Lawrence Erlbaum Associates, 2006.",
      "doi": ""
    },
    {
      "text": "Malone, T.W. What Makes Things Fun to Learn?: Heuristics for Designing Instructional Computer Games. In Proc. SIGSMALL '80, ACM Press, NY, USA, 162--169.  ",
      "doi": "10.1145/800088.802839"
    },
    {
      "text": "Marcus, A., and Gould, E. Cultural Dimensions and Global Web User-Interface Design: What? So What? Now What? In Proc. 6th Conference on Human Factors and the Web, 2000.  ",
      "doi": "10.1145/633292.633468"
    },
    {
      "text": "Medhi, I., Sagar, A., Toyama, K. Multiple Mice for Computers in Education in Developing Countries. In Proc. of 2006 International Conference on Information and Communication Technologies and Development.",
      "doi": ""
    },
    {
      "text": "Norman, D. The Design of Everyday Things. Currency, 1990.",
      "doi": ""
    },
    {
      "text": "Parikh, T.S., Ghosh, K., Chavan, A., Sayal, P., and Arora, S. Design Studies for a Financial Management System for Micro-Credit Groups in Rural India. In Proc. ACM Conference on Universal Usability, 2003.  ",
      "doi": "10.1145/957205.957209"
    },
    {
      "text": "Parikh, T.S, Javid, P., Sasikumar, K., Ghosh, K., Toyama, K. Mobile Phones and Paper Documents; Evaluating a New Approach for Capturing Microfinance Data in Rural India. In Proc. CHI 2006, ACM Press, 2006, 551--560.  ",
      "doi": "10.1145/1124772.1124857"
    },
    {
      "text": "Pawar, U., Pal, J., Toyama, K. Text-Free User Interfaces for Illiterate and Semi-Literate Users. In Proc. of 2006 International Conference on Information and Communication Technologies and Development.",
      "doi": ""
    },
    {
      "text": "Pedagogical Patterns. www.pedagogicalpatterns.org.",
      "doi": ""
    },
    {
      "text": "Plauche, M., Wooters, C., Ramachandran, D., Pal, J., Nallasamy, U. Speech Recognition for Illiterate Access to Information and Technology. In Proc. of 2006 International Conference on Information and Communication Technologies and Development.",
      "doi": ""
    },
    {
      "text": "Roschelle, J., and Jackiw, N. Technology Design as Educational Research: Interweaving Imagination, Inquiry, and Impact. In Kelly, A. and Lesh, R. (Eds.) Research Design in Mathematics & Science Education. Kleuwer, 1999.",
      "doi": ""
    },
    {
      "text": "Scribner, S., and Cole, M. The Psychology of Literacy. Harvard University Press, 1981.",
      "doi": ""
    },
    {
      "text": "Shukla, S. From Pre-colonial to Post-Colonial: Educational Transitions in Southern Asia. Economic Political Weekly, 1996. 31(22), 1344--49.",
      "doi": ""
    },
    {
      "text": "Smith, A., Dunckley, L., French, T., Minocha, S., and Chang, Yu. A Process Model for Developing Usable Cross-Cultural Websites. In Interacting with Computers 16, 2004, 63--91.",
      "doi": ""
    },
    {
      "text": "Snowling, M.J., and Hulme, C. (Eds.) The Science of Reading: A Handbook. Blackwell Publishers, 2005.",
      "doi": ""
    },
    {
      "text": "Van Duyne, D.K., Landay, J., and Hong, J. The Design of Sites: Principles, Processes and Patterns for Crafting a Customer-Centered Web Experience. Addison-Wesley, 2002. ",
      "doi": "10.5555/548998"
    },
    {
      "text": "Vodafone Policy Paper Series. Moving the Debate Forward. Number 2, March 2005.",
      "doi": ""
    },
    {
      "text": "Wiley, D.A. Connecting Learning Objects to Instructional Design Theory: A Definition, A Metaphor, and a Taxonomy. In D.A. Wiley (Ed.), The Instructional Use of Learning Objects, Association for Instructional Technology and Association for Educational Communications and Technology, 2002.",
      "doi": ""
    },
    {
      "text": "Yeo, A. W. Global-Software Development Lifecycle: An Exploratory Study. In Proc. CHI 2001, ACM Press, 2001.  ",
      "doi": "10.1145/365024.365060"
    }
  ]
}