{
  "doi": "10.1145/1240624.1240755",
  "title": "Effects of audio and visual surrogates for making sense of digital video",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "867-876",
  "year": 2007,
  "badges": [],
  "abstract": "Video surrogates are meant to help people quickly make sense of the content of a video before downloading or seeking more detailed information. In this paper we present the results of a study comparing the effectiveness of three different surrogates for objects in digital video libraries. Thirty-six people participated in a within subjects user study in which they did five tasks for each of three surrogate alternatives: visual alone (a storyboard), audio alone (spoken description), and combined visual and audio (a storyboard augmented with spoken description). The results show that combined surrogates are more effective, strongly preferred, and do not penalize efficiency. The results also demonstrate that spoken descriptions alone lead to better understanding of the video segments than do visual storyboards alone, although people like to have visual surrogates and use them to confirm interpretations and add context. Participants were able to easily use the combined surrogates even though they were not synchronized, suggesting that synchronization of different media channels may not be necessary in surrogates as it is in full video. The results suggest that multimodal surrogates should be incorporated into video retrieval user interfaces and audio surrogates should be used in small display interfaces. The study also raises questions about the need to synchronize different information channels in multimedia surrogates.",
  "authors": [
    {
      "name": "Yaxiao Song",
      "institution": "University of North Carolina at Chapel Hill, Chapel Hill, NC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328490763",
      "orcid": "missing"
    },
    {
      "name": "Gary Marchionini",
      "institution": "University of North Carolina at Chapel Hill, Chapel Hill, NC",
      "img": "/do/10.1145/contrib-81100052406/rel-imgonly/icadl01bwcropped.jpg",
      "acmid": "81100052406",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Christel, M et al. Collages as Dynamic Summaries for News Video. Proc. Multimedia '02, ACM (2002), 561--69.  ",
      "doi": "10.1145/641007.641120"
    },
    {
      "text": "Christel, M. Smith, C.R. Taylor, and D. Winkler, Evolving Video Skims into Useful Multimedia Abstractions. In Proc. CHI '98, ACM (1998), 171--178.  ",
      "doi": "10.1145/274644.274670"
    },
    {
      "text": "Christel, M. and Warmack, A. The Effect of Text in Storyboards for Video Navigation. In Proc. IEEE Int'l Conf. Acoustics, Speech and Signal Processing (2001), 1409--1412.  ",
      "doi": "10.1109/ICASSP.2001.941193"
    },
    {
      "text": "Davis, F. D. (1989). Perceived usefulness, perceived ease of use, and user acceptance of information technology. MIS Quarterly, 13(3), 319--340.",
      "doi": "10.2307/249008"
    },
    {
      "text": "Ding W., Marchionini G., & Soergel, D. Multimodal Surrogates for Video Browsing. In Proc. the Fourth ACM Conference on Digital Libraries (1999), 85--93.  ",
      "doi": "10.1145/313238.313266"
    },
    {
      "text": "Fluhr, C., Moellic, P., & Hede, P. (in press). Usage-oriented multimedia information retrieval technological evaluation. Multimedia Information Retrieval Workshop. ACM Press (2006).  ",
      "doi": "10.1145/1178677.1178719"
    },
    {
      "text": "Ghani, J. A., Supnick, R., & Rooney, P. (1991). The experience of flow in computer-mediated and in face-to-face groups. Proceedings of the Twelfth International Conference on Information Systems (December 16--18, 1991, New York), 229--237. ",
      "doi": "10.5555/126686.150736"
    },
    {
      "text": "Goodrum, A. (1997). Evaluation of Text-Based and Image-Based Representations for Moving Image Documents. Unpublished doctoral dissertation, University of North Texas.",
      "doi": ""
    },
    {
      "text": "Gunther, R., Kazman, R, and MaccGregor, C. (2004) Using 3D sound as a navigational aid in virtual environments. Behaviour and Information Technology. 23(6), 435--446.",
      "doi": ""
    },
    {
      "text": "Li, F., Gupta, A., Sanocki, E., He, L., Rui, Y (2000). Browsing Digital Video. Proc. CHI 2000, ACM Press (2000), 169--176.  ",
      "doi": "10.1145/332040.332425"
    },
    {
      "text": "Li, Y., Dorai, C. and Farrell, R. Creating MAGIC: System for generating learning object metadata for instructional content. In Prof. ACM Multimedia (2005), 367--370.  ",
      "doi": "10.1145/1101149.1101227"
    },
    {
      "text": "Marchionini, G., Wildemuth, B., & Geisler, G. (2006). The Open Video Digital Library: A Mobius strip of theory and practice. Journal of the American Society for Information Science and Technology. 57(2), 1629--43.  ",
      "doi": "10.5555/1165013.1165017"
    },
    {
      "text": "Mayer, R. (2003). Elements of a science of E-learning. Journal of Educational Computing Research, 29(3), 297--313.",
      "doi": ""
    },
    {
      "text": "Mayer, R., & Moreno, R. (1998). A split-attention effect in multimedia learning: Evidence for dual processing systems in working memory. Journal of Educational Psychology, 90(2), 312--320.",
      "doi": ""
    },
    {
      "text": "O'Conner, B. (1985). Access to moving image documents: Background concepts and proposals for surrogates for film and video works. Journal of Documentation, 41(4), 209--220.",
      "doi": ""
    },
    {
      "text": "Over, P., Kraaij, W., & Smeaton, A. (2005). TRECVID 2005: An introduction. Proc. TRECVID 2005 (Gaithersburg, MD), 1--14. http://www.cdvp.dcu.ie/Papers/TRECVid2005_Overview.pdf.",
      "doi": ""
    },
    {
      "text": "Pavio, A. (1986). Mental representations: A dual coding approach. Oxford: Oxford U. Press.",
      "doi": ""
    },
    {
      "text": "Russell, D., Stefik, M., Pirolli, P., & Card. S. (1993). The cost structure of sensemaking. Proc. the SIGCHI Conference on Human Factors in Computing Systems. ACM Press, 269--276.  ",
      "doi": "10.1145/169059.169209"
    },
    {
      "text": "Turner, J. (1994). Determining the subject content of still and moving image documents for storage and retrieval: An experimental investigation. Unpublished doctoral dissertation, University of Toronto.",
      "doi": ""
    },
    {
      "text": "Wildemuth, B., Marchionini, G., Wilkens, T., Yang, M., Geisler, G., Fowler, B., Hughes, A., & Mu, X (2002). Alternative Surrogates for Video Objects in a Digital Library: Users Perspectives on Their Relative Usability. In Proc. the 6th European Conference on Digital Libraries (2002), 493--507. ",
      "doi": "10.5555/646635.700074"
    },
    {
      "text": "Wildemuth, B., Marchionini, G., Yang. M., Geisler, G., Wilkens, T., Hughes, A., & Gruss, R. (2003). How fast is too fast? Evaluating fast forward surrogates for digital video. Proc. JCDL (2003), 221--230. ",
      "doi": "10.5555/827140.827176"
    },
    {
      "text": "Yang, M. & Marchionini, G. (2005). Deciphering visual gist and its implications for video retrieval and interface design. Conference on Human Factors in Computing Systems: CHI '05 extended abstracts on Human factors in computing systems. NY: ACM Press, 1877--1880.  ",
      "doi": "10.1145/1056808.1057045"
    }
  ]
}