{
  "doi": "10.1145/1240624.1240827",
  "title": "Context & usability testing: user-modeled information presentation in easy and difficult driving conditions",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1343-1346",
  "year": 2007,
  "badges": [],
  "abstract": "A 2x2 enhanced Wizard-of-Oz experiment (N = 32) was conducted to compare two different approaches to presenting information to drivers in easy and difficult driving conditions. Data of driving safety, evaluation of the spoken dialogue system, and perception of self were analyzed. Results show that the user-modeled summarize-and-refine (UMSR) approach led to more efficient information retrieval than did the summarize-and-refine (SR) approach. However, depending on driving condition, higher efficiency did not always translate into pleasant subjective experience. Implications for usability testing and interface design were presented, followed by discussions of future research directions.",
  "authors": [
    {
      "name": "Jiang Hu",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100255358",
      "orcid": "missing"
    },
    {
      "name": "Andi Winterboer",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328491101",
      "orcid": "missing"
    },
    {
      "name": "Clifford I. Nass",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100153283",
      "orcid": "missing"
    },
    {
      "name": "Johanna D. Moore",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100045785",
      "orcid": "missing"
    },
    {
      "name": "Rebecca Illowsky",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488805",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Chung, G. Developing a flexible spoken dialog system using simulation. In Proc. of ACL 2004, ACL (2004), 63--70.  ",
      "doi": "10.3115/1218955.1218964"
    },
    {
      "text": "Demberg, V., and Moore, J.D. Information presentation in spoken dialogue systems. In Proc. of EACL 2006, ACL (2006), 65--72.",
      "doi": ""
    },
    {
      "text": "Moore, J.D., Foster, M.E., Lemon, O., and White, M. Generating tailored, comparative descriptions in spoken dialogue. In Proc. of the 17th International Florida Artificial Intelligence Research Society Conference, AAAI Press (2004), 917--922.",
      "doi": ""
    },
    {
      "text": "Polifroni, J., Chung, G., and Seneff, S. Towards automatic generation of mixed-initiative dialogue systems from web content. In Proc. of Eurospeech '03, 193--196.",
      "doi": ""
    },
    {
      "text": "Salvucci, D.D. Predicting the effects of in-car interface use on driver performance: an integrated model approach. Int. J. Human-Computer Studies, 55, 85--107.",
      "doi": "10.1006/ijhc.2001.0472"
    },
    {
      "text": "Walker, M.A., Whittaker, S., Stent, A., Maloor, P., Moore, J.D., Johnston, M., and Vasireddy, G. Generation and evaluation of user tailored responses in dialogue. Cognitive Science, 28, 811--840.",
      "doi": ""
    }
  ]
}