{
  "doi": "10.1145/1240624.1240735",
  "title": "Back stage on the front lines: perspectives and performance in the combat information center",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "717-726",
  "year": 2007,
  "badges": [],
  "abstract": "While tactical command. control and communication environments might appear to be entirely instrumental in nature, they nevertheless provide a setting for social interaction. This paper describes how such interaction occurs in a particular naval tactical command and control system, focusing on the shared perspectives created by the organizational, administrative and professional aspects of the environment and on issues of self-presentation. It is argued that the complexity and multiplicity of interactional regions in this environment lead to problematic situations for key actors, and that these problems may have relevance to future computing environments.",
  "tags": [
    "control and communication",
    "command",
    "social worlds",
    "tactical data systems",
    "self-presentation"
  ],
  "authors": [
    {
      "name": "Paul M. Aoki",
      "institution": "Intel Research, Berkeley, CA",
      "img": "/do/10.1145/contrib-81100590142/rel-imgonly/pma-square.jpg",
      "acmid": "81100590142",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adkins, M. and Kruse, J., Network Centric Warfare in the U.S. Navy's Fifth Fleet. U.S. DoD, Washington, DC, 2003.",
      "doi": ""
    },
    {
      "text": "Andersen, P.B., \"Maritime Work and Communication,\" Australian J. Info. Sys. 8, 2 (2001), 83--102.",
      "doi": ""
    },
    {
      "text": "Bailey, D.M., Aegis Guided Missile Cruiser. MBI, Osceola, WI, 1991.",
      "doi": ""
    },
    {
      "text": "Ben-Ari, E., Mastering Soldiers: Conflict, Emotions, and the Enemy in an Israeli Military Unit. Berghahn, Oxford, 1998.",
      "doi": ""
    },
    {
      "text": "Bonini, D., \"ATC Do I Trust Thee? Referents of Trust in Air Traffic Control,\" Ext. Abstracts, CHI 2001, ACM (2001), 449--450.  ",
      "doi": "10.1145/634067.634327"
    },
    {
      "text": "Boslaugh, D.L., When Computers Went to Sea. IEEE CS Press, Los Alamitos, CA, 1999.",
      "doi": ""
    },
    {
      "text": "Clarke, A.E., \"Social Worlds/Arenas Theory as Organizational Theory,\" in Social Organization & Social Process, Aldine de Gruyter, Hawthorne, NY, 1991, 119--158.",
      "doi": ""
    },
    {
      "text": "Cohen, M.S., Freeman, J.T. and Thompson, B., \"Critical Thinking Skills in Tactical Decision Making: A Model and a Training Strategy,\" in Making Decisions Under Stress, APA, Washington, DC, 1998, 155--189.",
      "doi": ""
    },
    {
      "text": "Endsley, M.R., Bolté, B. and Jones, D.G., Designing for Situation Awareness. Taylor & Francis, London, 2003.",
      "doi": ""
    },
    {
      "text": "Fitzpatrick, G., The Locales Framework. Kluwer, Dordrecht, The Netherlands, 2003.",
      "doi": ""
    },
    {
      "text": "Fogarty, W.N., Formal Investigation into the Circumstances Surrounding the Downing of a Commercial Airliner by the USS Vincennes (CG 49) on July 3, 1988. U.S. DoD, Washington, DC, 1988.",
      "doi": ""
    },
    {
      "text": "Gabler, E., The American Telegrapher: A Social History. Rutgers Univ. Press, Piscataway, NJ, 1988.",
      "doi": ""
    },
    {
      "text": "Ginnett, R.C., First Encounters of the Close Kind: The Formation Process of Airline Flight Crews. Ph.D. dissertation, Yale Univ., New Haven, CT, 1987.",
      "doi": ""
    },
    {
      "text": "Goffman, E., The Presentation of Self in Everyday Life. Anchor, New York, 1959.",
      "doi": ""
    },
    {
      "text": "Harper, R.H.R. and Hughes, J.A., \"What a f-ing system! Send 'em all to the same place and then expect us to stop 'em hitting: Making Technology Work in Air Traffic Control,\" in Technology in Working Order, Routledge, London, 1993, 127--144.",
      "doi": ""
    },
    {
      "text": "Heath, C.C. and Luff, P.K., \"Collaboration and Control: Crisis Management and Multimedia Technology in London Underground Line Control Rooms,\" CSCW 1, 1--2 (1992), 69--94.",
      "doi": ""
    },
    {
      "text": "Homans, G.C., \"The Small Warship,\" Am. Sociol. Rev. 11, 3 (1946), 294--300.",
      "doi": ""
    },
    {
      "text": "Hutchins, E., Cognition in the Wild. MIT Press, Cambridge, MA, 1995.",
      "doi": ""
    },
    {
      "text": "Kieras, D.E. and Santoro, T.P., \"Computational GOMS Modeling of a Complex Team Task: Lessons Learned,\" Proc. CHI 2004, ACM (2004), 97--104.  ",
      "doi": "10.1145/985692.985705"
    },
    {
      "text": "Ling, R. and Yttri, B., \"Hyper-coordination via Mobile Phones in Norway,\" in Perpetual Contact, CUP, Cambridge, 2002, 139--169. ",
      "doi": "10.5555/644547.644558"
    },
    {
      "text": "Mark, G., \"Conventions and Commitments in Distributed CSCW Groups,\" CSCW 11, 3--4 (2002), 349--387.  ",
      "doi": "10.1023/A%3A1021289427473"
    },
    {
      "text": "Mark, G. and Poltrock, S., \"Groupware Adoption in a Distributed Organization: Transporting and Transforming Technology through Social Worlds,\" Info. & Org. 14, 4 (2004), 297--327.",
      "doi": ""
    },
    {
      "text": "McGee, D.R., Cohen, P.R., Wesson, R.M. and Horman, S., \"Comparing Paper and Tangible, Multimodal Tools,\" Proc. CHI 2002, ACM (2002), 407--414.  ",
      "doi": "10.1145/503376.503449"
    },
    {
      "text": "Meyrowitz, J., No Sense of Place. OUP, Oxford, 1985.",
      "doi": ""
    },
    {
      "text": "Munsey, C., \"Collision Course: Navy Relieves Carrier CO,\" Navy Times (2004).",
      "doi": ""
    },
    {
      "text": "Pakenham, W.T.T., Naval Command and Control. Brassey's, London, 1989.",
      "doi": ""
    },
    {
      "text": "Patterson, E.S., Watts-Perotti, J. and Woods, D.D., \"Voice Loops as Coordination Aids in Space Shuttle Mission Control,\" CSCW 8, 4 (1999), 353--371.  ",
      "doi": "10.1023/A%3A1008722214282"
    },
    {
      "text": "Perrow, C., Normal Accidents. Basic Books, New York, 1984.",
      "doi": ""
    },
    {
      "text": "Roberts, K.H., Stout, S.K. and Halpern, J.J., \"Decision Dynamics in Two High Reliability Military Organizations,\" Mgmt. Sci. 40, 5 (1994), 614--624.  ",
      "doi": "10.5555/2784030.2784036"
    },
    {
      "text": "Sherry, J., Mainwaring, S., Burrell, J., Beckwith, R. and Salvador, T., \"'This All Together, Hon?' Ubicomp in Non-office Work Environments,\" Proc. Ubicomp 2004, Springer (2004), 179--195.",
      "doi": ""
    },
    {
      "text": "Shibutani, T., The Derelicts of Company K: A Sociological Study of Demoralization. U.C. Press, Berkeley, CA, 1978.",
      "doi": ""
    },
    {
      "text": "Shibutani, T., \"Reference Groups as Perspectives,\" Am. J. Sociol. 60, 6 (1955), 562--569.",
      "doi": ""
    },
    {
      "text": "Snook, S.A., Friendly Fire: The Accidental Shootdown of U.S. Black Hawks Over Northern Iraq. Princeton Univ. Press, Princeton, NJ, 2000.",
      "doi": ""
    },
    {
      "text": "Weick, K.E., \"Organizational Culture as a Source of High Reliability,\" Calif. Mgmt. Rev. 29, 2 (1987), 112--127.",
      "doi": ""
    },
    {
      "text": "Wouk, H., The Caine Mutiny. Doubleday, Garden City, NY, 1951.",
      "doi": ""
    },
    {
      "text": "Zuboff, S., In the Age of the Smart Machine. Basic Books, New York, 1989.",
      "doi": ""
    }
  ]
}