{
  "doi": "10.1145/1240624.1240705",
  "title": "Sustainable interaction design: invention & disposal, renewal & reuse",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "503-512",
  "year": 2007,
  "badges": [],
  "abstract": "This paper presents the perspective that sustainability can and should be a central focus of interaction design-a perspective that is termed Sustainable Interaction Design (SID). As a starting point for a perspective of sustainability, design is defined as an act of choosing among or informing choices of future ways of being. This perspective of sustainability is presented in terms of design values, methods, and reasoning. The paper proposes (i) a rubric for understanding the material effects of particular interaction design cases in terms of forms of use, reuse, and disposal, and (ii) several principles to guide SID. The paper illustrates--with particular examples of design critique for interactive products and appeals to secondary research--how two of these principles may be applied to move the effects of designs from less preferred forms of use to more preferred ones. Finally, a vision for incorporating sustainability into the research and practice of interaction design is described.",
  "tags": [
    "sustainability",
    "sustainable interaction design",
    "interaction design",
    "design",
    "design theory"
  ],
  "authors": [
    {
      "name": "Eli Blevis",
      "institution": "Indiana University at Bloomington, Bloomington, IN",
      "img": "/do/10.1145/contrib-81100365314/rel-imgonly/20171007-self.jpg",
      "acmid": "81100365314",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexander, C. (2002). The Nature of Order. Volume II. The Center for Environmental Structure. Berkeley, CA.",
      "doi": ""
    },
    {
      "text": "Blevis, E. (2006). Advancing sustainable interaction design: two perspectives on material effects. Design Philosophy Papers. #04/2006.",
      "doi": ""
    },
    {
      "text": "Blevis, E., Lim, Y., Stolterman, E. (2006). Regarding software as a material of design. Wonderground Design Research Society Conference, Lisbon.",
      "doi": ""
    },
    {
      "text": "Blevis, E., Lim, Y., Ozakca, M., & Aneja, S. (2005). Designing interactivity for the specific context of designerly collaborations. In Ext. Abs. of CHI '05. ACM Press, New York, NY. 1216--1219.  ",
      "doi": "10.1145/1056808.1056880"
    },
    {
      "text": "Bhuie, A., Ogunseitan, O., Saphores, J., Shapiro, A. (2004). Environmental and economic trade-offs in consumer electronic products recycling: a case study of cell phones and computers. IEEE International Symposium on Electronics and the Environment, 2004. 74--79. ",
      "doi": "10.5555/1260988.1261717"
    },
    {
      "text": "Coroama, V., Kostakos, V., Magerkurth, C., de Vallejo, I. (2005). UbiSoc 2005: first international workshop on social implications of ubiquitous computing. In Ext. Abs. of CHI '05. ACM Press, New York, NY. 2111--2112.  ",
      "doi": "10.1145/1056808.1057111"
    },
    {
      "text": "Cross, N. (2001). Designerly ways of knowing: design discipline versus design science. Design Issues. MIT Press, 17(3). 49--55.",
      "doi": ""
    },
    {
      "text": "Dourish, P. (2006). Implications for design. In Proc. of CHI '06. ACM Press, New York, NY. 541--550.  ",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Fallman, D. (2003). Designing design: design-oriented human-computer interaction. In Proc. of CHI '03. ACM Press, New York, NY. 225--232.  ",
      "doi": "10.1145/642611.642652"
    },
    {
      "text": "Friedman, B., Kahn, P., and Borning, A. (2006). Value sensitive design and information systems. In P. Zhang & D. Galletta (eds.), Human-Computer Interaction and Management Information Systems: Foundations. M.E. Sharpe, New York, 348--372.",
      "doi": ""
    },
    {
      "text": "Friedman, B. (2004). Value sensitive design. Encyclopedia of human-computer interaction. Great Barrington, MA: Berkshire Publishing Group. 76--774.",
      "doi": ""
    },
    {
      "text": "Friedman, B., & Kahn, P., Jr. (2003). Human values, ethics, and design. In J. Jacko and A. Sears (Eds.), The human--computer interaction handbook. Mahwah, NJ: Lawrence Erlbaum Associates. 1177--1201. ",
      "doi": "10.5555/772072.772147"
    },
    {
      "text": "Friedman, B. (Ed.) (1997). Human Values and the Design of Computer Technology. Stanford CA: CSLI Press. ",
      "doi": "10.5555/278213"
    },
    {
      "text": "Fry, T. (2005). The Voice of sustainment: the scenario of design. Design Philosophy Papers. #01/2005.",
      "doi": ""
    },
    {
      "text": "Fry, T. (1999). A New Design Philosophy: An Introduction to Defuturing. New South Wales, Australia: NSWU Press.",
      "doi": ""
    },
    {
      "text": "Gibson, J. (1977). The theory of affordances. In R. Shaw & J. Bransford (Eds.), Perceiving, Acting, and Knowing. Hillsdale, NJ: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Graedel, T. and Allenby, B. (1995). Industrial Ecology, 2nd ed., Prentice Hall, Englewood Cliffs, N.J.",
      "doi": ""
    },
    {
      "text": "Heidegger, M. (1954). The Question concerning technology. In William Lovitt, The Question Concerning Technology and Other Essays. Harper Torchbooks, {1954} 1977. 3--35.",
      "doi": ""
    },
    {
      "text": "Jain, R. and Wullert, J. (2002). Challenges: environmental design for pervasive computing systems. In Proc. of the 8th Annual international Conference on Mobile Computing and Networking. ACM Press, New York, NY. 263--270.  ",
      "doi": "10.1145/570645.570678"
    },
    {
      "text": "Kling, R. and Star, S. L. (1998). Human centered systems in the perspective of organizational and social informatics. SIGCAS Comput. Soc. 28, 1. 22--29.  ",
      "doi": "10.1145/277351.277356"
    },
    {
      "text": "Kumar, V., Bee, D., Shirodkar, P., Tumkor, S., Bettig, B., Sutherland, J. (2005). Towards sustainable product and material flow cycles: identifying barriers to achieving product multi-use and zero waste. In Proc. of IMECE2005, 2005 ASME International Mechanical Engineering Congress and Exposition.",
      "doi": ""
    },
    {
      "text": "Kurk, F. and McNamara, C. (---). Better by Design: An Innovation Guide: Using Natural Design Solutions. Minnesota Pollution Control Agency. St. Paul, MN.",
      "doi": ""
    },
    {
      "text": "Löwgren, J. & Stolterman, E. (2004). Thoughtful Interaction Design. MIT Press. ",
      "doi": "10.5555/1050958"
    },
    {
      "text": "Mankoff, J., Fussell, S., Resnick, P., Friedman, B., Sengers, P., Borning, A., Blevis, E., Hasbrouk, J., & Woodruf, A. (2007, under review). Sustainability and interaction. (SIG). In Ext. Abs. of CHI'07. ACM Press, New York, NY.  ",
      "doi": "10.1145/1240866.1240963"
    },
    {
      "text": "Makelberge, N. (2003) Computing against the grain. Design Philosophy Papers. #04/2003.",
      "doi": ""
    },
    {
      "text": "Margolin, V., & Margolin, S. (2003). A \"Social model\" of design: issues of practice and research. Design Issues (MIT Press). 18(4). 24--30.",
      "doi": ""
    },
    {
      "text": "Margolin, V. (Ed.) (1989). Design Discourse: History, Theory, Criticism. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Muller, M.J. & Wharton, C. (1998). Toward an HCI research and practice agenda based on human needs and social responsibility. SIGCHI Bulletin. 30(2).  ",
      "doi": "10.1145/279044.279052"
    },
    {
      "text": "Nardi, B.A. & O'Day, V.L. (1999). Information Ecologies: Using Technology with Heart. MIT Press. ",
      "doi": "10.5555/299579"
    },
    {
      "text": "Nelson, H. & Stolterman, E. (2003). The Design Way--Intentional Change in an Unpredictable World. Educational Technology Publications. New Jersey. ",
      "doi": "10.5555/861852"
    },
    {
      "text": "Norman, D. (2002). Emotion and design: attractive things work better. Interactions Magazine. ix (4). 36--42.  ",
      "doi": "10.1145/543434.543435"
    },
    {
      "text": "Norman, D. (1999). Affordances, conventions, and design. Interactions. (May). 38--43.  ",
      "doi": "10.1145/301153.301168"
    },
    {
      "text": "Norman, D. (1998). The Invisible Computer: Why Good Products Can Fail, the Personal Computer Is So Complex, and Information Appliances Are the Solution. MIT Press. ",
      "doi": "10.5555/288759"
    },
    {
      "text": "Norman, D. (1990). The Design of Everyday Things. (2nd ed.). New York: Doubleday.",
      "doi": ""
    },
    {
      "text": "Papanek, V. (1985). Design for the Real World: Human Ecology and Social Change (2nd ed.). Chicago: Academy Chicago.",
      "doi": ""
    },
    {
      "text": "Preece, J., Rogers, Y., & Sharp, H. (2002). Interaction Design: Beyond Human-Computer Interaction. New York: John Wiley & Sons, Inc. ",
      "doi": "10.5555/560143"
    },
    {
      "text": "Reed, C., Wang, H., & Blevis, E. (2005). Recognizing individual needs and desires in the case of designing an inventory of humanity-centered, sustainability-directed concepts for time and travel. In Proc. of DPPI '05 Designing Pleasurable Product Interfaces. Eindhoven, NL. 181--212.",
      "doi": ""
    },
    {
      "text": "Schön, D. (1983). The Reflective Practitioner. London: Temple Smith.",
      "doi": ""
    },
    {
      "text": "Schmidt, C. (2006). Unfair trade e-waste in Africa. Environmental Health Perspectives. 114(4): A232--A235.",
      "doi": ""
    },
    {
      "text": "Simon, H. (1996). The Sciences of the Artificial (3rd ed.). MIT Press. ",
      "doi": "10.5555/237774"
    },
    {
      "text": "Stegall, N. (2006). Designing sustainability: a philosophy for ecologically intentional design. Design Issues. 22(2). 56--63.",
      "doi": ""
    },
    {
      "text": "Thackara, John. (2005). In the Bubble: Designing for a Complex World. MIT Press. ",
      "doi": "10.5555/1076352"
    },
    {
      "text": "Townsend, G. et al. (2004). RCRA toxicity characterization of computer CPUs and other discarded electronic devices. Department of Environmental Engineering Sciences, University of Florida. US EPA.",
      "doi": ""
    },
    {
      "text": "Vandewater E., Shim M., & Caplovitz A. (2004). Linking obesity and activity level with children's television and video game use. J Adolesc. Feb;27(1):71--85.",
      "doi": ""
    },
    {
      "text": "Weiser, M. (1994). The world is not a desktop. Interactions. 7--8.  ",
      "doi": "10.1145/174800.174801"
    },
    {
      "text": "Weiser, M. (1991). The computer for the twenty-first century. Scientific American. September.",
      "doi": ""
    },
    {
      "text": "Willis, A.M. (2006). Ontological designing. Design Philosophy Papers. #02/2006.",
      "doi": ""
    },
    {
      "text": "Willis, A.M. (2003). Editorial. Design Philosophy Papers. #04/2003.",
      "doi": ""
    },
    {
      "text": "Winograd, T. & Flores, F. (1986). Understanding Computers and Cognition: A New Foundation for Design. New York: Addison-Wesley, Inc. ",
      "doi": "10.5555/576359"
    },
    {
      "text": "Woolley, M. (2003). Choreographing obsolescence -- ecodesign: the pleasure/dissatisfaction cycle. In Proc. of DPPI '03 Designing Pleasurable Products and Interfaces. ACM Press, New York, NY. 77--81.  ",
      "doi": "10.1145/782896.782916"
    }
  ]
}