{
  "doi": "10.1145/1240624.1240795",
  "title": "Mobile kits and laptop trays: managing multiple devices in mobile information work",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1127-1136",
  "year": 2007,
  "badges": [],
  "abstract": "A study at a large IT company shows that mobile information workers frequently migrate work across devices (here: smartphones, desktop PCs, laptops). While having multiple devices provides new opportunities to work in the face of changing resource deprivations, the management of devices is often problematic. The most salient problems are posed by 1) the physical effort demanded by various management tasks, 2) anticipating what data or functionality will be needed, and 3) aligning these efforts with work, mobility, and social situations. Workers' strategies of coping with these problems center on two interwoven activities: the physical handling of devices and cross-device synchronization. These aim at balancing risk and effort in immediate and subsequent use. Workers also exhibit subtle ways to handle devices in situ, appropriating their physical and operational properties. The design implications are discussed.",
  "authors": [
    {
      "name": "Antti Oulasvirta",
      "institution": "Helsinki Institute for Information Technology (HIIT), Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    },
    {
      "name": "Lauri Sumari",
      "institution": "Helsinki Institute for Information Technology (HIIT), Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328490752",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bellotti, V. and Bly, S. (2002). Walking away from the desktop computer: Distributed collaboration and mobility in a product design team. Proc. CHI'02, 209--218.  ",
      "doi": "10.1145/240080.240256"
    },
    {
      "text": "Brown, B., Green, N. and Harper, R. (2002). Wireless World: Social and Interactional Implications of Wireless Technology. London: Springer-Verlag.",
      "doi": ""
    },
    {
      "text": "Chalmers, M. and Galani, A. (2004). Seamful interveawing: heterogeneity in the theory and design of interactive systems. Proc. DIS'04, 243--252.  ",
      "doi": "10.1145/1013115.1013149"
    },
    {
      "text": "Grudin, J. (2001). Partitioning digital worlds: Focal and peripheral awareness in multiple monitor use. Proc. CHI'01, 458--465.  ",
      "doi": "10.1145/365024.365312"
    },
    {
      "text": "Kaptelinin, V. (1996). Creating computer-based work environments: An empirical study of macintosh users. Proc. ACM SIGCPR/SIGMIS'96, 360--366.  ",
      "doi": "10.1145/238857.238921"
    },
    {
      "text": "Landsdale, M. (1988). The psychology of personal information management. Applied Ergonomics, 19, 1, 55--66.",
      "doi": ""
    },
    {
      "text": "Lin, M., Lutters, W.G., and Kim, T.S. (2004). Understanding the micronote lifecycle: improving mobile support for informal note taking. Proc. CHI'04, 687--694.  ",
      "doi": "10.1145/985692.985779"
    },
    {
      "text": "Luff, P. and Heath, C. (1998). Mobility in collaboration. Proc. CSCW'98, 305--314.  ",
      "doi": "10.1145/289444.289505"
    },
    {
      "text": "Mainwaring, S.D., Anderson, K., Chang, M.F. (2005). Living for the global city: Mobile kits, urban interfaces, and ubicomp. Proc. Ubicomp 2005, Springer-Verlag, 268--286.  ",
      "doi": "10.1007/11551201_16"
    },
    {
      "text": "Malone, T.W. (1983). How do people organize their desks? Implications for the design of office information systems. ACM TOIS, 1, 1, 99--112.  ",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "Nardi, B. and O'Day V. (1999). Information Ecologies: Using Technology with Heart. MIT Press. ",
      "doi": "10.5555/299579"
    },
    {
      "text": "Perry, M. and Brodie, J. (2005). Virtually connected, practically mobile. In E. Andriesson and M. Vartiainen (Eds.) Mobile Virtual Work: A New Paradigm, Berlin: Springer-Verlag, pp. 97--127.",
      "doi": ""
    },
    {
      "text": "Perry, M., O'Hara, K., Sellen, A., Harper, R., and Brown, B. (2001). Dealing with mobility: understanding access anytime, anywhere. ACM TOCHI, 8, 4, 323--347.  ",
      "doi": "10.1145/504704.504707"
    },
    {
      "text": "Tolmie, P., Pycock, J., Diggins, T., MacLean, A., and Karsenty, A. (2002). Unremarkable computing. Proc. CHI'02, 399--406.  ",
      "doi": "10.1145/503376.503448"
    },
    {
      "text": "Whittaker, S. and Hirschberg, J. (2001). The character, value, and management of personal paper archives. ACM TOCHI, 8, 2, 150--170.  ",
      "doi": "10.1145/376929.376932"
    },
    {
      "text": "Whittaker, S. and Sidner, C. (1996). Email overload: Exploring personal information management of email. Proc. CHI'96, 276--283.  ",
      "doi": "10.1145/238386.238530"
    }
  ]
}