{
  "doi": "10.1145/1240624.1240836",
  "title": "Earpod: eyes-free menu selection using touch input and reactive audio feedback",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1395-1404",
  "year": 2007,
  "badges": [],
  "abstract": "We present the design and evaluation of earPod: an eyes-free menu technique using touch input and reactive auditory feedback. Studies comparing earPod with an iPod-like visual menu technique on reasonably-sized static menus indicate that they are comparable in accuracy. In terms of efficiency (speed), earPod is initially slower, but outperforms the visual technique within 30 minutes of practice. Our results indicate that earPod is potentially a reasonable eyes-free menu technique for general use, and is a particularly exciting technique for use in mobile device interfaces.",
  "authors": [
    {
      "name": "Shengdong Zhao",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328491174",
      "orcid": "missing"
    },
    {
      "name": "Pierre Dragicevic",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502723138",
      "orcid": "0000-0002-1854-5899"
    },
    {
      "name": "Mark Chignell",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100112821/rel-imgonly/marknew.jpg",
      "acmid": "81100112821",
      "orcid": "missing"
    },
    {
      "name": "Ravin Balakrishnan",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100503904",
      "orcid": "0000-0002-3379-7680"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    }
  ],
  "references": [
    {
      "text": "KidsClick! web search for kids by librarians: http://sunsite.berkeley.edu/KidsClick!/.",
      "doi": ""
    },
    {
      "text": "Wikipedia: http://www.wikipedia.org/.",
      "doi": ""
    },
    {
      "text": "Barry, A. (1997). SpeechSkimmer: a system for interactively skimming recorded speech. ACM Transactions on Computer-Human Interaction, 4(1). p. 3--38.  ",
      "doi": "10.1145/244754.244758"
    },
    {
      "text": "Bernstein, L. (1997). Detection and discrimination of interaural disparities: Modern earphone-based studies, in Binaural and Spatial Hearing in Real and Virtual Environments, R.H. Gilkey et. al. Editors. Lawrence Erlbaum. p. 117--138.",
      "doi": ""
    },
    {
      "text": "Berry, G. (1997). The Esterel Primer. Technical report, Ecole des Mines de Paris and INRIA.",
      "doi": ""
    },
    {
      "text": "Blattner, M., Sumikawa, D., and Greenberg, R. (1989). Earcons and icons: Their structure and common design principles. Human Computer Interaction, 4(1). p. 11--44.",
      "doi": ""
    },
    {
      "text": "Brewster, S., Lumsden, J., Bell, M., Hall, M., and Tasker, S. (2003). Multimodal 'eyes-free' interaction techniques for wearable devices. ACM CHI Conference on Human Factors in Computing Systems. p. 473--480.  ",
      "doi": "10.1145/642611.642694"
    },
    {
      "text": "Brewster, S. (1998). Using nonspeech sounds to provide navigation cues. ACM Transactions on Computer-Human Interaction. 5(3). p. 224--259.  ",
      "doi": "10.1145/292834.292839"
    },
    {
      "text": "Brewster, S., and Cryer, P. (1999). Maximising Screen Space on Mobile Computing Devices. ACM CHI Conference on Human Factors in Computing Systems (Extended Abstracts).p. 224--225.  ",
      "doi": "10.1145/632716.632855"
    },
    {
      "text": "Brewster, S., Wright, P., and Edwards, A. (1993). An evaluation of earcons for use in auditory human-computer interfaces. ACM CHI Conference on Human Factors in Computing Systems. p. 222--227.  ",
      "doi": "10.1145/169059.169179"
    },
    {
      "text": "Callahan, J., Hopkins, D., Weiser, M. and Shneiderman, B. (1988). An empirical comparison of pie vs. linear menus. ACM CHI Conference on Human Factors in Computing Systems. p. 95--100.  ",
      "doi": "10.1145/57167.57182"
    },
    {
      "text": "Doel, K., and Pai, D. (2001). A Java audio synthesis system for programmers. International Conference on Auditory Display.",
      "doi": ""
    },
    {
      "text": "Gaver, W. (1989). The Sonic Finder: An interface that uses auditory icons. Human Computer Interaction, 4(1). p. 67--94.",
      "doi": ""
    },
    {
      "text": "Gaver, W., and Smith, R. (1991). Auditory icons in large-scale collaborative environments. ACM SIGCHI Bulletin, 23(1). p. 96.  ",
      "doi": "10.1145/122672.1048010"
    },
    {
      "text": "Guo, J., and Guo, A. (2005). Crossmodal interaction between olfactory and visual learning in Drosophila. Science, 309. p. 307--310.",
      "doi": ""
    },
    {
      "text": "Harrison, B., Fishkin, K., Gujar, A., Mochon, C., and Want, R. (1998). Squeeze me, hold me, tilt me! An exploration of manipulative user interfaces. ACM CHI Conference on Human Factors in Computing Systems. p. 17--24.  ",
      "doi": "10.1145/274644.274647"
    },
    {
      "text": "Kurtenbach, G. (1993). The design and evaluation of marking menus. Ph.D. Thesis, University of Toronto. ",
      "doi": "10.5555/193157"
    },
    {
      "text": "Liao, C., Guimbretiere, F., and Loeckenhoff, C. (2006). Pen-top feedback for paper-based interfaces. ACM UIST Symposium on User Interface Software and Technology. p. 201--210.  ",
      "doi": "10.1145/1166253.1166285"
    },
    {
      "text": "Luk, J., Pasquero, J., Little, J., MacLean, K., Levesque, V., Hayward, V. (2006). A role for haptics in mobile interaction: initial design using a handheld tactile display prototype. ACM CHI Conference on Human Factors in Computing Systems. p. 171--180.  ",
      "doi": "10.1145/1124772.1124800"
    },
    {
      "text": "Marics, M., and Engelbeck, G. (1997). Designing voice menu applications for telephones, in Handbook of Human-Computer Interaction, Helander, M., Landauer, T., and Prabhu, P. Editors. Elsevier. p. 1085--1102.",
      "doi": ""
    },
    {
      "text": "Miller, D. (1981). The depth/breadth tradeoff in hierarchical computer menus. Human Factors Society Conference. p. 296--300.",
      "doi": ""
    },
    {
      "text": "Minoru, K., Chris, S. (1997). Dynamic Soundscape: mapping time to space for audio browsing. ACM CHI Conference on Human Factors in Computing Systems. p. 194--201.  ",
      "doi": "10.1145/258549.258702"
    },
    {
      "text": "Mynatt, E. (1995). Transforming graphical interfaces into auditory interfaces. ACM CHI Conference Companion on Human Factors in Computing Systems. p. 67--68.  ",
      "doi": "10.1145/223355.223432"
    },
    {
      "text": "Norman, K. (1991). The Psychology of Menu Selection: Designing Cognitive Control at the Human/Computer Interface. Ablex Publishing Corporation. ",
      "doi": "10.5555/574380"
    },
    {
      "text": "Oulasvirta, A., Tamminen, S., Roto, V., and Kuorelahti, J. (2005). Interaction in 4-second bursts: the fragmented nature of attentional resources in mobile HCI. ACM CHI Conference on Human Factors in Computing Systems. p. 919--928.  ",
      "doi": "10.1145/1054972.1055101"
    },
    {
      "text": "Paap, K., and Cooke, N. (1997). Designing menus, in Handbook of Human-Computer Interaction, Helander, M., Landauer, T., and Prabhu, P. Editors. Elsevier. p. 533--572.",
      "doi": ""
    },
    {
      "text": "Pascoe, J., Ryan, N., and Morse, D. (2000). Using while moving: HCI issues in fieldwork environments. ACM Transactions on Computer-Human Interaction, 7(3). p. 417--437.  ",
      "doi": "10.1145/355324.355329"
    },
    {
      "text": "Pauws, S., Bouwhuis, D., and Eggen, B. (2000). Programming and enjoying music with your eyes closed. ACM CHI Conference on Human Factors in Computing Systems. p. 376--383.  ",
      "doi": "10.1145/332040.332460"
    },
    {
      "text": "Pirhonen, A., Brewster, S., and Holguin, C. (2002). Gestural and audio metaphors as a means of control for mobile devices. ACM CHI Conference on Human Factors in Computing Systems. p. 291--298.  ",
      "doi": "10.1145/503376.503428"
    },
    {
      "text": "Ranjan, A., Balakrishnan, R., and Chignell, M. (2006). Searching in audio: the utility of transcripts, dichotic presentation, and time-compression. ACM CHI Conference on Human Factors in Computing Systems. p. 721--730.  ",
      "doi": "10.1145/1124772.1124879"
    },
    {
      "text": "Resnick, P., and Virzi, R. (1992). Skip and scan: cleaning up telephone interface. ACM CHI Conference on Human Factors in Computing Systems. p. 419--426.  ",
      "doi": "10.1145/142750.142881"
    },
    {
      "text": "Roberts, T., and Engelbeck, G. (1989). The effects of device technology on the usability of advanced telephone functions. ACM CHI Conference on Human Factors in Computing Systems. p. 331--337.  ",
      "doi": "10.1145/67449.67514"
    },
    {
      "text": "Rosenberger, J., and Gasco, M. (1983). Comparing location estimators: Trimmed means, medians, and trimean. in Understanding robust and exploratory data analysis, Hoagan, D., Mosteller, F., and Tukey, J., Editors. John Wiley: New York.",
      "doi": ""
    },
    {
      "text": "Roy, D. and Schmandt, C. (1996). NewsComm: a hand-held interface for interactive access to structured audio. ACM CHI Conference on Human Factors in Computing Systems. p. 173--180.  ",
      "doi": "10.1145/238386.238471"
    },
    {
      "text": "Sawhney, N., and Schmandt, C. (2000). Nomadic radio: speech and audio interaction for contextual messaging in nomadic environments. ACM Transactions Computer-Human In-teractaction, 7(3). p. 353--383.  ",
      "doi": "10.1145/355324.355327"
    },
    {
      "text": "Schmandt, C. (1998). Audio hallway: a virtual acoustic environment for browsing. ACM UIST Symposium on User Interface Software and Technology. p. 163--170.  ",
      "doi": "10.1145/288392.288597"
    },
    {
      "text": "Schmandt, C., Lee, K., Kim, J., and Ackerman, M. (2004). Impromptu: managing networked audio applications for mobile users. ACM MobiSYS Conference on Mobile Systems, Applications, and Services. p. 59--69.  ",
      "doi": "10.1145/990064.990074"
    },
    {
      "text": "Shneiderman, B. (2004). Design the user interface: strategies for effective human-computer-interaction. Addison-Wesley. ",
      "doi": "10.5555/983803"
    },
    {
      "text": "Stifelman, L., Arons, B., and Schmandt, C. (2001). The audio notebook: paper and pen interaction with structured speech. ACM CHI Conference on Human Factors in Computing Systems. p. 182--189.  ",
      "doi": "10.1145/365024.365096"
    },
    {
      "text": "Stifelman, L., Arons, B., Schmandt, C., and Hulteen, E. (1993) VoiceNotes: a speech interface for a hand-held voice notetaker. ACM CHI Conference on Human Factors in Computing Systems. p. 179--186.  ",
      "doi": "10.1145/169059.169150"
    },
    {
      "text": "Suhm, B., Freeman, B., and Getty, B. (2001). Curing the menu blues in touch-tone voice interfaces. ACM CHI Conference on Human Factors in Computing Systems (Extended Abstracts). p. 131--132.  ",
      "doi": "10.1145/634067.634147"
    },
    {
      "text": "Witten, I., Cleary, J., and Greenberg, S. (1984). On frequency-based menu-splitting algorithms. International Journal of Man-Machine Studies, 21(2). p. 135--148.",
      "doi": ""
    },
    {
      "text": "Yin, M., and Zhai, S. (2006). The benefits of augmenting telephone voice menu navigation with visual browsing and search. ACM CHI Conference on Human Factors in Computing Systems. p. 319--328.  ",
      "doi": "10.1145/1124772.1124821"
    },
    {
      "text": "Zhao, S., Agrawala, M., and Hinckley, K. (2006). Zone and polygon menus: using relative position to increase the breadth of multi-stroke marking menus. ACM CHI Conference on Human Factors in Computing Systems. p. 1077--1086.  ",
      "doi": "10.1145/1124772.1124933"
    },
    {
      "text": "Zhao, S., and Balakrishnan, R. (2004). Simple vs. compound mark hierarchical marking menus. ACM UIST Symposium on User Interface Software and Technology. p. 33--42.  ",
      "doi": "10.1145/1029632.1029639"
    }
  ]
}