{
  "doi": "10.1145/1240624.1240710",
  "title": "Sabbath day home automation: \"it's like mixing technology and religion\"",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "527-536",
  "year": 2007,
  "badges": [],
  "abstract": "We present a qualitative study of 20 American Orthodox Jewish families' use of home automation for religious purposes. These lead users offer insight into real-life, long-term experience with home automation technologies. We discuss how automation was seen by participants to contribute to spiritual experience and how participants oriented to the use of automation as a religious custom. We also discuss the relationship of home automation to family life. We draw design implications for the broader population, including surrender of control as a design resource, home technologies that support long-term goals and lifestyle choices, and respite from technology.",
  "tags": [
    "religious technology",
    "smart homes",
    "family life",
    "domestic technology",
    "home automation",
    "ubiquitous computing"
  ],
  "authors": [
    {
      "name": "Allison Woodruff",
      "institution": "Intel Research Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100327302",
      "orcid": "missing"
    },
    {
      "name": "Sally Augustin",
      "institution": "PlaceCoach, Inc., Sheboygan, WI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350567614",
      "orcid": "missing"
    },
    {
      "name": "Brooke Foucault",
      "institution": "Intel Digital Home Group, Hillsboro, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488233",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bell, G. No More SMS from Jesus: Ubicomp, Religion and Techno-spiritual Practices. Proc. UbiComp 2006, 141--158.  ",
      "doi": "10.1007/11853565_9"
    },
    {
      "text": "Bell, G., and Kaye, J.J. Designing Technology for Domestic Spaces: A Kitchen Manifesto. Gastronomica 2(2):42--62, 2002.",
      "doi": ""
    },
    {
      "text": "Benford, S., et al. Uncle Roy All Around You: Implicating the City in a Location-Based Performance. Proc. ACE 2004.",
      "doi": ""
    },
    {
      "text": "Beyer, H., and Holtzblatt, K. Contextual Design: Defining Customer-Centered Systems. Morgan Kaufman, San Francisco, 1998. ",
      "doi": "10.5555/286067"
    },
    {
      "text": "Cohen, S.B. The Shabbos Home: A Comprehensive Halachic Guide to the Laws of Shabbos as They Apply Throughout the Home. Mesorah, Brooklyn, v.1,2, 1995.",
      "doi": ""
    },
    {
      "text": "Crabtree, A., and Rodden, T. Domestic Routines and Design for the Home. JCSCW 13(2):191--220, 2004  ",
      "doi": "10.1023/B%3ACOSU.0000045712.26840.a4"
    },
    {
      "text": "Davidoff, S. et al. Principles of Smart Home Control. Proc. UbiComp 2006, 19--34.  ",
      "doi": "10.1007/11853565_2"
    },
    {
      "text": "Diamond, E. And I Will Dwell in Their Midst: Orthodox Jews in Suburbia. The University of North Carolina Press, Chapel Hill and London, 2000.",
      "doi": ""
    },
    {
      "text": "Dundes, A. The Shabbat Elevator and Other Sabbath Subterfuges: An Unorthodox Essay on Circumventing Custom and Jewish Character. Rowman and Littlefield Publishers, Inc., Lanham, MD, 2002.",
      "doi": ""
    },
    {
      "text": "Dunne, A., and Raby, F. Design Noir: The Secret Life of Electronic Objects. Basel, Boston, 2001.",
      "doi": ""
    },
    {
      "text": "Edwards, W.K., and Grinter, R.E. At Home with Ubiquitous Computing: Seven Challenges. Proc. UbiComp 2001, 256--272. ",
      "doi": "10.5555/647987.741327"
    },
    {
      "text": "Erard, M. The Geek Guide to Kosher Machines. Wired Magazine 12(11), 2004.",
      "doi": ""
    },
    {
      "text": "Fasman, J. Shabbat Tech. I.D. 53(2):46--49, 2006.",
      "doi": ""
    },
    {
      "text": "Fogg, B.J. Persuasive Technology: Using Computers to Change What We Think and Do. Morgan Kaufmann Publishers, Boston, 2003. ",
      "doi": "10.5555/2821581"
    },
    {
      "text": "Frank, G., et al. Jewish Spirituality Through Actions in Time: Daily Occupations of Young Orthodox Jewish Couples in Los Angeles. American Journal of Occupational Therapy 51(3):199--206, 1997.",
      "doi": ""
    },
    {
      "text": "Hamill, L. Controlling Smart Devices in the Home. The Information Society 22:241--249, 2006.",
      "doi": ""
    },
    {
      "text": "Harper, R. (ed). Inside the Smart Home. Springer, London, 2003. ",
      "doi": "10.5555/940815"
    },
    {
      "text": "Heisley, D.H., and Levy, S. J. Autodriving: A Photoelicitation Technique. The Journal of Consumer Research 18(3):257--272, 1991.",
      "doi": ""
    },
    {
      "text": "Intille, S.S. et al. A Living Laboratory for the Design and Evaluation of Ubiquitous Computing Technologies. CHI 2005 Extended Abstracts, 1941--1944.  ",
      "doi": "10.1145/1056808.1057062"
    },
    {
      "text": "Kaplan, R., and Kaplan, S. The Experience of Nature: A Psychological Perspective. Cambridge University Press, Cambridge, 1989.",
      "doi": ""
    },
    {
      "text": "Kidd, C. et al. The Aware Home: A Living Laboratory for Ubiquitous Computing Research. Proc. CoBuild 1999, 191--198. ",
      "doi": "10.5555/645969.674887"
    },
    {
      "text": "Latour, B. Where are the Missing Masses? The Sociology of a Few Mundane Artifacts. In W.E. Bijker and J. Law (eds.), Shaping Technology/Building Society: Studies in Sociotechnical Change (pp. 225--258). MIT Press, Cambridge, MA, 1992.",
      "doi": ""
    },
    {
      "text": "Mainwaring, S.D., Chang, M.F., and Anderson, K. Infrastructures and Their Discontents: Implications for Ubicomp. Proc. UbiComp 2004, 418--432.",
      "doi": ""
    },
    {
      "text": "Mallett, S. Understanding Home: A Critical Review of the Literature. Sociological Review 52(1):62--89, 2004.",
      "doi": ""
    },
    {
      "text": "Mozer, M. C. Lessons from an Adaptive House. In D. Cook & R. Das (eds.), Smart Environments: Technologies, Protocols, and Applications (pp. 273--294). J. Wiley & Sons, Hoboken, NJ, 2005.",
      "doi": ""
    },
    {
      "text": "Muller, M. J. et al. Spiritual Life and Information Technology. CACM, 44(3):82--83, 2001.  ",
      "doi": "10.1145/365181.365211"
    },
    {
      "text": "Reiss, S. Multifaceted Nature of Intrinsic Motivation: The Theory of 16 Basic Drives. Review of General Psychology 8(3):179--193, 2004.",
      "doi": ""
    },
    {
      "text": "Orlikowski, W.J., and Yates, J. It's About Time: Temporal Structuring in Organizations. Organization Science 13(6):684--700, 2002.  ",
      "doi": "10.1287/orsc.13.6.684.501"
    },
    {
      "text": "Shore, B. Class Acts: Activity Fetishism and Busyness as Usual. American Anthropological Assoc. Mtg. 2003.",
      "doi": ""
    },
    {
      "text": "Taylor, A.S., and Swan, L. Artful Systems in the Home. Proc. CHI 2005, 641--650.  ",
      "doi": "10.1145/1054972.1055060"
    },
    {
      "text": "Wyche, S. et al. Technology in Spiritual Formation: An Exploratory Study of Computer Mediated Religious Communications. Proc. CSCW 2006, 199--208.  ",
      "doi": "10.1145/1180875.1180908"
    },
    {
      "text": "Zomet. http://www.moreshet.co.il/zomet/index-e.html",
      "doi": ""
    }
  ]
}