{
  "doi": "10.1145/1240624.1240648",
  "title": "Questions not answers: a novel mobile search technique",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "155-158",
  "year": 2007,
  "badges": [],
  "abstract": "Mobile search is becoming an increasingly important user activity. In this paper, instead of investigating the most efficient and effective ways of providing search results, the answers, we consider the value of giving access to previous queries, the questions, relating to a user's location. By exposing what other people have searched for, the aim is to provide useful insights into a location's character. To consider the value of the approach we deployed two mobile probes in a large-scale field study involving 391 participants. Our experiences suggest that presenting users with other people's in situ queries influences their information seeking interactions positively.",
  "tags": [
    "social software",
    "location",
    "mobile search"
  ],
  "authors": [
    {
      "name": "Matt Jones",
      "institution": "Swansea University, Swansea, Wales, UK",
      "img": "/do/10.1145/contrib-81328488881/rel-imgonly/forweb.jpg",
      "acmid": "81328488881",
      "orcid": "0000-0001-7657-7373"
    },
    {
      "name": "George Buchanan",
      "institution": "Swansea University, Swansea, Wales, UK",
      "img": "/do/10.1145/contrib-81100456135/rel-imgonly/g5edit.jpg",
      "acmid": "81100456135",
      "orcid": "missing"
    },
    {
      "name": "Richard Harper",
      "institution": "Microsoft Research, Cambridge, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452613064",
      "orcid": "missing"
    },
    {
      "name": "Pierre-Louis Xech",
      "institution": "Microsoft Research, Cambridge, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81321499781",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Espinoza, F., Persson, P., Sandin, A., Nyström, H., Cacciatore, E. and Bylund, M. (2001). GeoNotes: Social and Navigational Aspects of Location-Based Information Systems. Proceedings of the 3rd International conference on Ubiquitous Computing, Springer-Verlag, 2--17. ",
      "doi": "10.5555/647987.741330"
    },
    {
      "text": "Hansen, F. A., Pederson, T. B and Gagach, J. (2004). Integrating the Web and the World: Contextual Trails on the Move, Procs. ACM Hypertext 2004, 98--107.  ",
      "doi": "10.1145/1012807.1012837"
    },
    {
      "text": "Jones, M., Buchanan, G. and Thimbleby, H. (2003). Improving web search on small screen devices. Interacting With Computers 15(4): 479--495.",
      "doi": ""
    },
    {
      "text": "Kamvar, M. and Baluja, S. 2006. A large scale study of wireless search behavior: Google mobile search. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '06. ACM Press, 701--709.  ",
      "doi": "10.1145/1124772.1124877"
    },
    {
      "text": "Marchionini, G., Information Seeking in Electronic Environments, Cambridge University Press, 1995. ",
      "doi": "10.5555/206740"
    },
    {
      "text": "Schusteritsch, R., Rao, S., and Rodden, K. 2005. Mobile search with text messages: designing the user experience for Google SMS. In CHI '05 Extended Abstracts on Human Factors in Computing Systems CHI '05. ACM Press, New York, NY, 1777--1780.  ",
      "doi": "10.1145/1056808.1057020"
    }
  ]
}