{
  "doi": "10.1145/1240624.1240824",
  "title": "A study of emergency response work: patterns of mobile phone interaction",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1323-1332",
  "year": 2007,
  "badges": [],
  "abstract": "This paper presents descriptive accounts of time-critical organizing in the domain of emergency response. Patterns of mobile phone interaction in such work is analyzed showing how the dyadic exchange of mobile phone numbers between the actors plays an important role in the social interactions in the organizing and sensemaking of the emergency. Enacted sensemaking is used as an analytical framework. Implications for design of emergency response information technology are outlined and discussed.",
  "authors": [
    {
      "name": "Jonas Landgren",
      "institution": "Viktoria Institute, Göteborg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311484289",
      "orcid": "missing"
    },
    {
      "name": "Urban Nulden",
      "institution": "Viktoria Institute, Göteborg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100626382",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arnold, M. On the phenomenology of technology: the \"Janus--faces\" of mobile phones.\" Information and Organization 13,4, (2003) 231--256.",
      "doi": ""
    },
    {
      "text": "Bigley, G. A. and K. H. Roberts . The Incident Command System: High-Reliability Organizing For Complex and Volatile Task Environments. Academy of Management Journal 44,6 (2001) 1281--1300.",
      "doi": ""
    },
    {
      "text": "Calloway, L. J. and P. G. W. Keen. Organizing for crisis response. Journal of Information Technology 11,1 (1996) 13--27.",
      "doi": ""
    },
    {
      "text": "Camp, P. J., Hudson, J. M., Keldorph, R. Lewis, S., Mynatt, E.D. Supporting communication and collaboration practices in safety-critical situations. In Proc. CHI 2000, ACM Press (2000).  ",
      "doi": "10.1145/633292.633438"
    },
    {
      "text": "Farnham, S., Pedersen, E., Kirkpatrick, R. Observation of Katrina/Rita Groove Deployment: Addressing Social and Communication Challenges of Ephemeral Groups In Proc. ISCRAM 2006, (2006).",
      "doi": ""
    },
    {
      "text": "Fredholm, L. Decision-making patterns in major firefighting and rescue operations. In Decision Making under stress: Emerging themes and applications. Ed: R. Flin, E. Salas, M. Strub and L. Martin. Vermont, USA, Ashgate Publishing Company, 1997.",
      "doi": ""
    },
    {
      "text": "Hammersley, M. and Atkinson, P. Ethnography, Routeledge, London, 1995.",
      "doi": ""
    },
    {
      "text": "Heath, C. and P. Luff. Collaboration and Control: Crisis Management and Multimedia Technology in London Underground Line Control Rooms. Computer Supported Cooperative Work 1,1 (1992) 24--48.",
      "doi": ""
    },
    {
      "text": "Hughes, J. A., D. Randall, D. Shapiro. Faltering from ethnography to design. In Proc. CSCW 1992, ACM Press (1992).  ",
      "doi": "10.1145/143457.143469"
    },
    {
      "text": "Jiang, X., Chen, N.Y., Hong, J.I., Wang, K., Takayama, L., Landay, J.A. Siren: Context-aware Computing for Firefighting. In Proc. Pervasive 2004, (2004).",
      "doi": ""
    },
    {
      "text": "Kristensen, M., Kyng, M and Palen, L. Participatory design in emergency medical service: designing for future practice. In Proc. CHI 2006, ACM Press (2006).  ",
      "doi": "10.1145/1124772.1124798"
    },
    {
      "text": "Landgren, J. Supporting fire crew sensemaking enroute to an incident. International Journal of Emergency Management 2,3 (2005) 176--188.",
      "doi": ""
    },
    {
      "text": "Landgren, J. Making action visible in time-critical work. In Proc. CHI 2006, ACM Press (2006).  ",
      "doi": "10.1145/1124772.1124804"
    },
    {
      "text": "Lorincz, K. Malan, D.J. Fulford-Jones, T.R.F. Nawoj, A. Clavel, A. Shnayder, V. Mainland, G. Welsh, M. Moulton, S. Sensor networks for emergency response: challenges and opportunities. Pervasive Computing 3,4 (2004) 16--23.  ",
      "doi": "10.1109/MPRV.2004.18"
    },
    {
      "text": "Manning, P. K. Information Technology in the Police Context: The \"Sailor\" Phone. Information Systems Research 7,1 (1996) 52--62.",
      "doi": "10.1287/isre.7.1.52"
    },
    {
      "text": "Mark, G. Extreme Collaboration. Communications of the ACM. 45,6 (2002), 89--93.  ",
      "doi": "10.1145/508448.508453"
    },
    {
      "text": "Nardi, B., Whittaker, S., Schwarz, H. NetWORKers and their Activity in Intentional Networks. Computer Supported Cooperative Work 11 (2002) 205--242.  ",
      "doi": "10.1023/A%3A1015241914483"
    },
    {
      "text": "Normark, M. Sense-making of an emergency call: possibilities and constraints of a computerized case file. In Proc. NordiCHI 2002. ACM Press (2002).  ",
      "doi": "10.1145/572020.572031"
    },
    {
      "text": "Patton, M. Q. Qualitative Evaluation and Research Methods. SAGE Publications, London, United Kingdom, 1990.",
      "doi": ""
    },
    {
      "text": "Prasopoulou, E., A. Pouloudi, Panteli, N. Enacting new temporal boundaries: the role of mobile phones. European Journal of Information Systems 15,3 (2006) 277--284.",
      "doi": ""
    },
    {
      "text": "Pettersson, M., Randall, D., Helgeson, B. Ambiguities, awareness and economy: a study of emergency service work. In Proc. CSCW 2002, ACM Press (2002).  ",
      "doi": "10.1145/587078.587118"
    },
    {
      "text": "Perrow, C. Normal accidents. Basic Books New York, 1984.",
      "doi": ""
    },
    {
      "text": "Roberts, K. H. Some Characteristics of One Type of High Reliability Organization. Organization Science 1,2 (1990) 160--176.",
      "doi": "10.1287/orsc.1.2.160"
    },
    {
      "text": "Smircich, L. and Stubbart, C. Strategic Management in an Enacted World. The Academy of Management Review 10,4 (1985) 724--736.",
      "doi": ""
    },
    {
      "text": "Teasley, S., Covi, L., Krishnan, M.S., Olson, J.S. How Does Radical Collocation Help a Team Succeed? In Proc. CSCW 2000, ACM Press (2000).  ",
      "doi": "10.1145/358916.359005"
    },
    {
      "text": "Turoff, M., Chumer, M., Van de Walle, B., Yao, X. The Design of Emergency Response Management Information Systems. The Journal of Information Technology Theory and Application (JITTA), 5,4 (2004) 1--35.",
      "doi": ""
    },
    {
      "text": "Weick, K. E. Enacted sensemaking in crisis situations. Journal of Management Studies 25,4 (1988) 305--318.",
      "doi": ""
    },
    {
      "text": "Weick, K. E. The Vulnerable System: An Analysis of the Tenerife Air Disaster. Journal of Management 16,3 (1990) 571--594.",
      "doi": ""
    },
    {
      "text": "Weick, K. E. Sensemaking in organisations. Thousand Oaks, SAGE Publications Inc. 1995.",
      "doi": ""
    },
    {
      "text": "Weick, K., Sutcliffe, K,. Obstfeld, D. Organizing and the Process of Sensemaking. Organization Science 16,4 (2005) 409--412.  ",
      "doi": "10.1287/orsc.1050.0133"
    },
    {
      "text": "Quarantelli, E. L. Problematical aspects of the information/communication revolution for disaster planning and research: ten non-technical issues and questions. Disaster Prevention and Management 6,2 (1997) 94--106.",
      "doi": ""
    }
  ]
}