{
  "doi": "10.1145/1240624.1240627",
  "title": "Improving recognition and characterization in groupware with rich embodiments",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "11-20",
  "year": 2007,
  "badges": [],
  "abstract": "Embodiments are visual representations of people in a groupware system. Embodiments convey awareness information such as presence, location, and movement -- but they provide far less information than what is available from a real body in a face-to-face setting. As a result, it is often difficult to recognize and characterize other people in a groupware system without extensive communication. To address this problem, information-rich embodiments use ideas from multivariate information visualization to maximize the amount of information that is represented about a person. To investigate the feasibility of rich embodiment and their effects on group interaction, we carried out three studies. The first shows that users are able to recall and interpret a large set of variables that are graphically encoded on an embodiment. The second and third studies demonstrated rich embodiments in two groupware systems -- a multiplayer game and a drawing application -- and showed that the enhanced representations do improve recognition and characterization, and that they can enrich interaction in a variety of ways.",
  "tags": [
    "rich embodiment",
    "telepointers",
    "avatars",
    "embodiment"
  ],
  "authors": [
    {
      "name": "Tadeusz Stach",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328490612",
      "orcid": "missing"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    },
    {
      "name": "David Pinelle",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100573952",
      "orcid": "missing"
    },
    {
      "name": "Pourang Irani",
      "institution": "University of Manitoba, Winnipeg, MAN, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    }
  ],
  "references": [
    {
      "text": "Argyle, M. Bodily Communication, 2nd ed. New York, NY: Methuen & Co., 1988.",
      "doi": ""
    },
    {
      "text": "Benford, S., Bowers, J., Fahlen, L., Greenhalgh, C., and Snowdon, C., User Embodiment in Collaborative Virtual Environments, Proc. CHI 1995, 242--249.  ",
      "doi": "10.1145/223904.223935"
    },
    {
      "text": "Bertin, J., Semiology of Graphics, translated by W. Berg, University of Wisconsin Press, 1983. ",
      "doi": "10.5555/1095597"
    },
    {
      "text": "Brand, S., Spacewar: Fanatic Life and Symbolic Death Among the Computer Bums, Rolling Stone, No. 123, 1972, 50--58.",
      "doi": ""
    },
    {
      "text": "Brown, B. and Bell, M., CSCW at play: 'There' as a collaborative virtual environment. Proc. CSCW 2004, 350--359.  ",
      "doi": "10.1145/1031607.1031666"
    },
    {
      "text": "Chernoff, H., The use of faces to represent points in k-dimensional space graphically, Journal of American Statistical Association, Vol. 68, 1973, 361--368.",
      "doi": ""
    },
    {
      "text": "Chuah, M. and Eick, S., Information-rich glyphs for software management data, IEEE Computer Graphics and Applications, 18, (4), 1998, 24--29.  ",
      "doi": "10.1109/38.689658"
    },
    {
      "text": "Dyck, J., Pinelle, D., Brown, B., and Gutwin, C., Learning from Games: HCI Design Innovations in Entertainment Software, Proc. GI 2003, 237--246.",
      "doi": ""
    },
    {
      "text": "Gerhard, M., Moore D., and Hobbs D., Embodiment and Copresence in Collaborative Interfaces, IJHCS, 61 (4), 2004, 453--480.  ",
      "doi": "10.1016/j.ijhcs.2003.12.014"
    },
    {
      "text": "Greenberg, S., Gutwin, C., and Roseman, M., Semantic Telepointers for Groupware, Proc. OzCHI 1996, 54--61. ",
      "doi": "10.5555/548200.883204"
    },
    {
      "text": "Gutwin, C. Traces: Visualizing the Immediate Past to Improve Group Interaction, Proc. GI 2002, 43--50.",
      "doi": ""
    },
    {
      "text": "Gutwin, C., and Greenberg, S., A Descriptive Framework of Workspace Awareness for Real-Time Groupware, JCSCW, 11(3), 2002, 411--446.  ",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "Hartigan J., Printer graphics for clustering. J. Statistical Computing and Simulation, vol. 4, 1975, 187--213.",
      "doi": ""
    },
    {
      "text": "Hill, W., Hollan, J. Wroblewski, D. and McCandless, T., Edit Wear and Read Wear. Proc. ACM CHI 1992, 3--9.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Ishii, H., Kobayashi, M., and Grudin, J., Integration of Inter-Personal Space and Shared Workspace: ClearBoard Design and Experiments. Proc. CSCW 1992, 33--42.  ",
      "doi": "10.1145/143457.143459"
    },
    {
      "text": "Lewis, J., Rosenholtz, R., Fong, N., and Neumann, U., VisualIDs: automatic distinctive icons for desktop interfaces, ACM ToG, 23 (3), 2004, 416--423.  ",
      "doi": "10.1145/1015706.1015739"
    },
    {
      "text": "Mackinlay, J., Automating the design of graphical presentations of relational information. ACM ToG, 5(2), 1986, 110--141.  ",
      "doi": "10.1145/22949.22950"
    },
    {
      "text": "Nowell, L., Schulman, R., Hix, D., Graphical encoding for information visualizations: an empirical study, InfoVis2002, 43--50. ",
      "doi": "10.5555/857191.857751"
    },
    {
      "text": "Perry, E., and Donath, J., Anthropomorphic Visualization: A New Approach for Depicting Participants in Online Spaces. Proc. CHI 2004, 1115--1118.  ",
      "doi": "10.1145/985921.986002"
    },
    {
      "text": "Tang, A., Neustaedter, C. Greenberg, S., VideoArms: Embodiments for Mixed Presence Groupware. Proc. BCS-HCI 2006.",
      "doi": ""
    },
    {
      "text": "Vaghi, I., Greenhalgh, C., and Benford, S., Coping with inconsistency due to network delays in collaborative virtual environments. VRST 1999, 42--49.  ",
      "doi": "10.1145/323663.323670"
    },
    {
      "text": "Ward, M., A taxonomy of glyph placement strategies for multidimensional data visualization, Information Visualization, 1 (3-4), 2002, 194--210.  ",
      "doi": "10.1057/palgrave.ivs.9500025"
    },
    {
      "text": "Wickens, C., Engineering Psychology and Human Performance, New York: Harper Collins, 1992.",
      "doi": ""
    },
    {
      "text": "Xiong, R., and Donath, J., PeopleGarden: Creating Data Portraits for Users, Proc. UIST 1999, 37--44.  ",
      "doi": "10.1145/320719.322581"
    }
  ]
}