{
  "doi": "10.1145/1240624.1240842",
  "title": "Making mashups with marmite: towards end-user programming for the web",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1435-1444",
  "year": 2007,
  "badges": [],
  "abstract": "There is a tremendous amount of web content available today, but it is not always in a form that supports end-users' needs. In many cases, all of the data and services needed to accomplish a goal already exist, but are not in a form amenable to an end-user. To address this problem, we have developed an end-user programming tool called Marmite, which lets end-users create so-called mashups that re-purpose and combine existing web content and services. In this paper, we present the design, implementation, and evaluation of Marmite. An informal user study found that programmers and some spreadsheet users had little difficulty using the system.",
  "tags": [
    "web services",
    "mashup",
    "spreadsheet",
    "end-user programming"
  ],
  "authors": [
    {
      "name": "Jeffrey Wong",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311481846",
      "orcid": "missing"
    },
    {
      "name": "Jason I. Hong",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81408598366/rel-imgonly/81408598366.png",
      "acmid": "81408598366",
      "orcid": "0000-0002-9856-9654"
    }
  ],
  "references": [
    {
      "text": "Apple, Automator: Your Personal Automation Assistant. http://www.apple.com/macosx/features/automator/",
      "doi": ""
    },
    {
      "text": "Barrett, R., Maglio, P., and Kellem, D. \"How to Personalize the Web.\" Proc. CHI'97, pp. 75--82.  ",
      "doi": "10.1145/258549.258595"
    },
    {
      "text": "Bolin, M., Webber, M., Rha, P., Wilson, T., and Miller, R. C. Automation and customization of rendered web pages. Proc. UIST '05. ACM Press (2005), 163--172.  ",
      "doi": "10.1145/1095034.1095062"
    },
    {
      "text": "Cohen, W.W., Minorthird: Methods for Identifying Names and Ontological Relations in Text using Heuristics for Inducing Regularities from Data. 2004. http://minorthird.sourceforge.net",
      "doi": ""
    },
    {
      "text": "Cypher, Allen, ed. \"Watch What I Do: Programming by Demonstration\", MIT Press, Cambridge MA, 1993. ",
      "doi": "10.5555/168080"
    },
    {
      "text": "Dapper. http://www.dappit.com",
      "doi": ""
    },
    {
      "text": "DataMashups. http://www.datamashups.com",
      "doi": ""
    },
    {
      "text": "eGrabber, AddressGrabber Business 3.2.1.",
      "doi": ""
    },
    {
      "text": "Faaborg, A. and Lieberman, H. A goal-oriented web browser. Proc. CHI 2006. ACM Press (2006) pp. 751--760.  ",
      "doi": "10.1145/1124772.1124883"
    },
    {
      "text": "Fujima, J., A. Lunzer, K. Hornbaek, and Y. Tanaka. Clip, Connect, Clone: Combining Application Elements to Build Custom Interfaces for Information Access. In Proc. UIST2004, CHI Letters 6(2). ACM Press (2004). pp. 175--184.  ",
      "doi": "10.1145/1029632.1029664"
    },
    {
      "text": "Huynh, D., Mazzocchi, Stefano and David Karger. Piggy Bank: Experience the Semantic Web Inside Your Web Browser. International Semantic Web Conference (ISWC), November 2005, Galway, Ireland.  ",
      "doi": "10.1007/11574620_31"
    },
    {
      "text": "Huynh, D. F., Miller, R. C., and Karger, D. R. Enabling web browsers to augment web sites' filtering and sorting functionalities. Proc. UIST '06. ACM Press (2006), 125--134.  ",
      "doi": "10.1145/1166253.1166274"
    },
    {
      "text": "Kelleher, C. and Pausch, R. Lowering the barriers to programming: A taxonomy of programming environments and languages for novice programmers. ACM Comput. Surv. 37, 2 (2005), 83--137.  ",
      "doi": "10.1145/1089733.1089734"
    },
    {
      "text": "Kistler, T. and Marais, H. WebL -- a programming language for the Web. Proc. WWW7, (1998) 259--270. ",
      "doi": "10.5555/297805.297847"
    },
    {
      "text": "Ko, A. J. Myers, B. A. Human Factors Affecting Dependability in End-User Programming. 1st Workshop on End-User Software Engineering (2005), St. Louis, MI, pp. 1--4.  ",
      "doi": "10.1145/1083231.1083245"
    },
    {
      "text": "Ko, A. J., Myers, B. A., and Aung, H. Six Learning Barriers in End-User Programming Systems. IEEE Symp. On VLHCC, (2005) pp. 199--206.  ",
      "doi": "10.1109/VLHCC.2004.47"
    },
    {
      "text": "Ko, A. J. and Myers, B. A. Designing the Whyline: A Debugging Interface for Asking Questions About Program Failures. Proc. of CHI 2004, ACM Press (2004), 151--158.  ",
      "doi": "10.1145/985692.985712"
    },
    {
      "text": "Kuhlins, S. and R. Tredwell, Toolkits for Generating Wrappers -- A Survey of Software Toolkits fo Automated Data Extraction from Web Sites. LNCS 2591 2003: p. 184--198. ",
      "doi": "10.5555/648033.744083"
    },
    {
      "text": "Laender, A.H.F., B.A. Ribeiro-Neto, A.S.d. Silva, and J.S. Teixeira, A Brief Survey of Web Data Extraction Tools. SIGMOD Record 2002. 31(2): p. 84--93.  ",
      "doi": "10.1145/565117.565137"
    },
    {
      "text": "Lieberman, H. (Ed.) 2001. Your Wish is My Command: Programming by Example. San Francisco: Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "H. Liu, P. Singh, ConceptNet -- A Practical Commonsense Reasoning Tool-Kit, BT Technology Journal, 22, 4, p.211--226, October 2004.  ",
      "doi": "10.1023/B%3ABTTJ.0000047600.45421.6d"
    },
    {
      "text": "Metafy Anthracite. http://www.metafy.com/products/anthracite",
      "doi": ""
    },
    {
      "text": "Microsoft, Microsoft Office XP Smart Tags. http://www.microsoft.com/technet/prodtechnol/office/officexp/maintain/xptags.mspx",
      "doi": ""
    },
    {
      "text": "Miller, R.C., Lightweight Structure in Text, Unpublished PhD thesis, Carnegie Mellon University, Pittsburgh, 2002. ",
      "doi": "10.5555/935837"
    },
    {
      "text": "Miller, R. and Bharat, K. SPHINX: A Framework for Creating Personal, Site-Specific Web Crawlers. Proc. WWW7, (1998), 119--130. ",
      "doi": "10.5555/297805.297829"
    },
    {
      "text": "Mozilla Foundation, XBL (Extensible Binding Language). http://www.mozilla.org/projects/xbl/xbl.html",
      "doi": ""
    },
    {
      "text": "Mozilla Foundation, XUL (XML User Interface Language), http://www.mozilla.org/projects/xul/",
      "doi": ""
    },
    {
      "text": "Myers, B. A., Pane, J. F. and Ko, A. Natural Programming Languages and Environments. Comm. Of the ACM, (Sept. 2004), 47--52.  ",
      "doi": "10.1145/1015864.1015888"
    },
    {
      "text": "Nardi, B.A., J.R. Miller, and D.J. Wright, Collaborative Programmable Intelligent Agents, Communications of the ACM, vol. 41(3): pp. 96--104, 1998.  ",
      "doi": "10.1145/272287.272331"
    },
    {
      "text": "Pandit, M.S. and S. Kalbag. The Selection Recognition Agent: Instant Access to Relevant Information and Operations. In Proceedings of International Conference on Intelligent User Interfaces. Orlando, FL. pp. 47--52 1997.  ",
      "doi": "10.1145/238218.238285"
    },
    {
      "text": "schraefel, m.c., Modjeska, D., Wigdor, D., and Zhu, Y. Hunter Gatherer: Interaction support for the creation and management of within-Web-page collections. Technical Report CSRG-437, Department of Computer Science, University of Toronto, October 2001.",
      "doi": ""
    },
    {
      "text": "Solvent, http://simile.mit.edu/solvent/",
      "doi": ""
    },
    {
      "text": "Sugiura, A. and Koseki, Y. Internet scrapbook: automating Web browsing tasks by demonstration. Proc UIST '98. ACM Press (1998), 9--18.  ",
      "doi": "10.1145/288392.288395"
    },
    {
      "text": "W3C, XPath (XML Path Language) http://www.w3.org/TR/xpath",
      "doi": ""
    },
    {
      "text": "W3C, Semantic Web. http://www.w3.org/2001/sw/",
      "doi": ""
    }
  ]
}