{
  "doi": "10.1145/1240624.1240693",
  "title": "A minimal model for predicting visual search in human-computer interaction",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "431-434",
  "year": 2007,
  "badges": [],
  "abstract": "Visual search is an important part of human-computer interaction. It is critical that we build theory about how people visually search displays in order to better support the users' visual capabilities and limitations in everyday tasks. One way of building such theory is through computational cognitive modeling. The ultimate promise for cognitive modeling in HCI it to provide the science base needed for predictive interface analysis tools. This paper discusses computational cognitive modeling of the perceptual, strategic, and oculomotor processes people used in a visual search task. This work refines and rounds out previously reported cognitive modeling and eye tracking analysis. A revised \"minimal model\" of visual search is presented that explains a variety of eye movement data better than the original model. The revised model uses a parsimonious strategy that is not tied to a particular visual structure or feature beyond the location of objects. Three characteristics of the minimal strategy are discussed in detail.",
  "tags": [
    "EPIC",
    "visual search",
    "screen design",
    "eye movements",
    "cognitive strategies",
    "cognitive modeling"
  ],
  "authors": [
    {
      "name": "Tim Halverson",
      "institution": "University of Oregon, Eugene, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100229966",
      "orcid": "missing"
    },
    {
      "name": "Anthony J. Hornof",
      "institution": "University of Oregon, Eugene, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100426680",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brumby, D. P., & Howes, A. (in press). Strategies for Guiding Interactive Search: An Empirical Investigation into the Consequences of Label Relevance for Assessment and Selection. Human-Computer Interaction.",
      "doi": ""
    },
    {
      "text": "Halverson, T., & Hornof, A. J. (2004). Explaining Eye Movements in the Visual Search of Varying Density Layouts. In Proc. ICCM 2004, Lawrence Erlbaum Associates, 124--129.",
      "doi": ""
    },
    {
      "text": "Hooge, I. T. C., & Erkelens, C. J. (1996). Control of fixation duration in a simple search task. Perception and Psychophysics, 58, 969--976.",
      "doi": ""
    },
    {
      "text": "Hornof, A. J. (2004). Cognitive Strategies for the Visual Search of Hierarchical Computer Displays. Human-Computer Interaction, 19(3), 183--223.  ",
      "doi": "10.1207/s15327051hci1903_1"
    },
    {
      "text": "Hornof, A. J., & Halverson, T. (2003). Cognitive strategies and eye movements for searching hierarchical computer displays. In Proc. CHI 2003, ACM Press, 249--256.  ",
      "doi": "10.1145/642611.642656"
    },
    {
      "text": "John, B. E., Prevas, K., Salvucci, D. D., & Koedinger, K. (2004). Predictive Human Performance Modeling Made Easy. In Proc. CHI 2004, ACM, 455--462.  ",
      "doi": "10.1145/985692.985750"
    },
    {
      "text": "Kieras, D. E., & Meyer, D. E. (1997). An overview of the EPIC architecture for cognition and performance with application to human-computer interaction. Human-Computer Interaction, 12(4), 391--438.  ",
      "doi": "10.1207/s15327051hci1204_4"
    },
    {
      "text": "Koostra, G., Nederveen, A., & de Boer, B. (2006). On the Bottom-Up and Top-Down Influences of Eye Movements. In Proc. Proc. CogSci 2006, Lawrence Erlbaum Associates, 2538.",
      "doi": ""
    },
    {
      "text": "Motter, B. C., & Belky, E. J. (1998). The guidance of eye movements during active visual search. Vision Research, 38(12), 1905--1815.",
      "doi": ""
    },
    {
      "text": "Peterson, M. S., Kramer, A. F., Wang, R. F., Irwin, D. E., & McCarley, J. S. (2001). Visual search has memory. Psychological Science, 12(4), 287--292.",
      "doi": ""
    },
    {
      "text": "St. Amant, R., & Ritter, F. E. (2004). Automated GOMS-to-ACT-R Model Generation. In Proc. ICCM 2004, Lawrence Earlbaum, 26--31.",
      "doi": ""
    },
    {
      "text": "Wolfe, J. M. (1994). Guided Search 2.0: A revised model of visual search. Psychonomic Bulletin and Review, 1(2), 202--238.",
      "doi": ""
    }
  ]
}