{
  "doi": "10.1145/1240624.1240723",
  "title": "A predictive model of menu performance",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "627-636",
  "year": 2007,
  "badges": [],
  "abstract": "Menus are a primary control in current interfaces, but there has been relatively little theoretical work to model their performance. We propose a model of menu performance that goes beyond previous work by incorporating components for Fitts' Law pointing time, visual search time when novice, Hick-Hyman Law decision time when expert, and for the transition from novice to expert behaviour. The model is able to predict performance for many different menu designs, including adaptive split menus, items with different frequencies and sizes, and multi-level menus. We tested the model by comparing predictions for four menu designs (traditional menus, recency and frequency based split menus, and an adaptive 'morphing' design) with empirical measures. The empirical data matched the predictions extremely well, suggesting that the model can be used to explore a wide range of menu possibilities before implementation.",
  "tags": [
    "menus",
    "performance modelling",
    "Hick-Hyman Law",
    "adaptive behaviour",
    "Fitts' Law"
  ],
  "authors": [
    {
      "name": "Andy Cockburn",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607754",
      "orcid": "0000-0003-1074-4268"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, UNK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    },
    {
      "name": "Saul Greenberg",
      "institution": "University of Calgary, Calgary, Canada",
      "img": "/do/10.1145/contrib-81100197069/rel-imgonly/saul.greenberg.jpg",
      "acmid": "81100197069",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Accot, J. and Zhai, S. Beyond Fitts' Law: Models for Trajectory-Based HCI Tasks. Proc. CHI'97, 295--302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Ahlström, D. Modeling and Improving Selection in Cascading Pull-Down Menus Using Fitts' Law, the Steering Law and Force Fields. Proc. CHI'05, 61--70.  ",
      "doi": "10.1145/1054972.1054982"
    },
    {
      "text": "Anderson, J., Matessa, M. and Lebiere, C. ACT-R: A theory of higher level cognition and its relation to visual attention. JHCI, 12 (4). 1997. 439--462.  ",
      "doi": "10.1207/s15327051hci1204_5"
    },
    {
      "text": "Bederson, B. Fisheye Menus. Proc. UIST'00, 217--225.  ",
      "doi": "10.1145/354401.354782"
    },
    {
      "text": "Byrne, M. ACT-R/PM and menu selection: Applying a cognitive architecture to HCI. IJHCS, 55. 2001. 41--84.",
      "doi": ""
    },
    {
      "text": "Byrne, M., Anderson, J., Douglass, S. and Matessa, M. Eye Tracking the Visual Search of Click-Down Menus. Proc. CHI'99, 402--409.  ",
      "doi": "10.1145/302979.303118"
    },
    {
      "text": "Card, S. Visual search of computer command menus. in Bouma, H. and Bouwhuis, D. eds. Attention and Performance X, LEA, London, 1984, 97--108.",
      "doi": ""
    },
    {
      "text": "Card, S., Moran, T. and Newell, A. The Psychology of Human-Computer Interaction. LEA, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Ellis, S. and Hitchcock, R. Emergence of Zipf's Law: Spontaneous Encoding Optimization by Users of a Command Language. IEEE Tran. Man & Cybernetics, 16, 1986. 423--427.  ",
      "doi": "10.1109/TSMC.1986.4308973"
    },
    {
      "text": "Findlater,L. and McGrenere,J. A comparison of static, adaptive, & adaptable menus. Proc. CHI'04, 89--96.  ",
      "doi": "10.1145/985692.985704"
    },
    {
      "text": "Fitts, P. The Information Capacity of the Human Motor System in Controlling the Amplitude of Movement. J. Experimental Psych., 47. 1954. 381--391.",
      "doi": ""
    },
    {
      "text": "Fitzmaurice, G., Khan, A., Pieke, R., Buxton, M. and Kurtenbach,G. Tracking menus. Proc. UIST'03, 71--79.  ",
      "doi": "10.1145/964696.964704"
    },
    {
      "text": "Greenberg, S. and Witten, I. Supporting Command Reuse. IJMMS, 39. 1993. 353--390.  ",
      "doi": "10.1006/imms.1993.1065"
    },
    {
      "text": "Gutwin, C. Improving Focus Targeting in Interactive Fisheye Views. Proc. CHI'02, 267--274.  ",
      "doi": "10.1145/503376.503424"
    },
    {
      "text": "Hansen, S., Kraut, R. and Farber, J. Interface Design and Multivariate Analyis of Unix commands. ACM TOIS, 2 (1). 1984. 42--57.  ",
      "doi": "10.1145/357417.357421"
    },
    {
      "text": "Hick, W. On the rate of gain of information. J. Experimental Psychology, 4. 1952. 11--36.",
      "doi": ""
    },
    {
      "text": "Hoffmann, E. and Lim, J. Concurrent manual-decision tasks. Ergonomics, 40 (3). 1997. 293--318.",
      "doi": ""
    },
    {
      "text": "Hornof, A. and Kieras, D. Cognitive Modeling Reveals Menu Search is Both Random and Systematic. Proc. CHI'97, 107--114.  ",
      "doi": "10.1145/258549.258621"
    },
    {
      "text": "Howes, A., Payne, S. and Woodward, A. The trouble with shortcuts. Proc. CHI'00, 267--268.  ",
      "doi": "10.1145/633292.633448"
    },
    {
      "text": "Hyman, R. Stimulus information as a determinant of reaction time. J. Experimental Psych., 45. 1953. 188--196.",
      "doi": ""
    },
    {
      "text": "John, B. and Kieras, D. The GOMS family of user interface analysis techniques: comparison and contrast. ACM TOCHI, 3 (4). 1996. 320--351.  ",
      "doi": "10.1145/235833.236054"
    },
    {
      "text": "Kaptelinin, V. Item Recognition in Menu Selection: The Effect of Practice. Proc. InterCHI'93., 183--184.  ",
      "doi": "10.1145/259964.260196"
    },
    {
      "text": "Kurtenbach, G., Sellen, A. and Buxton, W. An empirical evaluation of some articulatory & cognitive aspects of marking menus. JHCI, 8 (1). 1993. 1--23.",
      "doi": ""
    },
    {
      "text": "Landauer, T. and Nachbar, D. Selection from alphabetic and numeric menu trees using a touch screen: breadth, depth and width. Proc. CHI'85, 73--78.  ",
      "doi": "10.1145/317456.317470"
    },
    {
      "text": "Lane, D., Napier, H., Batsell, R. and Naman, J. Predicting the skilled use of hierarchical menus with the keystroke-level model. JHCI, 8 (2). 1993. 185--192.",
      "doi": ""
    },
    {
      "text": "Lee, E. and McGregor, J. Minimizing user search time in menu retrieval systems. Human Factors, 27 (2). 1985. 157--162.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. and Zhang, S. An empirical investigation of novice experience with soft keyboards. Behaviour & Info. Tech., 20. 2001. 411--418.",
      "doi": ""
    },
    {
      "text": "Miller, G. The Magical Number Seven, Plus or Minus Two: Some Limits on our Capacity for Processing Information. Psychological Review, 63. 1956. 81--97.",
      "doi": ""
    },
    {
      "text": "Nilsen, E. Perceptual-motor control in human computer interaction. Report 37, The Cognitive Sci. & Machine Intelligence Lab., Univ. Michegan, 1991.",
      "doi": "10.1145/126729.1056081"
    },
    {
      "text": "Sears, A., Jacko, J., Chu, J. and Moro, F. The role of visual search in the design of effective soft keyboards. Behavior and Info. Tech., 20. 2001. 159--156.",
      "doi": ""
    },
    {
      "text": "Sears, A. and Shneiderman, B. Split menus: Effectively using selection frequency to organize menus. ACM ToCHI., 1 (1). 2004. 27--51.  ",
      "doi": "10.1145/174630.174632"
    },
    {
      "text": "Seow, S. Information Theoretic Models of HCI: A Comparison of the Hick-Hyman Law and Fitts' Law. JHCI, 20 (3). 2005. 315--352.  ",
      "doi": "10.1207/s15327051hci2003_3"
    },
    {
      "text": "Shannon, C. and Weaver, W. The mathematical theory of communications. Urbana: Univ. Illinois Press, 1949. ",
      "doi": "10.5555/1102016"
    },
    {
      "text": "Somberg, B. A comparison of rule-based and positionally constant arrangements of computer menu items. Proc. CHI+GI '87, 255--260.  ",
      "doi": "10.1145/29933.275639"
    },
    {
      "text": "Soukoreff, R. and MacKenzie, I. Theoretical upper & lower bounds on typing speed using a stylus and soft keyboard. Behavior & Info. Tech, 14. 1995. 370--379.",
      "doi": ""
    },
    {
      "text": "Zipf, G. Human Behavior and the Principle of Least Effort: An Introduction to Human Ecology. Addison-Wesley, Reading, Mass., 1949.",
      "doi": ""
    }
  ]
}