{
  "doi": "10.1145/1240624.1240686",
  "title": "An exploration of web-based monitoring: implications for design",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "377-386",
  "year": 2007,
  "badges": [],
  "abstract": "Monitoring occurs when users return to previously viewed web pages to view new or updated information. While tools exist to support web-based monitoring, we know little about the monitoring activities users engage in and the nature of the support needed. We have conducted 40 semi-structured interviews in order to better understand the types of information users monitor and the characteristics of different monitoring activities. Using the data collected during the interviews, we characterized monitoring as an activity within six web information tasks: Browsing, Communications, Fact Finding, Information Gathering, Maintenance, and Transactions. The results of our study have been used to provide general, as well as task specific, recommendations for the design of monitoring tools.",
  "tags": [
    "revisitation",
    "semi-structured interviews",
    "task",
    "user behaviour",
    "web",
    "monitoring"
  ],
  "authors": [
    {
      "name": "Melanie Kellar",
      "institution": "Dalhousie University, Halifax, NS, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100339801",
      "orcid": "missing"
    },
    {
      "name": "Carolyn Watters",
      "institution": "Dalhousie University, Halifax, NS, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100083433",
      "orcid": "missing"
    },
    {
      "name": "Kori M. Inkpen",
      "institution": "Dalhousie University, Halifax, NS, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519232",
      "orcid": "0000-0001-5661-4659"
    }
  ],
  "references": [
    {
      "text": "Abrams, D., Baecker, R. and Chignell, M. (1998). Information Archiving with Bookmarks: Personal Web Space Construction and Organization. In Proc. of CHI '98, Los Angeles, CA, 41--48.  ",
      "doi": "10.1145/274644.274651"
    },
    {
      "text": "Bernard, H. R. (2000). Social Research Methods: Qualitative and Quantitative Approaches, Sage Publications.",
      "doi": ""
    },
    {
      "text": "Boardman, R. and Sasse, M. A. (2004). \"Stuff Goes into the Computer and Doesn't Come Out\": A Cross-Tool Study of Personal Information Management. In Proc. of CHI '04, Vienna, Austria, 583--590.  ",
      "doi": "10.1145/985692.985766"
    },
    {
      "text": "Bruce, H., Jones, W. and Dumais, S. (2004). Keeping and Re-Finding Information on the Web: What Do People Do and What Do They Need? In Proc. of ASIS&T 2004, Providence, RI, 129--137.",
      "doi": ""
    },
    {
      "text": "Cadiz, J. J., Venolia, G., Jancke, G. and Gupta, A. (2002). Designing and Deploying an Information Awareness Interface. In Proc. of CSCW 2002, New Orleans, LA, 314--323.  ",
      "doi": "10.1145/587078.587122"
    },
    {
      "text": "Capra, R. and Perez-Quinones, M. (2005). Using Web Search Engines to Find and Refind Information. Computer, 38(10): 36--42.  ",
      "doi": "10.1109/MC.2005.355"
    },
    {
      "text": "Chakravarthy, S., Sanka, A. and Jacob, A. J. (2004). A Learning-Based Approach for Fetching Pages in WebVigiL. In Proc. of SAC 2004, Nicosia, Cyprus, 1725--1731.  ",
      "doi": "10.1145/967900.968241"
    },
    {
      "text": "Choo, C. W., Detlor, B. and Turnbull, D. (2000). Information Seeking on the Web: An Integrated Model of Browsing and Searching. First Monday 5(2): http://firstmonday.org/issues/issues5_2/choo/index.html.",
      "doi": ""
    },
    {
      "text": "Cockburn, A. and McKenzie, B. (2001). What Do Web Users Do? An Empirical Analysis of Web Use. Int. J. Human-Computer Studies, 54(6): 903--922.  ",
      "doi": "10.1006/ijhc.2001.0459"
    },
    {
      "text": "Ellis, D. and Haugan, M. (1997). Modelling the Information Seeking Patterns of Engineers and Research Scientists in an Industrial Environment. J. of Documentation, 53(4): 384--403.",
      "doi": ""
    },
    {
      "text": "Forecastfox. http://forecastfox.mozdev.org.",
      "doi": ""
    },
    {
      "text": "Fujima, J., Lunzer, A., Hornbæk, K. and Tanaka, Y. (2004). Clip, Connect, Clone: Combining Application Elements to Build Custom Interfaces for Information Access. In Proc. of UIST 2004, Santa Fe, NM, 175--184.  ",
      "doi": "10.1145/1029632.1029664"
    },
    {
      "text": "Glance, N., Meunier, J.-L., Bernard, P. and Arregui, D. (2001). Collaborative Document Monitoring. In Proc. of GROUP '01, Boulder, CO, 171--178.  ",
      "doi": "10.1145/500286.500313"
    },
    {
      "text": "Greenberg, S. and Boyle, M. (2006). Generating Custom Notification Histories by Tracking Visual Differences between Web Page Visits. In Proc. of GI 2006, Quebec City, Canada, 227--234. ",
      "doi": "10.5555/1143079.1143117"
    },
    {
      "text": "Herder, E. (2005). Characterizations of User Web Revisit Behavior. In Proc. of Workshop on Adaptivity and User Modeling in Interactive Systems (ABIS 2005), Saarbrücken, Germany.",
      "doi": ""
    },
    {
      "text": "Kellar, M., Watters, C. and Shepherd, M. (2006). A Goal-Based Classification of Web Information Tasks. In Proc. of ASIS&T 2006, Austin, TX.",
      "doi": ""
    },
    {
      "text": "Kellar, M., Watters, C. and Shepherd, M. (2006). The Impact of Task on the Usage of Web Browser Navigation Mechanisms. In Proc. of GI 2006, Quebec City, Canada, 235--242. ",
      "doi": "10.5555/1143079.1143118"
    },
    {
      "text": "Liu, L., Tang, W., Buttler, D. and Pu, C. (2002). Information Monitoring on the Web: A Scalable Solution. World Wide Web Journal, 5(4): 263--304.  ",
      "doi": "10.1023/A%3A1021028509335"
    },
    {
      "text": "Mac OS X Dashboard Web Clips. http://www.apple.com/macosx/.",
      "doi": ""
    },
    {
      "text": "Marchionini, G. (1995). Information Seeking in Electronic Environments, Cambridge University Press. ",
      "doi": "10.5555/206740"
    },
    {
      "text": "Meho, L. and Tibbo, H. (2003). Modeling the Information-Seeking Behaviour of Social Scientists: Ellis' Study Revisisted. J. of the American Society for Information Science and Technology, 54(6): 570--587.  ",
      "doi": "10.1002/asi.10244"
    },
    {
      "text": "Morning Coffee. https://addons.mozilla.org/firefox/2677.",
      "doi": ""
    },
    {
      "text": "Morrison, J. B., Pirolli, P. and Card, S. K. (2001). A Taxonomic Analysis of What World Wide Web Activities Significantly Impact People's Decisions and Actions. In Proc. of CHI '01, Seattle, WA, 163--164.  ",
      "doi": "10.1145/634067.634167"
    },
    {
      "text": "NetMind. http://www.intellisync.com/.",
      "doi": ""
    },
    {
      "text": "Netvibes. http://www.netvibes.com/.",
      "doi": ""
    },
    {
      "text": "Page Update Checker. https://addons.mozilla.org/firefox/920.",
      "doi": ""
    },
    {
      "text": "Plaue, C., Miller, T. and Stasko, J. T. (2004). Is a Picture Worth a Thousand Words? An Evaluation of Information Awareness Displays. In Proc. of GI 2004, London, Canada, 117--126. ",
      "doi": "10.5555/1006058.1006073"
    },
    {
      "text": "Tauscher, L. and Greenberg, S. (1997). Revisitation Patterns in World Wide Web Navigation. In Proc. of CHI '97, Atlanta, GA, 22--27.  ",
      "doi": "10.1145/258549.258816"
    },
    {
      "text": "Young, K. S. (1996). Internet Addiction: The Emergence of a New Clinical Disorder. In Proc. of 104th Annual Meeting of the APA, Toronto, Canada, 237--244.",
      "doi": ""
    }
  ]
}