{
  "doi": "10.1145/1240624.1240864",
  "title": "Multiple mice for retention tasks in disadvantaged schools",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1581-1590",
  "year": 2007,
  "badges": [],
  "abstract": "This study evaluates single-mouse and multiple-mice configurations for computer-aided learning in schools where access to computers is limited due to resource constraints. Multimouse, a single display groupware solution, developed to allow multiple mice to be used simultaneously on a single PC, is compared with single-user-single-mouse and multiple-user-single-mouse scenarios. Multimouse itself is trialed with two unique interaction designs -- one where competitive interaction among students is encouraged, and another where more collaborative interaction is expected. Experiments were conducted with 238 schoolchildren from underprivileged households in rural India on an English vocabulary retention task. On the whole, Multimouse configurations (five users each) were found to be at par with single-user scenarios in terms of actual words learned by students. This suggests that the value of a PC can be inexpensively multiplied by employing a multi-input shared-use design. Gender effects were found, where boys show significant differences in learning depending on interaction modality, whereas girls learned at similar rates across configurations. In addition, a comparison of the two Multimouse modes -- collaborative and competitive -- showed the striking difference in learning outcomes and user behavior that is possible due to even slight variations in interaction designs for multiple-mice.",
  "tags": [
    "developing nations",
    "multiple mice",
    "education",
    "single display groupware",
    "shared computers"
  ],
  "authors": [
    {
      "name": "Udai Singh Pawar",
      "institution": "Microsoft Research India, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314484899",
      "orcid": "missing"
    },
    {
      "name": "Joyojeet Pal",
      "institution": "University of California at Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100249207",
      "orcid": "0000-0002-9076-2046"
    },
    {
      "name": "Rahul Gupta",
      "institution": "Microsoft Research India, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488530",
      "orcid": "missing"
    },
    {
      "name": "Kentaro Toyama",
      "institution": "Microsoft Research India, Bangalore, India",
      "img": "/do/10.1145/contrib-81100410420/rel-imgonly/kentarotoyamaportrait201411480x640.jpg",
      "acmid": "81100410420",
      "orcid": "0000-0002-9128-2255"
    }
  ],
  "references": [
    {
      "text": "Abnett, C., Stanton, D., Neale, H and O'Malley. The effect of multiple input devices on collaboration and gender issues. Proc. EuroCSCL (2001), 29--36.",
      "doi": ""
    },
    {
      "text": "Benford, S., Bederson, B. B., Åkesson, K., Bayon, V., Druin, A., Hansson, P., Hourcade, J. P., Ingram, R., Neale, H., O'Malley, C., Simsarian, K. T., Stanton, D., Sundblad, Y., and Taxén, G. Designing storytelling technologies to encouraging collaboration between young children. Proc. CHI '00, ACM Press (2000), 556--563.  ",
      "doi": "10.1145/332040.332502"
    },
    {
      "text": "Bier E.A, and Freeman S. MMM: A User Interface Architecture for Shared Editors on a Single Screen. Proc. UIST (1991), 79--86.  ",
      "doi": "10.1145/120782.120791"
    },
    {
      "text": "Bloom B.S. and David R.K., Taxonomy of Educational Objectives: The Classification of Educational Goals. Handbook I. Longmans, Green (1956), NY.",
      "doi": ""
    },
    {
      "text": "Bricker, L. Cooperatively Controlled Objects in Support of Collaboration. Ph.D. Thesis (1998), Univ. of Washington. ",
      "doi": "10.5555/926969"
    },
    {
      "text": "Bricker, L.J., Tanimoto, S.L., Rothenberg, A.I., Hutama, D.C., and Wong, T.H. Multiplayer Activities that Develop Mathematical Coordination. Proc. CSCL (1995), 32--39.  ",
      "doi": "10.3115/222020.222049"
    },
    {
      "text": "Druin, A., Revelle, G., Bederson, B. B., Hourcade, J. P., Farber, A., Lee, J., & Campbell, D. A Collaborative Digital Library for Children: A Descriptive Study of Children's Collaborative Behaviors. J. Computer-Assisted Learning 19, 2 (2003), 239--248.",
      "doi": ""
    },
    {
      "text": "Ebbinghaus, H. Memory: A Contributon to Experimental Psychology. Dover Publications (1964), New York, NY.",
      "doi": ""
    },
    {
      "text": "Inkpen K., Booth K.S., Gribble S.D., and Klawe M. Give and Take: Children Collaborating on One Computer. Short papers in CHI' 95, ACM Press (1995), 258--259.  ",
      "doi": "10.1145/223355.223663"
    },
    {
      "text": "Inkpen, K., Booth, K. S., Klawe, M., and Upitis, R. Playing together beats playing apart, especially for girls. Proc. CSCL (1995), 177--181.  ",
      "doi": "10.3115/222020.222164"
    },
    {
      "text": "Inkpen, K., Ho-Ching, W., Kuederle, O., Scott, S.D., & Shoemaker, G. This is fun! We're all best friends and we're all playing.: Supporting children's synchronous collaboration. Proc. CSCL (1999), 252--259. ",
      "doi": "10.5555/1150240.1150271"
    },
    {
      "text": "Inkpen, K., McGrenere, J., Booth, K. S., and Klawe, M. The effect of turn-taking protocols on children's learning in mouse-driven collaborative environments. Proc. GI (1997), 138--145. ",
      "doi": "10.5555/266774.266793"
    },
    {
      "text": "Kam, M. Notes Towards a Framework for Designing Mobile Games for Children in the Developing World to Learn English as a Second Language in Out-of-School Settings. Proc. DREAM 2006 (2006).",
      "doi": ""
    },
    {
      "text": "Mitra, S., Dangwal, R., Chatterjee, S, Jha, S., Bisht, R.S., and Kapur, P. Acquisition of computing literacy on shared public computers: Children and the 'Hole in the Wall'. Australasian Journal of Educational Technology 21, 3 (2005), 407--426.",
      "doi": ""
    },
    {
      "text": "Myers, B.A., Stiehl, H, and Gargiulo, R . Collaboration using multiple PDAs connected to a PC. Proc. CSCW (1998), 285--294.  ",
      "doi": "10.1145/289444.289503"
    },
    {
      "text": "O'Leary-Kelly, A., Mortochhio, J, Frink, D. 1994. A Review of the Influence of Group Goals on Group Performance. Academy of Management Journal 37, 5(1994), 1285--1301.",
      "doi": ""
    },
    {
      "text": "Oppenheimer, T. The Flickering Mind. Random House Publishers (2003).",
      "doi": ""
    },
    {
      "text": "Pal, J., Pawar, U., Brewer, E., and Toyama, K. The case for multi-user design for computer aided learning in developing regions. Proc. WWW 2006, ACM Press (2006), 781--789.  ",
      "doi": "10.1145/1135777.1135896"
    },
    {
      "text": "Pawar, U. S., Pal, J., and Toyama, K. Multiple mice for computers in education in developing countries. Proc. IEEE/ACM ICTD (2006), 64--71.",
      "doi": ""
    },
    {
      "text": "Pederson, E.R., K. McCall, T. P. Moran, and F. G. Halasz. Tivoli: An electronic whiteboard for informal workgroup meetings. Proc. CHI '93, ACM Press (2003), 391--398.  ",
      "doi": "10.1145/169059.169309"
    },
    {
      "text": "Scott, S., Mandryk, R., and Inkpen, K. Understanding Children's Interactions in Synchronous Shared Environments. Proc. CSCL (2002), 333--341. ",
      "doi": "10.5555/1658616.1658664"
    },
    {
      "text": "Scott, S.D., Mandryk, R.L., and Inkpen, K.M. Understanding Children's Collaborative Interactions in Shared Environments. J. CAL 19, 2 (2003), 220--228.",
      "doi": ""
    },
    {
      "text": "Shen, C. Multi-user interface and interactions on direct-touch horizontal surfaces: collaborative tabletop research at MERL. Proc. IEEE TableTop (2006), 53--56.  ",
      "doi": "10.1109/TABLETOP.2006.22"
    },
    {
      "text": "Shoemaker G.B.D. Single Display Groupware research in the year 2000. TR2001-1 (2001), Simon Fraser University.",
      "doi": ""
    },
    {
      "text": "Siriginidi S.R. Bridging digital divide: Efforts in India, Telematics and Informatics 22, 4 (2006), 361--375.  ",
      "doi": "10.1016/j.tele.2005.01.007"
    },
    {
      "text": "Stanton D., and Neale H.R. The Effects of Multiple Mice on Children's talk and Interaction. J. Computer Assisted Learning 19, 2 (2003), 220--228.",
      "doi": ""
    },
    {
      "text": "Stanton, D., Neale, H. and Bayon, V. Interfaces to support children's co-present collaboration: multiple mice and tangible technologies. Proc. CSCL (2002), 342--352. ",
      "doi": "10.5555/1658616.1658665"
    },
    {
      "text": "Stewart J., Bederson B., and Druin A. Single Display Groupware: A model for Co-present Collaboration. Proc. CHI '99, ACM Press (1999), 286--293.  ",
      "doi": "10.1145/302979.303064"
    },
    {
      "text": "Stewart J., Raybourn E., Bederson B., and Druin A. When Two Hands are Better Than One: Enhancing Collaboration Using Single Display Groupware. Ext.Abst. CHI '98, ACM Press (1998), 287--288.  ",
      "doi": "10.1145/286498.286766"
    }
  ]
}