{
  "doi": "10.1145/1240624.1240704",
  "title": "Research through design as a method for interaction design research in HCI",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "493-502",
  "year": 2007,
  "badges": [],
  "abstract": "For years the HCI community has struggled to integrate design in research and practice. While design has gained a strong foothold in practice, it has had much less impact on the HCI research community. In this paper we propose a new model for interaction design research within HCI. Following a research through design approach, designers produce novel integrations of HCI research in an attempt to make the right thing: a product that transforms the world from its current state to a preferred state. This model allows interaction designers to make research contributions based on their strength in addressing under-constrained problems. To formalize this model, we provide a set of four lenses for evaluating the research contribution and a set of three examples to illustrate the benefits of this type of research.",
  "tags": [
    "wicked problems",
    "research through design",
    "HCI research",
    "design",
    "design theory",
    "design method",
    "interaction design",
    "interaction design research"
  ],
  "authors": [
    {
      "name": "John Zimmerman",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81406592256/rel-imgonly/headshot2010.jpg",
      "acmid": "81406592256",
      "orcid": "missing"
    },
    {
      "name": "Jodi Forlizzi",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100492013",
      "orcid": "missing"
    },
    {
      "name": "Shelley Evenson",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100302617",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexander, C., Ishikawa, S., Silverstein, M., Jacobson, M., Fiksdahl-King, I., Angel, S. A Pattern Language: Towns, Buildings, Construction. Oxford University Press, 1977.",
      "doi": ""
    },
    {
      "text": "Apple Computer, Inc. Macintosh Human Computer Interface Guidelines, Addison-Wesley Professional, Reading, MA, 1992. ",
      "doi": "10.5555/573097"
    },
    {
      "text": "Bayazit, N. Investigating Design: A Review of Forty Years of Design Research. Design Issues 20, 1 (2004), 16--29.",
      "doi": ""
    },
    {
      "text": "Buchanan, R. Design Research and the New Learning. Design Issues 17, 4 (2001), 3--23.",
      "doi": ""
    },
    {
      "text": "Blevis, E., Lim, Y.K., & Stolterman, E. Regarding Software as a Material of Design. Proc. of Wonderground, Design Research Society, (2006).",
      "doi": ""
    },
    {
      "text": "Chung, Eric, Jason I. Hong, James Lin, Madhu K. Prabaker, James A. Landay, and Alan Liu. Development and Evaluation of Emerging Design Patterns for Ubiquitous Computing. Proc. DIS 2004, ACM Press (2004), 233--242.  ",
      "doi": "10.1145/1013115.1013148"
    },
    {
      "text": "Cross, N. Design Research: A Disciplined Conversation. Design Issues 15, 2 (1999), 5--10.",
      "doi": ""
    },
    {
      "text": "Cross, N. Designerly Ways of Knowing: Design Discipline Versus Design Science. Design Issues 17, 3 (2001), 49--55.",
      "doi": ""
    },
    {
      "text": "Dunne, A., Raby. F. Design Noir: The Secret Life of Electronic Objects. Birkhäuser, Basel, Switzerland, 2001.",
      "doi": ""
    },
    {
      "text": "Gaver, WW., Bowers, J., Boucher, A., Gellerson, H., Pennington, S., Schmidt, A., Steed, A., Villars, N., Walker, B. The drift table: designing for ludic engagement. Ext. Abstracts CHI '04, ACM Press (2004), 885--900.  ",
      "doi": "10.1145/985921.985947"
    },
    {
      "text": "Kidd, C.D., Orr, R., Abowd, G.D., Atkeson, C.G., Essa, I.A., MacIntyre, B., Mynatt, E.D., Starner, T., Newstetter, W. The Aware Home: A Living Laboratory for Ubiquitous Computing Research, Proc. of the Second International Workshop on Cooperative Buildings, Integrating Information, Organization, and Architecture, (1999) 191--198. ",
      "doi": "10.5555/645969.674887"
    },
    {
      "text": "Fallman, D. Design-Oriented Human-Computer Interaction. Proc. CHI 2003, ACM Press (2003), 225--232.  ",
      "doi": "10.1145/642611.642652"
    },
    {
      "text": "Fallman, D. Why Research-Oriented Design Isn't Design-Oriented Research. Proc. NordiCHI 2005, Umea Institute of Design Press (2005).",
      "doi": ""
    },
    {
      "text": "Frayling, C. Research in Art and Design. Royal College of Art Research Papers 1, 1 (1993),1--5.",
      "doi": ""
    },
    {
      "text": "Laurel B. Design Research: Methods and Perspectives. MIT Press, Cambridge, MA, 2003. ",
      "doi": "10.5555/971109"
    },
    {
      "text": "Löwgren, J. Applying Design Methodology to Software Development. Proc. of DIS 1995, ACM Press (1995), 87--95.  ",
      "doi": "10.1145/225434.225444"
    },
    {
      "text": "Nelson, H.G. and Stoltermann, E. The Design Way: intentional change in an unpredictable world. Educational Technology Publications, Englewood Cliffs, NJ, 2003. ",
      "doi": "10.5555/861852"
    },
    {
      "text": "Oren, T., Salomon, G., Kreitman, K., Don, A.: Guides: Characterizing the Interface. In (Eds: Laurel, B.): The Art of Human-Computer Interface Design, Addison-Wesley (1990) 355--365.",
      "doi": ""
    },
    {
      "text": "Philips Design, Vision of the Future V&K (1995).",
      "doi": ""
    },
    {
      "text": "Rheinfrank, J., Hartman, W., Wasserman, A., Design for usability: crafting a strategy for the design of a new generation of Xerox copiers, Usability: turning technologies into tools, Oxford University Press, Inc., New York, NY, 1992. ",
      "doi": "10.5555/146329.146334"
    },
    {
      "text": "Rittel, H.W.J., Webber, M.M. Dilemmas in a General Theory of Planning. Policy Sciences 4, 2 (1973), 155--66.",
      "doi": ""
    },
    {
      "text": "Schön, D.A. The Reflective Practitioner: How professionals think in action. Temple Smith, London, 1983.",
      "doi": ""
    },
    {
      "text": "Simon, H.A. The Sciences of the Artificial, MIT Press, Cambridge, MA, 1969. ",
      "doi": "10.5555/237774"
    },
    {
      "text": "van Duyne, D.K., Landay, J.A., Hong, J. I. The Design of Sites: Principles, Processes, and Patterns for Crafting a Customer-Centered Web Experience, Addison-Wesley, Reading, MA, 2003. ",
      "doi": "10.5555/548998"
    },
    {
      "text": "Wolf, T.V., Rode, J.A., Sussman, J., Kellogg, W.A. Dispelling Design as the 'Black Art' of Chi. Proc. of CHI 2006, ACM Press (2006), 521--530.  ",
      "doi": "10.1145/1124772.1124853"
    },
    {
      "text": "Wright, P., Blythe, M., McCarthy, J. User Experience and the Idea of Design in HCI. Lecture Notes in Computer Science, Stephen W. Gilroy and Michael D. Harrison eds. Springer, Berlin/Heidelberg (2006). 1--14.  ",
      "doi": "10.1007/11752707_1"
    },
    {
      "text": "Xerox Corporation. Design Guidelines: Industrial design and Human Factors for Reprographics Products (1985).",
      "doi": ""
    },
    {
      "text": "Xerox Corporation. Principles for Constructing Communicative Objects and Object Systems as Interactive Dialogs (1985).",
      "doi": ""
    }
  ]
}