{
  "doi": "10.1145/1240624.1240732",
  "title": "Understanding and developing models for detecting and differentiating breakpoints during interactive tasks",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "697-706",
  "year": 2007,
  "badges": [],
  "abstract": "The ability to detect and differentiate breakpoints during task execution is critical for enabling defer-to-breakpoint policies within interruption management. In this work, we examine the feasibility of building statistical models that can detect and differentiate three granularities (types) of perceptually meaningful breakpoints during task execution, without having to recognize the underlying tasks. We collected ecological samples of task execution data, and asked observers to review the interaction in the collected videos and identify any perceived breakpoints and their type. Statistical methods were applied to learn models that map features of the interaction to each type of breakpoint. Results showed that the models were able to detect and differentiate breakpoints with reasonably high accuracy across tasks. Among many uses, our resulting models can enable interruption management systems to better realize defer-to-breakpoint policies for interactive, free-form tasks.",
  "authors": [
    {
      "name": "Shamsi T. Iqbal",
      "institution": "University of Illinois, Urbana, IL",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495796",
      "orcid": "0000-0002-9380-8759"
    },
    {
      "name": "Brian P. Bailey",
      "institution": "University of Illinois, Urbana, IL",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100615948",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adamczyk, P.D. and B.P. Bailey. If Not Now When? The Effects of Interruptions at Different Moments within Task Execution. CHI, 2004, 271--278.  ",
      "doi": "10.1145/985692.985727"
    },
    {
      "text": "Altheide, D.L. Qualitative Media Analysis. Sage, Newbury Park, CA, 1996.",
      "doi": ""
    },
    {
      "text": "Baeza-Yates, R.A. and B. Ribeiro-Neto Modern Information Retrieval. Addison-Wesley, Boston, 1999. ",
      "doi": "10.5555/553876"
    },
    {
      "text": "Bailey, B.P., P.D. Adamczyk, T.Y. Chang and N.A. Chilson. A Framework for Specifying and Monitoring User Tasks. Journal of Computers in Human Behavior, 22 (4), 2006, 685--708.",
      "doi": ""
    },
    {
      "text": "Bailey, B.P. and J.A. Konstan. On the Need for Attention Aware Systems: Measuring Effects of Interruption on Task Performance, Error Rate, and Affective State. Journal of Computers in Human Behavior, 22 (4), 2006, 709--732.",
      "doi": ""
    },
    {
      "text": "Card, S., T. Moran and A. Newell The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, Hillsdale, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Czerwinski, M., E. Cutrell and E. Horvitz. Instant Messaging: Effects of Relevance and Timing. People and Computers XIV: Proceedings of HCI, 2000, 71--76.",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., E. Horvitz and S. Wilhite. A Diary Study of Task Switching and Interruptions. CHI, 2004, 175--182.  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Dragunov, A.N., T.G. Dietterich, K. Johnsrude, M. McLaughlin, L. Li and J.L. Herlocker. Tasktracer: A Desktop Environment to Support Multi-Tasking Knowledge Workers. Proc. IUI, 2005, 75--82.  ",
      "doi": "10.1145/1040830.1040855"
    },
    {
      "text": "Fogarty, J., S.E. Hudson and J. Lai. Examining the Robustness of Sensor-Based Statistical Models of Human Interruptibility. CHI, 2004, 207--214.  ",
      "doi": "10.1145/985692.985719"
    },
    {
      "text": "Fogarty, J., A.J. Ko, H.H. Aung, E. Golden, K.P. Tang and S.E. Hudson. Examining Task Engagement in Sensor-Based Statistical Models of Human Interruptibility. CHI, 2005, 331--340.  ",
      "doi": "10.1145/1054972.1055018"
    },
    {
      "text": "Gonzalez, V.M. and G. Mark. \"Constant, Constant, Multi-Tasking Craziness\": Managing Multiple Working Spheres. CHI, 2004, 113--120.  ",
      "doi": "10.1145/985692.985707"
    },
    {
      "text": "Hall, M.A. Correlation-Based Feature Selection for Discrete and Numeric Class Machine Learning. Proceedings of the 17th International Conference on Machine Learning, 2000, 359--366. ",
      "doi": "10.5555/645529.657793"
    },
    {
      "text": "Hanson, C. and W. Hirst. On the Representation of Events: A Study of Orientation, Recall, and Recognition. Journal of Experimental Psychology: General, 118 (2), 1989, 136--147.",
      "doi": ""
    },
    {
      "text": "Henderson, A. and S.K. Card. Rooms: The Use of Multiple Virtual Workspaces to Reduce Space Contention in a Window-Based Graphical User Interface. ACM TOG, 5 (3), 1986, 211--243.  ",
      "doi": "10.1145/24054.24056"
    },
    {
      "text": "Ho, J. and S. Intille. Using Context--Aware Computing to Reduce the Perceived Burden of Interruptions from Mobile Devices. CHI, 2005, 909--918.  ",
      "doi": "10.1145/1054972.1055100"
    },
    {
      "text": "Horvitz, E., P. Koch and J. Apacible. Busybody: Creating and Fielding Personalized Models of the Cost of Interruption. CSCW, 2004, 507--510.  ",
      "doi": "10.1145/1031607.1031690"
    },
    {
      "text": "Iqbal, S.T. and B.P. Bailey. Investigating the Effectiveness of Mental Workload as a Predictor of Opportune Moments for Interruption. CHI, 2005, 1489--1492.  ",
      "doi": "10.1145/1056808.1056948"
    },
    {
      "text": "Iqbal, S.T. and B.P. Bailey. Leveraging Characteristics of Task Structure to Predict Costs of Interruption. CHI, 2006, 741--750.  ",
      "doi": "10.1145/1124772.1124882"
    },
    {
      "text": "John, B.E. and D.E. Kieras. The GOMS Family of User Interface Analysis Techniques: Comparison and Contrast. ACM TOCHI, 3 (4), 1996, 320--351.  ",
      "doi": "10.1145/235833.236054"
    },
    {
      "text": "Mark, G., V.M. Gonzalez and J. Harris. No Task Left Behind? Examining the Nature of Fragmented Work. CHI, 2005, 321--330.  ",
      "doi": "10.1145/1054972.1055017"
    },
    {
      "text": "Nair, R., S. Voida and E. Mynatt. Frequency--Based Detection of Task Switches. Proceedings of the 19th British HCI Group Annual Conference, 2005, 94--99.",
      "doi": ""
    },
    {
      "text": "Newtson, D. Attribution and the Unit of Perception of Ongoing Behavior. Journal of Personality and Social Psychology, 28 (1), 1973, 28--38.",
      "doi": ""
    },
    {
      "text": "Newtson, D. and G. Engquist. The Perceptual Organization of Ongoing Behavior. Journal of Experimental Social Psychology, 12, 1976, 436--450.",
      "doi": ""
    },
    {
      "text": "Newtson, D., G. Enquist and J. Bois. The Objective Basis of Behavior Units. Journal of Personality and Social Psychology, 35 (12), 1977, 847--862.",
      "doi": ""
    },
    {
      "text": "Rizzolatti, G., L. Fadiga, V. Gallese and L. Fogassi. Premotor Cortex and the Recognition of Motor Actions. Cognitive Brain Research, 3, 1996, 131--141.",
      "doi": ""
    },
    {
      "text": "Shen, J., L. Li, T. Dietterich and J. Herlocker. A Hybrid Learning System for Recognizing User Tasks from Desktop Activities and Email Messages. Proc. IUI, 2006, 86--92.  ",
      "doi": "10.1145/1111449.1111473"
    },
    {
      "text": "Zacks, J., B. Tversky and G. Iyer. Perceiving, Remembering, and Communicating Structure in Events. Journal of Experimental Psychology: General, 130 (1), 2001, 29--58.",
      "doi": ""
    },
    {
      "text": "Zacks, J.M. and B. Tversky. Event Structure in Perception and Conception. Psychological Bulletin, 127, 2001, 3--21.",
      "doi": ""
    }
  ]
}