{
  "doi": "10.1145/1240624.1240810",
  "title": "Social practices in location-based collecting",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1225-1234",
  "year": 2007,
  "badges": [],
  "abstract": "The use of location-based technology to augment visitor experiences has received considerable attention over the years. In this paper, we take an alternative perspective on these kinds of location-based experiences by focussing on the collecting and keeping of location-based content as opposed to simply the in situ consumption of content. We describe a trial of a location-based experience at London zoo in which mobile camera phones were used to access digital content at particular animal enclosures around the zoo. Through the fieldwork we demonstrate ways in which collecting and keeping have important social values over and above simply consuming the content in situ. More specifically, the role of the collection of location-based content in identity work; in developing a sense of challenge and achievement; in defining a sense of group camaraderie; and in creating a playful sense of competition among group members. Further, we see how narratives told around the collected location-based content over time imbue it with additional value. These narratives become part of the resources through which relationships with family and friends get actively constructed. We discuss how these aspects have different design implications from the in-situ consumption model of location-based experiences and tensions this introduces.",
  "tags": [
    "mobile phones",
    "situated displays",
    "visitor experience",
    "collecting",
    "zoo",
    "2D barcodes",
    "location-based computing"
  ],
  "authors": [
    {
      "name": "Kenton O'Hara",
      "institution": "Hewlett-Packard Labs, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452615958",
      "orcid": "missing"
    },
    {
      "name": "Tim Kindberg",
      "institution": "Hewlett-Packard Labs, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100650307",
      "orcid": "missing"
    },
    {
      "name": "Maxine Glancy",
      "institution": "BBC, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81344491064",
      "orcid": "missing"
    },
    {
      "name": "Luciana Baptista",
      "institution": "BBC, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328487482",
      "orcid": "missing"
    },
    {
      "name": "Byju Sukumaran",
      "institution": "BBC, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328490712",
      "orcid": "missing"
    },
    {
      "name": "Gil Kahana",
      "institution": "BBC, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488673",
      "orcid": "missing"
    },
    {
      "name": "Julie Rowbotham",
      "institution": "BBC, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328490325",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abowd, G.D., Atkeson, C.G., Hong, J., Long, S., Kooper, R. and Pinkerton, M. (1997) Cyberguide: A Mobile Context-Aware Tour Guide. ACM Wireless Networks, 3(3): 421--433.  ",
      "doi": "10.1023/A%3A1019194325861"
    },
    {
      "text": "Aoki, P., M., Grinter, R., E., Hurst, A., Szymanski, M., H., Thornton, J., D. & Woodruff, A. (2002). Sotto voce: exploring the interplay of conversation and mobile audio spaces. In Proceedings of CHI '02, Minneapolis, Minnesota, USA.  ",
      "doi": "10.1145/503376.503454"
    },
    {
      "text": "Bal, M. (1994) Telling Objects: A Narrative Perspective on Collecting. In Elsner, J. & Cardinal, R. (Eds) The Cultures of Collecting. Harvard: Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Barkhuus, L. and Brown, B. (2006) The television will be revolutionised: effects of PVRs and filesharing on television watching. In Proceedings of CHI '06, Montreal, Canada. New York: ACM Press.  ",
      "doi": "10.1145/1124772.1124870"
    },
    {
      "text": "Baudrillard, J. (1994) The System of Collecting. In Elsner, J. & Cardinal, R. (Eds) The Cultures of Collecting. Harvard: Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Belk, R. W., Wallendorf, M., Sherry, J. F. & Holbrook, M. B. (1991) Collecting in a Consumer Culture. In Belk, R.W. & Wallendorf, W. (Eds) Highways and Buyways: Naturalistic Research from the Consumer Odyssey. Association for Consumer Research.",
      "doi": ""
    },
    {
      "text": "Bellotti, F., Berta, R., de Gloria, A. & Margarone, M. (2002) User Testing a Hypermedia Tour Guide. IEEE Pervasive Computing, 1(2): 33--41.  ",
      "doi": "10.1109/MPRV.2002.1012335"
    },
    {
      "text": "Bilsland, C. (2002). Collecting Oneself: The meaning of objects in the home. Central Saint Martins College of Art and Design, London.",
      "doi": ""
    },
    {
      "text": "Brown, B. & Chalmers, M. (2003). Tourism and Mobile Technology. In Proceedings of ECSCW '03, Helsinki, Finland. ",
      "doi": "10.5555/1241889.1241907"
    },
    {
      "text": "Brown, B., MacColl, I., Bell, M., Chalmers, M. & Greenahalgh, C. (2005). Sharing the Square: collaborative leisure in city streets. In Proceedings of ECSCW '05, Paris, France. ",
      "doi": "10.5555/1242029.1242051"
    },
    {
      "text": "Brown, B., Geelhoed, E. and Sellen, A., 2001, Music sharing as a computer supported collaborative application. In Proceedings of ECSCW 2001, Bonn, Germany, 179--198. ",
      "doi": "10.5555/1241867.1241877"
    },
    {
      "text": "Cheverst, K., Davies, N., Mitchell, K. & Friday, A. (2000). Experiences of developing and deploying a context-aware tourist guide: the GUIDE project. In Proceedings of the 6th Annual International Conference on Mobile Computing and Networking. Boston, Massachusetts, United States: ACM Press.  ",
      "doi": "10.1145/345910.345916"
    },
    {
      "text": "Cheverst, K., Davies, N., Mitchell, K., Friday, A. & Efstratiou, C. (2000). Developing a context-aware electronic tourist guide: some issues and experiences. In Proceedings of CHI 2000, The Hague, The Netherlands.  ",
      "doi": "10.1145/332040.332047"
    },
    {
      "text": "Christ, E. A. (1965) The \"retired\" stamp collector: Economic and other functions of a systematised leisure activity. In Rose, A.M. & Peterson, W. A. (Eds) Older people and their social world: The subculture of aging. F.A. Davis Co.",
      "doi": ""
    },
    {
      "text": "Cole, H., Stanton, D., (2003). Designing mobile technologies to support co-present collaboration. Personal and Ubiquitous Computing, 7(6), pp. 365--371.  ",
      "doi": "10.1007/s00779-003-0249-4"
    },
    {
      "text": "DeVault, Marjorie L., (2000). Producing Family Time: Practices of Leisure Activity Beyond the Home. Qualitative Sociology, 23(4), pp. 485--503.",
      "doi": ""
    },
    {
      "text": "Fleck, M., Frid, M., Kindberg, T., O'Brien-Strain, E., Rajani, R. & Spasojevic, M. (2002) From Informing to Remembering: Ubiquitous Systems in Interactive Museums. IEEE Pervasive Computing 1(2): 13--21.  ",
      "doi": "10.1109/MPRV.2002.1012333"
    },
    {
      "text": "Fournier, S. & Richins, M. L. (1991) Some theoretical and popular notions concerning materialism. Journal of Social Behaviour and Personality 6: 403--414.",
      "doi": ""
    },
    {
      "text": "Grinter, R., E., Aoki, P., M., Szymanski, M., H., Thornton, J., D., Woodruff, A. & Hurst, A. (2002). Revisiting the visit: understanding how technology can shape the museum visit. In Proceedings of CSCW '02, New Orleans, Louisiana, USA: ACM Press.  ",
      "doi": "10.1145/587078.587100"
    },
    {
      "text": "Heath, C. & vom Lehn, D. (2004) Configuring Reception: (Dis-)Regarding the 'Spectator' in Museums and Galleries. Theory, Culture and Society 21(6): 43--65.",
      "doi": ""
    },
    {
      "text": "Kindberg, T., Spasojevic, M., Fleck, R. & Sellen, A. (2005). I saw this and thought of you: some social uses of camera phones. In Extended Abstracts of CHI '05, Portland, OR, USA.  ",
      "doi": "10.1145/1056808.1056962"
    },
    {
      "text": "McIntosh, W. D. & Schmeichel, B. (2004) Collectors and Collecting: A Social Psychological Perspective. Leisure Sciences 26: 85--97.",
      "doi": ""
    },
    {
      "text": "O'Hara, K., Slayden-Mitchell, A. and Vorbau, A. (2007) Consuming Video on Mobile Devices. In Proceedings of CHI '07, San Jose, CA.  ",
      "doi": "10.1145/1240624.1240754"
    },
    {
      "text": "O'Hara, K. & Perry, M. (2003). User Centred Opportunities for Supporting Consumer Behaviour through Handheld and Ubiquitous Computing, Proceedings of HICSS '03 - Track 9 - Volume 9: IEEE Computer Society. ",
      "doi": "10.5555/820756.821841"
    },
    {
      "text": "Pearce, S. (1992) Museums, Objects and Collections: A Cultural Study. Leicester University Press.",
      "doi": ""
    },
    {
      "text": "Reid, J., Hull, R., Melamed, T. and Clayton, B. (2006) Scape the Hood: A Design Case Study of a Location Based Digital Story Mediascape. In Proceedings of DIME '06, Bangkok, Thailand.",
      "doi": ""
    },
    {
      "text": "Tajfel, H. (1982) Social psychology of intergroup relations. Annual Review of Psychology 33: 1--39.",
      "doi": ""
    },
    {
      "text": "Toye, E., Madhavapeddy, A., Sharp, R., Scott, D., Blackwell, A. & Upton, E. (2004). Using camera-phones to interact with context-aware mobile services (No. ISSN 1476-2986). Cambridge: Cambridge University Computer Laboratory.",
      "doi": ""
    },
    {
      "text": "Voida, A., Grinter, R.E., Ducheneaut, N., Edwards, W.K., & Newman, M.W. (2005) Listening in: Practices surrounding iTunes music sharing. In Proceedings of CHI '05, Portland, OR. New York: ACM Press.  ",
      "doi": "10.1145/1054972.1054999"
    },
    {
      "text": "vom Lehn, D. & Heath, C. (2005) Accounting for New Technology in Museum Exhibitions. International Journal of Arts Management 7(3).",
      "doi": ""
    },
    {
      "text": "Weilenmann, A., & Larsson, C. (2001). Local Use and Sharing of Mobile Phones. In B. Brown, N. Green & R. Harper (Eds.) Wireless World: Social and Interactional Aspects of the Mobile Age. Godalming and Heidelberg: Springer Verlag, pp. 99--115. ",
      "doi": "10.5555/510801.510811"
    },
    {
      "text": "Woodruff, A., Szymanski, M., H., Aoki, P., M. & Hurst, A. (2001). The Conversational Role of Electronic Guidebooks. In Proceedings of the 3rd international conference on Ubiquitous Computing. Atlanta, Georgia, USA: Springer-Verlag. ",
      "doi": "10.5555/647987.741321"
    }
  ]
}