{
  "doi": "10.1145/1240624.1240683",
  "title": "Over-exposed?: privacy patterns and considerations in online and mobile photo sharing",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "357-366",
  "year": 2007,
  "badges": [],
  "abstract": "As sharing personal media online becomes easier and widely spread, new privacy concerns emerge - especially when the persistent nature of the media and associated context reveals details about the physical and social context in which the media items were created. In a first-of-its-kind study, we use context-aware camerephone devices to examine privacy decisions in mobile and online photo sharing. Through data analysis on a corpus of privacy decisions and associated context data from a real-world system, we identify relationships between location of photo capture and photo privacy settings. Our data analysis leads to further questions which we investigate through a set of interviews with 15 users. The interviews reveal common themes in privacy considerations: security, social disclosure, identity and convenience. Finally, we highlight several implications and opportunities for design of media sharing applications, including using past privacy patterns to prevent oversights and errors.",
  "tags": [
    "photos",
    "privacy",
    "social software",
    "online content",
    "photo sharing",
    "context-aware",
    "location-aware"
  ],
  "authors": [
    {
      "name": "Shane Ahern",
      "institution": "Yahoo! Research Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309491108",
      "orcid": "missing"
    },
    {
      "name": "Dean Eckles",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350568241",
      "orcid": "missing"
    },
    {
      "name": "Nathaniel S. Good",
      "institution": "Yahoo! Research Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81423596141",
      "orcid": "missing"
    },
    {
      "name": "Simon King",
      "institution": "Yahoo! Research Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488677",
      "orcid": "missing"
    },
    {
      "name": "Mor Naaman",
      "institution": "Yahoo! Research Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100585927",
      "orcid": "0000-0002-6436-3877"
    },
    {
      "name": "Rahul Nair",
      "institution": "Yahoo! Research Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489425",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Acquisti, A. and Grossklags, J. Privacy and Rationality: Preliminary Evidence from Pilot Data. In Proc. WEIS 2004.",
      "doi": ""
    },
    {
      "text": "Acquisti, A. and Gross, R. Imagined Communities: Awareness, Information Sharing, and Privacy on the Facebook. Privacy Enhancing Technologies (2006).",
      "doi": ""
    },
    {
      "text": "Barkhuus, L., Dey, A.K. Location-based services for mobile telephony: a study of users' privacy concerns. In Proc. Interact 2003, (2003) 709--712.",
      "doi": ""
    },
    {
      "text": "Barnes, S. A privacy paradox: Social networking in the United States. First Monday 10, 9 (2006).",
      "doi": ""
    },
    {
      "text": "Bellotti, V. and Sellen, A. Design for Privacy in Ubiquitous Computing Environments. In Proc. ECSCW 1993, Kluwer (1993), 77--92. ",
      "doi": "10.5555/1241934.1241940"
    },
    {
      "text": "Bellotti, V. What You Don't Know Can Hurt You: Privacy in Collaborative Computing. In Proc. HCI on People and Computers XI, ACM Press (1996), 241--261. ",
      "doi": "10.5555/646683.702613"
    },
    {
      "text": "Consolvo, S., Smith, I. E., Matthews, T., LaMarca, A., Tabert, J., and Powledge, P. Location disclosure to social relations: why, when, & what people want to share. In Proc. CHI 2005, ACM Press (2005), 81--90.  ",
      "doi": "10.1145/1054972.1054985"
    },
    {
      "text": "Flickr -- http://flickr.com",
      "doi": ""
    },
    {
      "text": "Gemmell, J., Williams, L., Wood, K., Lueder, R., and Bell, G. Passive capture and ensuing issues for a personal lifetime store. In Proc. CARPE 2004, ACM Press (2004), 48--55.  ",
      "doi": "10.1145/1026653.1026660"
    },
    {
      "text": "Good, N. S. and Krekelberg, A. Usability and privacy: a study of Kazaa P2P file-sharing. In Proc. CHI '03. ACM Press (2003), 137--144.  ",
      "doi": "10.1145/642611.642636"
    },
    {
      "text": "Gruteser, M. and Grunwald, D. Enhancing location privacy in wireless LAN through disposable interface identifiers: a quantitative analysis. Mob. Netw. Appl. 10, 3 (2005), 315--325.  ",
      "doi": "10.1007/s11036-005-6425-1"
    },
    {
      "text": "Gruteser, M., Schelle, G., Jain, A., and Grunwald. D. Privacy-aware location sensor networks. In Proc. HotOS 2003, (2003). ",
      "doi": "10.5555/1251054.1251082"
    },
    {
      "text": "Halderman, J. A., Waters, B., and Felten, E. W. Privacy management for portable recording devices. In Proc. WPES 2004, ACM Press (2004), 16--24.  ",
      "doi": "10.1145/1029179.1029183"
    },
    {
      "text": "Hawkey, K. and Inkpen, K. M. Keeping up appearances: understanding the dimensions of incidental information privacy. In Proc. CHI 2006, ACM Press, 821--830.  ",
      "doi": "10.1145/1124772.1124893"
    },
    {
      "text": "Iachello, G., Truong, K. N., Abowd, G. D., Hayes, G. R., and Stevens, M. Prototyping and sampling experience to evaluate ubiquitous computing privacy in the real world. In Proc. CHI 2006, ACM Press, 1009--1018.  ",
      "doi": "10.1145/1124772.1124923"
    },
    {
      "text": "Ito, M., Okabe, D., and Matsuda, M. Personal, Portable, Pedestrian: Mobile Phones in Japanese Life. MIT Press (2005). ",
      "doi": "10.5555/1088854"
    },
    {
      "text": "Hong, J. and Landay, J. An architecture for privacy-sensitive ubiquitous computing. In Proc. Conference on Mobile Systems, Applications, and Services, 2004.  ",
      "doi": "10.1145/990064.990087"
    },
    {
      "text": "Hull, R., Kumar, B., Lieuwen, D., Patel-Schneider, P. F., Sahuguet, A., Varadarajan, S. and Vyas A. Enabling Context-Aware and Privacy-Conscious User Data Sharing. In Proc. MDM 2004, IEEE (2004), 187--198.",
      "doi": ""
    },
    {
      "text": "Kindberg, T., Spasojevic, M., Fleck, R. and Sellen, A. The Ubiquitous Camera: An In-depth Study of Cameraphone Use. IEEE Pervasive Comp. 4, 2 (2005), 42--50.  ",
      "doi": "10.1109/MPRV.2005.42"
    },
    {
      "text": "Lederer, S., Hong, I., Dey, K. and Landay, A. Personal privacy through understanding and action: five pitfalls for designers. Personal Ubiquitous Computing. 8, 6 (Nov. 2004), 440--454.  ",
      "doi": ""
    },
    {
      "text": "Palen, L. and Dourish, P. Unpacking \"privacy\" for a networked world. In Proc. CHI 2003, ACM Press (2003), 129--136.  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Patil, S. and Lai, J. Who gets to know what when: configuring privacy permissions in an awareness application. In Proc. CHI 2005, ACM Press (2005), 101--110.  ",
      "doi": "10.1145/1054972.1054987"
    },
    {
      "text": "Spiekermann, S., Grossklags, J., Berendt, B. Stated Privacy Preferences versus Actual Behaviour in EC environments: a Reality Check. In Proc. WI-IF 2001.",
      "doi": ""
    },
    {
      "text": "Stutzman, F. An Evaluation of Identity-Sharing Behavior in Social Network Communities. In Proc. iDMAa and IMS Code Conference, 2006.",
      "doi": ""
    },
    {
      "text": "Tang, K. P., Keyani, P., Fogarty, J., and Hong, J. I. Putting people in their place: an anonymous and privacy-sensitive approach to collecting sensed data in location-based applications. In Proc. CHI 2006, ACM Press (2006), 93--102.  ",
      "doi": "10.1145/1124772.1124788"
    },
    {
      "text": "van House, N., Davis, M., Ames, M., Finn, M., and Viswanathan, V. The uses of personal networked digital imaging: an empirical study of cameraphone photos and sharing. In Ext. Abstracts CHI 2006, ACM Press (2006), 1853--1856.  ",
      "doi": "10.1145/1056808.1057039"
    },
    {
      "text": "Varian, H. Economic Aspects of personal privacy. In Privacy and Self-Regulation in the Information Age, NTIA report (1996).",
      "doi": ""
    }
  ]
}