{
  "doi": "10.1145/1240624.1240797",
  "title": "Command strokes with and without preview: using pen gestures on keyboard for command selection",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1137-1146",
  "year": 2007,
  "badges": [],
  "abstract": "This paper presents a new command selection method that provides an alternative to pull-down menus in pen-based mobile interfaces. Its primary advantage is the ability forusers to directly select commands from a very large set without the need to traverse menu hierarchies. The proposed method maps the character strings representing the commands onto continuous pen-traces on a stylus keyboard. The user enters a command by stroking part of its character string. We call this method \"command strokes.\" We present the results of three experiments assessing the usefulness of the technique. The first experiment shows that command strokes are 1.6 times faster than the de-facto standard pull-down menus and that users find command strokes more fun to use. The second and third experiments investigate the effect of displaying a visual preview of the currently recognized command while the user is still articulating the command stroke. These experiments show that visual preview does not slow users down and leads to significantly lower error rates and shorter gestures when users enter new unpracticed commands.",
  "authors": [
    {
      "name": "Per Ola Kristensson",
      "institution": "Linköpings universitet, Linköping, Sweden",
      "img": "/do/10.1145/contrib-81100362804/rel-imgonly/pokristensson2013small.jpg",
      "acmid": "81100362804",
      "orcid": "0000-0002-7139-871X"
    },
    {
      "name": "Shumin Zhai",
      "institution": "IBM Almaden Research Center, San Jose, CA",
      "img": "/do/10.1145/contrib-81408591988/rel-imgonly/81408591988.jpg",
      "acmid": "81408591988",
      "orcid": "0000-0003-0752-2090"
    }
  ],
  "references": [
    {
      "text": "Accot, J. and Zhai, S. Beyond Fitts' Law: Models for Trajectory-Based HCI Tasks. Proc. CHI 1997, pp. 295--302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Bernard, P., Hammond, N., MacLean, A. and Morton, J. Learning and Remembering Interactive Commands. Proc. CHI 1982, pp. 2--7.  ",
      "doi": "10.1145/800049.801744"
    },
    {
      "text": "Callahan, J., Hopkins, D., Weiser, M. and Shneiderman, B. An Empirical Comparison of Pie vs. Linear Menus. Proc. CHI 1988, pp. 95--100.  ",
      "doi": "10.1145/57167.57182"
    },
    {
      "text": "Guimbretière, F. and Winograd, T. FlowMenu: Combining Command, Text and Data Entry. Proc. UIST 2000, pp. 213--216.  ",
      "doi": "10.1145/354401.354778"
    },
    {
      "text": "Kristensson, P.O. and Zhai, S. SHARK2: A Large Vocabulary Shorthand Writing System for Pen-based Computers. Proc. UIST 2004, pp. 43--52.  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "Kurtenbach, G. and Buxton, W. The Limits of Expert Performance Using Hierarchic Marking Menus. Proc. CHI 1993, pp. 482--487.  ",
      "doi": "10.1145/169059.169426"
    },
    {
      "text": "Kobayashi, M. and Igarashi, T. Considering the Direction of Cursor Movement for Efficient Traversal of Cascading Menus. Proc. UIST 2003, pp. 91--94.  ",
      "doi": "10.1145/964696.964706"
    },
    {
      "text": "Kurtenbach, G., Fitzmaurice, G., Owen, R.N. and Baudel, T. The Hotbox: Efficient Access to a Large Number of Menu-items. Proc. CHI 1999, pp. 231--237.  ",
      "doi": "10.1145/302979.303047"
    },
    {
      "text": "Landauer, T.K. and Nachbar, D.W. Selection from Alphabetic and Numeric Menu Trees Using a Touch Screen: Breadth, Depth, and Width. Proc. CHI 1985, pp. 73--78.  ",
      "doi": "10.1145/317456.317470"
    },
    {
      "text": "Long, A.C., Landay, J.A., Rowe, L.A. and Michiels, J. Visual Similarity of Pen Gestures. Proc. CHI 2000, pp. 360--367.  ",
      "doi": "10.1145/332040.332458"
    },
    {
      "text": "Perlin, K. Quikwriting: Continuous Stylus-Based Text Entry. Proc. UIST 1998, pp. 215--216.  ",
      "doi": "10.1145/288392.288613"
    },
    {
      "text": "Quigley, M., Goodrich, M.A. and Beard, R.W. Semi-Autonomous Human-UAV Interfaces for Fixed-Wing Mini-UAVs. Proc. Intl. Conf. Intelligent Robots and Systems 2004, pp. 2457--2462.",
      "doi": ""
    },
    {
      "text": "Rubine, D. Specifying Gestures by Example. Proc. SIGGRAPH 1991, pp. 329--337.  ",
      "doi": "10.1145/122718.122753"
    },
    {
      "text": "Zhai, S. and Kristensson, P.O. Shorthand Writing on Stylus Keyboard. Proc. CHI 2003, pp. 17--24.  ",
      "doi": "10.1145/642611.642630"
    },
    {
      "text": "Zhao, S. and Balakrishnan, R. Simple vs. Compound Mark Hierarchical Marking Menus. Proc. UIST 2004, pp. 33--42.  ",
      "doi": "10.1145/1029632.1029639"
    }
  ]
}