{
  "doi": "10.1145/1240624.1240839",
  "title": "Usability testing: what have we overlooked?",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1415-1424",
  "year": 2007,
  "badges": [],
  "abstract": "For more than a decade, the number of usability test participants has been a major theme of debate among usability practitioners and researchers keen to improve usability test performance. This paper provides evidence suggesting that the focus be shifted to task coverage instead. Our data analysis of nine commercial usability test teams participating in the CUE-4 study revealed no significant correlation between the percentage of problems found or of new problems and number of test users, but correlations of both variables and number of user tasks used by each usability team were significant. The role of participant recruitment on usability test performance and future research directions are discussed.",
  "authors": [
    {
      "name": "Gitte Lindgaard",
      "institution": "Carleton Univerisity, Ottawa, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100447814",
      "orcid": "missing"
    },
    {
      "name": "Jarinee Chattratichart",
      "institution": "Kingston University, Surrey, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328487984",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Chattratichart, J. & Jordan, P. W. Simulating 'lived' user experience -- Virtual immersion and inclusive design. In Proceedings of Interact 2003, Amsterdam: IOS Press (2003), 721--725.",
      "doi": ""
    },
    {
      "text": "Cockton, G & Woolrych, A. Understanding inspection methods: Lessons from an assessment of heuristic evaluation. In People & Computers XV, A. Blandford & J. Vanderdonckt (Eds.), Springer-Verlag (2001), 171--191.",
      "doi": ""
    },
    {
      "text": "Constantine, L. CHI 2003 Feature: Testing& 1 2 3 4 5 & Testing& http://usabilitynews.com/news/article1058.asp. May, 2003.",
      "doi": ""
    },
    {
      "text": "Faulkner, L. Beyond the five-user assumption: Benefits of increased sample sizes in usability testing. Behavior Research Methods, Instruments & Computers, 35, 3, Psychonomic Society (2003), 379--383.",
      "doi": ""
    },
    {
      "text": "Fleiss, J. L. Statistical Methods for Rates and Proportions, 2nd Ed., John Wiley & Sons (1981).",
      "doi": ""
    },
    {
      "text": "Hertzum, M. & Jacobsen, N. E. The evaluator effect: A chilling fact about usability evaluation methods. International Journal of Human-Computer Interaction, 15, 1, Lawrence Erlbaum Associates (2003), 183--204.",
      "doi": ""
    },
    {
      "text": "Jacobsen, N. E., Hertzum, M., & John, B. E. The evaluator effect in usability studies: Problem detection and severity judgements. In Proc. HFES 1998, HFES (1998), 1336--1340.",
      "doi": ""
    },
    {
      "text": "Molich, R. & Dumas, J. S. Comparative Usability Evaluation (CUE-4). Behaviour & Information Technology, Taylor & Francis (in press).  ",
      "doi": "10.1080/0144929032000173951"
    },
    {
      "text": "Molich, R. & Jeffries, R. Comparative expert review, In Proc. CHI 2003, Extended Abstracts, ACM Press (2003), 1060--1061.  ",
      "doi": "10.1145/765891.766148"
    },
    {
      "text": "Molich, R., Ede, M. R., Kaasgaard. K., & Karyukin, B. Comparative usability evaluation. Behaviour & Information Technology, 23, 1, Taylor & Francis (2004), 65--74.  ",
      "doi": "10.1080/0144929032000173951"
    },
    {
      "text": "Molich, R., Bevan, N., Curson, I., Butler, S., Kindlund, E., Miller, D., & Kirakowski, J. Comparative evaluation of usability tests. In Proc. UPA 1998, UPA (1998), 189--200.",
      "doi": ""
    },
    {
      "text": "Molich, R., Thomsen, A.D., Karyukina, B., Schmidt, L., Ede, M., Oel, W.V. & Arcuri, M. Comparative evaluation of usability tests, Proc. CHI 1999, Extended Abstracts, ACM Press (1999), 83--84.  ",
      "doi": "10.1145/632716.632768"
    },
    {
      "text": "Nielsen, J. Why you only need to test with 5 users, Jakob Nielsen's Alertbox, March 19, 2000, http://www.useit.com/alertbox/20000319.html.",
      "doi": ""
    },
    {
      "text": "Nielsen, J., & Landauer, T. K. A mathematical model of the finding of usability problems. In Proceedings of INTERCHI 1993, ACM Press (1993), 206--213. ",
      "doi": "10.1145/169059.169166"
    },
    {
      "text": "Spool, J. & Schroeder, W. Testing Websites: Five users is nowhere near enough. In Proc. CHI 2001, Extended Abstracts, ACM Press (2001), 285--286.  ",
      "doi": "10.1145/634067.634236"
    },
    {
      "text": "Virzi, R.A. Refining the test phase of usability evaluation: How many subjects is enough? Human Factors, 34, HFES (1992), 457--468. ",
      "doi": "10.1177/001872089203400407"
    }
  ]
}