{
  "doi": "10.1145/1240624.1240714",
  "title": "Let's go to the whiteboard: how and why software developers use drawings",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "557-566",
  "year": 2007,
  "badges": [],
  "abstract": "Software developers are rooted in the written form of their code, yet they often draw diagrams representing their code. Unfortunately, we still know little about how and why they create these diagrams, and so there is little research to inform the design of visual tools to support developers' work. This paper presents findings from semi-structured interviews that have been validated with a structured survey. Results show that most of the diagrams had a transient nature because of the high cost of changing whiteboard sketches to electronic renderings. Diagrams that documented design decisions were often externalized in these temporary drawings and then subsequently lost. Current visualization tools and the software development practices that we observed do not solve these issues, but these results suggest several directions for future research.",
  "authors": [
    {
      "name": "Mauro Cherubini",
      "institution": "École Polytechnique Fédérale de Lausanne (EPFL), Lausanne, Switzerland",
      "img": "/do/10.1145/contrib-81328487693/rel-imgonly/81328487693.jpg",
      "acmid": "81328487693",
      "orcid": "missing"
    },
    {
      "name": "Gina Venolia",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100190815/rel-imgonly/ginav.jpg",
      "acmid": "81100190815",
      "orcid": "missing"
    },
    {
      "name": "Rob DeLine",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350602833",
      "orcid": "0000-0001-8885-8367"
    },
    {
      "name": "Amy J. Ko",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100500360/rel-imgonly/2021-02.jpg",
      "acmid": "81100500360",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "M. W. Alibali, M. Bassok, K. O. Solomon, S. E. Syc, and S. Goldin-Meadow. Illuminating mental representation through speech and gesture. Psychological Science, 10:327--333, 1999.",
      "doi": ""
    },
    {
      "text": "V. Bellotti and S. Bly. Walking away from the desktop computer: Distributed collaboration and mobility in a product design team. In Proc. CSCW, pp. 209--218.  ",
      "doi": "10.1145/240080.240256"
    },
    {
      "text": "M. Cherubini and J. van der Pol. Grounding is not shared understanding: Distinguishing grounding at an utterance and knowledge level. In CONTEXT 2005.",
      "doi": ""
    },
    {
      "text": "H. H. Clark and E. F. Shaeffer. Contributing to discourse. Cognitive Science, 13:259--294, 1989.",
      "doi": ""
    },
    {
      "text": "U. Dekel. Supporting distributed software design meetings: What can we learn from co-located meetings? In Proc. HSSE 2005. ACM.  ",
      "doi": "10.1145/1083106.1083109"
    },
    {
      "text": "P. Dillenbourg, D. Traum, and D. Schneider. Grounding in multi-modal task-oriented collaboration. In Proc. EUROAIED 1996, pp. 415--425.",
      "doi": ""
    },
    {
      "text": "E. Do and M. D. Gross. Reasoning about cases with diagrams. In J. Vanegas and P. Chinowsky, editors, ASCE, pp. 314--320, 1996.",
      "doi": ""
    },
    {
      "text": "S. Goldin-Meadow. Hearing gesture: How our hands help us think. Belknap Press, Cambridge, MA, USA, 2003.",
      "doi": ""
    },
    {
      "text": "J. Heiser, B. Tversky, and M. Silverman. Visual and spatial reasoning in design III, chapter Sketches for and from collaboration, pp. 69--78. 2004.",
      "doi": ""
    },
    {
      "text": "K. Henderson. On Line and On Paper: Visual Representations, Visual Culture, and Computer Graphics in Design Engineering. Cambridge, MA: MIT Press, 1999. ",
      "doi": "10.5555/521215"
    },
    {
      "text": "J. D. Herbsleb. Metaphorical representation in collaborative software engineering. In Proc. WACC 1999, pp. 117--126. ACM.  ",
      "doi": "10.1145/295665.295679"
    },
    {
      "text": "M. Hertzum and A. M. Pejtersen. The information seeking practices of engineers: Searching for documents as well as for people. Information Processing and Management, 36(5):761--778, 2000.  ",
      "doi": "10.1016/S0306-4573%2800%2900011-X"
    },
    {
      "text": "E. Hutchins. Cognition in the Wild. MIT Press, Cambridge, MA, USA, 1995.",
      "doi": ""
    },
    {
      "text": "A.J. Ko, H.H. Aung, B.A. Myers (2005), Eliciting Design Requirements for Maintenance-Oriented IDEs: A Detailed Study of Corrective and Perfective Maintenance Tasks, In Proc. ICSE 2005. ACM.  ",
      "doi": "10.1145/1062455.1062492"
    },
    {
      "text": "J. H. Larkin and H. Simon. Why a diagram is (sometimes) worth ten thousand words. Cognitive Science, pages 65--99, 1987.",
      "doi": ""
    },
    {
      "text": "T. D. LaToza, G. Venolia, and R. DeLine. Maintaining mental models: a study of developer work habits. In ICSE '06: Proc ICSE 2006, pp. 492--501. ACM.  ",
      "doi": "10.1145/1134285.1134355"
    },
    {
      "text": "D. W. McDonald and M. S. Ackerman. Just talk to me: A field study of expertise location. In Proc. CSCW 1998, pp. 315--324.  ",
      "doi": "10.1145/289444.289506"
    },
    {
      "text": "D. E. Perry, N. A. Staudenmayer, and L. G. Votta. People, organizations and process improvement. IEEE Software, pages 36--45, July 1994.  ",
      "doi": "10.1109/52.300082"
    },
    {
      "text": "B. A. Price, R. M. Baecker, and I.S. Small. A Principled Taxonomy of Software Visualization. Journal of Visual Languages and Computing, 4(3):211--266, 1999.",
      "doi": ""
    },
    {
      "text": "M. Suwa, J. Gero, and T. Purcell. Unexpected discoveries and s-invention of design requirements: Improving vehicles for a design process. Design Studies, 18(4):539--567, 2000.",
      "doi": ""
    },
    {
      "text": "B. Tversky, M. Suwa, M. Agrawala, H. J, C. Stolte, P. Hanrahan, D. Phan, J. Klingner, M. Daniel, P. Lee, and J. Haymaker. Human behavior in design: Individuals, teams, tools. In Sketches for Design and Design of Sketches, pp. 79--86. Springer, 2003.",
      "doi": ""
    },
    {
      "text": "B. Tversky. Spatial schemas and abstract thought. In Spatial Schemas in Depictions, pp. 79--111. MIT, 2001.",
      "doi": ""
    }
  ]
}