{
  "doi": "10.1145/1240624.1240789",
  "title": "How HCI interprets the probes",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1077-1086",
  "year": 2007,
  "badges": [],
  "abstract": "We trace how cultural probes have been adopted and adapted by the HCI community. The flexibility of probes has been central to their uptake, resulting in a proliferation of divergent uses and derivatives. The varying patterns of adaptation of the probes reveal important underlying issues in HCI, suggesting underacknowledged disagreements about valid interpretation and the relationship between methods and their underlying methodology. With this analysis, we aim to clarify discussions around probes, and, more importantly, around how we define and evaluate methods in HCI, especially those grounded in unfamiliar conceptions of how research should be done.",
  "authors": [
    {
      "name": "Kirsten Boehner",
      "institution": "Cornell University, Ithaca, NY",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100556191",
      "orcid": "missing"
    },
    {
      "name": "Janet Vertesi",
      "institution": "Cornell University, Ithaca, NY",
      "img": "/do/10.1145/contrib-81328491066/rel-imgonly/vertesi_300.jpg",
      "acmid": "81328491066",
      "orcid": "missing"
    },
    {
      "name": "Phoebe Sengers",
      "institution": "Cornell University, Ithaca, NY",
      "img": "/do/10.1145/contrib-81100397464/rel-imgonly/ditheredhead.jpg",
      "acmid": "81100397464",
      "orcid": "missing"
    },
    {
      "name": "Paul Dourish",
      "institution": "U. California, Irvine, Irvine, CA",
      "img": "/do/10.1145/contrib-81100521529/rel-imgonly/paul-headshot-square.jpg",
      "acmid": "81100521529",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aley, E., Cooper, T., Graeber, R., Kerne, A., Overby, K., and Toups, Z. O. 2005. Censor chair. In Proc. MULTIMEDIA '05. NY: ACM Press, 922--929.  ",
      "doi": "10.1145/1101149.1101345"
    },
    {
      "text": "Amin, A. K., Kersten, B. T., Kulyk, O. A., Pelgrim, P. H., Wang, C. M., and Markopoulos, P. 2005. SenseMS. In Proc. MobileHCI '05, NY: ACM Press, 161--166.  ",
      "doi": "10.1145/1085777.1085804"
    },
    {
      "text": "Battarbee, K., Baerten, N., Hinfelaar, M., Irvine, P., Loeber, S., Munro, A., and Pederson, T. 2002. Pools and satellites. In Proc. DIS '02. NY: ACM Press, 237--245.  ",
      "doi": "10.1145/778712.778746"
    },
    {
      "text": "Battarbee, K., Soronen, A., and Mäyrä, F. 2004. Living in a zoo. In Proc. NordiCHI '04. NY: ACM Press, 373--376.  ",
      "doi": "10.1145/1028014.1028073"
    },
    {
      "text": "Blythe, M., Monk, A., and Park, J. 2002. Technology biographies. In CHI '02 Extended Abstracts. NY: ACM Press, 658--659.  ",
      "doi": "10.1145/506443.506532"
    },
    {
      "text": "Bødker, S., Kristensen, J. F., Nielsen, C., and Sperschneider, W. 2003. Technology for boundaries. In Proc. GROUP '03. NY: ACM Press, 311--320.  ",
      "doi": "10.1145/958160.958210"
    },
    {
      "text": "Candy, F. J. 2003. The fabric of society. In Proc. DPPI '03. NY: ACM Press, 28--33.  ",
      "doi": "10.1145/782896.782904"
    },
    {
      "text": "Chavan, A. L. and Munshi, S. 2004. Emotion in a ticket. In CHI '04 Extended Abstracts. NY: ACM Press, 1544--1544.  ",
      "doi": "10.1145/985921.986120"
    },
    {
      "text": "Crabtree, A., Hemmings, T., Rodden, T., Clarke, K., Dewsbury, G., Hughes, J., Rouncefield, M. and Sommerville, I. (2002) \"Sore legs and naked bottoms\". Proc. DIRC Conference on Dependable Computing Systems, London: The Royal Statistical Society.",
      "doi": ""
    },
    {
      "text": "Desmet, P. and Dijkhuis, E. 2003. A wheelchair can be fun. In Proc. DPPI '03. NY: ACM Press, 22--27.  ",
      "doi": "10.1145/782896.782903"
    },
    {
      "text": "Dey, A. K. and de Guzman, E. 2006. From awareness to connectedness. In Proc. CHI '06. NY: ACM Press, 899--908.  ",
      "doi": "10.1145/1124772.1124905"
    },
    {
      "text": "Dindler, C., Eriksson, E., Iversen, O. S., Lykke-Olesen, A., and Ludvigsen, M. 2005. Mission from Mars. In Proc. IDC '05. NY: ACM Press, 40--47.  ",
      "doi": "10.1145/1109540.1109546"
    },
    {
      "text": "Dourish, P. 2006. Implications for design. In Proc. CHI '06. NY: ACM Press, 541--550.  ",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Fitton, D, Chevherst, K., Rouncefield, M., Dix, A. and Crabtree, A. (2004) Probing Technology with Technology Probes. Paper presented at the Equator Workshop on Record and Replay Technologies.",
      "doi": ""
    },
    {
      "text": "Foucault, B. 2005. Designing Technology for Growing Families. Technology @ Intel Magazine. http://www.intel.com/technology/magazine/research/growing-families-0805.pdf",
      "doi": ""
    },
    {
      "text": "Gaver, W. and Dunne, A. 1999. Projected realities. In Proc. CHI '99. NY: ACM Press, 600--607.  ",
      "doi": "10.1145/302979.303168"
    },
    {
      "text": "Gaver, B., Dunne, T., and Pacenti, E. 1999. Cultural probes. interactions 6, 1 (Jan. 1999), 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Gaver, W.W., Hooker, B., and Dunne, A. (2001). The Presence Project. London: Royal College of Art.",
      "doi": ""
    },
    {
      "text": "Gaver, W. W., Boucher, A., Pennington, S., and Walker, B. 2004. Cultural probes and the value of uncertainty. interactions 11, 5 (Sep. 2004), 53--56.  ",
      "doi": "10.1145/1015530.1015555"
    },
    {
      "text": "Gaver, W. W., Bowers, J., Boucher, A., Gellerson, H., Pennington, S., Schmidt, A., Steed, A., Villars, N., and Walker, B. 2004. The drift table. In CHI '04 Extended Abstracts. NY: ACM Press, 885--900.  ",
      "doi": "10.1145/985921.985947"
    },
    {
      "text": "Gaye, L. and Holmquist, L. E. 2004. In duet with everyday urban settings. In Proc. New Interfaces For Musical Expression 2004. ",
      "doi": "10.5555/1085884.1085920"
    },
    {
      "text": "Hagen, P., Robertson, T., Kan, M., and Sadler, K. 2005. Emerging research methods for understanding mobile technology use. In Proc. CHISIG Australia 2005, 1--10. ",
      "doi": "10.5555/1108368.1108417"
    },
    {
      "text": "Hemmings, T., Clarke, K., Crabtree, A., Rodden, T. and Rouncefield, M. (2002) Probing the Probes. In Proc. Participatory Design 2002, pp. 42--50.",
      "doi": ""
    },
    {
      "text": "Horst, W., Bunt, T., Wensveen, S., and Cherian, L. 2004. Designing probes for empathy with families. In Proc. Dutch Directions in HCI. NY: ACM Press, 15.  ",
      "doi": "10.1145/1005220.1005239"
    },
    {
      "text": "Howard, S. Kjeldskov, J., Skov, M.B., Garnæs, K., and Grünberger, O. 2006. Negotiating presence-in-absence. In Proc. CHI '06. NY: ACM Press, 909--921.  ",
      "doi": "10.1145/1124772.1124906"
    },
    {
      "text": "Hulkko, S., Mattelmäki, T., Virtanen, K., and Keinonen, T. 2004. Mobile probes. In Proc. NordiCHI '04. NY: ACM Press, 43--51.  ",
      "doi": "10.1145/1028014.1028020"
    },
    {
      "text": "Hutchinson, H., Mackay, W., Westerlund, B., Bederson, B. B., Druin, A., Plaisant, C., Beaudouin-Lafon, M., Conversy, S., Evans, H., Hansen, H., Roussel, N., and Eiderbäck, B. 2003. Technology probes. In Proc. CHI '03. NY: ACM Press, 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Isbister, K., Höök, K., Sharp, M., and Laaksolahti, J. 2006. The sensual evaluation instrument. In Proc. CHI '06. NY: ACM Press, 1163--1172.  ",
      "doi": "10.1145/1124772.1124946"
    },
    {
      "text": "Iversen, O. S., Kanstrup, A. M., and Petersen, M. G. 2004. A visit to the 'new Utopia'. In Proc. NordiCHI '04. NY: ACM Press, 171--179.  ",
      "doi": "10.1145/1028014.1028040"
    },
    {
      "text": "Iversen, O. S. and Nielsen, C. 2003. Using digital cultural probes in design with children. In Proc. IDC '03. NY: ACM Press, 154--154.  ",
      "doi": "10.1145/953536.953564"
    },
    {
      "text": "Jönsson, B., Svensk, A., Cuartielles, D., Malmborg, L., Schlaucher, P. . Mobility and learning environments: Engaging people in design of their everyday environments. http://www.certec.lth.se/doc/mobility1/MobilityLearningReport021215.pdf",
      "doi": ""
    },
    {
      "text": "Kaye, J. 'J.' 2006. I just clicked to say I love you. In CHI '06 Extended Abstracts. CHI '06. NY: ACM Press, 363--368.  ",
      "doi": "10.1145/1125451.1125530"
    },
    {
      "text": "Kember, S., Cheverst, K., Clarke, K., Dewsbury, G., Hemmings, T., Rodden, T., and Rouncefield, M. 2003. Designing assistive technologies for medication tegimes in care settings. Universal Access in the Information Society, 2 (3), 235--242.",
      "doi": "10.1007/s10209-003-0055-9"
    },
    {
      "text": "Kim, J., Lee, S., and Kim, S. 2006. Understanding users in consumer electronics experience design. In CHI '06 Extended Abstracts . NY: ACM Press, 189--194.  ",
      "doi": "10.1145/1125451.1125492"
    },
    {
      "text": "Kriglstein, S. and Wallner, G. 2005. HOMIE. In CHI '05 Extended Abstracts. NY: ACM Press, 2094--2098.  ",
      "doi": "10.1145/1056808.1057106"
    },
    {
      "text": "Kuiper-Hoyng, L. L. and Beusmans, J. W. 2004. Using home networks to create atmospheres in the home. In Proc. Dutch Directions in HCI. NY: ACM Press, 7--10.  ",
      "doi": "10.1145/1005220.1005229"
    },
    {
      "text": "Labrune, J. and Mackay, W. 2005. Tangicam. In Proc. IDC '05. NY: ACM Press, 95--102.  ",
      "doi": "10.1145/1109540.1109553"
    },
    {
      "text": "Lindström, M., Ståhl, A., Höök, K., Sundström, P., Laaksolathi, J., Combetto, M., Taylor, A., and Bresin, R. 2006. Affective diary. In CHI '06 Extended Abstracts. NY: ACM Press, 1037--1042.",
      "doi": ""
    },
    {
      "text": "Lundberg, J., Ibrahim, A., Jönsson, D., Lindquist, S., and Qvarfordt, P. 2002. The snatcher catcher. In Proc. NordiCHI '02. NY: ACM Press, 209--212.  ",
      "doi": "10.1145/572020.572047"
    },
    {
      "text": "Mackay, W. E. 2004. The interactive thread. In Proc. DIS '04. NY: ACM Press, 103--112.  ",
      "doi": "10.1145/1013115.1013131"
    },
    {
      "text": "Maldonado, H., B. Lee, and S. Klemmer. Technology for Design Education. In CHI '06 Extended Abstracts, 1067--1072.  ",
      "doi": "10.1145/1125451.1125654"
    },
    {
      "text": "Mamykina, L., Mynatt, E. D., and Kaufman, D. R. 2006. Investigating health management practices of individuals with diabetes. In Proc. CHI '06. NY: ACM Press, 927--936.  ",
      "doi": "10.1145/1124772.1124910"
    },
    {
      "text": "Mattelmäki, T., Battarbee, K., Empathy Probes. Paper presented at Participation and Design, Malmö 2002.",
      "doi": ""
    },
    {
      "text": "Millen, D. R. 2000. Rapid ethnography. In Proc. DIS '00. NY: ACM Press, 280--286.  ",
      "doi": "10.1145/347642.347763"
    },
    {
      "text": "Murphy, J., Kjeldskov, J., Howard, S., Shanks, G., and Hartnell-Young, E. 2005. The converged appliance. In Proc. CHISIG of Australia, 1--10. ",
      "doi": "10.5555/1108368.1108416"
    },
    {
      "text": "Newman, W. 1994. A preliminary analysis of the products of HCI research, using pro forma abstracts. In Proc. CHI '94. NY: ACM Press, 278--284.  ",
      "doi": "10.1145/191666.191766"
    },
    {
      "text": "Nilsson, M., Johansson, S., and Håkansson, M. 2003. Nostalgia. In CHI '03 Extended Abstracts. NY: ACM Press, 964--965.  ",
      "doi": "10.1145/765891.766096"
    },
    {
      "text": "Paulos, E. and Beckmann, C. 2006. Sashay. In Proc. CHI '06. NY: ACM Press, 881--884.  ",
      "doi": "10.1145/1124772.1124901"
    },
    {
      "text": "Paulos, E. and Jenkins, T. 2005. Urban probes. In Proc. CHI '05. NY: ACM Press, 341--350.  ",
      "doi": "10.1145/1054972.1055020"
    },
    {
      "text": "Plaisant, C., Druin, A., and Hutchinson, H. 2002. Technologies for families. In CHI '02 Extended Abstracts. NY: ACM Press, 938--939.  ",
      "doi": "10.1145/506443.506669"
    },
    {
      "text": "Rodden, T. and Benford, S. 2003. The evolution of buildings and implications for the design of ubiquitous domestic environments. In Proc. CHI '03. NY: ACM Press, 9--16.  ",
      "doi": "10.1145/642611.642615"
    },
    {
      "text": "Roibás, A. C. and Johnson, S. 2006. Unfolding the user experience in new scenarios of pervasive interactive TV. In CHI '06 Extended Abstracts. NY: ACM Press, 1259--1264.  ",
      "doi": "10.1145/1125451.1125686"
    },
    {
      "text": "Sengers, P., and Gaver, B. (2006). Staying open to interpretation. In Proc. DIS '06, NY: ACM Press, 99--108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Sengers, P., Liesendahi, R., Magar, W., Seibert, C., Müller, B., Joachims, T., Geng, W., Mårtensson, P., and Höök, K. 2002. The enigmatics of affect. In Proc. DIS '02. NY: ACM Press, 87--98.  ",
      "doi": "10.1145/778712.778728"
    },
    {
      "text": "Swallow, D., Blythe, M., and Wright, P. 2005. Grounding experience. In Proc. 2005 Conf. European Assoc. Cognitive Ergonomics. University of Athens, 91--98. ",
      "doi": "10.5555/1124666.1124679"
    },
    {
      "text": "Vetere, F., Davis, H., Gibbs, M.R., Francis, P. and Howard, S. 2006. A magic box for understanding intergenerational play. In CHI '06 Extended Abstracts. NY: ACM Press, 1475--1480.  ",
      "doi": "10.1145/1125451.1125722"
    },
    {
      "text": "Vetere, F., Gibbs, M. R., Kjeldskov, J., Howard, S., Mueller, F., Pedell, S., Mecoles, K., and Bunyan, M. 2005. Mediating intimacy. In Proc CHI '05. NY: ACM Press, 471--480.  ",
      "doi": "10.1145/1054972.1055038"
    },
    {
      "text": "Voida, A. and Mynatt, E. D. 2005. Conveying user values between families and designers. In CHI '05 Extended Abstracts. NY: ACM Press, 2013--2016.  ",
      "doi": "10.1145/1056808.1057080"
    },
    {
      "text": "Wolf, T. V., Rode, J., Sussman, J., and Kellogg, W. (2006). Dispelling \"design\" as the black art of CHI. Proc. CHI 2006, NY: ACM Press, 521--530.  ",
      "doi": "10.1145/1124772.1124853"
    }
  ]
}