{
  "doi": "10.1145/1240624.1240666",
  "title": "InkSeine: In Situ search for active note taking",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "251-260",
  "year": 2007,
  "badges": [],
  "abstract": "Using a notebook to sketch designs, reflect on a topic, or capture and extend creative ideas are examples of active note taking tasks. Optimal experience for such tasks demands concentration without interruption. Yet active note taking may also require reference documents or emails from team members. InkSeine is a Tablet PC application that supports active note taking by coupling a pen-and-ink interface with an in situ search facility that flows directly from a user's ink notes (Fig. 1). InkSeine integrates four key concepts: it leverages preexisting ink to initiate a search; it provides tight coupling of search queries with application content; it persists search queries as first class objects that can be commingled with ink notes; and it enables a quick and flexible workflow where the user may freely interleave inking, searching, and gathering content. InkSeine offers these capabilities in an interface that is tailored to the unique demands of pen input, and that maintains the primacy of inking above all other tasks.",
  "authors": [
    {
      "name": "Ken Hinckley",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519448",
      "orcid": "0000-0002-4733-4927"
    },
    {
      "name": "Shengdong Zhao",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328491174",
      "orcid": "missing"
    },
    {
      "name": "Raman Sarin",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100396865",
      "orcid": "missing"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    },
    {
      "name": "Edward Cutrell",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100506242/rel-imgonly/cutrellheadshot2011-6x6.jpg",
      "acmid": "81100506242",
      "orcid": "0000-0002-9053-6057"
    },
    {
      "name": "Michael Shilman",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100465115",
      "orcid": "missing"
    },
    {
      "name": "Desney Tan",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100255664/rel-imgonly/desney_tan.jpg",
      "acmid": "81100255664",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agarawala, A., Balakrishnan, R. Keepin' It Real: Pushing the Desktop Metaphor with Physics, Piles and the Pen. CHI'06, 1283--92.  ",
      "doi": "10.1145/1124772.1124965"
    },
    {
      "text": "Apitz, G., Guimbretiere, F. CrossY: A crossing based drawing application. UIST 2004, 3--12.  ",
      "doi": "10.1145/1029632.1029635"
    },
    {
      "text": "Bederson, B., Interfaces for Staying in the Flow. Ubiquity, 2004. 5(27).  ",
      "doi": "10.1145/1029383.1074069"
    },
    {
      "text": "Buxton, B., Designing User Experiences: Getting the Design Right and the Right Design. 2007: In press.",
      "doi": ""
    },
    {
      "text": "Carr, R., Shafer, D., The Power of PenPoint. 1991: Addison-Wesley. ",
      "doi": "10.5555/574400"
    },
    {
      "text": "Csikszentmihalyi, M., Flow: The Psychology of Optimal Experience. 1991: HarperCollins.",
      "doi": ""
    },
    {
      "text": "Cutrell, E., Robbins, D., Dumais, S., Sarin, R. Fast, Flexible Filtering with Phlat: Personal Search and Organization Made Easy. CHI 2006, 261--270.  ",
      "doi": "10.1145/1124772.1124812"
    },
    {
      "text": "Davis, R., et al. NotePals: lightweight note sharing by the group, for the group. CHI '99, 338--345.  ",
      "doi": "10.1145/302979.303107"
    },
    {
      "text": "Fitzmaurice, G., Khan, A., Pieke, R., Buxton, B., Kurtenbach, G. Tracking Menus. UIST 2003, 71--79.  ",
      "doi": "10.1145/964696.964704"
    },
    {
      "text": "Furnas, G., Rauch, S. Considerations for Information Environments and the NaviQue Workspace. Digital Libraries 1998, 79--88.  ",
      "doi": "10.1145/276675.276684"
    },
    {
      "text": "Golovchinsky, G., Price, M., Schilit, B. From Reading to Retrieval: Freeform Ink Annotations as Queries. SIGIR'99, 19--25.  ",
      "doi": "10.1145/312624.312637"
    },
    {
      "text": "Hendry, D., Harper, D., An Informal Information-Seeking Environment. J. American Society of Information Science, 1997. 48(11): p. 1036--1048.  ",
      "doi": "10.5555/264878.264884"
    },
    {
      "text": "Hinckley, K., Baudisch, P., Ramos, G., Guimbretiere, F. Design and Analysis of Delimiters for Selection-Action Pen Gesture Phrases in Scriboli. CHI 2005, 451--460.  ",
      "doi": "10.1145/1054972.1055035"
    },
    {
      "text": "Jones, W. P., Dumais, S., The Spatial Metaphor for User Interfaces: Experimental Tests of Reference by Location versus Name. ACM Transactions on Office Information Systems, 1986. 4(1): p. 42--63.  ",
      "doi": "10.1145/5401.5405"
    },
    {
      "text": "Kirsch, D., The intelligent use of space. Artificial Intelligence, 1995. 73: p. 31--68.  ",
      "doi": "10.1016/0004-3702%2894%2900017-U"
    },
    {
      "text": "Kurtenbach, G., Buxton, W. Issues in Combining Marking and Direct Manipulation Techniques. UIST'91, 137--144.  ",
      "doi": "10.1145/120782.120797"
    },
    {
      "text": "Kurtenbach, G., Moran, T., Buxton, W. Contextual Animation of Gestural Commands. Proc. Graphics Interface'94, 83--90.",
      "doi": ""
    },
    {
      "text": "Li, Y., Hinckley, K., Guan, Z., Landay, J. A. Experimental Analysis of Mode Switching Techniques in Pen-based User Interfaces. CHI 2005, 461--470.  ",
      "doi": "10.1145/1054972.1055036"
    },
    {
      "text": "Mizobuchi, S., Yasumura, M. Tapping vs. Circling Selections on Pen-based Devices: Evidence for Different Performance-Shaping Factors. CHI 2004, 607--614.  ",
      "doi": "10.1145/985692.985769"
    },
    {
      "text": "Moran, T., Chiu, P., van Melle, W. Pen-Based Interaction Techniques for Organizing Material on an Electronic Whiteboard. UIST'97, 45--54.  ",
      "doi": "10.1145/263407.263508"
    },
    {
      "text": "Moscovich, T., Hughes, J. F. Navigating Documents with the Virtual Scroll Ring. UIST 2004, 57--60.  ",
      "doi": "10.1145/1029632.1029642"
    },
    {
      "text": "Mynatt, E. D., Igarashi, T., Edwards, W. K., LaMarca, A. Flatland: New Dimensions in Office Whiteboards. CHI'99, 346--353.  ",
      "doi": "10.1145/302979.303108"
    },
    {
      "text": "Price, M. N., Golovchinsky, G., Schilit, B. N. Linking by inking: trailblazing in a paper-like hypertext. HYPERTEXT '98, 30--39.  ",
      "doi": "10.1145/276627.276631"
    },
    {
      "text": "Rao, R., Card, S. K., Jellinek, H. D., Mackinlay, J. D., Robertson, G. G. The Information Grid: A Framework for Information Retrieval and Retrieval-centered Applications. UIST'92, 23--32.  ",
      "doi": "10.1145/142621.142625"
    },
    {
      "text": "Robertson, G., Czerwinski, M., Larson, K., Robbins, D., Thiel, D., van Dantzich, M. Data Mountain: Using Spatial Memory for Document Management. UIST'98, 153--162.  ",
      "doi": "10.1145/288392.288596"
    },
    {
      "text": "Russell, D., Stefik, M., Pirolli, P., Card, S. The Cost Structure of Sensemaking. ACM INTERCHI'93, 269--276. ",
      "doi": "10.5555/164632.164922"
    },
    {
      "text": "Schilit, B. N., Golovchinsky, G., Price, M. N. Beyond paper: supporting active reading with free form digital ink annotations. CHI'98, 249--256.  ",
      "doi": "10.1145/274644.274680"
    },
    {
      "text": "Shilman, M., Tan, D., Simard, P. CueTIP: A Mixed-Initiative Interface for Correcting Handwriting Errors. UIST 2006, 323--332.  ",
      "doi": "10.1145/1166253.1166304"
    },
    {
      "text": "Stifelman, L., Arons, B., Schmandt, C. The audio notebook: paper and pen interaction with structured speech. CHI '01, 182--189.  ",
      "doi": "10.1145/365024.365096"
    },
    {
      "text": "Wilcox, L. D., Schilit, B. N., Sawhney, N. Dynomite: a dynamically organized ink and audio notebook. CHI'97, 186--193.  ",
      "doi": "10.1145/258549.258700"
    },
    {
      "text": "Yahoo! Messenger, http://messenger.yahoo.com/feat_search.php.",
      "doi": ""
    }
  ]
}