{
  "doi": "10.1145/1240624.1240724",
  "title": "Endpoint prediction using motion kinematics",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "637-646",
  "year": 2007,
  "badges": [],
  "abstract": "Recently proposed novel interaction techniques such as cursor jumping [1] and target expansion for tiled arrangements [13] are predicated on an ability to effectively estimate the endpoint of an input gesture prior to its completion. However, current endpoint estimation techniques lack the precision to make these interaction techniques possible. To address a recognized lack of effective endpoint prediction mechanisms, we propose a new technique for endpoint prediction that applies established laws of motion kinematics in a novel way to the identification of motion endpoint. The technique derives a model of speed over distance that permits extrapolation. We verify our model experimentally using stylus targeting tasks, and demonstrate that our endpoint prediction is almost twice as accurate as the previously tested technique [13] at points more than twice as distant from motion endpoint.",
  "tags": [
    "minimum jerk",
    "motion",
    "kinematics",
    "cursor prediction",
    "Fitts' Law"
  ],
  "authors": [
    {
      "name": "Edward Lank",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315489747",
      "orcid": "0000-0003-2760-2370"
    },
    {
      "name": "Yi-Chun Nikko Cheng",
      "institution": "San Francisco State University, San Francisco, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81407592627",
      "orcid": "missing"
    },
    {
      "name": "Jaime Ruiz",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81341495915/rel-imgonly/jgruiz.jpg",
      "acmid": "81341495915",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "T. Asano, E. Sharlin, Y. Kitamura, K. Takashima, F. Kishino, \"Predictive interaction using the delphian desktop\", Proc. UIST 2005, pp. 133--141.  ",
      "doi": "10.1145/1095034.1095058"
    },
    {
      "text": "P. Baudisch, E. Cutrell, D. Robbins, M. Czerwinski, P. Tandler, B. Bederson, A. Zierlinger, \"Drag-and-pop and drag-and-pick\", Proc. of INTERACT 2003, pp. 57--64.",
      "doi": ""
    },
    {
      "text": "E. Bier and M. Stone, \"Snap-dragging\", Proc. of ACM SIGGRAPH 1986, pp. 233--240.  ",
      "doi": "10.1145/15922.15912"
    },
    {
      "text": "R. Blanch, Y. Guiard, M. Beaudouin-Lafon, 11Semantic pointing: improving target acquisition with control-display ratio adaptation\", Proc. CHI 2004, p.519--526.  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "P. M. Fitts, \"The information capacity of the human motor system in controlling the amplitude of movement\", J. of Exp. Psychology, 47 (1954), pp. 381--391.",
      "doi": ""
    },
    {
      "text": "T. Flash and N. Hogan. \"The coordination of arm movements: an experimentally confirmed mathematical model\", Journal of Neuroscience, Vol. 5, pp. 1688--1703.",
      "doi": ""
    },
    {
      "text": "E. Graham, C. L. MacKenzie. \"Physical versus virtual pointing,\" Proc. CHI 1996, pp. 292--299.  ",
      "doi": "10.1145/238386.238532"
    },
    {
      "text": "T. Grossman, R. Balakrishnan, \"The bubble cursor: enhancing target acquisition by dynamic resizing of the cursor's activation area\", Proc. CHI 2005, pp. 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Yves Guiard, Renaud Blanch, Michel Beaudouin-Lafon, Object pointing: a complement to bitmap pointing in GUIs, Proc. of Graphics interface 2004, p.9--16. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "N. Hogan, \"An organizing principle for a class of voluntary movements\" Journal of Neuroscience, Vol 4, pp. 2745--2754.",
      "doi": ""
    },
    {
      "text": "P. Kabbash , W. Buxton, \"The prince technique: Fitts' law and selection using area cursors\", Proc. CHI 1995, pp. 273--279.  ",
      "doi": "10.1145/223904.223939"
    },
    {
      "text": "C. Lane, S. C. Peres, A. Sandor, and H. A. Napier, \"A Process for Anticipating and Executing Icon Selection in Graphical User Interfaces\", Int. J. Human-Computer Interaction, 19:2 (2005), Pages 241--252.",
      "doi": ""
    },
    {
      "text": "M. McGuffin, R. Balakrishnan, \"Fitts' Law and Expanding Targets: Experimental Studies and Designs for User Interfaces\" TOCHI 12:4, pp. 388--422.  ",
      "doi": "10.1145/1121112.1121115"
    },
    {
      "text": "C. L. MacKenzie, R. Marteniuk, C. Dugas and B. Eickmeier, \"Three-Dimensional Movement Trajectories in Fitts' Task\", Quarterly J. of Exp. Psychology, 39A (1987), pp. 629--647.",
      "doi": ""
    },
    {
      "text": "D. Meyer, J. Smith, S. Kornblum, R. Abrams, and C. Wright, \"Speedaccuracy tradeoffs in aimed movements: Toward a theory of rapid voluntary action\", in Attention and Performance XIII, M. Jeannerod, Ed., Lawrence Erlbaum, Hillsdale, NJ. 173--226.",
      "doi": ""
    },
    {
      "text": "A. Murata, \"Improvement of Pointing Time by Predicting Targets in Pointing\", Int. J. of Human-Comp Interaction, 10:1, pp. 23--32.",
      "doi": ""
    },
    {
      "text": "H. Oirschot and A. Houtsma, \"Cursor Trajectory Analysis\", Proc. of the Haptic Human Computer InteractionWorkshop, 2000, pp. 127--134. ",
      "doi": "10.5555/645443.652680"
    },
    {
      "text": "W. Press, S. Teukolsky, W. Vetterling and B. Flannery, \"Numerical Recipes in C++\", Cambridge Press, 2002.",
      "doi": ""
    },
    {
      "text": "J. Richardson and T. Flash, \"Comparing Smooth Arm Movements with the Two-Thirds Power Law and the Related Segmented-Control Hypothesis\", M. Neuroscience, 22:18 (Sept. 2002), pp. 8201--8211.",
      "doi": ""
    },
    {
      "text": "S. Zhai, S. Conversy, M. Beaudouin-Lafon, and Y. Guiard, \"Human on-line response to target expansion.\", Proc. CHI 2003, CHI Letters 5:1, pp. 177--184.  ",
      "doi": "10.1145/642611.642644"
    }
  ]
}