{
  "doi": "10.1145/1240624.1240749",
  "title": "Project massive: self-regulation and problematic use of online gaming",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "829-838",
  "year": 2007,
  "badges": [],
  "abstract": "A longitudinal design was employed to collect three waves of survey data over a 14 month period from 2790 online gamers. Respondents were asked questions about their gaming activity, motivations, personality, social and emotional environment, and the effect gaming has had on their lives. Prospective analysis was used to establish causal and temporal linkages among the repeatedly measured factors. While the data provide some indication that a player's reasons for playing do influence the development of problematic usage, these effects are overshadowed by the central importance of self-regulation in managing both the timing and amount of play. An individual's level of self-regulatory activity is shown to be very important in allowing them to avoid negative outcomes like problematic use. The role of depression is also discussed. With responsible use, online gaming appears to be a healthy recreational activity that provides millions of people with hours of social entertainment and adaptive diversion. However, failure to manage play behavior can lead to feelings of dependency.",
  "tags": [
    "self-regulation",
    "MMORPG",
    "addiction",
    "online games",
    "play motivation",
    "social integration",
    "depression"
  ],
  "authors": [
    {
      "name": "A. Fleming Seay",
      "institution": "University of Texas, Austin, TX",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100119487",
      "orcid": "missing"
    },
    {
      "name": "Robert E. Kraut",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81328489038/rel-imgonly/bob2010-head-vest-edit.jpg",
      "acmid": "81328489038",
      "orcid": "0000-0002-8554-2137"
    }
  ],
  "references": [
    {
      "text": "Adams, E. (2002) \"Stop Calling Games Addictive.\" http://www.designersnotebook.com",
      "doi": ""
    },
    {
      "text": "Bandura, A. (1999). \"A sociocognitive analysis of substance abuse: An agentic perspective.\" Psychological Science 10(3): 214--217.",
      "doi": ""
    },
    {
      "text": "Bandura, A., Caprara, G.V., Barbaranelli, C., Verbino, M., Pastorelli, C. (2003). \"Role of affective self-regulatory efficacy in diverse spheres of psychosocial functioning.\" Child Development 74(3): 769--782.",
      "doi": ""
    },
    {
      "text": "Bessière, K., Kiesler, S., Kraut, R., & Boneva, B. (Under Review). Longitudinal Effects of Internet Uses on Depressive Affect: A Social Resources Approach. Unpublished manuscript, Carnegie Mellon University, Pittsburgh, PA.",
      "doi": ""
    },
    {
      "text": "Brown, R. I. F. (1993). Some contributions of the study of gambling to the study of other addictions. Gambling behavior and problem gambling. W. R. C. J. A. Eadigton. Reno, NV, University of Nevada: 241--272.",
      "doi": ""
    },
    {
      "text": "Carey, K. B., D. J. Neal, et al. (2004). \"A psychometric analysis of the self-regulation questionnaire.\" Addictive Behaviors 29(2): 253--260.",
      "doi": ""
    },
    {
      "text": "Charlton, J. P. (2002). \"A factor-analytic investigation of computer 'addiction' and engagement.\" British Journal of Psychology 93: 329--344.",
      "doi": ""
    },
    {
      "text": "Charlton, J. P., & Danforth, I.D.W. (2004). Differentiating computer-related addictions and high engagement. Psychology & IT 2004, University of Cadiz.",
      "doi": ""
    },
    {
      "text": "Cohen, J. & Cohen, P. (1983). Applied Multiple Regression/Correlation Analysis for the Behavioral Sciences, Second Edition. Lawrence Erlbaum Associates, New Jersey, USA.",
      "doi": ""
    },
    {
      "text": "Danforth, I. D. W. (2004). \"Addiction to Online Games.\"",
      "doi": ""
    },
    {
      "text": "ESA (2004). \"Top Ten Industry Facts.\" http://www.theesa.com/pressroom.html.",
      "doi": ""
    },
    {
      "text": "Goodman, A. (1990). \"Addiction: Definition and implications.\" British Journal of Psychiatry 85: 1403--1408.",
      "doi": ""
    },
    {
      "text": "Greenfield, D. N. (1999). Virtual Addiction. Oakland, CA, New Harbinger Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Griffiths, M. D., Davies, N.O., Chappell, D. (2004). \"Online Computer Gaming: A Comparison of Adolescent and Adult Gamers.\" Journal of Adolescence 27: 87--96.",
      "doi": ""
    },
    {
      "text": "Harris Interactive (2003). \"Born to Be Wired: Understanding the First Wired Generation.\" http://us.i1.yimg.com/us.yimg.com/i/promo/btbw_2003/btbw_execsum.pdf.",
      "doi": ""
    },
    {
      "text": "IGDA, S., D., Staehlin, C., McShaffry, M., Meunier, V. (2003). \"IGDA Austin Chapter Panel on Game Addiction.\" www.igda.org/articles/austin_addiction.php.",
      "doi": ""
    },
    {
      "text": "Kagan (2004). \"The Business of Movie Production and Distribution 2003.\" http://www.kagan.com/cgibin/pkcat/prd03.htm.",
      "doi": ""
    },
    {
      "text": "Kanfer, S. H. (1970). Self-regulation: Research, issues, and speculations. Behavior modification in clinical psychology. C. M. Neuringer, J.L. New York, Appleton-Century-Crofts: 178--220.",
      "doi": ""
    },
    {
      "text": "Kocovski, N. L. and N. S. Endler (2000). \"Self-regulation: Social anxiety and depression.\" Journal of Applied Biobehavioral Research 5(1): 80--91.",
      "doi": ""
    },
    {
      "text": "Kraut, R., Lundmark, V., Patterson, M., Kiesler, S., Mukopadhyay, T., & Scherlis, W. (1998). \"Internet paradox: A social technology tht reduces social involvement and psychological well-being?\" American Psychologist 53: 1017--1031.",
      "doi": ""
    },
    {
      "text": "LaRose, R., Lin, C.A., Eastin, M.S. (2003). \"Unregulated Internet Usage: Addiction, Habit, or Deficient Self-Regulation?\" Media Psychology 5(3): 225--253.",
      "doi": ""
    },
    {
      "text": "Medsearch (2004). \"Medsearch Medical Reference.\" http://www.gulflink.osd.mil/medsearch/glossary/glossary_d.shtml.",
      "doi": ""
    },
    {
      "text": "Messerly, J. G. (2004). \"How Computer Games Affect CS(and other)Students' School Performance.\" 47: 29--31.  ",
      "doi": "10.1145/971617.971639"
    },
    {
      "text": "Miller, S. A. (2002). \"Death of a game addict.\" http://www.jsonline.com/news/state/mar02/31536.asp.",
      "doi": ""
    },
    {
      "text": "Nie, N.H., & Hillygus, S. (2001). Education and democratic citizenship. In Making good citizens: Education and civil society, Diane Ravitch and Joseph Viteritti (eds.). New Haven: Yale Univ. Press.",
      "doi": ""
    },
    {
      "text": "O'Dwyer, S. (2002). \"Online Gaming Addiction on the Rise.\" http://www.media52.net/archives/000032.html.",
      "doi": ""
    },
    {
      "text": "Orzack, M. H. (2004). \"Computer Addiction Services.\" http://www.computeraddiction.com/.",
      "doi": ""
    },
    {
      "text": "Radloff, L. S. (1991). \"The use of the center for epidemiologic studies depression scale in adolescents and young adults.\" Journal of Youth and Adolescence 20: 149--166.",
      "doi": ""
    },
    {
      "text": "Rheingold, H. (2000). The Virtual Community: Homesteading on the Electronic Frontier. MIT Press. ",
      "doi": "10.5555/517690"
    },
    {
      "text": "Salguero, R. A. T., & Moran, R.M.B. (2002). \"Measuring Problem Video Game Playing in Adolescents.\" Addiction 97: 1601--1606.",
      "doi": ""
    },
    {
      "text": "Seay, A. F., Jerome, W.J., Lee, K.S., & Kraut, R.E. (2004). Project Massive: A Study of Online Gaming Communities. Proceedings of the CHI 2004 Conference on Human Factors in Computing Systems, Vienna, Austria.  ",
      "doi": "10.1145/985921.986080"
    },
    {
      "text": "Turkle, S. (1995). Life on the screen: Identity in the age of the Internet. Simon and Schuster, New York, USA. ",
      "doi": "10.5555/526517"
    },
    {
      "text": "Yee, N. (2004). \"The Daedalus Project.\" http://www.nickyee.com/daedalus/.",
      "doi": ""
    },
    {
      "text": "Young, K. S. (1998). Caught in the Net. New York, John Wiley & Sons, Inc.",
      "doi": ""
    },
    {
      "text": "Zona, I. (2004). \"Online Console Gaming, 2004.\" http://www.researchandmarkets.com/reports/225173/.",
      "doi": ""
    }
  ]
}