{
  "doi": "10.1145/1240624.1240649",
  "title": "Tactile feedback for mobile interactions",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "159-162",
  "year": 2007,
  "badges": [],
  "abstract": "We present a study investigating the use of vibrotactile feedback for touch-screen keyboards on PDAs. Such key-boards are hard to use when mobile as keys are very small. We conducted a laboratory study comparing standard but-tons to ones with tactile feedback added. Results showed that with tactile feedback users entered significantly more text, made fewer errors and corrected more of the errors they did make. We ran the study again with users seated on an underground train to see if the positive effects trans-ferred to realistic use. There were fewer beneficial effects, with only the number of errors corrected significantly im-proved by the tactile feedback. However, we found strong subjective feedback in favour of the tactile display. The results suggest that tactile feedback has a key role to play in improving interactions with touch screens.",
  "authors": [
    {
      "name": "Stephen Brewster",
      "institution": "University of Glasgow, Glasgow, UK",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    },
    {
      "name": "Faraz Chohan",
      "institution": "University of Glasgow, Glasgow, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328487749",
      "orcid": "missing"
    },
    {
      "name": "Lorna Brown",
      "institution": "University of Glasgow, Glasgow, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100012726",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akamatsu, M., MacKenzie, I.S. and Hasbrouq, T. A comparison of tactile, auditory, and visual feedback in a pointing task using a mouse-type device. Ergonomics, 38. 816--827.",
      "doi": ""
    },
    {
      "text": "Brewster, S.A. Overcoming the Lack of Screen Space on Mobile Computers. Personal and Ubiquitous Computing, 6 (3). 188--205.  ",
      "doi": "10.1007/s007790200019"
    },
    {
      "text": "Brewster, S.A. and King, A.J., An Investigation into the Use of Tactons to Present Progress Information. In Proc. of Interact 2005, Springer, 6--17.  ",
      "doi": "10.1007/11555261_4"
    },
    {
      "text": "Brown, L.M., Brewster, S.A. and Purchase, H.C., A First Investigation into the Effectiveness of Tactons. In Proc. of Worldhaptics 2005, IEEE Press, 167--176.  ",
      "doi": "10.1109/WHC.2005.6"
    },
    {
      "text": "Hart, S.G. and Wickens, C. Workload assessment and prediction. In Booher, H.R. ed. MANPRINT, an approach to systems integration, Van Nostrand Reinhold, New York, 1990, 257--296.",
      "doi": ""
    },
    {
      "text": "Klatzky, R. and Lederman, S. Chapter 6: Touch. In Healy, A. and Proctor, R. eds. Handbook of Psychology Volume 4: Experimental Psychology, John Wiley and Sons, 2003, 147--176.",
      "doi": ""
    },
    {
      "text": "Lee, J.C., Dietz, P., Leigh, D., Yerazunis, W. and Hudson, S.E., Haptic Pen: A Tactile Feedback Stylus for Touch Screens. In Proc. of ACM UIST 2004, ACM Press Addison-Wesley, 291--294.  ",
      "doi": "10.1145/1029632.1029682"
    },
    {
      "text": "Luk, J., Pasquero, J., Little, S., MacLean, K., Levesque, V. and Hayward, V. A role for haptics in mobile interaction. In Proc. ACM CHI 2006, ACM Press Addison Wesley, 171--180.  ",
      "doi": "10.1145/1124772.1124800"
    },
    {
      "text": "Poupyrev, I. and Maruyama, S., Tactile Interfaces for Small Touch Screens. In Proc. of UIST 2003, ACM Press, 217--220.  ",
      "doi": "10.1145/964696.964721"
    }
  ]
}