{
  "doi": "10.1145/1240624.1240798",
  "title": "Shallow-depth 3d interaction: design and evaluation of one-, two- and three-touch techniques",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1147-1156",
  "year": 2007,
  "badges": [],
  "abstract": "On traditional tables, people frequently use the third dimension to pile, sort and store objects. However, while effective and informative for organization, this use of the third dimension does not usually extend far above the table. To enrich interaction with digital tables, we present the concept of shallow-depth 3D -- 3D interaction with limited depth. Within this shallow-depth 3D environment several common interaction methods need to be reconsidered. Starting from any of one, two and three touch points, we present interaction techniques that provide control of all types of 3D rotation coupled with translation (6DOF) on a direct-touch tabletop display. The different techniques exemplify a wide range of interaction possibilities: from the one-touch technique, which is designed to be simple and natural, but inherits a degree of imprecision from its simplicity; through to three-touch interaction, which allows precise bimanual simultaneous control of multiple degrees of freedom, but at the cost of simplicity. To understand how these techniques support interaction in shallow-depth 3D, we present a user study that examines the efficiency of, and preferences for, the techniques developed. Results show that users are fastest and most accurate when using the three-touch technique and that their preferences were also strongly in favour of the expressive power available from three-touch.",
  "authors": [
    {
      "name": "Mark Hancock",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/do/10.1145/contrib-81100211996/rel-imgonly/acm.jpg",
      "acmid": "81100211996",
      "orcid": "missing"
    },
    {
      "name": "Sheelagh Carpendale",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452616781",
      "orcid": "missing"
    },
    {
      "name": "Andy Cockburn",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607754",
      "orcid": "0000-0003-1074-4268"
    }
  ],
  "references": [
    {
      "text": "Agarawala, A. and Balakrishnan, R. Keepin' it real: Pushing the desktop metaphor with physics, piles and the pen. In Proc. CHI, pp. 1283--1292. ACM Press, 2006.  ",
      "doi": "10.1145/1124772.1124965"
    },
    {
      "text": "Deitz, P. and Leigh, D. DiamondTouch: a multi-user touch technology. In Proc. UIST 2001, pp. 219--226. ACM Press, 2001.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Dragicevic, P. Combining crossing--based and paper-based interaction paradigms for dragging and dropping between overlapping windows. In Proc. UIST, pp. 193--196. ACM Press, 2004.  ",
      "doi": "10.1145/1029632.1029667"
    },
    {
      "text": "Fröhlich, B., Hochstrate, J., Skuk, V., and Huckauf, A. The GlobeFish and the GlobeMouse: Two new six degree of freedom input devices for graphics applications. In Proc. CHI, pp. 191--199. ACM Press, 2006.  ",
      "doi": "10.1145/1124772.1124802"
    },
    {
      "text": "Han, J. Y. Low-cost multi-touch sensing through frustrated total internal reflection. In Proc. UIST, pp. 115--118, New York, NY, USA, 2005. ACM Press.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "Hancock, M. S., Vernier, F., Wigdor, D., Carpendale, S., and Shen, C. Rotation and translation mechanisms for tabletop interaction. In Proc. Tabletop, pp. 79--86. IEEE Press, 2006.  ",
      "doi": "10.1109/TABLETOP.2006.26"
    },
    {
      "text": "Jacob, R. J. K., Sibert, L. E., McFarlane, D. C., and M. Preston Mullen, J. Integrality and separability of input devices. TOCHI, 1(1):3--26, 1994.  ",
      "doi": "10.1145/174630.174631"
    },
    {
      "text": "Kruger, R., Carpendale, S., Scott, S. D., and Greenberg, S. Roles of orientation in tabletop collaboration: Comprehension, coordination and communication. JCSCW, 13(5--6):501--537, 2004.  ",
      "doi": "10.1007/s10606-004-5062-8"
    },
    {
      "text": "Kruger, R., Carpendale, S., Scott, S. D., and Tang, A. Fluid integration of rotation and translation. In Proc. CHI, pp. 601--610. ACM Press, 2005.  ",
      "doi": "10.1145/1054972.1055055"
    },
    {
      "text": "Matsushita, M., Iida, M., Ohguro, T., Shirai, Y., Kakehi, Y., and Naemura, T. Lumisight table: a face-to-face collaboration support system that optimizes direction of projected information to each stakeholder. In Proc. CSCW, pp. 274--283. ACM Press, 2004.  ",
      "doi": "10.1145/1031607.1031653"
    },
    {
      "text": "Nakashima, K., Machida, T., Kiyokawa, K., and Takemura, H. A 2D-3D integrated environment for cooperative work. In Proc. VRST, pp. 16--22. ACM Press, 2005.  ",
      "doi": "10.1145/1101616.1101621"
    },
    {
      "text": "Sellen, A. J., Kurtenbach, G. P., and Buxton, W. S. The prevention of mode errors through sensory feedback. HCI, 7(2):141--164, 1992.",
      "doi": "10.1207/s15327051hci0702_1"
    },
    {
      "text": "Shen, C., Vernier, F. D., Forlines, C., and Ringel, M. Diamondspin: an extensible toolkit for around-the-table interaction. In Proc. CHI, pp. 167--174, New York, NY, USA, 2004. ACM Press.  ",
      "doi": "10.1145/985692.985714"
    },
    {
      "text": "Ståhl, O., Wallberg, A., Söderberg, J., Humble, J., Fahlén, L. E., Bullock, A., and Lundberg, J. Information exploration using the pond. In Proc. CVE, pp. 72--79. ACM Press, 2002.  ",
      "doi": "10.1145/571878.571890"
    },
    {
      "text": "Wang, Y., MacKenzie, C. L., Summers, V. A., and Booth, K. S. The structure of object transportation and orientation in human-computer interaction. In Proc. CHI, pp. 312--319. ACM Press, 1998.  ",
      "doi": "10.1145/274644.274688"
    },
    {
      "text": "Ware, C. Information Visualization: Perception for Design. Morgan Kaufmann, 2nd edition, 2004. ",
      "doi": "10.5555/983611"
    },
    {
      "text": "Zhai, S. and Milgram, P. Quantifying coordination in multiple DOF movement and its application to evaluating 6 DOF input devices. In Proc. CHI, pp. 320--327. ACM Press, 1998.  ",
      "doi": "10.1145/274644.274689"
    }
  ]
}