{
  "doi": "10.1145/1240624.1240680",
  "title": "PageLinker: integrating contextual bookmarks within a browser",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "337-346",
  "year": 2007,
  "badges": [],
  "abstract": "PageLinker is a browser extension that allows to contextualise navigation by linking web pages together and to navigate through a network of related web pages without prior planning. The design is based on extensive interviews with biologists, which highlighted their difficulties finding previously visited web pages. They found current browser tools inadequate, resulting in poorly organised bookmarks and rarely used history lists. In a four-week controlled field experiment, PageLinker significantly reduced time, page loads and mouse clicks. By presenting links in context, PageLinker facilitates web page revisitation, is less prone to bookmark overload and is highly robust to change.",
  "authors": [
    {
      "name": "Aurélien Tabard",
      "institution": "INRIA and LRI - University Paris-Sud & CNRS, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328490759",
      "orcid": "missing"
    },
    {
      "name": "Wendy Mackay",
      "institution": "INRIA and LRI - University Paris-Sud & CNRS, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100236706",
      "orcid": "missing"
    },
    {
      "name": "Nicolas Roussel",
      "institution": "INRIA and LRI - University Paris-Sud & CNRS, Orsay, France",
      "img": "/do/10.1145/contrib-81100029990/rel-imgonly/nicolas-roussel.png",
      "acmid": "81100029990",
      "orcid": "missing"
    },
    {
      "name": "Catherine Letondal",
      "institution": "Institut Pasteur, Paris, France",
      "img": "/do/10.1145/contrib-81100163015/rel-imgonly/portrait2.png",
      "acmid": "81100163015",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "D. Abrams, R. Baecker, and M. Chignell. Information archiving with bookmarks: personal web space construction and organization. In CHI'98: Proceedings of the SIGCHI conference on Human factors in computing systems, pages 41--48, New York, NY, USA, 1998. ACM Press/Addison-Wesley Publishing Co.  ",
      "doi": "10.1145/274644.274651"
    },
    {
      "text": "V. Anupam, J. Freire, B. Kumar, and D. Lieuwen. Automating Web navigation with the WebVCR. Computer Networks, 1:503--517, 2000.  ",
      "doi": "10.1016/S1389-1286%2800%2900073-6"
    },
    {
      "text": "S. Baker. Mosaic-surfing at home and abroad. In SIGUCCS '94: Proceedings of the 22nd annual ACM SIGUCCS conference on User services, pages 159--163, New York, NY, USA, 1994. ACM Press.  ",
      "doi": "10.1145/196355.196436"
    },
    {
      "text": "V. Bush. As we may think. Atlantic Monthly, 176(1):101--108, June 1945.",
      "doi": "10.5555/117924.117925"
    },
    {
      "text": "T. B. C. Sorensen, D. Macklin. Navigating the world wide web: Bookmark maintenance architectures. Interacting with Computers, 13:375--400, 2001.",
      "doi": ""
    },
    {
      "text": "L. D. Catledge and J. E. Pitkow. Characterizing browsing strategies in the world-wide web. In Proceedings of the Third International World-Wide Web conference on Technology, tools and applications, pages 1065--1073, 1995. Elsevier North-Holland, Inc.  ",
      "doi": "10.1016/0169-7552%2895%2900043-7"
    },
    {
      "text": "A. Cockburn, S. Greenberg, S. Jones, B. McKenzie, and M. Moyle. Improving web page revisitation: Analysis design and evaluation. IT Society, 1:159--183, 2003.",
      "doi": ""
    },
    {
      "text": "A. Cockbum, S. Greenberg, B. McKenzie, M. Smith and S. Kaasten. WebView: A graphical aid for revisiting Web pages. Proc OZCHI'99, Australia, 1999.",
      "doi": ""
    },
    {
      "text": "A. Cockburn and B. J. McKenzie. What do web users do? an empirical analysis of web use. Int. J. Hum.-Comput. Stud., 54(6):903--922, 2001.  ",
      "doi": "10.1006/ijhc.2001.0459"
    },
    {
      "text": "T. Cook and D. Campbell. QuasiExperimentation: Design & Analysis Issues for Field Settings. Houghton Mifflin Company, 1979.",
      "doi": ""
    },
    {
      "text": "J. Fujima, A. Lunzer, K. Hornbaek, and Y. Tanaka. Clip, connect, clone: combining application elements to build custom interfaces for information access. In UIST '04: Proceedings of the 17th annual ACM symposium on User interface software and technology, 2004.  ",
      "doi": "10.1145/1029632.1029664"
    },
    {
      "text": "R. Hightower, L. Ring, J. Helfman, B. Bederson, and J. Hollan. Graphical multiscale web histories: A study of PadPrints. In Hypertext '98 Proceedings, pages 58--65, 1998.  ",
      "doi": "10.1145/276627.276634"
    },
    {
      "text": "W. Jones, H. Bruce, and S. Dumais. Keeping found things found on the web. In CIKM '01: Proceedings of the tenth international conference on Information and knowledge management, pages 119--126, New York, NY, USA, 2001. ACM Press.  ",
      "doi": "10.1145/502585.502607"
    },
    {
      "text": "C. Letondal. A web interface generator for molecular biology programs in unix. Bioinformatics, 17, 2001.",
      "doi": ""
    },
    {
      "text": "C. Letondal and W. E. Mackay. Participatory programming and the scope of mutual responsibility: balancing scientific, design and software commitment. In PDC 04: Proceedings of the eighth conference on Participatory design, pages 31--41, New York, NY, USA, 2004. ACM Press.  ",
      "doi": "10.1145/1011870.1011875"
    },
    {
      "text": "W. Mackay, C. Letondal, G. Pothier, K. Bøegh, and H. Sørensen. The missing link: augmenting biology laboratory notebooks. In UIST 2002.  ",
      "doi": "10.1145/571985.571992"
    },
    {
      "text": "W. Mackay. Users and Customizable Software: A Co-Adaptive Phenomenon. PhD thesis, M.I.T., 1990.",
      "doi": ""
    },
    {
      "text": "W. Mackay. Triggers and barriers to customizing software. In CHI '91: Proceedings of the SIGCHI conference on Human factors in computing systems, pages 153--160, New York, NY, USA, 1991. ACM Press.  ",
      "doi": "10.1145/108844.108867"
    },
    {
      "text": "W. Mackay and A. L. Fayard. Video brainstorming and prototyping: techniques for participatory design. In CHI '99: CHI '99 extended abstracts on Human factors in computing systems, pages 118--119, New York, NY, USA, 1999. ACM Press.  ",
      "doi": "10.1145/632716.632790"
    },
    {
      "text": "J. Nielsen. User interface directions for the web. Commun. ACM, 42(1):65--72, 1999.  ",
      "doi": "10.1145/291469.291470"
    },
    {
      "text": "N. Roussel, A. Tabard, and C. Letondal. All you need is log. In WWW 2006 Workshop on Logging Traces of Web Activity: The Mechanics of Data Collection, May 2006. 4 pages.",
      "doi": ""
    },
    {
      "text": "Stevens, Goble, Baker, and Brass. A classification of tasks in bioinformatics. BIOINF: Bioinformatics, 17, 2001.",
      "doi": ""
    },
    {
      "text": "Suchman, L. (1987) Plans and Situated Actions. Cambridge, England: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "L. Tauscher and S. Greenberg. How people revisit web pages: empirical findings and implications for the design of history systems. International Journal of Human Computer Studies, 47(1):97--137, 1997.  ",
      "doi": "10.1006/ijhc.1997.0125"
    },
    {
      "text": "L. Tauscher and S. Greenberg. Revisitation patterns in World Wide Web navigation. In Proceedings of the Conference on Human Factors in Computing Systems CHI'97, 1997.  ",
      "doi": "10.1145/258549.258816"
    },
    {
      "text": "J. Teevan, C. Alvarado, M. Ackerman, and D. Karger. The Perfect Search Engine Is Not Enough: A Study of Orienteering Behavior in Directed Search. In Proceedings of ACM CHI 2004 Conference on Human factors and Computing Systems, pages 415--422. ACM Press, Apr. 2004.  ",
      "doi": "10.1145/985692.985745"
    },
    {
      "text": "H. Weinreich, H. Obendorf, E. Herder, and M. Mayer. Off the beaten tracks: exploring three aspects of web navigation. In WWW '06: Proceedings of the 15th international conference on World Wide Web, pages 133--142, New York, NY, USA, 2006. ACM Press.  ",
      "doi": "10.1145/1135777.1135802"
    }
  ]
}