{
  "doi": "10.1145/1240624.1240657",
  "title": "Copy-and-paste between overlapping windows",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "201-210",
  "year": 2007,
  "badges": [],
  "abstract": "Copy-and-paste, one of the fundamental operations of modern userinterfaces, can be performed through various means (e.g. using the keyboard, mouse-based direct manipulation or menus). When users copy-and-paste between two different windows, the process is complicated by window management tasks. In this paper, we propose two new window management techniques to facilitate these tasks in the particular case of partially overlapping windows. We describe an experiment comparing four commonly-used copy-and-paste techniques under four window management conditions -- non-overlapping windows, partially overlapping windows, and partially overlapping ones with one of our two window management techniques. Results show that our new window management techniques significantly reduce task completion time for all copy-and-paste techniques. They also show that X Window copy-and-paste is faster than the other three techniques under all four window management conditions.",
  "authors": [
    {
      "name": "Olivier Chapuis",
      "institution": "LRI - Univ. Paris-Sud & CNRS and INRIA, Orsay, France",
      "img": "/do/10.1145/contrib-81319489300/rel-imgonly/oc.jpg",
      "acmid": "81319489300",
      "orcid": "0000-0003-0632-3700"
    },
    {
      "name": "Nicolas Roussel",
      "institution": "LRI - Univ. Paris-Sud & CNRS and INRIA, Orsay, France",
      "img": "/do/10.1145/contrib-81100029990/rel-imgonly/nicolas-roussel.png",
      "acmid": "81100029990",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "C. Appert, M. Beaudouin-Lafon, and W. Mackay. Context Matters: Evaluating Interaction Techniques with the CIS Model. In Proceedings of HCI'04, pages 279--295. Springer Verlag, 2004.",
      "doi": ""
    },
    {
      "text": "P. Baudisch and C. Gutwin. Multiblending: displaying all overlapping windows simultaneously without the drawbacks of alpha blending. In Proceedings of CHI'04, pages 367--374. ACM Press, 2004.  ",
      "doi": "10.1145/985692.985739"
    },
    {
      "text": "M. Beaudouin-Lafon. Novel interaction techniques for overlapping windows. In Proceedings of UIST '01, pages 153--154. ACM Press, 2001.  ",
      "doi": "10.1145/502348.502371"
    },
    {
      "text": "B. Bell and S. Feiner. Dynamic space management for user interfaces. In Proceedings of UIST'00, pages 239--248. ACM Press, 2000.  ",
      "doi": "10.1145/354401.354790"
    },
    {
      "text": "E. A. Bier, E. W. Ishak, and E. Chi. Entity quick click: rapid text copying based on automatic entity extraction. In Extended abstracts of CHI '06, pages 562--567. ACM Press, 2006.  ",
      "doi": "10.1145/1125451.1125570"
    },
    {
      "text": "S. Bly and J. Rosenberg. A comparison of tiled and overlapping windows. In Proceedings of CHI '86, pages 101--106. ACM Press, 1986.  ",
      "doi": "10.1145/22627.22356"
    },
    {
      "text": "O. Chapuis and N. Roussel. Metisse is not a 3D desktop! In Proceedings of UIST '05, pages 13--22. ACM Press, 2005.  ",
      "doi": "10.1145/1095034.1095038"
    },
    {
      "text": "W. Citrin, D. Broodsky, and J. McWhirter. Style-based cut-and-paste in graphical editors. In Proceedings of AVI '94, pages 105--112. ACM Press, 1994.  ",
      "doi": "10.1145/192309.192331"
    },
    {
      "text": "P. Dragicevic. Combining crossing-based and paper-based interaction paradigms for dragging and dropping between overlapping windows. In Proceedings of UIST '04, pages 193--196. ACM Press, 2004.  ",
      "doi": "10.1145/1029632.1029667"
    },
    {
      "text": "E. Dykstra-Erickson and D. Curbow. The role of user studies in the design of OpenDoc. In Proceedings of DIS '97, pages 111--120. ACM Press, 1997.  ",
      "doi": "10.1145/263552.263588"
    },
    {
      "text": "D. C. Engelbart. Authorship provisions in augment. In Proceedings of COMPCON '84, pages 465--472. IEEE, 1984.",
      "doi": ""
    },
    {
      "text": "D. Hutchings and J. Stasko. Revisiting Display Space Management: Understanding Current Practice to Inform Next-generation Design. In Proceedings of GI'04, pages 127--134. Canadian Human-Computer Communications Society, 2004. ",
      "doi": "10.5555/1006058.1006074"
    },
    {
      "text": "E. W. Ishak and S. K. Feiner. Interacting with hidden content using content-aware free-space transparency. In Proceedings of UIST '04, pages 189--192. ACM Press, 2004.  ",
      "doi": "10.1145/1029632.1029666"
    },
    {
      "text": "E. Kandogan and B. Shneiderman. Elastic Windows: evaluation of multi-window operations. In Proceedings of CHI '97, pages 250--257. ACM Press, 1997.  ",
      "doi": "10.1145/258549.258720"
    },
    {
      "text": "M. Kim, L. Bergman, T. Lau, and D. Notkin. An ethnographic study of copy and paste programming practices in OOPL. In Proceedings of ISESE '04, pages 83--92. IEEE, 2004.  ",
      "doi": "10.5555/1018434.1021568"
    },
    {
      "text": "B. Lampson. Personal distributed computing: the alto and ethernet software. In Proceedings of the ACM Conference on The history of personal workstations, pages 101--131. ACM Press, 1986.  ",
      "doi": "10.1145/12178.12186"
    },
    {
      "text": "I. S. MacKenzie, A. Sellen, and W. A. S. Buxton. A comparison of input devices in element pointing and dragging tasks. In Proceedings of CHI '91, pages 161--166. ACM Press, 1991.  ",
      "doi": "10.1145/108844.108868"
    },
    {
      "text": "R. C. Miller and B. A. Myers. Multiple selections in smart text editing. In Proceedings of IUI '02, pages 103--110. ACM Press, 2002.  ",
      "doi": "10.1145/502716.502734"
    },
    {
      "text": "B. A. Myers. Using handhelds and PCs together. Communications of the ACM, 44(11):34--41, 2001.  ",
      "doi": "10.1145/384150.384159"
    },
    {
      "text": "J. Rekimoto. Pick-and-drop: a direct manipulation technique for multiple computer environments. In Proceedings of UIST '97, pages 31--39. ACM Press, 1997.  ",
      "doi": "10.1145/263407.263505"
    },
    {
      "text": "G. Robertson, E. Horvitz, M. Czerwinski, P. Baudisch, D. Hutchings, B. Meyers, D. Robbins, and G. Smith. Scalable Fabric: Flexible Task Management. In Proceedings of AVI '04, pages 85--89, 2004.  ",
      "doi": "10.1145/989863.989874"
    },
    {
      "text": "SAS Institute Inc. JMP Version 6. SAS Institute Inc., Cary, NC, 1989--2005.",
      "doi": ""
    },
    {
      "text": "R. Scheifler and J. Gettys. The X Window System. ACM Transactions on Graphics, 5(2):79--109, 1986.  ",
      "doi": "10.1145/22949.24053"
    },
    {
      "text": "B. Shneiderman. Creating creativity: user interfaces for supporting innovation. ACM Transactions on Computer-Human Interaction, 7(1):114--138, 2000.  ",
      "doi": "10.1145/344949.345077"
    },
    {
      "text": "D. Smith, C. Irby, R. Kimball, W. Verplank, and E. Harslem. Designing the Star user interface. Byte, 7(4):242--282, 1982.",
      "doi": ""
    },
    {
      "text": "W. Stuerzlinger, O. Chapuis, D. Phillips, and N. Roussel. User Interface Facades: Towards Adaptable User Interfaces. In Proceedings of UIST'06, pages 309--318. ACM Press, 2006.  ",
      "doi": "10.1145/1166253.1166301"
    },
    {
      "text": "J. Stylos, B. A. Myers, and A. Faulring. Citrine: providing intelligent copy-and-paste. In Proceedings of UIST '04, pages 185--188. ACM Press, 2004.  ",
      "doi": "10.1145/1029632.1029665"
    },
    {
      "text": "I. Sutherland. Sketchpad, a man-machine graphical communication system. PhD thesis, Massachusetts Institute of Technology (USA), 1963.",
      "doi": ""
    },
    {
      "text": "R. Sweet. The MESA programming environment. In Proceedings of the ACM SIGPLAN 85 symposium on Language issues in programming environments, pages 216--229. ACM Press, 1985.  ",
      "doi": "10.1145/800225.806843"
    },
    {
      "text": "W. W. Tryon. Evaluating statistical difference, equivalence, and indeterminacy using inferential confidence intervals: An integrated alternative method of conducting null hypothesis statistical tests. Psychological Methods, 6:371--386, 2001.",
      "doi": ""
    },
    {
      "text": "G. Wallace, B. Robert, and E. Tempero. Smarter cut-and-paste for programming text editors. In Proceedings of AUIC '01, pages 56--63. IEEE, 2001. ",
      "doi": "10.5555/545646.545654"
    }
  ]
}