{
  "doi": "10.1145/1240624.1240844",
  "title": "Storytelling alice motivates middle school girls to learn computer programming",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1455-1464",
  "year": 2007,
  "badges": [],
  "abstract": "We describe Storytelling Alice, a programming environment that introduces middle school girls to computer programming as a means to the end of creating 3D animated stories. Storytelling Alice supports story creation by providing 1) a set of high-level animations, that support the use of social characters who can interact with one another, 2) a collection of 3D characters and scenery designed to spark story ideas, and 3) a tutorial that introduces users to writing Alice programs using story-based examples. In a study comparing girls' experiences learning to program using Storytelling Alice and a version of Alice without storytelling support (Generic Alice), we found that users of Storytelling Alice and Generic Alice were equally successful at learning basic programming constructs. Participants found Storytelling Alice and Generic Alice equally easy to use and entertaining. Users of Storytelling Alice were more motivated to program; they spent 42% more time programming, were more than 3 times as likely to sneak extra time to work on their programs, and expressed stronger interest in future use of Alice than users of Generic Alice.",
  "tags": [
    "children",
    "computer science education",
    "gender",
    "motivation",
    "programming",
    "programming environments",
    "Alice"
  ],
  "authors": [
    {
      "name": "Caitlin Kelleher",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100607695/rel-imgonly/ckelleher.jpg",
      "acmid": "81100607695",
      "orcid": "missing"
    },
    {
      "name": "Randy Pausch",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100493478",
      "orcid": "missing"
    },
    {
      "name": "Sara Kiesler",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100476487/rel-imgonly/kiesler2001.jpg",
      "acmid": "81100476487",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "AAUW, Shortchanging Girls, Shortchanging America American Association of University Women, Washington DC, 1990.",
      "doi": ""
    },
    {
      "text": "AAUW, Tech-Savvy: Educating Girls in the New Computer Age. American Association of University Women Educational Foundation, Washington, DC, USA, 2000.",
      "doi": ""
    },
    {
      "text": "Alice 2.0. http://www.alice.org",
      "doi": ""
    },
    {
      "text": "Begel, A. LogoBlocks: A Graphical Programming Language for Interacting with the World. EECS, MIT Boston, MA, 1996.",
      "doi": ""
    },
    {
      "text": "Bruckman, A. MOOSE Crossing: Construction, Community, and Learning in a Networked Virtual World for Kids. MIT Media Lab. Boston, MA., 1997.",
      "doi": "10.5555/925796"
    },
    {
      "text": "Bruckman, A., Jenson, C., and DeBonte, A. Gender and Programming Achievement in a CSCL Environment. In Proc. CSCL 2002. (2002), 119--227. ",
      "doi": "10.5555/1658616.1658634"
    },
    {
      "text": "Dossey, J., Mullis, I., et al. The mathematics report card: Are we measuring up? Educational Testing Service, Princeton, NJ, 1988.",
      "doi": ""
    },
    {
      "text": "Duplantis, W., MacGregor, E., Klawe, M., and Ng, M. Virtual Family: an approach to introducing Java programming. In Proc. SIGCSE 2002. ACM Press (2002), 40--43.",
      "doi": "10.1145/543812.543827"
    },
    {
      "text": "Fennema, E. and Sherman, J. \"Sex Related Differences in Math Achievement, Spatial Visualization and Affective Factors.\" American Educational Research Journal 14 (1977), 51--71.",
      "doi": ""
    },
    {
      "text": "Fenton, J. and K. Beck. Playground: an object-oriented simulation system with agent rules for children of all ages. In Proc. OOPSLA. ACM Press (1989).  ",
      "doi": "10.1145/74877.74891"
    },
    {
      "text": "Fernaeus, Y., Kindborg, M., and Scholz, R. Rethinking Children's Programming with Contextual Signs. In Proc. IDC 2006. ACM Press (2006), 121--128.  ",
      "doi": "10.1145/1139073.1139105"
    },
    {
      "text": "Flanagan, M., Howe, D. and Nissenbaum, H. Values at play: design tradeoffs in socially-oriented game design. In Proc. CHI 2005. ACM Press (2005), 751--760.  ",
      "doi": "10.1145/1054972.1055076"
    },
    {
      "text": "Furger, R. Does Jane Compute?: Preserving Our Daughter's Place in the Cyber Revolution. Warner Books, Inc. New York, NY, 1998. ",
      "doi": "10.5555/522420"
    },
    {
      "text": "Gill, J. Shedding some new light on old truths: student attitudes to school in terms of year level and gender. In Proc. of the American Educational Research Association. (1994).",
      "doi": ""
    },
    {
      "text": "Harel, I. Children Designers. Ablex Publishing Norwood, N.J., 1991.",
      "doi": ""
    },
    {
      "text": "Hoyles, C., Noss, R., and Adamson, R. Rethinking the Microworld Idea. Journal of Educational Computing Research. 27, 1--2 (2002), 29--53.",
      "doi": ""
    },
    {
      "text": "Kafai, Y. Minds in Play: Computer Game Design as a Context for Children's Learning. Lawrence Erlbaum Associates, Hillsdale, N.J., 1995. ",
      "doi": "10.5555/527173"
    },
    {
      "text": "Kahn, K. Drawings on napkins, video-game animation, and other ways to program computers. Communications of the ACM 43,3 (1996), 104--106.  ",
      "doi": "10.1145/232014.232028"
    },
    {
      "text": "Kay, A. Etoys and Simstories in Squeak. http://www.squeakland.org/author/etoys.html",
      "doi": ""
    },
    {
      "text": "Kelleher, C. and Pausch, R. Lessons Learned from Designing a Programming System to Support Middle School Girls Creating Animated Stories. In Proc VL/HCC. IEEE (2006), 165--172.  ",
      "doi": "10.1109/VLHCC.2006.30"
    },
    {
      "text": "Kelleher, C. and Pausch, R. Lowering the barriers to programming: A taxonomy of programming environments and languages for novice programming. ACM Computing Surveys 37, 2 (2005), 83--137.  ",
      "doi": "10.1145/1089733.1089734"
    },
    {
      "text": "Kelleher, C. and Pausch, R. Stencils-based tutorials: design and evaluation. In Proc CHI 2005. ACM Press (2005), 541--550.  ",
      "doi": "10.1145/1054972.1055047"
    },
    {
      "text": "Linn, M., Fostering Equitable Consequences from Computer Learning Environments. Sex Roles 13, 3/4 (1985). 229--240.",
      "doi": ""
    },
    {
      "text": "Lionet, F. and Lamoureux, Y. Klik and Play, Maxis, 1994.",
      "doi": ""
    },
    {
      "text": "Logo Computer Systems, Inc., My Make Believe Castle, 1995.",
      "doi": ""
    },
    {
      "text": "Logotron, Magic Forest, 2002.",
      "doi": ""
    },
    {
      "text": "Maloney, J., Burd, L., Kafai, Y., Rusk, N., Silverman, B., and Resnick, M. Scratch: A Sneak Preview. In Proc of Creating, Connecting, and Collaborating through Computing (2004). 104--109.  ",
      "doi": "10.5555/1009376.1009408"
    },
    {
      "text": "Moskal, B., D. Lurie, et al. Evaluating the Effectiveness of a New Instructional Approach. In Proc SIGCSE 2004. ACM Press (2004), 75--79.  ",
      "doi": "10.1145/971300.971328"
    },
    {
      "text": "Nelson, M. Robocode. IBM Advanced Technologies, 2001.",
      "doi": ""
    },
    {
      "text": "Pane, J. Myers, B.A., and Miller, L.B. Using HCI Techniques to Design a More Usable Programming System. In Proc. HCC 2002, IEEE (2002), 198--206. ",
      "doi": "10.5555/795687.797801"
    },
    {
      "text": "Papert, S. Mindstorms: Children, Computers, and Powerful Ideas. Basic Books New York, NY, 1980. ",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Resnick, M. StarLogo: an environment for decentralized modeling and decentralized thinking. In Ext. Abstracts CHI 1996. ACM Press (1996), 11--12.  ",
      "doi": "10.1145/257089.257095"
    },
    {
      "text": "Smith, D., Cypher, A., and Tesler, L. Programming by example: novice programming comes of age. Communications of the ACM 43, 3 (2000), 75--81.  ",
      "doi": "10.1145/330534.330544"
    },
    {
      "text": "StarLogo TNG. http://education.mit.edu/starlogo-tng/index.htm",
      "doi": ""
    },
    {
      "text": "Tanimoto, S. and Runyan, M. Play: An Iconic Programming System for Children. Visual Languages. In S. K. Chang, T. Ichikawa and P. A. Ligomenides, Plenum Publishing Corporation (1986). 191--205.",
      "doi": ""
    },
    {
      "text": "Vegso, J. Drop in CS Bachelor's Degree Production. Computing Research News 18, 2 (2006).",
      "doi": ""
    },
    {
      "text": "Zimmer, L. and Bennett, S. Gender Differences on the California Statewide Assessment of Attitudes and Achievement in Science. Proceedings of the Annual Meeting of the American Educational Research Association. (1987).",
      "doi": ""
    }
  ]
}