{
  "doi": "10.1145/1240624.1240642",
  "title": "Shoogle: excitatory multimodal interaction on mobile devices",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "121-124",
  "year": 2007,
  "badges": [],
  "abstract": "Shoogle is a novel, intuitive interface for sensing data withina mobile device, such as presence and properties of textmessages or remaining resources. It is based around activeexploration: devices are shaken, revealing the contents rattlingaround \"inside\". Vibrotactile display and realistic impactsonification create a compelling system. Inertial sensingis used for completely eyes-free, single-handed interactionthat is entirely natural. Prototypes are described runningboth on a PDA and on a mobile phone with a wireless sensorpack. Scenarios of use are explored where active sensing ismore appropriate than the dominant alert paradigm.",
  "tags": [
    "vibrotactile",
    "audio",
    "accelerometer",
    "multimodal",
    "mobile"
  ],
  "authors": [
    {
      "name": "John Williamson",
      "institution": "University of Glasgow, Scotland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100169940",
      "orcid": "missing"
    },
    {
      "name": "Roderick Murray-Smith",
      "institution": "University of Glasgow, Scotland and NUI, Maynooth, Ireland",
      "img": "/do/10.1145/contrib-81100572841/rel-imgonly/aa.jpg",
      "acmid": "81100572841",
      "orcid": "missing"
    },
    {
      "name": "Stephen Hughes",
      "institution": "SAMH Engineering Services, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81494640446",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "P. Eslambolchilar and R. Murray-Smith. Model-based, multimodal interaction in document browsing. In Multimodal Interaction and Related Machine Learning Algorithms, 2006.  ",
      "doi": "10.1007/11965152_1"
    },
    {
      "text": "M. Fernström. Sound objects and human-computer interaction design. In D. Rocchesso and F. Fontana, editors, The Sounding Object, pages 45--59. Mondo Estremo Publishing, 2003.",
      "doi": ""
    },
    {
      "text": "T. Hermann and H. Ritter. Listen to your data: Model-based sonification for data analysis. In Advances in intelligent computing and mulimedia systems., pages 189--194. IIASRC, 1999.",
      "doi": ""
    },
    {
      "text": "K. Hinckley, J. Pierce, E. Horvitz, and M. Sinclair. Foreground and background interaction with sensor-enhanced mobile devices. ACM Trans. Comput.-Hum. Interact., 12(1):31--52, 2005.  ",
      "doi": "10.1145/1057237.1057240"
    },
    {
      "text": "K. Hinckley, J. Pierce, M. Sinclair, and E. Horvitz. Sensing techinques for mobile interaction. In UIST'2000, 2000.  ",
      "doi": "10.1145/354401.354417"
    },
    {
      "text": "S. Hughes, I. Oakley, and S. O'Modhrain. Mesh: Supporting mobile multi-modal interfaces. In UIST 2004. ACM, 2004.",
      "doi": ""
    },
    {
      "text": "K. J. Kuchenbecker, J. Fiene, and G. Niemeyer. Improving contact realism through event-based haptic feedback. IEEE Transactions on Visualization and Computer Graphics, 12(2):219--230, 2006.  ",
      "doi": "10.1109/TVCG.2006.32"
    },
    {
      "text": "J. Linjama, J. Hakkila, and S. Ronkainen. Gesture interfaces for mobile devices -- minimalist approach for haptic interaction. In CHI Workshop: Hands on Haptics: Exploring Non-Visual Visualisation Using the Sense of Touch, 2005.",
      "doi": ""
    },
    {
      "text": "S. O'Modhrain and G. Essl. Pebblebox and crumblebag: Tactile interfaces for granular synthesis. In NIME'04, 2004. ",
      "doi": "10.5555/1085884.1085901"
    },
    {
      "text": "M. Rath and D. Rocchesso. Continuous sonic feedback from a rolling ball. IEEE MultiMedia, 12(2):60--69, 2005.  ",
      "doi": "10.1109/MMUL.2005.24"
    },
    {
      "text": "J. Rekimoto. Tilting operations for small screen interfaces. In ACM Symposium on User Interface Software and Technology, pages 167--168, 1996.  ",
      "doi": "10.1145/237091.237115"
    },
    {
      "text": "K. van den Doel, P. G. Kry, and D. K. Pai. Foleyautomatic: physically-based sound effects for interactive simulation and animation. In SIGGRAPH '01, pages 537--544. ACM Press, 2001.  ",
      "doi": "10.1145/383259.383322"
    },
    {
      "text": "J. Williamson. Continuous Uncertain Interaction. PhD thesis, Dept. Computing Science, University of Glasgow, 2006.",
      "doi": ""
    },
    {
      "text": "J. Williamson and R. Murray-Smith. Pointing without a pointer. In ACM SIG CHI, pages 1407--1410. ACM, 2004.  ",
      "doi": "10.1145/985921.986076"
    },
    {
      "text": "H.-Y. Yao and V. Hayward. An experiment on length perception with a virtual rolling stone. In Eurohaptics 06, 2006.",
      "doi": ""
    }
  ]
}