{
  "doi": "10.1145/1240624.1240758",
  "title": "Pictures at the ATM: exploring the usability of multiple graphical passwords",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "887-894",
  "year": 2007,
  "badges": [],
  "abstract": "Users gain access to cash, confidential information and services at Automated Teller Machines (ATMs) via an authentication process involving a Personal Identification Number (PIN). These users frequently have many different PINs, and fail to remember them without recourse to insecure behaviours. This is not a failing of users. It is a usability failing in the ATM authentication mechanism. This paper describes research executed to evaluate whether users find multiple graphical passwords more memorable than multiple PINs. The research also investigates the success of two memory augmentation strategies in increasing memorability of graphical passwords. The results demonstrate that multiple graphical passwords are substantially more effective than multiple PIN numbers. Memorability is further improved by the use of mnemonics to aid their recall.This study will be of interest to HCI practitioners and information security researchers exploring approaches to usable security.",
  "authors": [
    {
      "name": "Wendy Moncur",
      "institution": "Aberdeen University, Aberdeen, United Kingdom",
      "img": "/do/10.1145/contrib-81350572262/rel-imgonly/wendy-kayak.jpg",
      "acmid": "81350572262",
      "orcid": "missing"
    },
    {
      "name": "Grégory Leplâtre",
      "institution": "Napier University, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418598724",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adams, A., & Sasse, M. (1999). Users are not the enemy. Communications of the ACM, 42(12), 41--46.  ",
      "doi": "10.1145/322796.322806"
    },
    {
      "text": "Brostoff, S., & Sasse, M. A. (2000). Are passfaces more usable than passwords? A field trial investigation. In Proc. HCI 2000.",
      "doi": ""
    },
    {
      "text": "Brown, SC. & Park, D.C. (2003) Theoretical models of cognitive aging and implications for translational research in medicine. Gerontologist, 43(1), 57--67.",
      "doi": ""
    },
    {
      "text": "Coventry, L., De Angeli, A., & Johnson, G. (2003). Usability and biometric verification at the ATM interface. In Proc. CHI 2003.  ",
      "doi": "10.1145/642611.642639"
    },
    {
      "text": "DeAngeli, A., Coventry, L., Johnson, G., & Renaud, K. (2005). Is a picture really worth a thousand words? Exploring the feasibility of graphical authentication systems. International Journal of Human-Computer Studies, 63(2005), 128--152.  ",
      "doi": "10.1016/j.ijhcs.2005.04.020"
    },
    {
      "text": "Dhamija, R., & Perrig, A. (2000). Deja Vu: a user study using images for authentication. In Proc.9th USENIX Security Symposium. ",
      "doi": "10.5555/1251306.1251310"
    },
    {
      "text": "Frøkjær, E. & Hornbææk, K. (2002). Metaphors of Human Thinking in HCI: Habit, Stream of Thought, Awareness, Utterance, and Knowing. In Proc. HF2002/OzCHI 2002.",
      "doi": ""
    },
    {
      "text": "Goldberg, J., Hagman, J., & Sazawal, V. (2002). Doodling our way to better authentication. In Proc. CHI 2002.  ",
      "doi": "10.1145/506443.506639"
    },
    {
      "text": "Grudin, J. (1989). The case against user interface consistency. Communications of the ACM, 32(10), 1164--1173.  ",
      "doi": "10.1145/67933.67934"
    },
    {
      "text": "Jermyn, I., Mayer, A., Monrose, F., Reiter, M., & Rubin, A. (1999). The design and analysis of graphical passwords. In Proc. 8th USENIX Security Symposium. ",
      "doi": "10.5555/1251421.1251422"
    },
    {
      "text": "Patrick, A. S., Long, A. C., & Flinn, S. (2003). HCI and security systems. In Proc. CHI '03.  ",
      "doi": "10.1145/765891.766146"
    },
    {
      "text": "Renaud, K., & De Angeli, A. (2004). My password is here! An investigation into visuo-spatial authentication mechanisms. Interacting with computers, 16(2004), 1017--1041.",
      "doi": ""
    },
    {
      "text": "Renaud, K., & Smith, E. (2001). Jiminy: helping users to remember their passwords. In Proc. SAICSIT Annual Conference.",
      "doi": ""
    },
    {
      "text": "Sasse, M., Brostoff, S., & Weirich, D. (2001). Transforming the 'weakest link' -- a human/computer interaction approach to usable and effective security. BT Technology Journal, 19(3), 122--131.  ",
      "doi": "10.1023/A%3A1011902718709"
    },
    {
      "text": "Smetters, D. K., & Grinter, R. E. (2002). Moving from the design of usable security technologies to the design of useful secure applications. In Proc. New Security Paradigms Workshop 2002, 82--89.  ",
      "doi": "10.1145/844102.844117"
    },
    {
      "text": "Suo, X., Zhu, Y., & Owen, G. (2005). Graphical Passwords: A Survey. In Proc. ACSAC'05.  ",
      "doi": "10.1109/CSAC.2005.27"
    },
    {
      "text": "Tullis, T. S., & Tedesco, D. P. (2005). Using personal photos as picorial passwords. In Proc. CHI 2005.  ",
      "doi": "10.1145/1056808.1057036"
    },
    {
      "text": "Weinshall, D., & Kirkpatrick, A. S. (2004). Passwords you'll never forget, but can't recall. In Proc. CHI 2004.  ",
      "doi": "10.1145/985921.986074"
    },
    {
      "text": "Wiedenbeck, S., Waters, J., Birget, J.-C., Brodskiy, A., & Memon, N. (2005a). Authentication using graphical passwords: effects of tolerance and image choice. In Proc. SOUPS 2005.  ",
      "doi": "10.1145/1073001.1073002"
    },
    {
      "text": "Wiedenbeck, S., Waters, J., Birget, J.-C., Brodskiy, A., & Memon, N. (2005b). PassPoints: Design and longitudinal evaluation of a graphical password system. International Journal of Human -- Computer Studies.  ",
      "doi": "10.1016/j.ijhcs.2005.04.010"
    },
    {
      "text": "Yan, J., Blackwell, A., Anderson, R., & Grant, A. (2001). The memorability and security of passwords -- Some empirical results. (Technical report No. 500). Cambridge: Cambridge University Computer Laboratory.",
      "doi": ""
    }
  ]
}