{
  "doi": "10.1145/1240624.1240861",
  "title": "Social responses to virtual humans: implications for future interface design",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1561-1570",
  "year": 2007,
  "badges": [],
  "abstract": "Do human-human social interactions carry over to human-virtual human social interactions? How does this affect future interface designers? We replicated classical tests of social influence known as the social facilitation and inhibition effects. Social facilitation/inhibition theory states that when in the presence of others, people perform simple tasks better and complex tasks worse. Participants were randomly assigned to perform both simple and complex tasks alone and in the presence of either a real human, a projected virtual human, or a virtual human in a head-mounted display. Our results showed participants were inhibited by the presence of others, whether real or virtual. That is, participants performed worse on the complex task, both in terms of percent correct and reaction times, when in the presence of others than when alone. Social facilitation did not occur with the real or virtual human. We discuss these results and their implications for future interface designers.",
  "authors": [
    {
      "name": "Catherine Amine Zanbaka",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100524931",
      "orcid": "missing"
    },
    {
      "name": "Amy Catherine Ulinski",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100439259",
      "orcid": "missing"
    },
    {
      "name": "Paula Goolkasian",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311484667",
      "orcid": "missing"
    },
    {
      "name": "Larry F. Hodges",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100023789",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexander, L. and Martray, C. The development of an abbreviated version of the mathematics anxiety rating scale. Measurement and Evaluation in Counseling and Development, 22, 3 (1989), 143--150.",
      "doi": ""
    },
    {
      "text": "Baron, R. S. Distraction-conflict theory: Progress and problems. Advances in Experimental Social Psychology, 19, (1986), 1--40.",
      "doi": ""
    },
    {
      "text": "Baylor, A. L. The Impact of Pedagogical Agent Image on Affective Outcomes. Proceedings of Workshop \"Affective Interactions: The Computer in the Affective Loop\", International Conference on Intelligent User Interfaces 2005, ACM Press (2005).",
      "doi": ""
    },
    {
      "text": "Baylor, A. L., Rosenberg-Kima, R. B., and Plant, E. A. 2006. Interface agents as social models: the impact of appearance on females' attitude toward engineering. In Ext. Abstracts CHI 2006, ACM Press (2006), 526--531.  ",
      "doi": "10.1145/1125451.1125564"
    },
    {
      "text": "Blascovich, J., Mendes, W. B., Hunter, S. B., & Salomon, K. Social \"facilitation\" as challenge and threat. Journal of Personality and Social Psychology, 31, (1999), 422--429.",
      "doi": ""
    },
    {
      "text": "Bond, C.F., and Titus, L.J. Social facilitation: A meta-analysis of 241 studies. Psychological Bulletin, 94, (1983), 265--292.",
      "doi": ""
    },
    {
      "text": "Chittaro, L., Leronutti, L., and Rigutti, S. Supporting Presentation Techniques based on Virtual Humans in Educational Virtual Worlds. In Proc. The 2005 International Conference on Cyberworlds, CW. IEEE Computer Society (2005), 245--252.  ",
      "doi": "10.1109/CW.2005.86"
    },
    {
      "text": "Cottrell, N. B., Wack, D.L., Sekerak, G.J., & Rittle, R.H. Social facilitation of dominant responses by the presence of an audience and the mere presence of others. Journal of Personality and Social Psychology, 9, (1968), 245--250.",
      "doi": ""
    },
    {
      "text": "Foos, P.W., and Goolkasian, P. Presentation Format Effects in Working Memory: The Role of Attention. Memory & Cognition, 33, 3, (2005), 499--513.",
      "doi": ""
    },
    {
      "text": "Haptek Corporation. http://www.haptek.com/.",
      "doi": ""
    },
    {
      "text": "Hendrix, C. and Barfield, W. Presence within Virtual Environments as a Function of Visual Display Parameters. Presence: Teleoperators and Virtual Environments, 5, 3, (1996), 274--289.",
      "doi": "10.1162/pres.1996.5.3.290"
    },
    {
      "text": "Hoyt, C., Blascovich, J., and Swinth, K. Social inhibition in immersive virtual environments. Presence: Teleoperators and Virtual Environments, 12, 2, (2003), 183--195.  ",
      "doi": "10.1162/105474603321640932"
    },
    {
      "text": "Johnsen, K., Dickerson, R., Raij, A., Lok, B., Jackson J., Shin, M., Hernandez, J., Stevens, A., and Lind, D. S. Experiences in Using Immersive Virtual Characters to Educate Medical Communication Skills. In Proc. IEEE Virtual Reality 2005, IEEE Computer Society (2005), 179--186.  ",
      "doi": "10.1109/VR.2005.33"
    },
    {
      "text": "Koda, T., and Maes, P. Agents with faces: The effect of personification. In Proc. IEEE International Workshop on Robot and Human Communication 1996, 189--l94.",
      "doi": ""
    },
    {
      "text": "Maes, P. Agents that reduce work and information overload. Comm. ACM 37, 7 (1994), 30--40.  ",
      "doi": "10.1145/176789.176792"
    },
    {
      "text": "Middleton, S.E. Interface agents: A review of the field. Technical Report. University of Southampton, (2000). Online: http://www.ecs.soton.ac.uk/~sem99r/agent-survey.pdf",
      "doi": ""
    },
    {
      "text": "Mortensen, J., Vinayagamoorthy, V., Slater, M., Steed, A., Lok, B., and Whitton, M. C. Collaboration in Tele-Immersive Environments. In Proc. of the Workshop on Virtual Environments, 23, (2002), 93--101. ",
      "doi": "10.5555/509709.509724"
    },
    {
      "text": "Parise, S., Kiesler, S., Sproull L., and Waters, K. My Partner is a Real Dog: Cooperation with Social Agents. In Proc. CSCW 1996, ACM Press (1996), 399--408.  ",
      "doi": "10.1145/240080.240351"
    },
    {
      "text": "Ramloll, R., Trepagnier, C., Sebrechts, M., and Finkelmeyer, A. A Gaze Contingent Environment for Fostering Social Attention in Autistic Children. In Proc. ETRA 2004, ACM Press (2004), 19--26.  ",
      "doi": "10.1145/968363.968367"
    },
    {
      "text": "Reeves, B., and Nass, C. The Media Equation: How People Treat Computers, Television, and New Media like Real People and Places. Cambridge University Press, New York, USA, 1996. ",
      "doi": "10.5555/236605"
    },
    {
      "text": "Rickenberg R., and Reeves B. The effects of animated characters on anxiety, task performance, and evaluations of user interfaces. In Proc. CHI 2000, ACM Press (2000), 49--56.  ",
      "doi": "10.1145/332040.332406"
    },
    {
      "text": "Sanders, G. S., Baron, R. S., and Moore, D. L. Distraction and social comparison as mediators of social facilitation effects. Journal of Experimental Social Psychology, 14, (1978), 291--303.",
      "doi": ""
    },
    {
      "text": "Slater, M,. Pertaub, D., and Steed, A. Public Speaking in Virtual Reality: Facing an Audience of Avatars, IEEE Computer Graphics and Applications, 19, 2, (1999), 6--9.  ",
      "doi": "10.1109/38.749116"
    },
    {
      "text": "Slater, M. and Usoh, M. Body Centered Interaction in Immersive Virtual Environments. Artificial Life and Virtual Reality, N. Magnenat Thalmann and D. Thalmann, Eds, John Wiley and Sons, (1994), 125--148.",
      "doi": ""
    },
    {
      "text": "Triplett, N. The dynamogenic factors in pacemaking and competition. Journal of Psychology, 9, (1898), 507--533.",
      "doi": ""
    },
    {
      "text": "Zanbaka, C., Goolkasian, P., Hodges, L. F. \"Can a virtual cat persuade you? The role of gender and realism in speaker persuasiveness.\" In Proc. CHI 2006, ACM Press (2006), 1153--1162.  ",
      "doi": "10.1145/1124772.1124945"
    },
    {
      "text": "Zanbaka, C., Lok, B., Babu, S., Ulinski, A., Hodges, L. F. Comparison of path visualizations and cognitive measures relative to travel technique in a virtual environment. IEEE Transactions on Visualization and Computer Graphics, 11, 6, (2005), 694--705.  ",
      "doi": "10.1109/TVCG.2005.92"
    },
    {
      "text": "Zanbaka, C., Ulinski, A., Goolkasian, P., and Hodges, L. F. Effects of Virtual Human Presence on Task Performance. In Proc. International Conference on Artificial Reality and Telexistence 2004, (2004), 174--181.",
      "doi": ""
    },
    {
      "text": "Zajonc, R. B. Social Facilitation. Science, 149, (1965), 269--274.",
      "doi": ""
    }
  ]
}