{
  "doi": "10.1145/1240624.1240697",
  "title": "The truth about lying in online dating profiles",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "449-452",
  "year": 2007,
  "badges": [],
  "abstract": "Online dating is a popular new tool for initiating romantic relationships, although recent research and media reports suggest that it may also be fertile ground for deception. Unlike previous studies that rely solely on self-report data, the present study establishes ground truth for 80 online daters' height, weight and age, and compares ground truth data to the information provided in online dating profiles. The results suggest that deception is indeed frequently observed, but that the magnitude of the deceptions is usually small. As expected, deceptions differ by gender. Results are discussed in light of the Hyperpersonal model and the self-presentational tensions experienced by online dating participants.",
  "authors": [
    {
      "name": "Jeffrey T. Hancock",
      "institution": "Cornell University, Ithaca, NY",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100212035",
      "orcid": "missing"
    },
    {
      "name": "Catalina Toma",
      "institution": "Cornell University, Ithaca, NY",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328490425",
      "orcid": "missing"
    },
    {
      "name": "Nicole Ellison",
      "institution": "Michigan State University, Lansing, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100185352",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ellison, N., Heino, R., & Gibbs, J. (2006). Managing impressions online: Self-presentation processes in the online dating environment. Journal of Computer-Mediated Communication, 11, article 2. http://jcmc.indiana.edu/vol11/issue2/ellison.html",
      "doi": ""
    },
    {
      "text": "Fiore, A. T., & Donath, J. (2004). Online Personals: An Overview. Proc, CHI (2004), 1395--1398.  ",
      "doi": "10.1145/985921.986073"
    },
    {
      "text": "Goffman, E. (1959). The Presentation of Self in Everyday Life. New York: Anchor.",
      "doi": ""
    },
    {
      "text": "Hancock, J., Thom-Santelli, J., & Ritchie, T. (2004). Deception and design: The impact of communication technology on lying behavior. Proc, CHI (2004), 129--134.  ",
      "doi": "10.1145/985692.985709"
    },
    {
      "text": "Lance, L. (1998). Gender differences in heterosexual dating: A content analysis of personal ads. Journal of Men's Studies, 6, 297--305.",
      "doi": ""
    },
    {
      "text": "Walther, J. B. (1996). Computer-mediated communication: Impersonal, interpersonal, and hyperpersonal interaction. Communication Research, 23, 3--44.",
      "doi": ""
    }
  ]
}