{
  "doi": "10.1145/1240624.1240799",
  "title": "Affordances for manipulation of physical versus digital media on interactive surfaces",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1157-1166",
  "year": 2007,
  "badges": [],
  "abstract": "This work presents the results of a comparative study in which we investigate the ways manipulation of physical versus digital media are fundamentally different from one another. Participants carried out both a puzzle task and a photo sorting task in two different modes: in a physical 3-dimensional space and on a multi-touch, interactive tabletop in which the digital items resembled their physical counterparts in terms of appearance and behavior. By observing the interaction behaviors of 12 participants, we explore the main differences and discuss what this means for designing interactive surfaces which use aspects of the physical world as a design resource.",
  "tags": [
    "manipulation",
    "affordances",
    "interface design",
    "physical",
    "digital",
    "tabletop",
    "interactive surfaces"
  ],
  "authors": [
    {
      "name": "Lucia Terrenghi",
      "institution": "LMU University of Munich, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331505035",
      "orcid": "missing"
    },
    {
      "name": "David Kirk",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100166914/rel-imgonly/dave-kirk-3.jpg",
      "acmid": "81100166914",
      "orcid": "0000-0003-2776-0643"
    },
    {
      "name": "Abigail Sellen",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100309669/rel-imgonly/abigailsellen.jpg",
      "acmid": "81100309669",
      "orcid": "missing"
    },
    {
      "name": "Shahram Izadi",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488768",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agarawala, A., Balakrishnan, R. Keepin' it Real: Pushing the Desktop Metaphor with Physics, Piles and the Pen. In Proc. of CHI 2006, 1283--1292.  ",
      "doi": "10.1145/1124772.1124965"
    },
    {
      "text": "Apted, T., Kay, J., Quigley, A. Tabletop Sharing of Digital Photographs for the Elderly. In Proc. of CHI 2006, 781--790.  ",
      "doi": "10.1145/1124772.1124887"
    },
    {
      "text": "Ark, W., Dryer, D.C., Selker, T., Zhai, S. Representation Matters: The Effect of 3 Dimensional Objects and Spatial Metaphor in a Graphical User Interface. In Proc. of HCI on People and Computers XIII, 1998, 209--219. ",
      "doi": "10.5555/646685.702778"
    },
    {
      "text": "Bier, E. A., Stone, M., Pier, K., Buxton , W., DeRose, T. Toolglass and Magic Lenses: the See-through Interface. In Proc. of SIGGRAPH 1993, 73--80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Buxton, W. Chunking and Phrasing and the Design of Human-Computer Dialogues. In Proc. of the IFIP World Computer Congress, Dublin, Ireland, 1986, 475--480.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M., Thomas, J.C. Metaphors and The Cognitive Representation of Computing Systems. IEEE Transactions on Systems, Man and Cybernetics, 12 (2), 1982, 107--116.",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., Robertson, G.G., Meyers, B., Smith, G., Robbins, D., Tan, D. Large Display Research Overview. In Proc. of CHI 2006, 69--74.  ",
      "doi": "10.1145/1125451.1125471"
    },
    {
      "text": "Dietz, P., Leigh, D. DiamondTouch: A Multi-User Touch Technology. In Proc. of UIST 2001, 219--226.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Dragicevic, P. Combining Crossing-Based and Paper-based Interaction Paradigms for Dragging and Dropping Between Overlapping Windows. In Proc. of UIST 2004, 193--196.  ",
      "doi": "10.1145/1029632.1029667"
    },
    {
      "text": "Erickson, T. Working with Interface Metaphors. In The Art of Human-Computer Interface Design, Ed. by B. Laurel, Addison-Wesley, 1990.",
      "doi": ""
    },
    {
      "text": "Fishkin, K. P. A Taxonomy for and Analysis of Tangible Interfaces. Journal of Personal and Ubiquitous Computing, 8 (5), September 2004, 347--358.  ",
      "doi": "10.5555/1023813.1023819"
    },
    {
      "text": "Fitzmaurice, G. W., Ishii, H., and Buxton, W. A. Bricks: Laying the Foundations for Graspable User Interfaces. In Proc. of SIGCHI 1995, 442--449.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Guiard, Y. Asymmetric Division of Labor in Human Skilled Bimanual Action: The Kinematic Chain as a Model. In Motor Behavior, 19 (4), 1987, 486--517.",
      "doi": ""
    },
    {
      "text": "Hancock, M., Carpendale, S., Vernier, F., Wigdor, D. Shen, C. Rotation and Translation Mechanisms for Tabletop Interaction. IEEE Workshop on TABLETOP 2006, 79--88.  ",
      "doi": "10.1109/TABLETOP.2006.26"
    },
    {
      "text": "Hinckley, K., Pausch, R., Goble, J. C., and Kassell, N. F. Passive real-world interface props for neurosurgical visualization. In Proc. of SIGCHI 1994, 452--458.  ",
      "doi": "10.1145/191666.191821"
    },
    {
      "text": "Hinrichs, U., Carpendale, S., Scott, S., Pattison, E. Interface Currents: Supporting Fluent Collaboration on Tabletop Displays. In Proc. of the 5th Symposium on Smart Graphics, 2005, 185--197.  ",
      "doi": "10.1145/1187112.1187284"
    },
    {
      "text": "Hutchins, E., Hollan, J., Norman, D. Direct Manipulation Interfaces. In D. A. Norman & S. W. Draper (Eds.) User Centered System Design: New Perspectives in Human-Computer Interaction. Lawrence Erlbaum Associates: Hillsdale, NJ, 1986.",
      "doi": ""
    },
    {
      "text": "Ishii, H. and Ullmer, B. Tangible Bits: Towards Seamless Interfaces Between People, Bits and Atoms. In Proc. of SIGCHI 1997, 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Kirsh, D. The Intelligent Use of Space. In Artificial Intelligence, 73, 1995, 31--68.  ",
      "doi": "10.1016/0004-3702%2894%2900017-U"
    },
    {
      "text": "Koike, H., Xinlei, C., Nakanishi, Y., Oka, K., Sato, Y. Two-handed Drawing on Augmented Desk. In Extended Abstracts of CHI 2002, 760--761.  ",
      "doi": "10.1145/506443.506584"
    },
    {
      "text": "Kruger, R., Carpendale, M.S.T., Scott, S.D., Greenberg, S. Roles of Orientation in Tabletop Collaboration: Comprehension, Coordination and Communication. In Journal of Computer Supported Collaborative Work, 13(5--6), 1994, 501--537.  ",
      "doi": "10.1007/s10606-004-5062-8"
    },
    {
      "text": "Laurel, B. Interface as Mimesis. In DA Norman & SW Draper (eds.), User Centered Systems Design, Hillsdale, NJ: Lawrence Earlbaum Assoc, 1986, 67--85.",
      "doi": ""
    },
    {
      "text": "Leganchuk, A., Zhai, S., Buxton, W. Manual and Cognitive Benefits of Two-Handed Input: An Experimental Study. In Transactions on Computer-Human Interaction, Vol5 (4), 1998, 326--359.  ",
      "doi": "10.1145/300520.300522"
    },
    {
      "text": "Mander, R., Salomon, G., & Wong, Y. A \"Pile\" Metaphor for Supporting Casual Organization of Information. In Proc. of CHI 1992, 627--634.  ",
      "doi": "10.1145/142750.143055"
    },
    {
      "text": "Morris, M. R., Huang, A., Paepcke, A., and Winograd, T. Cooperative Gestures: Multi-user Gestural Interactions for Co-located Groupware. In Proc. of SIGCHI 2006, 1201--1210.  ",
      "doi": "10.1145/1124772.1124952"
    },
    {
      "text": "Norman, D.A. The Psychology of Everyday Things. Basic Books, New York, 1998.",
      "doi": ""
    },
    {
      "text": "Rekimoto, J., Saitoh, M. Augmented Surfaces: A Spatially Continuous Work Space for Hybrid Computing Environments. In Proc. of CHI 1999, 378--385.  ",
      "doi": "10.1145/302979.303113"
    },
    {
      "text": "Rekimoto, J. SmartSkin: An Infrastructure for Freehand Manipulation on Interactive Surfaces. In Proc. of CHI 2001, 113--120.  ",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "Ringel, M., Berg, H., Jin, Y., Winograd, T. Barehands: Implement-Free Interaction with a Wall-Mounted Display. In Extended Abstracts of CHI 2001, 367--368.  ",
      "doi": "10.1145/634067.634284"
    },
    {
      "text": "Ringel, M., Ryall, K., Shen, C., Forlines, C., Vernier, F. Release, Relocate, Reorient, Resize: Fluid Techniques for Document Sharing on Multi-User Interactive Tables. In Proc. of CHI'04, 1441--1444.  ",
      "doi": "10.1145/985921.986085"
    },
    {
      "text": "Scott, S.D., Grant, K., D., Mandryk, R. System Guidelines for Co-located, Collaborative Work on Tabletop Displays. In Proc. of ECSCW 2003, 159--178. ",
      "doi": "10.5555/1241889.1241898"
    },
    {
      "text": "Scott, S.D., Carpendale, M.S.T, Inkpen, K.M. Territoriality in Collaborative Tabletop Workspaces. In Proc. of CSCW 2004, 294--303.  ",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Sellen, A., Harper, R. The Myth of the Paperless Office. MIT Press, Cambridge, MA, 2003. ",
      "doi": "10.5555/778158"
    },
    {
      "text": "Shen, C., Vernier, F.D., Forlines, C., Ringel, M. DiamondSpin: An Extensible Toolkit for Around-the-Table Interaction. In Proc. of CHI 2004, 167--174.  ",
      "doi": "10.1145/985692.985714"
    },
    {
      "text": "Smith, D., Irby, C., Kimbal, R., Verplank, B., Harslem, E. 1982. Designing the Star User Interface. Byte, 7/4, 242--282.",
      "doi": ""
    },
    {
      "text": "Streitz, N.A., Geiβler, J., Holmer, T., Konomi, S., Müller-Tomfelde, C., Reischl, W., Rexroth, P.,Seitz, P., Steinmetz, R. i-LAND: An Interactive Landscape for Creativity and Innovation. In Proc. of CHI 1999, 120--127.  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Tang, J.C. Findings from Observational Studies of Collaborative Work. In International Journal of Man-Machine Studies, 34, 1991, 143--160.  ",
      "doi": "10.1016/0020-7373%2891%2990039-A"
    },
    {
      "text": "Terrenghi, L. Design of Affordances for Direct Manipulation of Digital Information. In Proc. of Smart Graphics Symposium 2005, 198--205.  ",
      "doi": "10.1007/11536482_17"
    },
    {
      "text": "Terrenghi, L., Fritsche, T., Butz, A.: The EnLighTable: Design of Affordances to Support Collaborative Creativity. In Proc. of Smart Graphics Symposium 2006, 206--217.",
      "doi": ""
    },
    {
      "text": "Underkoffler, J., and Ishii, H. Urp: A Luminous-Tangible Workbench for Urban Planning and Design. In Proc. of CHI 1999, 386--393.  ",
      "doi": "10.1145/302979.303114"
    },
    {
      "text": "Wellner, P. The Digitaldesk Calculator: Tangible Manipulation on a Desktop Display. In Proc. of SIGGRAPH 1991, 107--115.  ",
      "doi": "10.1145/120782.120785"
    },
    {
      "text": "Wilson, A. PlayAnywhere: a Compact Interactive Tabletop Projection-vision System. In Proc. UIST 2005, 83--92.  ",
      "doi": "10.1145/1095034.1095047"
    },
    {
      "text": "Wu, M., Balakrishnan, R. Multi-finger and Whole Hand Gestural Interaction Techniques for Multi-User Tabletop Displays. In Proc. of UIST 2003, 193--202.  ",
      "doi": "10.1145/964696.964718"
    }
  ]
}