{
  "doi": "10.1145/1240624.1240734",
  "title": "Implicit coordination in firefighting practice: design implications for teaching fire emergency responders",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "707-716",
  "year": 2007,
  "badges": [],
  "abstract": "Fire emergency response requires rapidly processing and communicating information to coordinate teams that protect lives and property. Students studying to become fire emergency responders must learn to communicate, process, and integrate information during dangerous, stressful, and time-sensitive work. We are performing an ethnographic investigation that includes interviews with experienced fire emergency responders and observations of team burn training exercises with students. We distill salient components of firefighting practice, which are relevant to the design of fire emergency response education systems. We derive design implications for systems that teach fire emergency responders to deal with issues surrounding the communication and integration of fireground information: the mixing of communication modalities, the distribution of information acquisition sources to create information differential and uncertainty, and audible clues.",
  "tags": [
    "team cognition",
    "distributed cognition",
    "firefighting",
    "emergency response",
    "implicit coordination",
    "ethnography"
  ],
  "authors": [
    {
      "name": "Zachary O. Toups",
      "institution": "Texas A&M University, College Station, TX",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309499161",
      "orcid": "missing"
    },
    {
      "name": "Andruid Kerne",
      "institution": "Texas A&M University, College Station, TX",
      "img": "/do/10.1145/contrib-81100203284/rel-imgonly/andruidamusebouche1.jpg",
      "acmid": "81100203284",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Artman, H., Waern, Y. Distributed cognition in an emergency coordination center. Cognition, Technology, & Work 1, 4 (1999), 237--246.",
      "doi": ""
    },
    {
      "text": "Carlson, G. P., Ed. Incident Command System, 1st ed. Fire Protection Pub., 1983.",
      "doi": ""
    },
    {
      "text": "College Station Fire Dept. CSFD Departmental Standard Operating Procedures. College Station, TX, Nov 2002.",
      "doi": ""
    },
    {
      "text": "Dugdale, J., Pallamin, N., Pavard, B. An assessment of a mixed reality environment: Toward an ethnomethodological approach. Simul. Gaming 37, 2 (2006), 226--244.  ",
      "doi": "10.1177/1046878105284450"
    },
    {
      "text": "Endsley, M. R. Toward a theory of situation awareness in dynamic systems. Human Factors 37, 1 (1995), 32--64.",
      "doi": ""
    },
    {
      "text": "Entin, E. E., Serfaty, D. Adaptive team coordination. Human Factors 41, 2 (Jun 1999), 312--325.",
      "doi": ""
    },
    {
      "text": "Faraj, S., Xiao, Y. Coordination in fast-response organizations. Management Science 52, 8 (Aug 2006), 1155--1169.  ",
      "doi": "10.1287/mnsc.1060.0526"
    },
    {
      "text": "Hollan, J., Hutchins, E., and Kirsh, D. Distributed cognition: toward a new foundation for human-computer interaction research. ACM Trans. CHI 7, 2 (2000), 174--196.  ",
      "doi": "10.1145/353485.353487"
    },
    {
      "text": "Jiang, X., Chen, N. Y., Hong, J. I., Wang, K., Takayama, L., Landay, J. A. Siren: Context-aware computing for firefighting. Pervasive Comp. 3001 (2004), 87--105.",
      "doi": ""
    },
    {
      "text": "Jiang, X., Hong, J. I., Takayama, L. A., Landay, J. A. Ubiquitous computing for firefighters: Field studies and prototypes of large displays for incident command. Proc. CHI 2004, ACM, 679--686.  ",
      "doi": "10.1145/985692.985778"
    },
    {
      "text": "Landgren, J. Making action visible in time-critical work. Proc. CHI 2006, ACM, 201--210.  ",
      "doi": "10.1145/1124772.1124804"
    },
    {
      "text": "MacMillan, J., Entin, E. E., Serfaty, D., Communication overhead: The hidden cost of team cognition, Ch. {14}, 61--82.",
      "doi": ""
    },
    {
      "text": "Pike, K. L., Language in relation to a unified theory of structure of human behavior, 2nd ed. The Hague: Mouton. 1967.",
      "doi": ""
    },
    {
      "text": "Salas, E., and Fiore, S. M., Eds. Team cognition understanding the factors that drive process and performance, 1st ed. APA, 2004.",
      "doi": ""
    },
    {
      "text": "Serfaty, D. E., Entin, E. E., Volpe, C. Adaptation to stress in team decision-making and coordination. In Proc. Human Factors and Ergonomics Society (1993), 37, 1228--1233.",
      "doi": ""
    },
    {
      "text": "Suchman, L. A. Plans and situated actions. Cambridge Univ. Press, 1987.",
      "doi": ""
    },
    {
      "text": "Technical Committee on Fire and Emergency Service Organization and Deployment. NFPA 1710 Standard for the Organization and Deployment of Fire Suppression Ops., Emergency Medical Ops., and Special Ops. to the Public by Career Fire Depts., 2001 ed. National Fire Protection Assoc.",
      "doi": ""
    },
    {
      "text": "Texas Engineering Extension Service. TEEX Fire Field. Sep. 14, 2006. Online: http://www.teex.com/teex.cfm? pageid=ESTIprog&area=ESTI&templateid=1527.",
      "doi": ""
    },
    {
      "text": "Wieder, M. A., Smith, C. M., Brakhage, C. S., Eds. Fire Service Orientation Terminology, 3rd ed. Fire Protection Pub., Oklahoma State Univ, Stillwater, OK, USA, 1993.",
      "doi": ""
    }
  ]
}