{
  "doi": "10.1145/1240624.1240848",
  "title": "Engaging constable: revealing art with new technology",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1485-1494",
  "year": 2007,
  "badges": [],
  "abstract": "Museums increasingly deploy new technologies to enhance visitors' experience of their exhibitions. They primarily rely on touch-screen computer systems, PDAs and digital audio-guides. Tate Britain recently employed two innovative systems in one of their major exhibitions of John Constable's work; a gestural interface and a touch-screen panel, both connected to large projection screens. This paper reports on the analysis of video-recordings and field observations of visitors' action and interaction. It explores how people interact with and around the systems, how they configure the space around the installation and how they examine and discover their properties. It suggests that designers of interfaces and installations developed for museum exhibitions face particular challenges, such as the transparency of the relationship between people's actions and the system' response, the provision of opportunities for individual and collaborative experiences and the interweaving of technological and aesthetic experiences.",
  "authors": [
    {
      "name": "Dirk vom Lehn",
      "institution": "King's College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100561154/rel-imgonly/dscf6346.jpg",
      "acmid": "81100561154",
      "orcid": "missing"
    },
    {
      "name": "Jon Hindmarsh",
      "institution": "King's College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100637335",
      "orcid": "missing"
    },
    {
      "name": "Paul Luff",
      "institution": "King's College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100229533",
      "orcid": "missing"
    },
    {
      "name": "Christian Heath",
      "institution": "King's College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100164455",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aoki, P.M., Grinter, R.E., Hurst, A., Szymanski, M.H., Thornton, J.D. and Woodruff, A. Sotto Voce: Exploring the Interplay of Conversation and Mobile Audio Spaces. In Proc Chi 2002, ACM Press (2002), 431--438.  ",
      "doi": "10.1145/503376.503454"
    },
    {
      "text": "Bellotti, V., Back, M., Edward, W.K., Grinter, R.E., Henderson, A. and Lopes, C. Making Sense of Sensing Systems: Five Questions for Designers and Researchers. Letters CHI 1, 1 (2002), 415--422.",
      "doi": ""
    },
    {
      "text": "Boehner, K., Thom-Santelli, J., Zoss, A., Gay, G., Hall, J. and Barrett, T. Imprints of place: Creative expressions of the museum experience. In Proc CHI'2005, ACM Press (2005).  ",
      "doi": "10.1145/1056808.1056881"
    },
    {
      "text": "Brown, B. and Chalmers, M. Tourism and mobile technology. In Proc ECSCW 2003, ACM Press (2003). ",
      "doi": "10.5555/1241889.1241907"
    },
    {
      "text": "Edwards, W.K. and Grinter, R.E. At Home with Ubiquitous Computing: Seven Challenges. In Proc UbiComp2001, Springer Verlag (2001), 256--272. ",
      "doi": "10.5555/647987.741327"
    },
    {
      "text": "Galani, A. and Chalmers, M. Production of pace as a collaborative activity. In Proc Proceedings of ACM CHI 2004 Conference on Human Factors in Computing Systems, ACM Press (2004), 1417--1420.  ",
      "doi": "10.1145/985921.986079"
    },
    {
      "text": "Garfinkel, H. Studies in Ethnomethodology. Blackwell, 1967.",
      "doi": ""
    },
    {
      "text": "Garfinkel, H. Studies in Ethnomethodology. Blackwell, 1967.",
      "doi": ""
    },
    {
      "text": "Heath, C. and Luff, P. Technology in Action. Cambridge University Press, Cambridge, 2000. ",
      "doi": "10.5555/556346"
    },
    {
      "text": "Heath, C., Luff, P., vom Lehn, D., Hindmarsh, J. and Cleverly, J. Crafting Participation: designing ecologies, configuring experience. Visual Communication 1, 1 (2002), 9--34.",
      "doi": ""
    },
    {
      "text": "Heath, C. and vom Lehn, D. Configuring Reception: (Dis-)Regarding the 'Spectator' in Museums and Galleries. Theory, Culture & Society 21, 6 (2004), 43--65.",
      "doi": ""
    },
    {
      "text": "Hindmarsh, J., Heath, C., vom Lehn, D. and Cleverly, J. Creating Assemblies in Public Environments: Social interaction, interactive exhibits and CSCW. Journal of Computer Supported Collaborative Work (JCSCW) 14, 1 (2005), 1--41.  ",
      "doi": "10.1007/s10606-004-1814-8"
    },
    {
      "text": "Koleva, B., Ian Taylor, Steve Benford, Mike Fraser, Chris Greenhalgh, Holger Schnädelbach Dirk vom Lehn, Christian Heath, Ju Row-Farr, Matt Adams, Blast Theory Orchestrating a Mixed Reality Performance. In Proc CHI'2001, ACM (2001), 38--45.  ",
      "doi": "10.1145/365024.365033"
    },
    {
      "text": "Menninger, M. The analysis of time data in visitor research and evaluation studies. In Proc Visitor Studies: Theory, Research, and Practice, (1991), 104--113.",
      "doi": ""
    },
    {
      "text": "Phillips, D. Evaluating Time-Lapse Video Evaluation. Museum Management and Curatorship 14, 1 (1995), 19--29.",
      "doi": ""
    },
    {
      "text": "Reeves, S., Benford, S., O'Mailey, C. and Fraser, M. Designing the Spectator Experience. In Proc SIGCHI Conference on Human Factors in Computing CHI2005 ACM Press (2005), 741--750.  ",
      "doi": "10.1145/1054972.1055074"
    },
    {
      "text": "Sacks, H. Lectures on Conversation. Blackwell, Oxford, 1992.",
      "doi": ""
    },
    {
      "text": "Scott, C. Interactivity. Curator: The Museum Journal (Special Issue) 47, 2 (2005).",
      "doi": ""
    },
    {
      "text": "Spasojevic, M. and Kindberg, T. A Study of an Augmented Museum Experience. Hewlett Packard, (HPL-2001-178).",
      "doi": ""
    },
    {
      "text": "Suchman, L. Plans and Situated Actions. The Problem of Human-Machine Communication. Cambridge University Press, Cambridge, 1987. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Thomas, S. and Mintz, A. (ed.) The Virtual and the Real: Media in the Museum. American Association of Museums, Washington, DC, 1998. ",
      "doi": "10.5555/551347"
    },
    {
      "text": "Williams, A., Kabisch, E. and Dourish, P. From Interaction to Participation: Configuring Space through Embodied Interaction, In Lecture Notes in Computer Science, (eds.), Springer, Berlin & Heidelberg, 2005, 287--304.  ",
      "doi": "10.1007/11551201_17"
    }
  ]
}