{
  "doi": "10.1145/1240624.1240715",
  "title": "Aligning development tools with the way programmers think about code changes",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "567-576",
  "year": 2007,
  "badges": [],
  "abstract": "Software developers must modify their programs to keepup with changing requirements and designs. Often, aconceptually simple change can require numerous editsthat are similar but not identical, leading to errors andomissions. Researchers have designed programming environmentsto address this problem, but most of thesesystems are counter-intuitive and difficult to use.By applying a task-centered design process, we developeda visual tool that allows programmers to makecomplex code transformations in an intuitive manner.This approach uses a representation that aligns wellwith programmers' mental models of programming structures.The visual language combines textual and graphicalelements and is expressive enough to support a broadrange of code-changing tasks. To simplify learning thesystem, its user interface scaffolds construction and executionof transformations. An evaluation with Java programmerssuggests that the interface is intuitive, easyto learn, and effective on a representative editing task.",
  "tags": [
    "cognitive dimensions",
    "transformations",
    "visual languages"
  ],
  "authors": [
    {
      "name": "Marat Boshernitsan",
      "institution": "Agitar Software: Inc., Mountain View, CA",
      "img": "/do/10.1145/contrib-81100402373/rel-imgonly/marat-square.jpg",
      "acmid": "81100402373",
      "orcid": "missing"
    },
    {
      "name": "Susan L. Graham",
      "institution": "University of California, Berkeley, Berkeley, CA",
      "img": "/do/10.1145/contrib-81452606376/rel-imgonly/81452606376.jpg",
      "acmid": "81452606376",
      "orcid": "missing"
    },
    {
      "name": "Marti A. Hearst",
      "institution": "University of California, Berkeley, Berkeley, CA",
      "img": "/do/10.1145/contrib-81100612246/rel-imgonly/marti_small.jpg",
      "acmid": "81100612246",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "XSL transformations (XSLT), version 1.0. World Wide Web Consortium, Recommendation, Nov. 1999.",
      "doi": ""
    },
    {
      "text": "G. J. Badros. JavaML: a markup language for Java source code. Computer Networks, 33(1--6):159--177, June 2000.  ",
      "doi": "10.1016/S1389-1286%2800%2900037-2"
    },
    {
      "text": "I. D. Baxter, C. Pidgeon, and M. Mehlich. DMS: Program transformations for practical scalable software evolution. In Proc. of ICSE '04, pages 625--634, 2004. ",
      "doi": "10.5555/998675.999466"
    },
    {
      "text": "A. F. Blackwell. SWYN: A visual representation for regular expressions. In H. Lieberman, editor, Your Wish Is My Command. Morgan Kauffman, 2001. ",
      "doi": "10.5555/369505.369521"
    },
    {
      "text": "A. F. Blackwell and T. R. G. Green. A cognitive dimensions questionnaire optimised for users. In A. Blackwell and E. Bilotta, editors, Proc. of PPIG 13, May 2000.",
      "doi": ""
    },
    {
      "text": "M. Boshernitsan. Program Manipulation via Interactive Transformations. PhD thesis, EECS Department, University of California, Berkeley, July 25 2006. Technical Report UCB/EECS-2006-100. ",
      "doi": "10.5555/1236735"
    },
    {
      "text": "M. Boshernitsan and S. L. Graham. Designing an XML-based exchange format for harmonia. In Proc. of WCRE '00, pages 287--289, 2000. ",
      "doi": "10.5555/832307.837088"
    },
    {
      "text": "S. Burson, G. B. Kotik, and L. Z. Markosian. A program transformation approach to automating software reengineering. In Proc. of ICSAC '90, pages 314--322, 1990.",
      "doi": ""
    },
    {
      "text": "M. L. Collard, J. I. Maletic, and A. Marcus. Supporting document and data views of source code. In Proc. of DocEng '02, pages 34--41, 2002.  ",
      "doi": "10.1145/585058.585066"
    },
    {
      "text": "J. R. Cordy, T. R. Dean, A. J. Malton, and K. A. Schneider. Software engineering by source transformation-experience with TXL. In Proc. of SCAM '01, pages 170--180, 2001.",
      "doi": ""
    },
    {
      "text": "J. R. Cordy, C. D. Halpern-Hamu, and E. Promislow. TXL: A rapid prototyping system for programming language dialects. Comput. Lang, 16(1):97--107, 1991.  ",
      "doi": "10.1016/0096-0551%2891%2990019-6"
    },
    {
      "text": "F. Detienne. Software Design -- Cognitive Aspects. Springer Verlag, 2001. ",
      "doi": "10.5555/502973"
    },
    {
      "text": "A. A. diSessa and H. Abelson. Boxer: a reconstructible computational medium. CACM, 29(9):859--868, 1986.  ",
      "doi": "10.1145/6592.6595"
    },
    {
      "text": "D. Dougherty. sed & awk. O'Reilly & Associates, Inc., 1991.",
      "doi": ""
    },
    {
      "text": "M. Erwig. A visual language for XML. In Proc. of VL '00, page 47, 2000. ",
      "doi": "10.5555/832281.834562"
    },
    {
      "text": "T. R. G. Green. Cognitive dimensions of notations. In Proc. of HCI'89, Cognitive Ergonomics, pages 443--460, 1989. ",
      "doi": "10.5555/92968.93015"
    },
    {
      "text": "W. G. Griswold, D. C. Atkinson, and C. McCurdy. Fast, flexible syntactic pattern matching and processing. In Proc. of WPC '96, 1996. ",
      "doi": "10.5555/525394.837836"
    },
    {
      "text": "H. Hosoya and B. C. Pierce. XDuce: A statically typed XML processing language. ACM Transactions on Internet Technology, 3(2):117--148, May 2003.  ",
      "doi": "10.1145/767193.767195"
    },
    {
      "text": "D. E. Knuth. The errors of TEX. Software- Practice and Experience, 19(7):607--681, July 1989.  ",
      "doi": "10.1002/spe.4380190702"
    },
    {
      "text": "D. A. Ladd and J. C. Ramming. A*: A language for implementing language processors. IEEE Transactions on Software Engineering, 21(11):894--901, Nov. 1995.  ",
      "doi": "10.1109/32.473218"
    },
    {
      "text": "J. Landauer and M. Hirakawa. Visual AWK: a model for text processing by demonstration. In Proc. of VL '95, 1995. ",
      "doi": "10.5555/832276.834280"
    },
    {
      "text": "R. C. Martin and R. S. Koss. Engineer notebook: An extreme programming episode. In R. C. Martin, editor, Advanced Principles, Patterns and Process of Software Development. Prentice Hall, 2001.",
      "doi": ""
    },
    {
      "text": "R. C. Miller and B. A. Myers. Interactive simultaneous editing of multiple text regions. In Proc. of USENIX ATC'01, pages 161--174, 2001. ",
      "doi": "10.5555/647055.715910"
    },
    {
      "text": "R. P. Nix. Editing by example. ACM Trans. Program. Lang. Syst., 7(4):600--621, 1985.  ",
      "doi": "10.1145/4472.4476"
    },
    {
      "text": "E. Pietriga, J.-Y. Vion-Dury, and V. Quint. VXT: A visual approach to XML transformations. In Proc. of DocEng '01, pages 1--10, 2001.  ",
      "doi": "10.1145/502187.502189"
    },
    {
      "text": "D. Roberts and J. Brant. Tools for making impossible changes. IEE Proceedings Software, 151(2):49--56, 2004.",
      "doi": ""
    },
    {
      "text": "D. Roberts, J. Brant, and R. E. Johnson. A refactoring tool for Smalltalk. Theory and Practice of Object Systems, 3(4):253--263, 1997.  ",
      "doi": "10.5555/280606.280610"
    },
    {
      "text": "E. B. Swanson. The dimensions of maintenance. In Proc. of ICSE '76, pages 492--497, 1976. ",
      "doi": "10.5555/800253.807723"
    },
    {
      "text": "E. Visser. Program transformation with Stratego/XT. In C. Lengauer et al., editors, Domain-Specific Program Generation, volume 3016 of Lecture Notes in Computer Science, pages 216--238. Spinger-Verlag, June 2004.",
      "doi": ""
    },
    {
      "text": "R. C. Waters. Program translation via abstraction and reimplementation. IEEE Transactions on Software Engineering, 14(8):1207--1228, Aug. 1988.  ",
      "doi": "10.1109/32.7629"
    },
    {
      "text": "I. H. Witten and D. Mo. TELS: learning text editing tasks from examples. pages 183--203, 1993. ",
      "doi": "10.5555/168080.168108"
    }
  ]
}