{
  "doi": "10.1145/1240624.1240803",
  "title": "\"Look!\": using the gaze direction of embodied agents",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1187-1190",
  "year": 2007,
  "badges": [],
  "abstract": "This paper describes the results of three studies investigating an embodied agent that supports its interaction with the user by gazing at corresponding objects within its close environment. Three experiments were conducted in order to research whether users can detect an agent's line of sight, whether the agent's gaze direction can help to guide the users' attention towards designated locations and whether such a setup can be used to improve realistic interaction situations. The results show that a) users can detect the agent's gaze direction quickly (within 200 ms) but not very exactly, b) the use of the agent's gaze direction can speed up but also slow down the detection of objects in dependence on their location and c) that the agent's gaze towards corresponding objects during the interaction can have counterproductive effects in realistic settings.",
  "authors": [
    {
      "name": "Johann Schrammel",
      "institution": "CURE - Center for Usability Research & Engineering, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100044484",
      "orcid": "missing"
    },
    {
      "name": "Arjan Geven",
      "institution": "CURE - Center for Usability Research & Engineering, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318488802",
      "orcid": "missing"
    },
    {
      "name": "Reinhard Sefelin",
      "institution": "CURE - Center for Usability Research & Engineering, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100509383",
      "orcid": "missing"
    },
    {
      "name": "Manfred Tscheligi",
      "institution": "CURE - Center for Usability Research & Engineering, Vienna, Austria and University of Salzburg, Salzburg, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548016789",
      "orcid": "0000-0001-6056-7285"
    }
  ],
  "references": [
    {
      "text": "Bickmore, T.W. (2003). Relational Agents: Effecting Change through Human-Computer Relationships, Ph.D. Thesis, MIT.",
      "doi": ""
    },
    {
      "text": "Colburn, R.A., Cohen, M.F. and Drucker, S.M. (2000). The Role of Eye Gaze in Avatar Mediated Conversational Interfaces. Technical Report, MSR-TR-2000-81. Microsoft Research.",
      "doi": ""
    },
    {
      "text": "Nass, C., Steuer, J. and Tauber, E.R., (1994). Computers are Social Actors, CHI '94: Proceedings of the SIGCHI conference on Human factors in computing systems.  ",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Reeves, B. and Nass, C. (1996). The Media Equation: How People Treat Computers, Television, and New Media Like Real People and Places. Cambridge University Press, Cambridge, UK. ",
      "doi": "10.5555/236605"
    },
    {
      "text": "van Es, I.; Heylen, D.; van Dijk, B. & Nijholt, A. (2002). Gaze behavior of talking faces makes a difference. CHI '02: Extended abstracts on Human factors in computing system.  ",
      "doi": "10.1145/506443.506571"
    },
    {
      "text": "Vernon, D. (2004). Cognitive Vision -- The Development of a Discipline, Proc. IST 2004 Event 'Participate in your future'.",
      "doi": ""
    },
    {
      "text": "www.haptek.com",
      "doi": ""
    }
  ]
}