{
  "doi": "10.1145/1240624.1240634",
  "title": "Understanding videowork",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "61-70",
  "year": 2007,
  "badges": [],
  "abstract": "In this paper we elucidate the patterns of behavior of home movie makers through a study of 12 families and a separate focus group of 7 teenagers. Analogous to a similar study of photowork [13], the goal is to provide a deeper understanding of what people currently do with video technologies, balancing the preponderence of techno-centric work in the area with appropriate user-centric insight. From our analysis, we derive a videowork lifecycle to frame the practices users engage in when working with video technologies in the home, and uncover two broad types of video usage therein. This has implications for how we conceive of and devise tools to support these practices, as we discuss.",
  "tags": [
    "home movies",
    "video",
    "editing",
    "user research"
  ],
  "authors": [
    {
      "name": "David Kirk",
      "institution": "University of Nottingham, Nottingham, UK",
      "img": "/do/10.1145/contrib-81100166914/rel-imgonly/dave-kirk-3.jpg",
      "acmid": "81100166914",
      "orcid": "0000-0003-2776-0643"
    },
    {
      "name": "Abigail Sellen",
      "institution": "Microsoft Research Cambridge, Cambridge, UK",
      "img": "/do/10.1145/contrib-81100309669/rel-imgonly/abigailsellen.jpg",
      "acmid": "81100309669",
      "orcid": "missing"
    },
    {
      "name": "Richard Harper",
      "institution": "Microsoft Research Cambridge, Cambridge, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452613064",
      "orcid": "missing"
    },
    {
      "name": "Ken Wood",
      "institution": "Microsoft Research Cambridge, Cambridge, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81344500170",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abowd, G. D., Gauger, M. and Lachenmann, A. The Family Video Archive: An annotation and browsing environment for home movies. In Proc. MIR'03, ACM Press (2003), 1--8.  ",
      "doi": "10.1145/973264.973266"
    },
    {
      "text": "Adams, B., Venkatesh, S. and Jain, R. IMCE: Integrated Media Creation Environment. ACM Transactions on Multimedia Computing, Communications and Applications. 1, 3 (2005), 211--247.  ",
      "doi": "10.1145/1083314.1083315"
    },
    {
      "text": "Beyer, H. & Holtzblatt, K. Contextual Design: Defining Customer--Centered Systems. Academic Press: Kaufmann Publishers, (1998). ",
      "doi": "10.5555/286067"
    },
    {
      "text": "Boreczky, J., Girgensohn, A., Golovchinsky, G. and Uchihashi, S. An Interactive Comic Book Presentation for Exploring Video. In Proc. CHI 2000, ACM Press (2000), 185--192.  ",
      "doi": "10.1145/332040.332428"
    },
    {
      "text": "Brown, B. and Sellen, A. Sharing and Listening to Music. In K. O'Hara and B. Brown (Eds.) Consuming Music Together: Social and Collaborative Aspects of Music Consumption Technologies. Springer: Netherlands, (2006) 37--56.",
      "doi": ""
    },
    {
      "text": "Casares, J., Long, A. C., Myers, B., Bhatnagar, R., Stevens, S. M., Dabbish, L., Yocum, D. and Corbett, A. Simplifying Video Editing Using Metadata. In Proc. DIS2002, ACM Press (2002), 157--166.  ",
      "doi": "10.1145/778712.778737"
    },
    {
      "text": "Davis, M. Garage Cinema and the Future of Media Technology. Communications of the ACM, 40, 2 (1997), 43--48.  ",
      "doi": "10.1145/253671.253697"
    },
    {
      "text": "Doherty, J., Wilcox, L. and Girgensohn, A. A Hitchcock Assisted Video Edited Night at the Opera. In Proc. Multimedia'02, ACM Press (2002), 660--661.  ",
      "doi": "10.1145/641007.641142"
    },
    {
      "text": "Girgensohn, A., Bly, S., Shipman, F., Boreczky, J and Wilcox, L. Home Video Editing Made Easy -- Balancing Automation and User Control. In Proc. INTERACT'01, IOS Press, Tokyo, Japan, (2001), 464--471.",
      "doi": ""
    },
    {
      "text": "Girgensohn, A., Boreczky, J., Chiu, P., Doherty, J., Foote, J., Golovchinsky, G., Uchihashi, S. and Wilcox, L. A Semi--automatic Approach to Home Video Editing. In Proc. UIST'00, ACM Press (2000), 81--89.  ",
      "doi": "10.1145/354401.354415"
    },
    {
      "text": "Hua, X., Lu, L. and Zhang, H. AVE -- Automated Home Video Editing. In Proc. MM'03, ACM Press (2003), 490--497.  ",
      "doi": "10.1145/957013.957121"
    },
    {
      "text": "Kindberg, T., Spasojevic, M., Fleck, R. and Sellen A. I Saw This and Thought of You: Some Social Uses of Camera Phones. In Proc. CHI '05 Extended Abstracts. ACM Press (2005), 1545--1548.  ",
      "doi": "10.1145/1056808.1056962"
    },
    {
      "text": "Kirk, D. S., Sellen, A., Rother, C. and Wood, K. Understanding Photowork. In Proc. CHI 2006, ACM Press (2006), 761--770.  ",
      "doi": "10.1145/1124772.1124885"
    },
    {
      "text": "Pan, Z. and Ngo, C. Structuring Home Video by Snippet Detection and Pattern Parsing. In Proc. MIR'04, ACM Press (2004), 69--76.  ",
      "doi": "10.1145/1026711.1026723"
    },
    {
      "text": "Stevens, M. M., Abowd, G. D., Truong, K. N. and Vollmer, F. Getting into the Living Memory Box: Family archives & holistic design. Personal and Ubiquitous Computing, 7, (2003), 210--216.  ",
      "doi": "10.1007/s00779-003-0220-4"
    },
    {
      "text": "Yan, W. and Kankanhalli M. S. Detection and Removal of Lighting & Shaking Artifacts in Home Videos. In Proc. Multimedia'02, ACM Press (2002), 107--116.  ",
      "doi": "10.1145/641007.641031"
    },
    {
      "text": "Yip, S., Leu, E. and Howe, H. The Automatic Video Editor. In Proc. MM'03, ACM Press (2003), 596--597.  ",
      "doi": "10.1145/957013.957138"
    },
    {
      "text": "Zhu, C., Mei, T. and Hua, X. Natural Video Browsing. In Proc. MM'05, ACM Press (2005), 265--266.  ",
      "doi": "10.1145/1101149.1101198"
    }
  ]
}