{
  "doi": "10.1145/1240624.1240638",
  "title": "An exploratory study of input configuration and group process in a negotiation task using a large display",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "91-100",
  "year": 2007,
  "badges": [],
  "abstract": "This paper reports on an exploratory study of the effects of input configuration on group behavior and performance in a collaborative task performed by a collocated group using a large display. Twelve groups completed a mixed-motive negotiation task under two conditions: a single, shared mouse and one mouse per person. Results suggest that the multiple mouse condition allowed for more parallel work, but the quality of discussion was higher in the single mouse condition. Moreover, participants were more likely to act in their own best interest in the multiple mouse condition.",
  "authors": [
    {
      "name": "Jeremy P. Birnholtz",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100651315",
      "orcid": "missing"
    },
    {
      "name": "Tovi Grossman",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    },
    {
      "name": "Clarissa Mak",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489697",
      "orcid": "missing"
    },
    {
      "name": "Ravin Balakrishnan",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100503904",
      "orcid": "0000-0002-3379-7680"
    }
  ],
  "references": [
    {
      "text": "Anderson, J.R. Cognitive Psychology and Its Implications. Worth Publishers, New York, NY, 2000.",
      "doi": ""
    },
    {
      "text": "Ball, R., Szwedo, M. and North, C. Dynamic size and speed cursor for large, high-resolution displays., Computer Science, Virginia Tech, 2006.",
      "doi": ""
    },
    {
      "text": "Barley, S.R. The alignment of technology and structure through roles and networks. Administrative Science Quarterly, 35, 1 (1990). 61--103.",
      "doi": ""
    },
    {
      "text": "Baudisch, P., Cutrell, E. and Robertson, G., high-density cursor: a visualization technique that helps users keep track of fast-moving mouse cursors. In Proc. Interact (2003), 236--243.",
      "doi": ""
    },
    {
      "text": "Benko, H., Wilson, A.D. and Baudisch, P., Precise selection techniques for multi-touch screens. In Proc. CHI, (2006), 1263--1271.  ",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "Bezerianos, A. and Balakrishnan, R. The vacuum: facilitating the manipulation of distant objects. In Proc. CHI (2005), 361--370.  ",
      "doi": "10.1145/1054972.1055023"
    },
    {
      "text": "Burgoon, J.K., Johnson, M.L. and Koch, P.T. The nature and measurement of interpersonal dominance. Communication Monographs, 65, (1998). 308--335.",
      "doi": ""
    },
    {
      "text": "Cohen, J. A coefficient of agreement for nominal scales. Educational and Psychological Measurement, 20, 1 (1960). 37--46.",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., Smith, G., Regan, T., Meyers, B., Robertson, G. and Starkweather, G., Woard characterizing the productivity benefits of very large displays. In Proc. Interact (2003), 9--16.",
      "doi": ""
    },
    {
      "text": "Davis, J. and Chen, X. Lumipoint: multi-user laser-based interaction on large tiled displays. Displays, 23, (2002). 205--211.",
      "doi": ""
    },
    {
      "text": "Dimicco, J.M., Pandolfo, A. and Bender, W., Influencing group participation with a shared display. In Proc. CSCW, (2004), 614--623.  ",
      "doi": "10.1145/1031607.1031713"
    },
    {
      "text": "Dudfield, H.J., Macklin, C., Fearnley, R., Simpson, A. and Hall, P., Big is better? human factors issues of large screen displays with military command teams. In People in Control (2001), 304--309.",
      "doi": ""
    },
    {
      "text": "Eady, P.M. and Lafferty, J.C. The subarctic survival situation. Synergistics, Plymouth, MI, 1975.",
      "doi": ""
    },
    {
      "text": "Elrod, S., Bruce, R., Gold, R., Goldberg, D., Halasz, F., Janssen, W., Lee, D., McCall, K., Pedersen, E., Pier, K., Tang, J.C. and Welch, B., Liveboard: a large interactive display supporting group meetings, presentations and remote collaboration. In Proc. CHI (1992), 599--607.  ",
      "doi": "10.1145/142750.143052"
    },
    {
      "text": "Fish, R.S., Kraut, R.E., Root, R.W. and Rice, R.E. Video as a technology for informal communication. Communications of the ACM, 36, 1 (1993). 46--61.  ",
      "doi": "10.1145/151233.151237"
    },
    {
      "text": "Guimbretière, F., Stone, M. and Winograd, T., Fluid interaction with high-resolution wall-size displays. In Proc. UIST (2001), 21--30.  ",
      "doi": "10.1145/502348.502353"
    },
    {
      "text": "Gutwin, C. and Greenberg, S. A descriptive framework of workspace awareness for real-time groupware. Computer Supported Cooperative Work, 11, (2002). 411--446.  ",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "Huang, W., Olson, J.S. and Olson, G.M., Camera angle affects dominance in video-mediated communication. In Proc. CHI (2002), 716--717.  ",
      "doi": "10.1145/506443.506562"
    },
    {
      "text": "Inkpen, K., McGrenere, J., Booth, K.S. and Klawe, M., The effect of turn-taking protocols on children's learning in mouse-driven collaborative environments. In Proc. Graphics Interface (1997), 138--145. ",
      "doi": "10.5555/266774.266793"
    },
    {
      "text": "Inkpen, K.M., Hawkey, K., Kellar, M., Mandryk, R., Parker, K., Reilly, D., Scott, S. and Whalen, T., Exploring display factors that influence co-located collaboration: angle, size, number, and user arrangement. In Proc. HCI International (2005).",
      "doi": ""
    },
    {
      "text": "Jacob, R.J.K., Sibert, L.E., McFarlane, D.C. and Mullen, M.P. Integrality and separability of input devices. ACM TOCHI, 1, 1 (1994). 3--26.  ",
      "doi": "10.1145/174630.174631"
    },
    {
      "text": "Khan, A., Fitzmaurice, G., Almeida, D., Burtnyk, N. and Kurtenbach, G., A remote control interface for large displays. In Proc. UIST (2004), 127--136.  ",
      "doi": "10.1145/1029632.1029655"
    },
    {
      "text": "Kraut, R. Applying social psychological theory to the problems of group work. in Carroll, J.M. ed. HCI Models, Theories and Frameworks, Morgan Kaufmann, New York, 2003, 325--356.",
      "doi": ""
    },
    {
      "text": "Malik, S., Ranjan, A. and Balakrishnan, R. Interacting with large displays from a distance with vision-tracked multi-finger gestural input. in Proc. UIST (2005), 43--52.  ",
      "doi": "10.1145/1095034.1095042"
    },
    {
      "text": "Malone, T.W. and Crowston, K. The interdisciplinary study of coordination. ACM Computing Surveys, 24, 1 (1994). 87--119.  ",
      "doi": "10.1145/174666.174668"
    },
    {
      "text": "McGrath, J.E. Groups: Interaction and performance. Prentice-Hall, Englewood Cliffs, NJ, 1984.",
      "doi": ""
    },
    {
      "text": "Moran, T.P., Chiu, P., Melle, W.v. and Kurtenbach, G., Pen-based interaction techniques for organizing material on an electronic whiteboard. In Proc. UIST (1997), 127--136.  ",
      "doi": "10.1145/263407.263508"
    },
    {
      "text": "Morris, M.R., Ryall, K., Shen, C., Forlines, C. and Vernier, F., Beyond \"social protocols:\" multi-user coordination policies for co-located groupware. In Proc. CSCW (2004), 262--265.  ",
      "doi": "10.1145/1031607.1031648"
    },
    {
      "text": "Nunally, J.C. Psychometric Theory. McGraw-Hill, New York, 1978.",
      "doi": ""
    },
    {
      "text": "Oh, J.-Y. and Stuerzlinger, W., Laser pointers as collaborative pointing devices. In Proc. Graphics Interface (2002).",
      "doi": ""
    },
    {
      "text": "Olsen, D.R. and Nielsen, T., Laser pointer interaction. In Proc. CHI (2001), 17--22.  ",
      "doi": "10.1145/365024.365030"
    },
    {
      "text": "Olson, G.M. and Olson, J.S. Distance matters. Human-Computer Interaction, 15, (2001). 139--179.  ",
      "doi": "10.1207/S15327051HCI1523_4"
    },
    {
      "text": "Ranjan, A., Birnholtz, J.P. and Balakrishnan, R., An exploratory analysis of partner action and camera control in a video-mediated collaborative task. In Proc. CSCW (2006).  ",
      "doi": "10.1145/1180875.1180936"
    },
    {
      "text": "Renambot, L., Jeong, B., Jagodic, R., Johnson, A. and Leigh, J., Collaborative visualization using high-resolution tiled displays. In ACM CHI Workshop on Information Visualization Interaction Techniques for Collaboration Across Multiple Displays (2006).",
      "doi": ""
    },
    {
      "text": "Robertson, G., Czerwinski, M., Baudisch, P., Meyers, B., Robbins, D., Smith, G. and Tan, D.S. The large-display user experience. IEEE Computer Graphics and Applications (2005). 44--51.  ",
      "doi": "10.1109/MCG.2005.88"
    },
    {
      "text": "Sears, A. and Schneiderman, B. High precision touchscreens: design strategies and comparisons with a mouse. International Journal of Man-Machine Studies, 34, 4 (1991). 593--613.  ",
      "doi": "10.1016/0020-7373%2891%2990037-8"
    },
    {
      "text": "Smith, V. Microeconomic systems as experimental science. American Economic Review, 72, 5 (1982). 923--955.",
      "doi": ""
    },
    {
      "text": "Stewart, J., B., B.B. and Druin, A., Single display groupware: a model for co-present collaboration. In Proc. CHI (1999), 286--293.  ",
      "doi": "10.1145/302979.303064"
    },
    {
      "text": "Streitz, N.A., Geissler, J., Holmer, T., Konomi, S., Muller-Tomfelde, C., Reischl, W., Rexroth, P., Seitz, P. and Steinmetz, R., i-LAND: An interactive landscape for creativity and information. In Proc. CHI (1999), 120--127.  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Teasley, S., Covi, L.A., Krishnan, M.S. and Olson, J.S. Rapid software development through team collocation. IEEE Trans. on Software Engineering, 28, 6 (2002).  ",
      "doi": "10.1109/TSE.2002.1019481"
    },
    {
      "text": "Thompson, J.D. Organizations in Action: Social Science Bases of Administrative Theory. McGraw-Hill, New York, 1967.",
      "doi": ""
    },
    {
      "text": "Tse, E. and Greenberg, S., Rapidly prototyping single display groupware through the SDG toolkit. In Proc. AUIC (2004), 101--110. ",
      "doi": "10.5555/976310.976323"
    },
    {
      "text": "van Alstyne, M. and Brynjolfsson, E. Could the Internet balkanize science? Science, 274, 5292 (1996). 1479--1480.",
      "doi": ""
    },
    {
      "text": "Van De Ven, A.H., Delbecq, A.L. and Koenig Jr., R. Determinants of coordination modes within organizations. American Sociological Review, 41, 2 (1976). 322--338.",
      "doi": ""
    },
    {
      "text": "Vogel, D. and Balakrishnan, R., Distant freehand pointing and clicking on very large high resolution displays. In Proc. UIST (2005), 33--42.  ",
      "doi": "10.1145/1095034.1095041"
    },
    {
      "text": "Vogel, D. and Balakrishnan, R., Interactive public ambient displays: Transitioning from implicit to explicit, public to personal, interaction with multiple users. In Proc. UIST (2004), 137--146.  ",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Vogt, F., Wong, J., Po, B., Argue, R., Fels, S.S. and Booth, K.S., Exploring collaboration with group pointer interaction. In Proc. Computer Graphics International (2004), 636--639.  ",
      "doi": "10.5555/1009379.1009663"
    },
    {
      "text": "Wilhelmson, R., Baker, P., Stein, R. and Heiland, R., Large tiled display walls and applications in meteorology, oceanography, and hydrology. In Proc. Int. Conf. on Interactive Information (2002), 29--30.",
      "doi": ""
    }
  ]
}