{
  "doi": "10.1145/1240624.1240786",
  "title": "Improvisation principles and techniques for design",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1069-1072",
  "year": 2007,
  "badges": [],
  "abstract": "Existing research addresses how designers create tools to support improvisation, yet little research explores how improvisation offers tools to support design work. This paper explores the potential relationship between improvisation and design, examining how design can benefit from improvisation. The paper argues that improvisation can build perspectives and skills that are critical for designers, such as creative collaboration, fostering innovation, supporting spontaneity, learning through error, and presenting ideas. The paper reviews the use of improvisation activities by designers in a multi-case study. The applications are analyzed to demonstrate individual and group level outcomes in design work.",
  "tags": [
    "design",
    "improvisation",
    "collaboration"
  ],
  "authors": [
    {
      "name": "Elizabeth Gerber",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502725085",
      "orcid": "0000-0001-8914-071X"
    }
  ],
  "references": [
    {
      "text": "Brandt, E. & Grunnet, C. Evoking the future: Drama and props in user centered design. In Proc. Participatory Design Conference, (2000), 11--20.",
      "doi": ""
    },
    {
      "text": "Bryan-Kinns, N. Daisyphone: The Design and Impact of a Novel Environment for Remote Group Music Improvisation. In Proc. CHI 2004, ACM Press (2004), 135--144.  ",
      "doi": "10.1145/1013115.1013135"
    },
    {
      "text": "Buchenau, M., Fulton Suri, J. Experience Prototyping. In Proc. DIS 2000, ACM Press (2000), 424--433.  ",
      "doi": "10.1145/347642.347802"
    },
    {
      "text": "Johnstone.K. Impro: Improvation and the Theatre. Methuen Publishing, London, 1989.",
      "doi": ""
    },
    {
      "text": "Kuutti, K., Iacucci, G., Iacucci, C. Acting to Know: Improving Creativity in the Design of Mobile Services by Using Performances. In Proc. C&C 2002, ACM Press (2002), 95--102.  ",
      "doi": "10.1145/581710.581726"
    },
    {
      "text": "Sutton, R., Hargadon. Brainstorming Groups in Context: Effectiveness in a Product Design Firm. Administrative Science Quarterly, 41, 4 (1996), 685--718.",
      "doi": ""
    },
    {
      "text": "Walker, W. A Computer Participant in Musical Improvisation. In Proc. CHI 1997, ACM Press (1997), 123--131.  ",
      "doi": "10.1145/258549.258629"
    }
  ]
}