{
  "doi": "10.1145/1240624.1240813",
  "title": "Mapmover: a case study of design-oriented research into collective expression and constructed publics",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1249-1252",
  "year": 2007,
  "badges": [],
  "abstract": "In this paper we present the MapMover project as a case study into the use and design of an interactive system for collective expression. Informed by analysis and reflection we advance the concept of constructed publics: publics that are established, shaped, and maintained through the actions and influence of others. We conclude by discussing the relevance of constructed publics as a theorectical frame for the analysis and evaluation of projects in the domains of urban computing and exploratory design in HCI.",
  "authors": [
    {
      "name": "Carl DiSalvo",
      "institution": "Carngegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100258547",
      "orcid": "0000-0002-7344-8741"
    },
    {
      "name": "Jeff Maki",
      "institution": "Carngegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489601",
      "orcid": "missing"
    },
    {
      "name": "Nathan Martin",
      "institution": "DeepLocal, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81547453256",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "boyd, danah. Identity Production in a Networked Culture: Why Youth Heart MySpace. Presentation at American Association for the Advancement of Science, St. Louis, MO. February 19, 2006.",
      "doi": ""
    },
    {
      "text": "Caroll, J.M. Community computing as human-computer interaction, Behaviour and Information Technology, 20, (5), pp. 307--314, 2001.",
      "doi": ""
    },
    {
      "text": "Chang, M., Jungnickel, K., Orloff, C., and Shklovski, I., Workshop: Engaging the City: Public Interfaces as Civic Intermediary. Ext. Abstracts CHI 2005, ACM Press (2005), 2109--2110.  ",
      "doi": "10.1145/1056808.1057110"
    },
    {
      "text": "Dewey, J. The Public and Its Problems. Holt & Co. 1927.",
      "doi": ""
    },
    {
      "text": "Fallman, D., Design-oriented human-computer interaction. In Proc. CHI 2003, ACM Press (2005) 225--232.  ",
      "doi": "10.1145/642611.642652"
    },
    {
      "text": "Galloway, A., Brucker-Cohen, J., Gaya, L., Goodman, E., Hill, D. Panel: Design for Hackability. Proc. DIS 2004, ACM Press (2004) 363--366.  ",
      "doi": "10.1145/1013115.1013181"
    },
    {
      "text": "Gaver, W. and Dunne, A. Projected Realities, Conceptual Design for Cultural Effect. Proc CHI 1999, ACM Press (1999) 600--607.  ",
      "doi": "10.1145/302979.303168"
    },
    {
      "text": "Grint, K. and Woolgar, S. Configuring the User: inventing new technologies. In The Machine at Work, Grint & Woolgar, eds. Polity Press, Cambridge (1997) 65--94.",
      "doi": ""
    },
    {
      "text": "Hirsch, T. and Liu, J., Speakeasy: overcoming barriers and promoting community development in an immigrant neighborhood. Proc DIS 2004, ACM Press (2004) 345--438.  ",
      "doi": "10.1145/1013115.1013176"
    },
    {
      "text": "Ito, et al., Making a Place for Seniors on the Net, Senior, Senior Identity, and the Digital Divide, Computers and Society 21(3), pp. 15--21, 2001.  ",
      "doi": "10.1145/504696.504699"
    },
    {
      "text": "Lievrouw, L. Oppositional and activist new media: remediation, reconfiguration, participation. Proc. PCD 2006, ACM Press (2006) 115--124.  ",
      "doi": "10.1145/1147261.1147279"
    },
    {
      "text": "March, W., Jacobs, and Salvador, T. Workshop: Designing Technology for Community Appropriation. Ext. Abstracts CHI 2005, ACM Press (2005) 2126--2127.  ",
      "doi": "10.1145/1056808.1057120"
    },
    {
      "text": "Paulos, E., Jenkins, T., Urban probes: Encountering our emerging urban atmospheres. Proc. CHI 2005, ACM Press (2005) 341--350.  ",
      "doi": "10.1145/1054972.1055020"
    },
    {
      "text": "Rönkkö, K. et al., Personas is not applicable: local remedies interpreted in a wider context. Proc. PDC 2006, ACM Press (2006) 112--120.  ",
      "doi": "10.1145/1011870.1011884"
    },
    {
      "text": "Sengers,P. et al., Reflective Design. Proc. Critical Computing 2004, ACM Press (2004) 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    }
  ]
}