{
  "doi": "10.1145/1240624.1240745",
  "title": "Tangible user interface for chemistry education: comparative evaluation and re-design",
  "published": "2007-04-29",
  "proctitle": "CHI '07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "805-808",
  "year": 2007,
  "badges": [],
  "abstract": "Augmented Chemistry (AC) is an application that utilizes a tangible user interface (TUI) for organic chemistry education. The empirical evaluation described in this paper compares learning effectiveness and user acceptance of AC versus the more traditional ball-and-stick model (BSM). Learning effectiveness results were almost the same for both learning environments. User preference and rankings, using NASA-TLX and SUMI, showed more differences and it was therefore decided to focus mainly on improving these aspects in a re-design of the AC system. For enhanced interaction, keyboard-free system configuration, and internal/external database (DB) access, a graphical user interface (GUI) has been incorporated into the TUI. Three-dimensional (3D) rendering has also been improved using shadows and related effects, thereby enhancing depth perception. The re-designed AC system was then compared to the old system by means of a small qualitative user study. This user study showed an improvement in subjective opinions a out the system's ease of use and ease of learning.",
  "authors": [
    {
      "name": "Morten Fjeld",
      "institution": "Chalmers University of Technology, Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100571519",
      "orcid": "missing"
    },
    {
      "name": "Jonas Fredriksson",
      "institution": "Chalmers University of Technology, Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332499396",
      "orcid": "missing"
    },
    {
      "name": "Martin Ejdestig",
      "institution": "Chalmers University of Technology, Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81388593285",
      "orcid": "missing"
    },
    {
      "name": "Florin Duca",
      "institution": "Chalmers University of Technology, Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81388596514",
      "orcid": "missing"
    },
    {
      "name": "Kristina Bötschi",
      "institution": "Zurich University, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81388597730",
      "orcid": "missing"
    },
    {
      "name": "Benedikt Voegtli",
      "institution": "HyperWerk: FHBB, Basel, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100631559",
      "orcid": "missing"
    },
    {
      "name": "Patrick Juchli",
      "institution": "HyperWerk: FHBB, Basel, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100439711",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bötschi, K. Evaluation of Augmented Chemistry, a Tangible User Interface for highschool organic chemistry education. ETH E--Collection, M.Sc. thesis (2005). http://e-collection.ethbib.ethz.ch/show?type=dipl&nr=171",
      "doi": ""
    },
    {
      "text": "Chen, Y. A study of comparing the use of augmented reality and physical models in chemistry education. In Proc. VRCIA '06. ACM Press, (2006), 369--372.  ",
      "doi": "10.1145/1128923.1128990"
    },
    {
      "text": "Fjeld, M. and Voegtli, B. Augmented Chemistry: An Interactive Educational Workbench. In Proc. Int. Symp. on Mixed and Augmented Reality (ISMAR), IEEE, (2002), 259--260. ",
      "doi": "10.5555/850976.854940"
    },
    {
      "text": "Hart, S.G. and Staveland, L.E. Development of NASA TLX (Task Load Index): Results of empirical and theoretical research. In Human Mental Workload, North Holland, (1988), 139--183.",
      "doi": ""
    },
    {
      "text": "Ishii, H., Underkoffler J., Chak D., Piper, B., BenJoseph, E. Yeung, L., and Kanji, Z. Augmented Urban Planning Workbench: Overlaying Drawings, Physical Models and Digital Simulation. In Proc. Int. Symp. on Mixed and Augmented Reality (ISMAR), IEEE, (2002), 203. ",
      "doi": "10.5555/850976.854980"
    },
    {
      "text": "Kato, H., Billinghurst, M., Poupyrev, I., Imamoto, K., and Tachibana, K. 2000. Virtual Object Manipulation on a Table-Top AR Environment. In Proc. Int. Symp. on Augmented Reality (ISAR), (2000), 111--119.",
      "doi": ""
    },
    {
      "text": "Kirakowski, J., and Corbett, M. SUMI: the Software Usability Measurement Inventory. British Journal of Educational Technology 24(3), (1993), 210--212.",
      "doi": ""
    },
    {
      "text": "Shon, Y. and McMains, S. Evaluation of drawing on 3D surfaces with haptics, Computer Graphics and Applications, IEEE (2004), 40--50.  ",
      "doi": "10.1109/MCG.2004.49"
    },
    {
      "text": "Van Liere, R., Kok, A., Martens, J.-B., and Van Tienen, M. Interacting with Molecular Structures: User Performance versus System Complexity. In Proc. EGVE, (2005).",
      "doi": ""
    },
    {
      "text": "Voegtli, B. Augmented Collaboration. M.Sc. thesis. HyperWerk FHBB, (2002).",
      "doi": ""
    }
  ]
}