{
  "doi": "10.1145/302979.303131",
  "title": "Authoring animated Web pages using “contact points”",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "458-465",
  "year": 1999,
  "badges": [],
  "abstract": "This paper explores how contact points or co-references between\nan animation and text should be designed in web pages. Guidelines\nare derived from an eye tracking study. A dynamic HTML authoring\ntool is described which supports these requirements. An evaluation\nstudy is reported in which four designs of animation in web pages\nwere tested.",
  "tags": [
    "Web page design",
    "authoring tools"
  ],
  "authors": [
    {
      "name": "Pete Faraday",
      "institution": "Multimedia Authoring Product Unit, Microsoft, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100223037",
      "orcid": "missing"
    },
    {
      "name": "Alistair Sutcliffe",
      "institution": "The Center for HCI Design, City University, London, EC1 0HB, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100269401",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mayer, R.E. &amp; Anderson, R.B. The Instructive Animation Helping students build connections between words and pictures in multimedia. Journal of Education Psychology, 84 (4), 444-452, 1992.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. Guidelines for Multimedia on the Web. http: //www. useit, com/alertbox/",
      "doi": ""
    },
    {
      "text": "Ausebel, D. The use of advanced organisers in the learning and retention of meaningful verbal language. Journal of Educational Psychology, 51,267-272, 1962",
      "doi": ""
    },
    {
      "text": "Faraday, P.M. &amp; Sutcliffe, A.G. Designing Effective Multimedia Presentations, ACM CHI 97, 272-279, 1997  ",
      "doi": "10.1145/258549.258753"
    },
    {
      "text": "Narayanan, H. &amp; Hegarty, M. On Designing comprehensible interactive hypermedia manuals. International Journal of Human-Computer Studies, 48, 267-301, 1998.  ",
      "doi": "10.1006/ijhc.1997.0169"
    },
    {
      "text": "Faraday, P.M. &amp; Sutcliffe, A.G. Making Contact Points between Text and Images. ACM Multimedia 98, http : //www. kom. e-technik, tudarms t adt. de / Pr/wor kshops / acmmm9 8 / elect ronic_proceedings / faraday/index. html  ",
      "doi": "10.1145/290747.290752"
    },
    {
      "text": "Feiner, S. &amp; McKeown, K. Automating the Generation of co-ordinated Multimedia Explanations. In Intelligent Multimedia Interfaces, AAAI Press, 117-138, 1993 ",
      "doi": "10.5555/162477.162493"
    },
    {
      "text": "Wahlster, W., Andre, E. Finkler, W &amp; Rist, T. Planbased integration of natural language and graphics generation. AI Journal, 387-427,1993.  ",
      "doi": "10.1016/0004-3702%2893%2990022-4"
    }
  ]
}