{
  "doi": "10.1145/302979.303152",
  "title": "Emotional interfaces for interactive aardvarks: designing affect into social interfaces for children",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "528-535",
  "year": 1999,
  "badges": [],
  "abstract": "Character-based social interfaces present a unique opportunity\nto integrate emotion into technology interactions. The present\npaper reports on the use of three emotional interactions (humor,\npraise, and affection) in the audio interfaces for two\ncharacter-based interactive learning toys. The reasons for\nselecting the emotions used, the design rationale for their\napplication, and findings from usability testing are reviewed. It\nis suggested that as a form of pretend play-acting akin to\npuppetry, social interfaces can engage the emotions of users in a\nvariety of beneficial ways.",
  "authors": [
    {
      "name": "Erik Strommen",
      "institution": "Microsoft Corporation, One Microsoft Way, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100626243",
      "orcid": "missing"
    },
    {
      "name": "Kristin Alexander",
      "institution": "Knowledge Kids Enterprises, 1250 45 St., Suite 150, Emeryville, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100502441",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bainum, C., Lounsbury, K., and Pollio, H. The development of laughing and smiling in nursery school children. Child Development, 55, 5 (1984), 1946-1957.",
      "doi": ""
    },
    {
      "text": "Bornstein, M. H. Maternal responsiveness: Characteristics and consequences. Jossey-Bass, San Francisco CA, 1989.",
      "doi": ""
    },
    {
      "text": "Bornstein, M. H., Haynes, O. M., O'Reilly, A. W., and Painter, K. M. Solitary and collaborative pretense play in early childhood: Sources of individual variation in the development of representational competence. Child Development, 67, 6 (1996), 2910-2929.",
      "doi": ""
    },
    {
      "text": "Bretherton, i. and Beeghly, M. Pretence: Acting 'as it.' in J.J. Lockman and N.L. Hazen (Eds.) Action in Social Context: Perspectives on Early Development. Plenum Press, NY, 1989, pp. 239-271.",
      "doi": ""
    },
    {
      "text": "Cameron, J. and Pierce, W. Reinforcement, Reward, and Intrinsic Motivation: A Meta-Analysis Review of Educational Research, 64, 3 (Fall 1994), 363-423.",
      "doi": ""
    },
    {
      "text": "Chapman, A. and Wright, D. Social enhancement of laughter: An experimental analysis of some companion variables. Journal of Experimental Child Psychology, 21, 2 (1976), 201-218.",
      "doi": ""
    },
    {
      "text": "Coleman, J. All seriousness aside: The laughinglearning connection. International Journal of Instructional Media, 19, 3 (1992), 269-276",
      "doi": ""
    },
    {
      "text": "Delin, C. R. and Baumeister, R. F. Praise: More than just social reinforcement. Journal for the Theory of Social Behaviour, 24, 3 (September 1994), 219-24 I.",
      "doi": ""
    },
    {
      "text": "Don, A., Brennan, S., Laurel, B., and Shneiderman, B. Anthropomorphism: From ELIZA to Terminator 2. in Proceedings of CHI'92 (May 3-7, 1992, Monterey, CA), pp. 67-70.  ",
      "doi": "10.1145/142750.142760"
    },
    {
      "text": "Dozier, M. Functional measurement assessment of young children's ability to predict future behavior. Child Development, 62 (1991), 1091- 1099",
      "doi": ""
    },
    {
      "text": "Fogg, B. J. and Nass, C. Silicon sycophants\" The effects of computers that flatter. International Journal of Human-Computer Studies, 46, 5 (May 1997), 551- 561.  ",
      "doi": "10.1006/ijhc.1996.0104"
    },
    {
      "text": "Friedman, B. and Kahn, P. Human agency and responsible computing: Implications for computer system design. Journal of Systems Software, 17 (1992), 7-14  ",
      "doi": "10.1016/0164-1212%2892%2990075-U"
    },
    {
      "text": "Frohlich, D. Direct Manipulation and other lessons, in M. Helander, T. Landauer, and P. Prabhu (eds.), Handbook of human-computer interaction. North Holland, NY, 1997, 463-488.",
      "doi": ""
    },
    {
      "text": "Frye, D. and Moore, C. (eds.) Children's theories of mind.\" Mental states and social understanding. Lawrence Erlbaum Associates, Hillsdale NJ, 199 I.",
      "doi": ""
    },
    {
      "text": "Garvey, C. Play. Harvard University Press. Cambridge MA, 1990.",
      "doi": ""
    },
    {
      "text": "Grover, S. A field study in the use of cognitivedevelopmental principles in microcomputer design for young children. Journal of Educational Research, 79 (1996), 325-332.",
      "doi": ""
    },
    {
      "text": "Henton, C. and Edelman, B. Generating and manipulating emotional synthetic speech on a personal computer. Multimedia Tools and Applications, 3 (1996), 105-125.",
      "doi": ""
    },
    {
      "text": "Herron, R. E. and Sutton-Smith, B. (eds.) Child's play. Robert E. Kreiger Publishing Company, Malabar FL, 1982.",
      "doi": ""
    },
    {
      "text": "Jennings, K. and Connors, R. Mothers' interactional style and children's competence at 3 years. International Journal of Behavioral Development, 12 (1989), 155-175.",
      "doi": ""
    },
    {
      "text": "Laurel, B. Interface agents: Metaphors with character. In B.Laurel (ec{) The Art of Human-Computer Interface Design, Addison-Wesley, Reading MA., 1990, 355-365",
      "doi": ""
    },
    {
      "text": "Maes, P. Intelligent software. In J. Moore, E. Edmonds, and A Puerta (eds.), Proceedings of1Ul'97: International Conference on Intelligent User Interfaces. (ACM, NY, 1997), 41-43.  ",
      "doi": "10.1145/238218.238283"
    },
    {
      "text": "Malone, T. and Lepper, M. 1987. Making learning fun: A taxonomy of intrinsic motivations for learning. In (R. Snow and M. Farr (eds.). Aptitude, Learning, and Instruction, Volume 3: Conative and A ffective Processes Analyses. Lawrence Erlbaum Associates, Hillsdale NJ, 1987, 223-253.",
      "doi": ""
    },
    {
      "text": "McGhee, P. The contribution of humor to children's social development. Journal of Children in Contemporary Society, 20, 1-2 (1988), 119-~134.",
      "doi": ""
    },
    {
      "text": "Meddock, T, Parsons, J., and Hill, K. Effects of an Adult's Presence and Praise on Young Children's Performance Journal of Experimental Child Psychology; 12, 2 (October 1971), 197-211.",
      "doi": ""
    },
    {
      "text": "Morkes, J., Kernal, H.K., and Nass, C. Humor in taskoriented computer-mediated communication and human-computer interaction. In CHI'98 Summary (Los Angeles CA 1998), ACM Press, 215-216.  ",
      "doi": "10.1145/286498.286704"
    },
    {
      "text": "Nass, C. and Steuer, J. Voices, Boxes, and :Sources of Messages: Computers and Social Actor,.~. Human Communication Research, 19, 4 (June 1993), 504-527.",
      "doi": ""
    },
    {
      "text": "Nass, C., Steuer, J. and Tauber, E.R. Computers are social actors. Proceedings of CHI'94 (Boston MA, April 1994). ACM Press, 72-77.  ",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Resnick, P. and Virzi, R. A. Relief from l~he Audio Interface Blues: Expanding the Spectrum of Menu, List, and Form Styles, ACM Transactions on Computer-Human Interaction, 2, 2 (1995), 145-176.  ",
      "doi": "10.1145/210181.210183"
    },
    {
      "text": "Resnik, P. and Lammers, H. The influence of selfesteem on cognitive responses to machine-like vs. human-like computer feedback. Journal of Social Psychology, 125, 6 (1986), 761-769.",
      "doi": ""
    },
    {
      "text": "Rueter, M. A. and Conger, R. D. Interaction style, problem- solving behavior, and family problemsolving effectiveness. Child Development, 66 (1995), 98-115.",
      "doi": ""
    },
    {
      "text": "Schneiderman, 13. Direct manipulation for comprehensible, predictable, and controllable user interfaces. Proceedings of The International Conference on Intelligent User Interfaces (Orlando FL, January 1997), ACM Press, 33-39.  ",
      "doi": "10.1145/238218.238281"
    },
    {
      "text": "Sletta, O, Sobstad, F., and Valas, H. Humour, peer acceptance, and perceived social competence in preschool and school-aged children. British Journal of Educational Psychology, 65 (1995), 179-195.",
      "doi": ""
    },
    {
      "text": "Strommen, E. F. \"What did he say?\": Speech output in preschool software. In S. Gayle (ed.), Proceedings of NECC '91 (Phoenix AR, June 1991). Intemational Society for Technology in Education, Eugene OR, 149- 151.",
      "doi": ""
    },
    {
      "text": "Strommen, E. F. (1998). When the interface is a talking dinosaur: Learning across media with ActiMates Barney, in Proceedings of ACM CHI'98 (Los Angeles CA, April 1998), ACM Press, 288-295.  ",
      "doi": "10.1145/274644.274685"
    },
    {
      "text": "Thomas, P. and Macredie, R. Games and the design of human-computer interfaces. Educational and Training Technology International, 31 (1994), 134-142.",
      "doi": ""
    },
    {
      "text": "Walker J. H., Sproull, L., and Subramani, R. 1994. Using a human face in an interface. Proceedings of CHI'94 (Boston, MA April 1994), ACM Press, 85-91.  ",
      "doi": "10.1145/191666.191708"
    },
    {
      "text": "Walker, M., Cahn, J., and Whittaker, S. 1997. Improvising linguistic style: Social and affective bases for agent personality. Proceedings of Autonomous Agents '97 (Marina Del Rey CA), ACM Press, 96-105  ",
      "doi": "10.1145/267658.267680"
    },
    {
      "text": "Warners-Kleverlann, N., Oppenheimer, L., and Sherman, L. To be or not to be humorous: Does it make a differences? Humor 9, 2 (1996), 117-141.",
      "doi": ""
    },
    {
      "text": "Yuill, N. and Pearson, A. The development of bases for trait attribution: Children's understanding of traits as causal mechanisms based on desire. Developmental Psychology, 34 (1998), 574-586.",
      "doi": ""
    },
    {
      "text": "Zillmann, D. and Bryant, J. Guidelines for the effective use of humor in children's educational television programs. Journal of Children in Contemporary Society, 20 (1998), 201-221.",
      "doi": ""
    }
  ]
}