{
  "doi": "10.1145/302979.303108",
  "title": "Flatland: new dimensions in office whiteboards",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "346-353",
  "year": 1999,
  "badges": [],
  "abstract": "Flatland is an augmented whiteboard interface designed for\ninformal office work. Our research investigates approaches to\nbuilding an augmented whiteboard in the context of continuous, long\nterm office use. In particular, we pursued three avenues of\nresearch based on input from user studies: techniques for the\nmanagement of space on the board, the ability to flexibly apply\nbehaviors to support varied application semantics, and mechanisms\nfor managing history on the board. Unlike some previously reported\nwhiteboard systems, our design choices have been influenced by a\ndesire to support long-term, informal use in an individual office\nsetting.",
  "tags": [
    "light-weight interaction",
    "whiteboards",
    "ubiquitous computing",
    "pen-based computing",
    "Flatland"
  ],
  "authors": [
    {
      "name": "Elizabeth D. Mynatt",
      "institution": "College of Computing, Georgia Institute of Technology, Atlanta, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100331104",
      "orcid": "missing"
    },
    {
      "name": "Takeo Igarashi",
      "institution": "University of Tokyo, 7-3-1 Bunkyo-ku, Hongo, Tokyo 113-8656, Japan",
      "img": "/do/10.1145/contrib-81100444444/rel-imgonly/photo_large.jpg",
      "acmid": "81100444444",
      "orcid": "missing"
    },
    {
      "name": "W. Keith Edwards",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100595699",
      "orcid": "missing"
    },
    {
      "name": "Anthony LaMarca",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100478916",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abowd, G., Atkeson, C., Feinstein, A., Hmelo, C., Kooper, R., Long, S., Sawhney, N. and Tani, M. Teaching and learning as multimedia authoring: the classroom 200 project. Proceedings of ACM Multimedia '96. New York: ACM.  ",
      "doi": "10.1145/244130.244191"
    },
    {
      "text": "Bederson, B.B., &amp; Hollan, J.D. Pad++: A zooming graphical interface for exploring alternate interface physics. Proceedings of UIST'94. New York: ACM.  ",
      "doi": "10.1145/192426.192435"
    },
    {
      "text": "Bier, E.A., Stone, M.C., Pier, K., Buxton, W., and DeRose, T. Toolglass and magic lenses: The see-through interface. In James T. Kajiya, editor, Computer Graphics (SIGGRAPH '93 Proceedings), volume 27.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Communications of the ACM, Special Issue on Augmented Environments, 36 (7), 1993.",
      "doi": ""
    },
    {
      "text": "Dourish, P. Edwards,W.K., LaMarca, A., Salisbury, M. Uniform document interaction using document properties. Submitted to CHI'99.",
      "doi": ""
    },
    {
      "text": "Edwards, W.K, Mynatt, E.D. Timewarp: techniques for autonomous collaboration. Proceedings of CHI'97. New York: ACM.  ",
      "doi": "10.1145/258549.258710"
    },
    {
      "text": "Geissler, J., Shuffle, throw or take it! Working efficiently with an interactive wall. Proceedings of CHI'98. New York: ACM.  ",
      "doi": "10.1145/286498.286745"
    },
    {
      "text": "Gross, M.D., &amp; Do, E.Y. Ambiguous intentions: a paper-like interface for creative design. Proceedings of UIST '96. New York: ACM.  ",
      "doi": "10.1145/237091.237119"
    },
    {
      "text": "Igarashi, T., Matsuoka, S., Kawachiya, S., &amp; Tanaka, Hidehiko. Interactive beautification: A technique for rapid geometric design. Proceedings of UIST'97. New York: ACM.  ",
      "doi": "10.1145/263407.263525"
    },
    {
      "text": "Kramer, A. Translucent patches - dissolving windows. Proceedings of UIST '94. New York: ACM.  ",
      "doi": "10.1145/192426.192474"
    },
    {
      "text": "Landay, J.A. and Myers, B.A. Interactive sketching for the early stages of interface design. Proceedings of CHI'95. New York: ACM.  ",
      "doi": "10.1145/223904.223910"
    },
    {
      "text": "Moran, T.P., Chiu, P., Harrison, S., Kurtenbach, G., Minneman, S. &amp; van Melle, W. Evolutionary engagement in an ongoing collaborative work process: a case study. Proceedings of CSCW'96. New York: ACM.  ",
      "doi": "10.1145/240080.240243"
    },
    {
      "text": "Moran, T.P., Chiu, P., van Melle, W., &amp; Kurtenbach, G. Implicit structures for pen-based systems within a freeform interaction paradigm. Proceedings of CHI'95. New York: ACM.  ",
      "doi": "10.1145/223904.223970"
    },
    {
      "text": "Moran, T.P., van Melle, W., &amp; Chiu, P. Tailorable domain objects as meeting tools for an electronic whiteboard. Proceedings of CSCW'98. New York: ACM.  ",
      "doi": "10.1145/289444.289504"
    },
    {
      "text": "Moran, T.P., Chiu, P., &amp; van Melle, W. Spatial interpretation of domain objects integrated into a freeform electronic whiteboard. Proceedings of UIST '98. New York: ACM.  ",
      "doi": "10.1145/288392.288600"
    },
    {
      "text": "Mynatt, E. D. The writing on the wall. Unpublished technical report, www.cc.gatech.edu/--mynatt.",
      "doi": ""
    },
    {
      "text": "Nakagawa, M., Oguni, T., Yoshino, T. Human interface and application on IdeaBoard. Published in Interact '97. ",
      "doi": "10.5555/647403.723502"
    },
    {
      "text": "Rekimoto, J. Pick-and-drop: a direct manipulation technique for multiple computer environments. Proceedings of UIST'97. New York: ACM.  ",
      "doi": "10.1145/263407.263505"
    },
    {
      "text": "Rekimoto, J. A multiple device approach for supporting whiteboard-based interactions. Proceedings of",
      "doi": ""
    }
  ]
}