{
  "doi": "10.1145/302979.303113",
  "title": "Augmented surfaces: a spatially continuous work space for hybrid computing environments",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "378-385",
  "year": 1999,
  "badges": [],
  "abstract": "This paper describes our design and implementation of a computer\naugmented environment that allows users to smoothly interchange\ndigital information among their portable computers, table and wall\ndisplays, and other physical objects. Supported by a camera-based\nobject recognition system, users can easily integrate their\nportable computers with the pre-installed ones in the environment.\nUsers can use displays projected on tables and walls as a spatially\ncontinuous extension of their portable computers. Using an\ninteraction technique called hyperdragging, users can transfer\ninformation from one computer to another, by only knowing the\nphysical relationship between them. We also provide a mechanism for\nattaching digital data to physical objects, such as a videotape or\na document folder, to link physical and digital spaces.",
  "tags": [
    "multiple device user interfaces",
    "physical space",
    "architectural media",
    "ubiquitous computing",
    "wall-sized displays",
    "augmented reality",
    "portable computers",
    "table-sized displays"
  ],
  "authors": [
    {
      "name": "Jun Rekimoto",
      "institution": "Sony Computer Science Laboratories, Inc., 3-14-13 Higashigotanda, Shinagawa-ku, Tokyo 141-0022 Japan",
      "img": "/do/10.1145/contrib-81100008564/rel-imgonly/p2.png",
      "acmid": "81100008564",
      "orcid": "0000-0002-3629-2514"
    },
    {
      "name": "Masanori Saitoh",
      "institution": "Department of Computer Science, Keio University, 3-14-1 Hiyoshi, Kohoku-ku, Yokohama, Kanagawa 223 Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100317821",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Steven Feiner and A. Shamash. Hybrid user interfaces: Breeding virtually bigger interfaces for physically smaller computers. In Proceedings of U1ST'91, A CM Symposium on User Interface Software and Technology, pp. 9-17, November 1991.]]  ",
      "doi": "10.1145/120782.120783"
    },
    {
      "text": "Jorg Geisler. Shuffle, throw or take it! working efficiently with an interactive wall. In CHI'98 summary, February 1998.]]  ",
      "doi": "10.1145/286498.286745"
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. Tangible Bits: Towards seamless interfaces between people, bits and atoms. In CHI'97 Proceedings, pp. 234-241, 1997.]]  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Myron W. Krueger. Artificial Reality H. Addison- Wesley, 1990.]]",
      "doi": ""
    },
    {
      "text": "Beth M. Lange, Mark A. Jones, and James L. Meyers. Insight Lab: An immersive team environment linking paper, displays, and data. In CH1'98 Proceedings, pp. 550-557, 1998.]]  ",
      "doi": ""
    },
    {
      "text": "W.E. Mackay, D.S. Pagani, L. Faber, B. Inwood, P. Launiainen, L. Brenta, and V. Pouzol. Ariel: augmenting paper engineering drawings. In CHI'95 Conference Companion, pp. 420-422, 1995.]]  ",
      "doi": "10.1145/223355.223763"
    },
    {
      "text": "Torsten Holmer Norbert A. Streitz, Jorg Geisler. Roomware for cooperative buildings: Integrated design of architectural spaces and information spaces. In Norbert A. Streitz and Shin'ichi Konomi, editors, Cooperative Buildings - Integrating Information, Organization, and Architecture, 1998.]] ",
      "doi": "10.5555/645968.674732"
    },
    {
      "text": "Ramesh Raskar, Greg Welch, Matt Cutts, Adam Lake, Lev Stesin, and Henry Fuchs. The office ofthe future: A unified approach to image-based modeling and spatially immersive displays. In SIGGRAPH'98 Proceedings, pp. 179-188, 1998.]]  ",
      "doi": "10.1145/280814.280861"
    },
    {
      "text": "Jun Rekimoto. Pick-and-Drop: A Direct Manipulation Technique for Multiple Computer Environments. In Proceedings of UIST'97, pp. 31-39, October 1997.]]  ",
      "doi": "10.1145/263407.263505"
    },
    {
      "text": "Jun Rekimoto. Matrix: A realtime object identification and registration method for augmented reality. In Proc. of Asia Pacific Computer Human Interaction (APCHI '98), July 1998.]] ",
      "doi": "10.5555/786112.786329"
    },
    {
      "text": "Jun Rekimoto. A multiple-device approach for supporting whiteboard-based interactions, in Proceedings of CHI'98, February 1998.]]  ",
      "doi": "10.1145/274644.274692"
    },
    {
      "text": "Stott Robertson, Cathleen Wharton, Catherine Ashworth, and Marita Franzke. Dual device user interface design: PDAs and interactive television. In CHI'96 Proceedings, pp. 79-86, 1996.]]  ",
      "doi": "10.1145/238386.238408"
    },
    {
      "text": "Peter Robinson, Dan Sheppard, Richard Watts, Robert Harding, and Steve Lay. Animated Paper Documents. In 7th International Conference on Human-Computer Interaction, HCI'97, 1997.]]",
      "doi": ""
    },
    {
      "text": "Eric Saund. ZombieBoard project description. http ://www.parc.xerox.com/spl/members/saund/ zombieboard-public.html.]]",
      "doi": ""
    },
    {
      "text": "Itiro Silo. lnfoBinder: a pointing device for a virtual desktop system. In 6th International Conference on Human-Computer Interaction (HCI International '95), pp. 261-264, July 1995.]]",
      "doi": ""
    },
    {
      "text": "Questin Stafford-Fraser and Peter Robinson. Brightboard: A video-augmented environment. In CHI'96 proceedings, pp. 134-141, 1996.]]  ",
      "doi": "10.1145/238386.238457"
    },
    {
      "text": "M. Stefik, G. Foster, D. Bobrow, K. Khan, S. Lanning, and L. Suchman. Beyond the chalkboard: computer support for collaboration and problem solving in meetings. Communication of the A CM, Vol. 30, No. 1, pp. 32-47, 1987.]]  ",
      "doi": "10.1145/7885.7887"
    },
    {
      "text": "Brygg Ullmer, Hiroshi Ishii, and Dylan Glas. media- Blocks: Physical containers, transports, and controls for online media. In SIGGRAPH'98 proceedings, pp. 379- 386, 1998.]]  ",
      "doi": "10.1145/280814.280940"
    },
    {
      "text": "John Underkoffler. A view from the Luminous Room. Personal Technologies, Vol. 1, No. 2;, June 1997.]]",
      "doi": ""
    },
    {
      "text": "John Underkoffler and Hiroshi Ishii. Illuminating Light: An optical design tool with a luminous-tangible interface. In CHI'98 Proceedings, pp. 542-549, 1998.]]  ",
      "doi": "10.1145/274644.274717"
    },
    {
      "text": "Pierre Wellner. The DigitalDesk calculator: Tangible manipulation on a desk top display. In Proceedings of UIST'91, ACM Symposium on User Interface Software and Technology, pp. 27-34, November 1991.]]  ",
      "doi": "10.1145/120782.120785"
    },
    {
      "text": "Pierre Wellner. Interacting with paper on the DigitalDesk. Communication of the A CM, Vol. 36, No. 7, pp. 87-96, August 1993.]]  ",
      "doi": "10.1145/159544.159630"
    }
  ]
}