{
  "doi": "10.1145/302979.303126",
  "title": "The context toolkit: aiding the development of context-enabled applications",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "434-441",
  "year": 1999,
  "badges": [],
  "abstract": "Context-enabled applications are just emerging and promise\nricher interaction by taking environmental context into account.\nHowever, they are difficult to build due to their distributed\nnature and the use of unconventional sensors. The concepts of\ntoolkits and widget libraries in graphical user interfaces has been\ntremendously successtil, allowing programmers to leverage off\nexisting building blocks to build interactive systems more easily.\nWe introduce the concept of context widgets that mediate between\nthe environment and the application in the same way graphical\nwidgets mediate between the user and the application. We illustrate\nthe concept of context widgets with the beginnings of a widget\nlibrary we have developed for sensing presence, identity and\nactivity of people and things. We assess the success of our\napproach with two example context-enabled applications we have\nbuilt and an existing application to which we have added\ncontext-sensing capabilities.",
  "tags": [
    "ubiquitous computing",
    "widgets",
    "applications development",
    "context-eabled or context-aware computing",
    "toolkits"
  ],
  "authors": [
    {
      "name": "Daniel Salber",
      "institution": "GVU Center, College of Computing, Georgia Institute of Technology, Atlanta, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100017622",
      "orcid": "missing"
    },
    {
      "name": "Anind K. Dey",
      "institution": "GVU Center, College of Computing, Georgia Institute of Technology, Atlanta, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100327371",
      "orcid": "missing"
    },
    {
      "name": "Gregory D. Abowd",
      "institution": "GVU Center, College of Computing, Georgia Institute of Technology, Atlanta, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100251687",
      "orcid": "0000-0002-3408-587X"
    }
  ],
  "references": [
    {
      "text": "Abowd, G.D., Atkeson, C.G., Hong, J., Long, S., Kooper, R. and Pinkerton, M. Cyberguide: A Mobile Context-Aware Tour Guide. ACM Wireless Networks 3, 421-433.  ",
      "doi": "10.1023/A%3A1019194325861"
    },
    {
      "text": "Brotherton, J. DUMMBO, Dynamic, Ubiquitous, Mobile Meeting Board. Available at http://www.cc.gateeh.edu/fce/dummbo/.",
      "doi": ""
    },
    {
      "text": "Brown, P.J. The Stick-e Document: A Framework for Creating Context-Aware Applications. Electronic Publishing 9, 1 (September 1996), 1-14.",
      "doi": ""
    },
    {
      "text": "Dallas Semiconductor. iButton Home Page. Available at http ://www.ibutton.eom/.",
      "doi": ""
    },
    {
      "text": "Dey, A., Abowd, G.D. and Wood, A. CyberDesk: A Framework for Providing Self-Integrating Context- Aware Services, in Proceedings of the 1998 Intelligent User Interfaces Conference (San Francisco CA, January 1998), ACM Press, 48-54.  ",
      "doi": "10.1145/268389.268398"
    },
    {
      "text": "Fels, S., Sumi, Y., Etani, T., Simonet, N., Kobayshi, K. and Mase, K. Progress of C-MAP: A Context-Aware Mobile Assistant, in Proceedings of AAAI 1998 Spring Symposium on Intelligent Environments (Palo Alto, CA, March 1998), AAAI Press, 60-67.",
      "doi": ""
    },
    {
      "text": "Finney, J. and Davies, N. FLUMP, The FLexible Ubiquitous Monitor Project. Available at http://www.comp, lancs.ac.uk/comp uti ng/staff/j oe/pape rs/flumpdh.html.",
      "doi": ""
    },
    {
      "text": "Hull, R., Neaves, P. and Bedrod-Roberts, J. Towards Situated Computing, in Proceedings of the Ist International Symposium on Wearable Computers, ISWC '97 (Cambridge MA, October 1997), IEEE Press. ",
      "doi": "10.5555/851036.856457"
    },
    {
      "text": "Lamming, M. and Flynn, M. Forget-me-not: Intimate Computing in Support of Human Memory, in Proceedings of FRIEND 21: International Symposium on Next Generation Human Interfaces (Tokyo, 1994), 125-128.",
      "doi": ""
    },
    {
      "text": "Lancaster University. The Active Badge Tourist Application. Available at http://www.comp.lancs.ac.uk/comp uting/research/mpg /most/abta_proj ect.html.",
      "doi": ""
    },
    {
      "text": "Myers, B.A. A New Model for Handling Input. Transactions on Information Systems 8, 3, 289-320.  ",
      "doi": "10.1145/98188.98204"
    },
    {
      "text": "Pederson, E.R. and Sokoler, T. AROMA: Abstract Representation of Presence Supporting Mutual Awareness, in Proceedings of CHI '97 (Atlanta GA, March 1997), ACM Press, 51-58.  ",
      "doi": "10.1145/258549.258584"
    },
    {
      "text": "Rhodes, B.J. The Wearable Remembrance Agent, in Proceedings of Ist International Symposium on Wearable Computers, ISWC '97 (Cambridge MA, October 1997), IEEE Press, 123-128. ",
      "doi": "10.5555/851036.856441"
    },
    {
      "text": "Sehilit, W.N. System Architecture for Context-Aware Mobile Computing. Ph.D. Thesis, Columbia University, 1995. ",
      "doi": "10.5555/220826"
    },
    {
      "text": "Texas Instruments. TIRIS Products and Technology. Available at http://www.ti.com/mc/docs/tiris/docs/rfid.htm.",
      "doi": ""
    },
    {
      "text": "W3CXML Working Group. Extensible Markup Language (XML) 1.0. Available at http://www.w3.orgffR/1998/REC-xml- 19980210.",
      "doi": ""
    },
    {
      "text": "Want, R., Hopper, A., Falcao, V. and Gibbons, J. The Active Badge Location System. ACM Transactions on Information Systems 10, I, 91-102.  ",
      "doi": "10.1145/128756.128759"
    },
    {
      "text": "Want, R., Schilit, B., Adams, N., Gold, R., Petersen, K., Ellis, J., Goldberg, D. and Weiser, M. The PARCTAB Ubiquitous Computitig Experiment. Technical Report CSL-95-1, Xerox Palo Alto Research Center, 1995.",
      "doi": ""
    },
    {
      "text": "Weiser, M. The Computer for the 21st Century. Scientific American 265, 3, 66-75.",
      "doi": ""
    }
  ]
}