{
  "doi": "10.1145/302979.303124",
  "title": "MOBILE: user-centered interface building",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "426-433",
  "year": 1999,
  "badges": [],
  "abstract": "Interfhce builders are popular tools for designing and\ndeveloping graphical user interfaces. These tools, however, are\nengineering-centered; they operate mainly on windows and widgets. A\ntypical interface builder does not offer any specific support for\nuser-centered interface design, a methodology recognized as\ncritical for effective user interface design. We present MOBILE\n(Model-Based Inter&xx Layout Editor) an interface building tool\nthat iidly supports user-centered design and that guides the\nhtafhce building process by using user-task models and a knowledge\nbase of interface design guidelines. The approach in MOBILE has the\nimportant added benefit of being useful in both top-down and\nbottom-up interface design strategies.",
  "tags": [
    "interface builders",
    "task models",
    "user-centered interface design",
    "model-based interface development",
    "user interface development tools"
  ],
  "authors": [
    {
      "name": "Angel R. Puerta",
      "institution": "RedWhale Software and Stanford University, 192 Walter Hays Drive, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100290318",
      "orcid": "missing"
    },
    {
      "name": "Eric Cheng",
      "institution": "RedWhale Software and Stanford University, 192 Walter Hays Drive, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81541053956",
      "orcid": "missing"
    },
    {
      "name": "Tunhow Ou",
      "institution": "RedWhale Software and Stanford University, 192 Walter Hays Drive, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100176958",
      "orcid": "missing"
    },
    {
      "name": "Justin Min",
      "institution": "RedWhale Software and Stanford University, 192 Walter Hays Drive, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100236295",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Myers, B., User Interface Software Tools. ACM Transactions on Computer-Human Interaction, 1995. 2(1): p. 65-103.  ",
      "doi": "10.1145/200968.200971"
    },
    {
      "text": "Norman, D. and S. Draper, eds. User Centered System Design. 1986, LEA.",
      "doi": ""
    },
    {
      "text": "Puerta, A.R., A Model-Based interface Development Environment, in IEEE Software. 1997. pp. 40-47.  ",
      "doi": "10.1109/52.595902"
    },
    {
      "text": "Tam, ILC.-M., D. Maulsby, and A. Puerta. U-TEL: A Tool for Eliciting User Task Models from Domain Experts. In 1U198:1998 International Conference on intelligent User Interfaces. 1998. San Francisco, CA: ACM Press.  ",
      "doi": "10.1145/268389.268402"
    },
    {
      "text": "Puerta, A. and D. Maulsby. Management of Interface Design Knowledge with MOB1-D. In 1U197: 1997 International Conference on Intelligent User Interfaces. 1997.  ",
      "doi": "10.1145/238218.238337"
    },
    {
      "text": "Puerta, A. and J. Eisenstem. lnteractively Mapping Task Models to Interfaces in MOB1-D. in DSV-1S98: Eurographics Workshop. 1998. Abingdon, England.",
      "doi": ""
    },
    {
      "text": "Valaer, L. and R. Babb. Choosing a User Interface Development Tool, in IEEE Software. 1997. pp. 29-39.  ",
      "doi": "10.1109/52.595896"
    },
    {
      "text": "Foley, J., et al., UIDE-An lmelligent User interface Design Environment, in Intelligent User Interfaces, J. Sullivan and S. Tyler, Editors. 1991, Addison-Wesley. p. 339-384.  ",
      "doi": "10.1145/107215.128716"
    },
    {
      "text": "Johnson, P., S. Wilson, and H. Johnson, Scenarios, Task Analysis, and the ADEPT Design Environment, in Scenario Based Design, J. Carrol, Editor. 1994, Addison- Wesley.",
      "doi": ""
    },
    {
      "text": "Puerta, A. and H. Eriksson. Model-Based Automated Generation of User Interfaces. in AAAI'94. 1994: AAAI Press. ",
      "doi": "10.5555/199288.184583"
    },
    {
      "text": "Vanderdonckt, J.M. and F. Bodart. Encapsulating Knowledge for Intelligent Automatic Interaction Objects Selection. In InterCHl'93. 1993: ACM Press.  ",
      "doi": "10.1145/169059.169340"
    }
  ]
}