{
  "doi": "10.1145/302979.302982",
  "title": "Social, individual and technological issues for groupware calendar systems",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "17-24",
  "year": 1999,
  "badges": [],
  "abstract": "Designing and deploying groupware is difficult. Groupware\nevaluation and design are often approached from a single\nperspective, with a technologically-, individually-, or\nsocially-centered focus. A study of Groupware Calendar Systems\n(GCSs) highlights the need for a synthesis of these multiple\nperspectives to fully understand the adoption challenges these\nsystems face. First, GCSs often replace existing calendar\nartifacts, which can impact users calendaring habits and in turn\ninfluence technology adoption decisions. Second, electronic\ncalendars have the potential to easily share contextualized\ninformation publicly over the computer network, creating\nopportunities for peer judgment about time allocation and raising\nconcerns about privacy regulation. However, this situation may also\nsupport coordination by allowing others to make useful inferences\nabout ones schedule. Third, the technology and the social\nenvironment are in a reciprocal, co-evolutionary relationship: the\nuse context is affected by the constraints and affordances of the\ntechnology, and the technology also co-adapts to the environment in\nimportant ways. Finally, GCSs, despite being below the horizon of\neveryday notice, can affect the nature of temporal coordination\nbeyond the expected meeting scheduling practice.",
  "tags": [
    "diaries",
    "groupware calendar systems",
    "calendars",
    "sociotemporality",
    "ethnography",
    "time",
    "meeting scheduling",
    "CSCW"
  ],
  "authors": [
    {
      "name": "Leysia Palen",
      "institution": "Department of Computer Science, University of Colorado, Boulder, ECOT 717, Campus Box 430, Boulder, CO",
      "img": "/do/10.1145/contrib-81100610626/rel-imgonly/image3.jpg",
      "acmid": "81100610626",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Beard, D., Palanlappan, M., Humm, A., Banks, D., Nair, A. &amp; Shan, Y-P. (1990). A Visual Calendar for Scheduling Group Meetings. Proceedings of the A CM CSCW'90 Conference, 279-290.  ",
      "doi": "10.1145/99332.99361"
    },
    {
      "text": "Ehrlich, S.F. (1987a). Social and Psychological Factors Influencing the Design of Office Communication Systems. Proceedings of the A CM CH1+ G1'87 Conference, 323-329.  ",
      "doi": "10.1145/29933.275651"
    },
    {
      "text": "Ehrlich, S.F. (1987b). Strategies for Encouraging Successful Adoption of Office Communication Systems. ACM Transactions on Office Information Systems 5(4), 340-357.  ",
      "doi": "10.1145/42196.42198"
    },
    {
      "text": "Francik, E., Rudman, S.E., Cooper, D. Levine, S. (1991). Putting Innovation to Work: Adoption Strategies for Multimedia Communication Systems. Communications of the ACM 34(12), 52 (12 }pages).  ",
      "doi": "10.1145/125319.125322"
    },
    {
      "text": "Greif, I. (1984). The User Interface of a Personal Calendar Program. In Y. Vassiliou (Ed.) Human Factors and Interactive Systems: Proc. of the NYU Symposium on User Interfaces '82. Ablex, 207-222. ",
      "doi": "10.5555/2092.2104"
    },
    {
      "text": "Grudin, J. (1988). Why CSCW Applications Fail: Problems in the Design and Evaluation of Organizational Interfaces. Proceedings of A CM CSCW'88 Conference, 85-93.  ",
      "doi": "10.1145/62266.62273"
    },
    {
      "text": "Grudin, J. &amp; Palen, L. (1995). Why Groupware Succeeds: Discretion or Mandate? Proc. of European CSCW (ECSCW'95), H. Marmolin, Y. Stmdblad, K. Schmidt (eds.), Kluwer Academic Publishers, 263-278. ",
      "doi": "10.5555/1241958.1241975"
    },
    {
      "text": "Kelley, J.F. &amp; Chapanis, A. (1982). How Professional Persons Keep Their Calendars: Implications for Computerization. Journal of Occupational Psychology, 55, 241-256.",
      "doi": ""
    },
    {
      "text": "Kincaid, C., Dupont, P. &amp; Kaye, A. (1985). Electronic Calendars in the Office:An Assessment of User Needs and Current Technology. ACM Transactions on Office Information Systems 3(1), 89-102.  ",
      "doi": "10.1145/3864.3868"
    },
    {
      "text": "Mackay, W.E. (1990). Users and Customizable Software: A Co-Adaptive Phenomenon. Dissertation, Sloan School of Management. Cambridge, ~L~t, MIT.",
      "doi": ""
    },
    {
      "text": "Markus, M. L. &amp; Connolly, T. (1990). Why CSCW Applications Fail\" Problems in the Adoption of Interdependent Work Tools. Proceedings qf the ACM CSCW'90 Conference, 371-380.  ",
      "doi": "10.1145/99332.99368"
    },
    {
      "text": "Mosier, J.N. &amp; Tammaro, S.G. (1997). When are Group Scheduling Tools Useful? CSCW: The Journal of Collaborative Computing, 6, 53-70.  ",
      "doi": "10.1023/A%3A1008684204655"
    },
    {
      "text": "Myers, B. (1998). A Brief History of Human-Computer Interaction Technology. interactions 5(2), 44-54.  ",
      "doi": "10.1145/274430.274436"
    },
    {
      "text": "Orlikowski, W. (1992). The Duality of Technology: Rethinking the Concept of Technology in Organizations. Organization Science 3(3), 398-427.",
      "doi": "10.1287/orsc.3.3.398"
    },
    {
      "text": "Palen, L. (1998). Calendars on the New Frontier: Challenges of Groupware Technology. Dissertation, Info. &amp; Computer Science, Univ. of California, lrvine. ",
      "doi": "10.5555/335810"
    },
    {
      "text": "Payne, S.J. (1993). Understanding Calendar Use. Human Computer Interaction 8(2), 83-100.",
      "doi": "10.1207/s15327051hci0802_1"
    },
    {
      "text": "Schwartz, B. (1968). The Social Psychology of Privacy. American Journal of Sociology 73(6), 741-752.",
      "doi": ""
    },
    {
      "text": "Zerubavel, E. (1981). Hidden Rhythms: ScJhedules and Calendars in Social Life. Univ. of Chicago Press.",
      "doi": ""
    }
  ]
}