{
  "doi": "10.1145/302979.303123",
  "title": "Learning and performing by exploration: label quality measured by latent semantic analysis",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "418-425",
  "year": 1999,
  "badges": [],
  "abstract": "Models of learning and performing by exploration assume that the\nsemantic similarity between task descriptions and labels on display\nobjects (e.g., menus, tool bars) controls in part the users search\nstrategies. Nevertheless, none of the models has an objective way\nto compute semantic similarity. In this study, Latent Semantic\nAnalysis (LSA) was used to compute semantic similarity between task\ndescriptions and labels in an applications menu system.\nParticipants performed twelve tasks by exploration and they were\ntested for recall after a l-week delay. When the labels in the menu\nsystem were semantically similar to the task descriptions, subjects\nperformed the tasks faster. LSA could be incorporated into any of\nthe current models, and it could be used to automate the evaluation\nof computer applications for ease of learning and performing by\nexploration.",
  "tags": [
    "latent semantic analysis",
    "semantic similarity",
    "cognitive models",
    "usability analysis",
    "learning by exploration",
    "label-following strategy"
  ],
  "authors": [
    {
      "name": "Rodolfo Soto",
      "institution": "Institute of Cognitive Science, University of Colorado, Boulder, CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332529320",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Rieman, J., et al. (1991). An automated w~dkthrough. Proceedings of CH1'91 Conference on Human Factors in Computer Systems, pp. 427-428. New York, NY: ACM Press.  ",
      "doi": "10.1145/108844.108986"
    },
    {
      "text": "Poison, P.G., et al. (1992). Cognitive walkthroughs: A method for theory-based evaluation of user interfaces. International Journal of Man-Machine Studies, 36(5), 741- 773.  ",
      "doi": "10.1016/0020-7373%2892%2990039-N"
    },
    {
      "text": "Franzke, M. (1995). Turning research into practice: Characteristics of display-based interaction. Proceedings of CHI'95 Conference on Human Factors in Computing Systems, pp. 421-428. New York, NY: ACM Press.  ",
      "doi": "10.1145/223904.223961"
    },
    {
      "text": "Landauer, T.K., Foltz, P., and Laham, D. (1998). An Introduction to Latent Semantic Analysis. .Discourse Processes, 24, 259-284.",
      "doi": ""
    },
    {
      "text": "Poison, P.G. and Lewis, C.H. (1990). Theory-based design for easily learned interfaces. Human-Computer Interaction, 5(2-3), 191-220.",
      "doi": ""
    },
    {
      "text": "Newell, A. and Simon, H.A. (1972). Human' Problem Solving. Englewoods Cliffs, NJ: Prentice-Hall. ",
      "doi": "10.5555/1095704"
    },
    {
      "text": "Engelbeck, G.E. (1986). Exceptions to generalizations: implications for formal models of human-computer interaction. Unpublished masters thesis, University of Colorado, Boulder, CO.",
      "doi": ""
    },
    {
      "text": "Muncher, E. (1989). The acquisition of spreadsheet skills. Unpublished masters thesis, University of Colorado, Boulder, CO.",
      "doi": ""
    },
    {
      "text": "Kitajima, M. and Poison, P.G. (1997). I,ICAI+: A Comprehension-Based Model of Learning for Display- Based Human-Computer Interaction. Proceedings of CHI'97 Conference on Human Factors in Computing Systems, pp. 333-334. New York, NY: ACM Press.  ",
      "doi": "10.1145/1120212.1120420"
    },
    {
      "text": "Landauer, T.K., Galotti, K.M., and H~utwell, S. (1983). Natural Command Names and Initial Learning: A study of Text-Editing Terms. Communicatior.~ of the ACM, 26(7), 495-503.  ",
      "doi": "10.1145/358150.358157"
    },
    {
      "text": "Howes, A. and Young, R.M. (1996). Learning consistent, interactive and meaningful device methods\" A computational model. Cognitive Science, 20, 30 }{.356.",
      "doi": ""
    },
    {
      "text": "Rieman, J., Young, R.M., and Howes, A. (1996). A dual-space model of iteratively deepening exploratory learning. International Journal of Human-Computer Studies, 44(6), 743-775.  ",
      "doi": "10.1006/ijhc.1996.0032"
    },
    {
      "text": "Rieman, J.F. (1994). Learning Strategies and Exploratory Behavior of Interactive Comput.er Users. Unpublished Doctoral Dissertation, University of Colorado, Boulder, CO. ",
      "doi": "10.5555/221772"
    },
    {
      "text": "Kitajima, M. and Poison, P.G. (1997). A Comprehension-Based Model of Exploration. Human- Computer Interaction, 12, 439-462.  ",
      "doi": "10.1207/s15327051hci1204_3"
    },
    {
      "text": "Kitajima, M., Soto, R., and Poison, P.G. (1998). LICAI+: A Comprehension-Based Model of The: Recall of Action Sequences. in F. Ritter and R.M. Young (Eds.), Proceedings of the Second European Conference on Cognitive Modelling (Nottingham, April 1-4, 1998) (pp. 82-89). Nottingham, UK: Nottingham University Press.  ",
      "doi": "10.1145/1120212.1120420"
    },
    {
      "text": "Kintsch, W. (1998). Comprehension: A paradigm for cognition. New York, NY: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Mannes, S.M. and Kintsch, W. (1991). Routine Computing Tasks: Planning as Understanding. Cognitive Science, 15, 305-342.",
      "doi": ""
    },
    {
      "text": "Deerwester, S., et al. (1990). Indexing by Latent Semantic Analysis. Journal of the American Society For Information Science, 41(6), 391-407.",
      "doi": "10.1002/%28SICI%291097-4571%28199009%2941%3A6%3C391%3A%3AAID-ASI1%3E3.0.CO%3B2-9"
    },
    {
      "text": "Landauer, T.K. and Dumais, S.T. (1997). A solution to Plato's problem: The latent semantic analysis theory of acquisition, induction, and representation of knowledge. Psychological Review, 104(2), 211-240.",
      "doi": ""
    },
    {
      "text": "Landauer, T.K. and Dumais, S.T. (1996). How come you know so much? From practical problem to theory. In D. Hermann, et al. (Eds.), Basic and applied memory: Memory in context (pp. 105-126). Mahwah, NJ: Erlbaum.",
      "doi": ""
    },
    {
      "text": "Landauer, T.K. and Dumais, S.T. (1994). Latent semantic analysis and the measurement of knowledge. In R.M. Kaplan and J.C. Burstein (Eds.), Educational testing service conference on natural language processing techniques and technology in assessment and education . Princeton, N.J.\" Educational Testing Service.",
      "doi": ""
    },
    {
      "text": "Ericsson, A.K. and Simon, H.A. (1980). Verbal Reports as Data. Psychological Review, 87(3), 215-251.",
      "doi": ""
    },
    {
      "text": "Payne, S.J. (1991). Display-based action at the user interface. International Journal of Man-Machine Studies, 35, 275-289.  ",
      "doi": "10.1016/S0020-7373%2805%2980129-4"
    },
    {
      "text": "Nielsen, J. (1992). Applying Heuristic Evaluation to a Highly Domain-Specific User Interface. Technical memorandum. Morristown, NJ: Bellcore.",
      "doi": ""
    },
    {
      "text": "Soto, R. (1998). Learning and Performing by Exploration: Label Quality Measured by Latent Semantic Analysis. Unpublished master thesis, University of Colorado, Boulder, CO.",
      "doi": ""
    }
  ]
}