{
  "doi": "10.1145/302979.303053",
  "title": "Manual and gaze input cascaded (MAGIC) pointing",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "246-253",
  "year": 1999,
  "badges": [],
  "abstract": "This work explores a new direction in utilizing eye gaze for\ncomputer input. Gaze tracking has long been considered as an\nalternative or potentially superior pointing method for computer\ninput. We believe that many fundamental limitations exist with\ntraditional gaze pointing. In particular, it is unnatural to\noverload a perceptual channel such as vision with a motor control\ntask. We therefore propose an alternative approach, dubbed MAGIC\n(Manual And Gaze Input Cascaded) pointing. With such an approach,\npointing appears to the user to be a manual task, used for fine\nmanipulation and selection. However, a large portion of the cursor\nmovement is eliminated by warping the cursor to the eye gaze area,\nwhich encompasses the target. Two specific MAGIC pointing\ntechniques, one conservative and one liberal, were designed,\nanalyzed, and implemented with an eye tracker we developed. They\nwere then tested in a pilot study. This early- stage exploration\nshowed that the MAGIC pointing techniques might offer many\nadvantages, including reduced physical effort and fatigue as\ncompared to traditional manual pointing, greater accuracy and\nnaturalness than traditional gaze pointing, and possibly faster\nspeed than manual pointing. The pros and cons of the two techniques\nare discussed in light of both performance data and subjective\nreports.",
  "authors": [
    {
      "name": "Shumin Zhai",
      "institution": "IBM Almaden Research Center, 650 Harry Road, San Jose, CA",
      "img": "/do/10.1145/contrib-81408591988/rel-imgonly/81408591988.jpg",
      "acmid": "81408591988",
      "orcid": "0000-0003-0752-2090"
    },
    {
      "name": "Carlos Morimoto",
      "institution": "IBM Almaden Research Center, 650 Harry Road, San Jose, CA",
      "img": "/do/10.1145/contrib-81100289339/rel-imgonly/hitoshi.jpg",
      "acmid": "81100289339",
      "orcid": "missing"
    },
    {
      "name": "Steven Ihde",
      "institution": "IBM Almaden Research Center, 650 Harry Road, San Jose, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332506131",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Levine, J.L., An Eye-Controlled Computer,. 1981, IBM TJ Watson Research Center: Yorktown Heights, New York.",
      "doi": ""
    },
    {
      "text": "Bolt, R.A. Eyes at the interface, in Human Factors in Computer Systems. 1982. Gaithersburg, Maryland: ACM.  ",
      "doi": "10.1145/800049.801811"
    },
    {
      "text": "Ware, C. and H.H. Mikaelian. An evaluation of an eye tracker as a device for computer input, in CHI+G1. ACM Conference on Human Factors in Computing Systems and Graphics Interface. 1987. Toronto.  ",
      "doi": "10.1145/29933.275627"
    },
    {
      "text": "Jacob, R.J.K. What You Look At is What You Get: Eye Movement-Based Interaction Techniques. in CHI'90: A CM Conference on Human Factors in Computing Systems. 1990: Addison-Wesley/ACM Press.  ",
      "doi": "10.1145/97243.97246"
    },
    {
      "text": "Joch, A., What Pupils Teach Computers. Byte, 1996(July): p. 99-100.",
      "doi": ""
    },
    {
      "text": "Jacob, R.J.K., The Use of Eye Movements in Human- Computer Interaction Techniques.\" What You Look At is What You Get. ACM Transactions on Information Systems,, 1991. vol. 9(no. 3): p. 152-169.  ",
      "doi": "10.1145/123078.128728"
    },
    {
      "text": "Jacob, R.J.K., Eye Movement-Based Human-Computer Interaction Techniques: Toward Non-Command Interfaces, in Advances in Human-Computer Interaction, H.R. Hartson and D. Hix, Editors. 1993, Ablex Publishing Co.,\" Norwood, N.J.p. 151-190.",
      "doi": ""
    },
    {
      "text": "Fitts, P.M., The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology, 1954.47: p. 381-391.",
      "doi": ""
    },
    {
      "text": "Silbert, L. and R. Jacob, The Advantage of Eye Gaze Interaction,. 1996: Unpublished manuscript.  ",
      "doi": "10.1145/332040.332445"
    },
    {
      "text": "Morimoto, C., et al., Pupil detection and tracking using multiple light sources, . 1998, IBM Almaden Research Center: San Jose.",
      "doi": ""
    },
    {
      "text": "Young, L. and D. Sheena, Methods &amp; designs: Survey of eye movement recording methods. Behavioral Research Methods &amp; Instrumentation, 1975.7(5): p. 397--429.",
      "doi": ""
    },
    {
      "text": "Hutchinson, T.E., et al., Human-computer interaction using eye-gaze input. IEEE Transactions on Systems, Man, and Cybernetics, 1989.19(Nov.Dec): p. 1527--1533.",
      "doi": ""
    },
    {
      "text": "Tomono, A., I. Muneo, and Y. Kobayashi. A TV camera system which extracts feature points for non-contact eye movement detection, iSPIE vol. 1194. Optics, Illumination, and lmage Sensing for Machine Vision IV. 1989.",
      "doi": ""
    },
    {
      "text": "Ebisawa, Y. and S. Satoh. Effectiveness of pupil area detection technique using two light sources and image difference method. 15th Annual lnt. Conf. of the 1EEE Eng. in Medicine and Biology Society. 1993. San Diego, CA.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S., Fitts' law as a research and design tool in human computer interaction. Human Computer Interaction, 1992.7: p. 91-139.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S., A. Sellen, and W. Buxton. A comparison of input devices in elemental pointing and dragging tasks, in CH1'91: A CM Conference on Human Factors in Computing Systems. 1991. New Orleans, Louisiana.  ",
      "doi": "10.1145/108844.108868"
    }
  ]
}