{
  "doi": "10.1145/302979.303030",
  "title": "Principles of mixed-initiative user interfaces",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "159-166",
  "year": 1999,
  "badges": [],
  "abstract": "Recent debate has centered on the relative promise of focusing\nuser-interface research on developing new metaphors and tools that\nenhance users abilities to directly manipulate objects versus\ndirecting effort toward developing interface agents that provide\nautomation. In this paper, we review principles that show promise\nfor allowing engineers to enhance human-computer interaction\nthrough an elegant coupling of automated services with direct\nmanipulation. Key ideas will be highlighted in terms of the Lookout\nsystem for scheduling and meeting management.",
  "tags": [
    "UI design",
    "probability",
    "direct manipulaton",
    "user modeling",
    "intelligent agents",
    "decision theory"
  ],
  "authors": [
    {
      "name": "Eric Horvitz",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100323543/rel-imgonly/81100323543.jpg",
      "acmid": "81100323543",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahlberg, C., and Shneiderman, B. Visual information seeking: Tight coupling of dynamic query filters with starfield displays. Proceedings of CHI '94 Human Factors in Computing Systems (April 1994) ACM, 313-317.  ",
      "doi": "10.1145/191666.191775"
    },
    {
      "text": "B irnbaum, L., Horvitz, E., Kurlander, D., Lieberman, H., Marks, J. Roth, S. Compelling Intelligent User Interfaces: How Much AI? In Proceedings of the 1997 A CM International Conference on Intelligent Interfaces (Orlando, FL, January 1996). http://www.merl.com/reports/TR96-28/index.html  ",
      "doi": "10.1145/238218.238319"
    },
    {
      "text": "Dumais, S. T., Platt, J., Heckerman, D., and Sahami, M., Inductive learning algorithms and representations for text categorization. Proceedings of CIKM98. (Bethesda MD, November 1998). ACM Press, 148-155  ",
      "doi": "10.1145/288627.288651"
    },
    {
      "text": "Heckerman, D., and Horvitz, E. Inferring Informational Goals from Free-Text Queries: A Bayesian Approach, Fourteenth Conference on Uncertainty in Artificial Intelligence (Madison WI, July 1998), Morgan Kaufmann Publishers, 230-237. http:#research.microsoft.com/reports/TR96-28/index.html. ",
      "doi": "10.5555/2074094.2074121"
    },
    {
      "text": "Horvitz, E., and Barry, M. Display of Information for Time-Critical Decision Making. Proceedin:gs of the Eleventh Conference on Uncertainty in Artificial Intelligence (Montreal, August 1995). Morgan Kaufmann Publishers, 296-305. http.//research.microsoft.com/-horvitz/vista.htm ",
      "doi": "10.5555/2074158.2074191"
    },
    {
      "text": "Horvitz, E., Breese, J., Heckerman, D., Hovel, D., Rommelse, D. The Lumiere Project: Bayesian User Modeling for Inferring the Goals and Needs of Software Users, Fourteenth Conference on Uncertainty in Artificial Intelligence (Madison WI, July 1998). Morgan Kaufmann Publishers, 256-265. http://research.microsoft.com/--horvitz/lurniere.htm ",
      "doi": "10.5555/2074094.2074124"
    },
    {
      "text": "Horvitz, E.J., Breese, J., and Henrion, M. Decision theory in Expert Systems and Artificial Intelligence. International Journal of Approximate Reasoning, Special Issue on Uncertainty in Artificial Intelligence, 2:247-30. http://research.microsoft.coml-horvitzldt.htm  ",
      "doi": "10.1016/0888-613X%2888%2990120-X"
    },
    {
      "text": "Lieberman, H., Letizia: An Agent That Assists Web Browsing, International Joint Conference on Artificial Intelligence (Montreal, August 1995). IJCAI. ",
      "doi": "10.5555/1625855.1625975"
    },
    {
      "text": "Maes, P. Agents that Reduce Work and information Overload. Commun. ACM 37,7, 31-40  ",
      "doi": "10.1145/176789.176792"
    },
    {
      "text": "Maes, P., and Shneiderman, B., Direct Manipulation vs. Interface Agents: A Debate. Interactions, Vol. IV Number 6, ACM Press, 1997.  ",
      "doi": "10.1145/267505.267514"
    },
    {
      "text": "Pearl, J. Probabilistic Reasoning in Intelligent Systems: Networks of Plausible Inference, Morgan Kaufmann Publishers: San Francisco, 1991. ",
      "doi": "10.5555/52121"
    },
    {
      "text": "Platt, J. Fast training of SVMs using sequential minimal optimization. To appear in: B. Scholkopf, C. Burges, and A. Smola (Eds.) Advances in Kernel Methods - Support Vector Learning, MIT Press, 1999. ",
      "doi": "10.5555/299094.299105"
    },
    {
      "text": "Schneiderman, B. Designing the User Interface: Strategies for Effective Human-Computer Interaction, ACM Press. 1992. ",
      "doi": "10.5555/129385"
    },
    {
      "text": "Selman, B. Brooks, R.A., Dean, T., HorviLtz, E., M. Mitchell, T., Nilsson, N.J. Challenge Problems for Artificial Intelligence, In: Proceedings of AAAI-96, Thirteenth National Conference on Artificial intelligence (Portland, OR, August 1996). AAAI Press, 1340-1345. ",
      "doi": "10.5555/1864519.1864588"
    }
  ]
}