{
  "doi": "10.1145/302979.303036",
  "title": "The strategic use of CAD: an empirically inspired, theory-based course",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "183-190",
  "year": 1999,
  "badges": [],
  "abstract": "The inefficient use of complex computer systems has been widely\nreported. These studies show the persistence of inefficient methods\ndespite many years of experience and formal training. To counteract\nthis phenomenon, we present the design of a new course, called the\nStrategic Use of CAD. The course aims at teaching students\nefficient strategies to use a computer-aided drafting system\nthrough a two-pronged approach. Learning to See teaches students to\nrecognize opportunities to use efficient strategies by studying the\nnature of the task, and Learning to Do teaches students to\nimplement the strategies. Results from a pilot experiment show that\nthis approach had a positive effect on the strategic behavior of\nstudents who did not exhibit knowledge of efficient strategies\nbefore the class, and had no effect on the strategic behavior of\nthose who did. Strategic training can thus assist users in\nrecognizing opportunities to use efficient strategies. We present\nthe ramifications of these results on the design of training and\nfuture experiments.",
  "tags": [
    "strategy",
    "learning",
    "efficiency",
    "training",
    "GOMS",
    "CAD"
  ],
  "authors": [
    {
      "name": "Suresh K. Bhavnani",
      "institution": "HCI Institute, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100435759",
      "orcid": "missing"
    },
    {
      "name": "Bonnie E. John",
      "institution": "HCI Institute, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100482886",
      "orcid": "missing"
    },
    {
      "name": "Ulrich Flemming",
      "institution": "School of Architecture, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100407554",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bhavnani, S. K. How Architects Draw with Computers: A Cognitive Analysis of Real-World CAD htteractions, unpublished Ph.D. dissertation, 1998, Carnegie Mellon University, Pittsburgh.",
      "doi": ""
    },
    {
      "text": "Bhavnani, S.K., Flemming, U., Forsythe, D.E., Garrett, J.H., Shaw, D.S., and Tsai, A. CAD Usage in an Architectural Office: From Observations to Active Assistance. Automation in Construction 5 (1996), 243- 255.",
      "doi": ""
    },
    {
      "text": "Bhavnani, S.K., and John, B.E. Exploring the Unrealized Potential of Computer-Aided Drafting. Proceedings of CHI'96 (1996), 332-339.  ",
      "doi": "10.1145/238386.238538"
    },
    {
      "text": "Bhavnani, S.K., and John, B.E. From Sufficient to Efficient Usage: An Analysis of Strategic Knowledge. Proceedings of CHI'97 (1997), 91-98.  ",
      "doi": "10.1145/258549.258615"
    },
    {
      "text": "Bhavnani, S.K., and John, B.E. Delegation and Circumvention: Two Faces of Efficiency. Proceedings of CHI'98 (1998), 273-280.  ",
      "doi": "10.1145/274644.274683"
    },
    {
      "text": "Card, S.K., Moran, T.E, and Newell, A. The Psychology of Human-Computer Interaction. Hillsdale, NJ: Lawrence Erlbaum Associates, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Cragg, EB. and King, M. Spreadsheet ModeliLng Abuse: An Opportunity for OR? Journal of the Operational Research Society 44 (1993), 743-752.",
      "doi": ""
    },
    {
      "text": "Doane, S.M., Pellegrino, J.W., and Klatzky, R.L. Expertise in a Computer Operating System: Conceptualization and Performance. Human-Computer Interaction 5 (1990), 267-304.",
      "doi": "10.1207/s15327051hci0502%25263_5"
    },
    {
      "text": "Flemming, U., Bhavnani, S.K., and John, B.E. Mismatched Metaphor: User vs. System Model in Computer-Aided Drafting. Design Studies 18 (1997), 349-368.",
      "doi": ""
    },
    {
      "text": "Luchins, A. S. Mechanization in Problem Solving. Psychological Monographs, (1942), 54 (248).",
      "doi": ""
    },
    {
      "text": "Nilsen, E., Jong H., Olson J., Biolsi, I., and Mutter, S. The Growth of Software Skill: A Longitudinal Look at Learning and Performance. Proceedings of INTERCHI'93. (1993), 149-156.  ",
      "doi": "10.1145/169059.169126"
    },
    {
      "text": "Schoenfeld, A. H. Mathematical Problem Solving. New York: Academic Press, 1985.",
      "doi": ""
    },
    {
      "text": "Siegler, R.S., and Jenkins, E. How ChiMren Discover New Strategies. Lawrence Erlbaum Associates, New Jersey, 1989.",
      "doi": ""
    },
    {
      "text": "Single),, M.K., and Anderson, J. R. The Transfer of Cognitive Skill. Harvard University Press, Cambridge, Massachusetts, 1989. ",
      "doi": "10.5555/75032"
    }
  ]
}