{
  "doi": "10.1145/302979.303153",
  "title": "Bridging strategies for VR-based learning",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "536-543",
  "year": 1999,
  "badges": [],
  "abstract": "A distributed immersive virtual environment was deployed as a\ncomponent of a pedagogical strategy for teaching third grade\nchildren that the Earth is round. The displacement strategy is\nbased on the theory that fundamental conceptual change requires an\nalternative cognitive starting point which doesnt invoke the\nfeatures of pre-existing models. While the VR apparatus helped to\nestablish that alternative framework, conceptual change was\nstrongly influenced by the bridging activities which related that\nexperience to the target domain. Simple declarations of relevance\nproved ineffective. A more articulated bridging process involving\nphysical models was effective for some children, but the multiple\nrepresentations employed required too much model-matching for\nothers.",
  "authors": [
    {
      "name": "Tom Moher",
      "institution": "Electronic Visualization Laboratory, EECS Department, University of Illinois at Chicago, Chicago, IL",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100538646",
      "orcid": "missing"
    },
    {
      "name": "Andrew Johnson",
      "institution": "Electronic Visualization Laboratory, EECS Department, University of Illinois at Chicago, Chicago, IL",
      "img": "/do/10.1145/contrib-81100449730/rel-imgonly/andy.jpg",
      "acmid": "81100449730",
      "orcid": "missing"
    },
    {
      "name": "Stellan Ohlsson",
      "institution": "Department of Psychology, University of Illinois at Chicago, Chicago, IL",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100606696",
      "orcid": "missing"
    },
    {
      "name": "Mark Gillingham",
      "institution": "College of Education, University of Illinois at Chicago, Chicago, IL",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100100452",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ainsworth, S., Bibby, P.A., &amp; Wood, D.J. (1997). Information technology and multiple representations: New opportunities--new problems. Journal of Information Technology for Teacher Education, 6, 93- 104.",
      "doi": ""
    },
    {
      "text": "Aronson, E., Blaney, N., Stephan, C., Sikes, J., &amp; Snapp, M. (1978). The Jigsaw Classroom. Beverly Hills, CA: Sage.",
      "doi": ""
    },
    {
      "text": "Angluin, D., &amp; Smith, C. H. (1983). Inductive inference: Theory and methods. Computing Surveys, 15, 237-269.  ",
      "doi": "10.1145/356914.356918"
    },
    {
      "text": "Bereiter, C., (1985). Toward a solution of the learning paradox. Review of Educational Research, 55, 201-226.",
      "doi": ""
    },
    {
      "text": "Bonar, J. &amp; Cunningham, R. (1988). Bridge: Tutoring the programming process. In J. Psotka, L. Massey, and S. Mutter (Eds.), Intelligent tutoring systems: Lessons learned (pp. 409-434). Hillsdale, NJ: Lawrence Erlbaum.",
      "doi": ""
    },
    {
      "text": "Bruer, J. T. (1994). Schools for thought: A science of learning in the classroom. Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "Calvin, W. H. (1996). The cerebral code. Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "Chi, M. T. H. (1992). Conceptual change within and across ontological categories: Examples from learning and discovery in science. In R. N. Giere, (Ed.), Cognitive models of science (pp. 129-186). Minneapolis, Minnesota: University of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Clement, J. (1988). Observed methods for generating analogies in scientific problem solving. Cognitive Science, 12, 563-586.",
      "doi": ""
    },
    {
      "text": "Confrey, J. (1990). A review of research on student conceptions in mathematics, science, and programming. In C. B. Cazdan, (Ed.), Review of research in education (Vol. 16, pp. 3-56). Washington, DC: American Educational Research Association.",
      "doi": ""
    },
    {
      "text": "Dede, C., Salzman, M., &amp; Loftin, R. (1996) ScienceSpace: Virtual Realities for Learning Complex and Abstract Scientific Concepts. In Proceedings VRAIS '96 (pp.246-253). ",
      "doi": "10.5555/832290.836023"
    },
    {
      "text": "DiSessa, A. A. (1988). Knowledge in pieces. In G. Forman &amp; P. Pufall, (Eds.), Constructivism in the computer age (pp. 49-70). Hillsdale, NJ: Erlbaum.",
      "doi": ""
    },
    {
      "text": "DiSessa, A. A. (1993). Toward an epistemology of physics. Cognition and Instruction, 10, 10.5-225.",
      "doi": ""
    },
    {
      "text": "Ericsson, K. A., Krampe, R. Th., &amp; Tesch-Romer, C. (1993). The role of deliberate practice in the acquisition of expert performance. Psychological Review, 100, 363-406.",
      "doi": ""
    },
    {
      "text": "Gentner, D., Rattermann, M., Forbus, K. (1993). The role of similarity in transfer. Cognitive Psychology, 25, 524-575.",
      "doi": ""
    },
    {
      "text": "Gick, M., &amp; Holyoak, J. (1987). The cognitive basis for knowledge transfer, in S. Cormier and J.Hagman (Eds.), Transfer of learning (pp. 9-46). San Diego, CA: Academic Press.",
      "doi": ""
    },
    {
      "text": "Hewson, P. W., &amp; Hewson, M. G. A. (1984). The role of conceptual conflict in conceptual ch~mge and the design of science instruction. Instructional Science, 13, 1-13.",
      "doi": ""
    },
    {
      "text": "Holyoak, K. J., &amp; Thagard, P. (I 995). Mental leaps. Cambridge, MA: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Karmiloff-Smith, A. (1992). Beyond modularity: A developmental perspective on cognitive science. Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "McCloseky, (1983). Intuitive theories of motion. In D. Gentner &amp; A. L. Stevens, (Eds.), Mental models (pp. 299-323). Hillsdale, NJ: Erlbaum.",
      "doi": ""
    },
    {
      "text": "Nussbaum, J. (1985). The Earth as a cosmic body. In R. Driver, E. Guesne, &amp; A. Tiberghien (F_.As.), Children's ideas in science (pp.170-192). Milton Keynes, UK: Open University Press.",
      "doi": ""
    },
    {
      "text": "Ohlsson, S. (1995a). Learning to do and learning to understand: A lesson and a challenge for cognitive modeling. In P. Reimann and H. Spada, (Eds.), Learning in humans and machines: Towards an interdisciplinary learning science. Oxford, UK: Elsevier.",
      "doi": ""
    },
    {
      "text": "Piaget, J. (1985). The equilibration of cognitive structures. Chicago, IL: The University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Reber, A. (1993). Implicit learning and tacit knowledge. New York: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Resnick, L. B., &amp; Omanson, S. (1987). {.earning to understand arithmetic. In R. Glaser, (Ed.), Advances in instructional psychology (Vol. 3, pp. 41-95). Hillsdale, NJ: Erlbaum.",
      "doi": ""
    },
    {
      "text": "Salzman, M., Dede, C., Loftin, R.~ &amp; Chen, J. A. (1998)A model for understanding how virtual reality aids complex conceptual learning. Presence (jin press).  ",
      "doi": "10.1162/105474699566242"
    },
    {
      "text": "Singley, M., &amp; Anderson, J. R. (1989). The transfer of cognitive skill. Cambridge, MA: Harvard University Press. ",
      "doi": "10.5555/75032"
    },
    {
      "text": "Steinberg, R. J., (Ed.), (1984). Mechanisms of cognitive development. New York: W. H. Freeman.",
      "doi": ""
    },
    {
      "text": "Vosniadou, S. (1994). Capturing and modeling the process of conceptual change. Learning and Instruction, 4, 45-69.",
      "doi": ""
    },
    {
      "text": "Vosniadou. S., &amp; Brewer, W. F. (1994). Mental models of the day/night cycle. Cognitive Science, 18, 123-183.",
      "doi": ""
    },
    {
      "text": "Youngblut, C. (1998) Educational uses of virtual reality technology. Technical Report IDA Document D-2128, Institute for Defense Analyses, Alexandria, VA.",
      "doi": ""
    }
  ]
}