{
  "doi": "10.1145/302979.303110",
  "title": "TouchCounters: designing interactive electronic labels for physical containers",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "362-369",
  "year": 1999,
  "badges": [],
  "abstract": "We present TouchCounters, an integrated system of electronic\nmodules, physical storage containers, and shelving surfaces for the\nsupport of collaborative physical work. Through physical sensors\nand local displays, TouchCounters record and display usage history\ninformation upon physical storage containers, thus allowing access\nto this information during the performance of real-world tasks. A\ndistributed communications network allows this data to be exchanged\nwith a server, such that users can access this information from\nremote locations as well.\nBased upon prior work in ubiquitous computing and tangible\ninterfaces, TouchCounters incorporate new techniques, including\nusage history tracking for physical objects and multi-display\nvisualization. This paper describes the components, interactions,\nimplementation, and conceptual approach of the TouchCounters\nsystem.",
  "tags": [
    "visualization",
    "ubiquitous computing",
    "tangible interfaces",
    "distributed sensing"
  ],
  "authors": [
    {
      "name": "Paul Yarin",
      "institution": "MIT Media Laboratory, 20 Ames Street, E15 (-444, -485), Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100299784",
      "orcid": "missing"
    },
    {
      "name": "Hiroshi Ishii",
      "institution": "MIT Media Laboratory, 20 Ames Street, E15 (-444, -485), Cambridge, MA",
      "img": "/do/10.1145/contrib-81100363076/rel-imgonly/120908-024.jpg",
      "acmid": "81100363076",
      "orcid": "0000-0003-4918-8908"
    }
  ],
  "references": [
    {
      "text": "Fishkin, K., Moran, T., and Harrison, B. Embodied User Interfaces: Towards Invisible User Interfaces, to appear in Proceedings ofEHCI'98, ACM }Press. ",
      "doi": "10.5555/645349.650706"
    },
    {
      "text": "Edwards, Paul N. \"From 'Impact' to Social Process: Computers in Society and Culture,\" in Sheila Jasanoff et al., eds., Handbook of Science and Technology Studies (Beverly Hills, CA: Sage Publications, 1994), 257-285.",
      "doi": ""
    },
    {
      "text": "Feiner, S., Maclntyre, B., and Seli~Tnann, D. Knowledge-based augmented reality. Commun. A CM 36, 7 (July 1993), ACM Press, 52-62.  ",
      "doi": "10.1145/159544.159587"
    },
    {
      "text": "Fitzmaurice, G. Situated information Spaces and Spatially Aware Palmtop Computers. Commun. A CM, 36, 7 (July 1993), ACM Press, 38-49.  ",
      "doi": "10.1145/159544.159566"
    },
    {
      "text": "Fitzmaurice, G., Ishii, H., and Buxton, W. Bricks: Laying the foundations for graspable user interfaces, in Proceedings of CHI'95, ACM Press, 442-449.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Gorbet, M., Orth, M., and Ishii, H. Triangles: Tangible interface for manipulation and exploration of digital information topography, in Proceedings of CH1\"98, ACM Press, 49-56.  ",
      "doi": "10.1145/274644.274652"
    },
    {
      "text": "Hearst, Mart} A. TileBars: Visualization of term distribution information in full text information access, in Proceedings of CHI'95, ACM Press, 59- 66.  ",
      "doi": "10.1145/223904.223912"
    },
    {
      "text": "Hill, W. C., Hollan, J. D., Wroblewski, D., and McCandless, T. Edit wear and read wear, in Proceedings ofCHI'92, ACM Press, 3-9.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Ishii, H., and Ullmer, B. Tangible bitz: Towards seamless interfaces between people, bits, and atoms, in Proceedings of CHI'97, ACM Press, 234-241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Ishii, H., Wisneski, C., Brave, S., Dahley, A., Gorbet, M., Ullmer, B. and Yarin, P. ambientROOM: integrating ambient media with architectural space (video), in Summary of CHI '98 (Los Angeles, April 1998), ACM Press, 173-174.  ",
      "doi": "10.1145/286498.286652"
    },
    {
      "text": "Poor, R. The iRX 2.0 ..where Atoms meet Bits. http ://ttt .media .mit. edu/pia/Researzh/iRX2/",
      "doi": ""
    },
    {
      "text": "Rekimoto, J, and Nagao, K. The world through the computer: Computer augmented interaction with real world environments, in Proceedings of UIST'95, ACM Press, 29.  ",
      "doi": "10.1145/215585.215639"
    },
    {
      "text": "Resnick, M., Berg, F., et al. Digital manipulatives: New toys to think with, in Proceedings of CH1'98, ACM Press, 281-285.  ",
      "doi": "10.1145/274644.274684"
    },
    {
      "text": "Ullmer, B., Ishii, H., and Glas, D. (1998). \"media- Blocks: Physical containers, transports, and controls for online media, in Proceedings of SIGGRAPH'98, ACM Press, 379-386.  ",
      "doi": "10.1145/280814.280940"
    },
    {
      "text": "Underkoffier, J., and Ishii, H. Illuminating light: An optical design tool with a luminous-tangible interface, in Proceedings of CHI'98, ACM Press, 542-549.  ",
      "doi": "10.1145/274644.274717"
    },
    {
      "text": "Weiser, M. \"The Computer for the 21 st Century.\" In Scientific American, 265(3), 94-104.",
      "doi": ""
    },
    {
      "text": "White, Tom. Introducing Liquid Haptics in High Bandwidth Human Computer Interfaces. MS Thesis, MIT Media Lab, May 1998.",
      "doi": ""
    }
  ]
}