{
  "doi": "10.1145/302979.303166",
  "title": "Cooperative inquiry: developing new technologies for children with children",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "592-599",
  "year": 1999,
  "badges": [],
  "abstract": "In todays homes and schools, children are emerging as frequent\nand experienced users of technology [3, 14]. As this trend\ncontinues, it becomes increasingly important to ask if we are\nfulfilling the technology needs of our children. To answer this\nquestion, I have developed a research approach that enables young\nchildren to have a voice throughout the technology development\nprocess. In this paper, the techniques of cooperative\ninquiry will be described along with a theoretical framework\nthat situates this work in the HCI literature. Two examples of\ntechnology resulting from this approach will be presented, along\nwith a brief discussion on the design-centered learning of\nteam researchers using cooperative inquiry.",
  "authors": [
    {
      "name": "Allison Druin",
      "institution": "Human-Computer Interaction Lab, University of Maryland, College Park, MD",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100365303",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Proceedings of PDC'90: Participatory Design Conference (1990). Palo Alto, CA: Computer Professionals for Social Responsibility.",
      "doi": ""
    },
    {
      "text": "Proceedings of PDC'96: Participatory Design Conference (1996). Cambridge, MA: Computer Professionals for Social Responsibility.",
      "doi": ""
    },
    {
      "text": "Report to the President on the use of technology to strengthen K-12 education in the United States (1997). President's Committee of Advisors on Science and Technology, Executive Office of the President of the United States, Washington, DC.",
      "doi": ""
    },
    {
      "text": "Bederson, B., Hollan, J., Perlin, K., Meyer, J., Bacon, D., &amp; Furnas, G. (1996). Pad++: A zoomable graphical sketchpad for exploring alternate interface physics. Journal of Visual Languages and Computing, 7, 3-31.",
      "doi": ""
    },
    {
      "text": "Beyer, H., &amp; Holtzblatt, K. (1998). Contextual design.\" defining customer-centered systems. San Francisco, CA: Morgan Kaufmann. ",
      "doi": "10.5555/286067"
    },
    {
      "text": "Bjerknes, G., Ehn, P., &amp; Kyng, M. (Ed,;.), (1987). Computers and democracy: A Scandinavian challenge. Aldershot, UK: Alebury.",
      "doi": ""
    },
    {
      "text": "Bodker, S. (1991). Through the interface: A human activity approach to user interface design. Hillsdale, NJ: Lawrence Erlbaum. ",
      "doi": "10.5555/533740"
    },
    {
      "text": "Boltman, A., Druin, A., &amp; Miura, A. (1998). What children can tell us about technology: The CHIkids model of technology immersion. CHI 98 Tutorial ACM Press.  ",
      "doi": "10.1145/286498.286581"
    },
    {
      "text": "Druin, A. (1996). A place called childhood. Interactions, 3(1), 17-22.  ",
      "doi": "10.1145/223500.223506"
    },
    {
      "text": "Druin, A., Bederson, B., Boltman, A., Miura, A., Knotts-Callahan, D., &amp; Platt, M. (1999). Children as our technology design partners. A. Druin (Ed.), The design of children's technology (pp. 51-72). San Francisco, CA: Morgan Kaufmann. ",
      "doi": "10.5555/303430.303435"
    },
    {
      "text": "Druin, A., Stewart, J., Proft, D., Bederson, B., &amp; Hollan, J. (1997). KidPad: A design collaboration between children, technologists, and educators. In Proceedings of Human Factors in Computing Systems (CHI 97) ACM Press, pp. 463-470.  ",
      "doi": "10.1145/258549.258866"
    },
    {
      "text": "Ehn, P. (1993). Scandinavian design: On participation and skill. D. Schuler, &amp; A. Namioka (Eds.), Participatory design: Principles and practices (pp. 41- 77). Hillsdale, NJ: Lawrence Erlbaum.",
      "doi": ""
    },
    {
      "text": "Erickson, K., &amp; Stull, D. (1998). Doing team ethnography: Warnings and advise. Thousand Oaks, CA: Sage.",
      "doi": ""
    },
    {
      "text": "Fulton, K. (1997). Learning in the digital age: Insights into the issues. Santa Monica, CA: Milken Exchange on Education Technology.",
      "doi": ""
    },
    {
      "text": "Greenbaum, J. (1993). A design of one's own: Toward participatory design in the United States. D. Schuler, &amp; A. Namioka (Eds.), Participatory design: Principles and practices (pp. 27-37). Hillsdale, NJ: Lawrence Erlbaum.",
      "doi": ""
    },
    {
      "text": "Greenbaum, J., &amp; Kyng, M. (Eds.), (1991). Design at work: Cooperative design of computer systems. Hillsdale, NJ: Lawrence Erlbaum. ",
      "doi": "10.5555/125470"
    },
    {
      "text": "Heller, S. (1998, August). The meaning of children in culture becomes a focal point for scholars. The Chronicle of Higher Education, pp. A14-At6.",
      "doi": ""
    },
    {
      "text": "Holtzblatt, K., &amp; Jones, S. (1995), R. M. Baecker, J. Grudin, W. A. S. Buxton, &amp; S. Greenberg (Eds.), Readings in Human-Computer Interaction: Toward the year 2000 (2nd ed.). San Francisco, CA: Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Lave, J. (1992). Cognition in practice. Cambridge: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Loh, B., Radinsky, J., Rusell, E., Gomez, L. M., Reiser, B. J., &amp; Edelson, D. C. (1998). The progress portfolio: Designing reflective tools for a classroom context. In Proceedings of Human Factors in Computing Systems (CHI 98) ACM Press, pp. 627- 634.  ",
      "doi": "10.1145/274644.274728"
    },
    {
      "text": "Muller, M. J., Wildman, D. M., &amp; White, E. A. (1994). Participatory design through games and other techniques. CHI 94 Tutorial ACM Press.  ",
      "doi": "10.1145/259963.260530"
    },
    {
      "text": "Mumford, E., &amp; Henshall, D. (1979/1983). Designing participatively: A participative approach to computer systems design. UK: Manchester Business School. ",
      "doi": "10.5555/578636"
    },
    {
      "text": "Nardi, B. (Ed.), (1996). Context and consciousness: Activity theory and Human-Computer interaction. Cambridge, MA: MIT Press. ",
      "doi": "10.5555/223826"
    },
    {
      "text": "Nielsen, J. (1995). Scenarios in discount usability engineering. J. Carroll (Ed.), Scenario-based design: Envisioning work and technology in system development (pp. 151-167). New York: Wiley. ",
      "doi": "10.5555/209227.209233"
    },
    {
      "text": "Nielsen, J., &amp; Mack, R. L. (1994). Usability inspection methods. New York: Wiley. ",
      "doi": "10.5555/189200"
    },
    {
      "text": "Oosterholt, R., Kusano, M., &amp; de Vries, G. (1996). Interaction design and human factors support in the development of a personal communicator for children. In Proceedings of Human Factors in Computing Systems (CH196) ACM Press, pp. 450-457.  ",
      "doi": "10.1145/238386.238603"
    },
    {
      "text": "Scaife, M., &amp; Rogers, Y. (1999). Kids as informants: Telling us what we didn't know or confirming what we knew already. A. Druin (Ed.), The design of children's technology (pp. 27-50). San Francisco, CA: Morgan Kaufmann. ",
      "doi": "10.5555/303430.303434"
    },
    {
      "text": "Scaife, M., Rogers, Y., Aldrich, F., &amp; Davies, M. (1997). Designing for or designing with? Informant design for interactive learning environments. In Proceedings of Human Factors in Computing Systems (CH197) ACM Press, pp. 343-350.  ",
      "doi": "10.1145/258549.258789"
    },
    {
      "text": "Schuler, D., &amp; Namioka, A. (Eds.), (1993). Participatory design: Principles and practices. Hillsdale, NJ: Lawrence Erlbaum. ",
      "doi": "10.5555/563076"
    },
    {
      "text": "Shneiderman, B. (1998). Relate--Create--Donate: A teaching/learning philosophy for cyber-generation. Computers and Education, pp. 1 - 15.  ",
      "doi": "10.5555/295238.295242"
    },
    {
      "text": "Stewart, J., Raybourn, E., Bederson, B. B., &amp; Druin, A. (1998). When two hands are better than one: Enhancing collaboration using single display groupware. In Proceedings of Extended Abstracts of Human Factors in Computing Systems (CHI 98) ACM Press, pp. 287-288.  ",
      "doi": "10.1145/286498.286766"
    },
    {
      "text": "Suchman, L. (1987). Plans and situated actions. Cambridge: Cambridge University Press.",
      "doi": ""
    }
  ]
}