{
  "doi": "10.1145/302979.303128",
  "title": "Navigation as multiscale pointing: extending Fitts' model to very high precision tasks",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "450-457",
  "year": 1999,
  "badges": [],
  "abstract": "Fitts pointing model has proven extremely useful for\nunderstanding basic selection in WIMP user interfaces. Yet todays\ninterfaces involve more complex navigation within electronic\nenvironments. As navigation amounts to a form of multi-scale\npointing, Fitts model can be applied to these more complex tasks.\nWe report the results of a preliminary pointing experiment that\nshows that users can handle higher levels of task difficulty with\ntwo-scale rather than traditional one-scale pointing control. Also,\nin tasks with very high-precision hand movements, performance is\nhigher with a stylus than with a mouse.",
  "tags": [
    "graphical tablet",
    "multiscale interfaces",
    "mouse",
    "navigation",
    "stylus",
    "Fitts' law",
    "input devices",
    "pointing"
  ],
  "authors": [
    {
      "name": "Yves Guiard",
      "institution": "Mouvement & Perception, CNRS & Université de la Méditerranée, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100143867",
      "orcid": "missing"
    },
    {
      "name": "Michel Beaudouin-Lafon",
      "institution": "Laboratoire de Recherche en Informatique, CNRS & Université de Paris-Sud, France",
      "img": "/do/10.1145/contrib-81100644686/rel-imgonly/mbl-120x120.jpg",
      "acmid": "81100644686",
      "orcid": "0000-0002-2905-9810"
    },
    {
      "name": "Denis Mottet",
      "institution": "Faculté des Sciences du Sport, Université de Poitiers, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100280424",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Accot, J., Yamaashi, K., Zhai, S., &amp; Buxton, W. Elementary, My Dear Fitts: Performance in twohanded pointing with a magnifying gJLass. CENA internal research report #NR98-831 (1998).",
      "doi": ""
    },
    {
      "text": "Accot, J. and Zhai, S. Beyond Fitts' law: Models for trajectory-based HCI tasks, in Proceeding,~ of CHI'97 (Atlanta GA, March 1997), ACM Press, 2!)5-302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Buxton, W. and Myers, B. A study in two-handed input, in Proceeding of CHI'86 (1986), ACM Press, 321-326.  ",
      "doi": "10.1145/22627.22390"
    },
    {
      "text": "Bederson, B. B., &amp; Hollan, J. D. Pad++: a zooming graphical interface for exploring alternate interface physics, in Proceeding of ACM UIST'94, (Marina del Ray, CA, November 1994), ACM Press, 17-26.  ",
      "doi": "10.1145/192426.192435"
    },
    {
      "text": "Card, S.K., English, W.K., and Burr, B.J. Evaluation of mouse, rate-controlled isometric joystick, step-keys, and text keys for text selection on a CRT. Ergonomics, 21, 8 (1978), 301-613.",
      "doi": ""
    },
    {
      "text": "Card, S.K., Robertson, G.G., &amp; York, W. The WebBook and the Web Forager; An information workspace for the world-wide web, in Proceedings of CHI'96 (Vancouver, BC, Canada, April 1996), ACM Press, l 11-117.  ",
      "doi": "10.1145/238386.238446"
    },
    {
      "text": "Fitts, P.M. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology 47 (1954), 381-391.",
      "doi": ""
    },
    {
      "text": "Fitts, P.M., and Peterson, J.R. Information capacity of discrete motor responses. Journal of Experimental Psychology 67 (1964), 103-112.",
      "doi": ""
    },
    {
      "text": "Furnas, G.W. &amp; Bederson, B.B. Space-scale diagrams: Understanding multiscale interfaces, in Proceedings of CHI'95 (Denver CO, May 1995), ACM Press, 234- 241.  ",
      "doi": "10.1145/223904.223934"
    },
    {
      "text": "Gan, K.C. and Hoffmann, E.R. Geometrical conditions for ballistic and visually controlled movements. Ergonomics 31 (1988), 829-839.",
      "doi": ""
    },
    {
      "text": "Guiard, Y. Asymmetric division of labor in human skilled bimanual action: The kinematic chain as a model. Journal of Motor Behavior 19 (1987), 486- 517.",
      "doi": ""
    },
    {
      "text": "Guiard, Y. Information and energy constraints in human movement: Fitts' law in the discrete vs. continuous paradigm. Human Movement Science 16 (1997), 97-131.",
      "doi": ""
    },
    {
      "text": "Guiard, Y. &amp; Ferrand, T. Asymmetry in bimanual skills, in D. Elliott &amp; E. A. Roy (Eds.), Manual asymmetries in motor performance (1996). Boca Raton FL: CRC Press, 175-195.",
      "doi": ""
    },
    {
      "text": "Kabbash, P., MacKenzie, I.S., and Buxton, W. Human performance using computer input devices in the preferred and non-preferred hands, in Proceedings of CHI'93 (Amsterdam, 1993), ACM Press, 474-481.  ",
      "doi": "10.1145/169059.169414"
    },
    {
      "text": "Lacquaniti, F., Ferrigno, G., Pedotti, A., Soechting, J.F., and Terzuolo, C. Changes in spatial scale in drawing and handwriting: Kinematic contributions by proximal and distal joints. Journal of Neuroscience 7, 3 (1987), 819-828.",
      "doi": ""
    },
    {
      "text": "Langolf, G.D., Chaffin, D.B., and Foulke, J.A. An investigation of Fitts' law using a wide range of movement amplitudes. Journal of motor Behavior 8 (1976), 113-128.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S. Fitts' law as a research and design tool in human-computer interaction. Human-Computer Interaction 7 (1992), 91-139.",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "MacKenzie, I.S. and Buxton, W. Extending Fitts' law to two-dimensional tasks, in Proceedings of CHI'92 (Monterey CA, May 1992), ACM Press, 219-226.  ",
      "doi": "10.1145/142750.142794"
    },
    {
      "text": "Meyer, D.E., Smith, J.E.K., Kornblum, S., Abrams, R.A., &amp; Wright, C.E. Speed-accuracy tradeoffs in aimed movements: Toward a theory of rapid voluntary action. In M. Jeannerod (Ed.), Attention and performance XIII (1990). Hillsdale, N.I: Erlbaum, 173- 226.",
      "doi": ""
    },
    {
      "text": "Mottet, D., Bootsma, R.J., Guiard, Y., and Laurent, M. Fitts' law in two-dimensional task space. Experimental Brain Research 100 (1994), 144-148.",
      "doi": ""
    },
    {
      "text": "Schmidt, R.A., Zelaznik, H.N., Hawkins, B., Frank, J.S., &amp; Quinn, J.T., jr. Motor output variability: A theory for the accuracy of rapid motor acts. Psychological Review 86 (1979), 415-451.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Designing information abundant websites: Issues and recommendations. International Journal of Human-Computer Studies (1997).  ",
      "doi": "10.1006/ijhc.1997.0127"
    },
    {
      "text": "Zhai, S., Milgram, P. and Buxton, W. The influence of muscle groups on performance of multiple degree-offreedom input, in Proceedings of CHI'96 (Vancouver BC, Canada, April 1996), ACM Press, 308-315.  ",
      "doi": "10.1145/238386.238534"
    },
    {
      "text": "Zhai, S., Smith, B.A., and Selker, T. Improving browsing performance: A study of four input devices for scrolling and pointing tasks, in Proceedings of INTERACT97 (Sydney, Australia, July 1997), 286- 292. ",
      "doi": "10.5555/647403.723823"
    }
  ]
}