{
  "doi": "10.1145/302979.303045",
  "title": "Touch-sensing input devices",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "223-230",
  "year": 1999,
  "badges": [],
  "abstract": "We can touch things, and our senses tell us when our hands are\ntouching something. But most computer input devices cannot detect\nwhen the user touches or releases the device or some portion of the\ndevice. Thus, adding touch sensors to input devices offers many\npossibilities for novel interaction techniques. We demonstrate the\nTouchTrackball and the Scrolling TouchMouse, which use unobtrusive\ncapacitance sensors to detect contact from the users hand without\nrequiring pressure or mechanical actuation of a switch. We further\ndemonstrate how the capabilities of these devices can be matched to\nan implicit interaction technique, the On-Demand Interface, which\nuses the passive information captured by touch sensors to fade in\nor fade out portions of a display depending on what the user is\ndoing; a second technique uses explicit, intentional interaction\nwith touch sensors for enhanced scrolling. We present our new\ndevices in the context of a simple tax- onomy of tactile input\ntechnologies. Finally, we discuss the properties of touch-sensing\nas an input channel in general.",
  "authors": [
    {
      "name": "Ken Hinckley",
      "institution": "Microsoft Research, One Microsoft Way, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519448",
      "orcid": "0000-0002-4733-4927"
    },
    {
      "name": "Mike Sinclair",
      "institution": "Microsoft Research, One Microsoft Way, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318498872",
      "orcid": "0000-0003-4343-2332"
    }
  ],
  "references": [
    {
      "text": "Balakrishnan, R., Patel, P., \"The PadMouse: Facilitating Selection and Spatial Positioning for the Non-Dominant Hand,\" CHr98, 1998, 9-16.  ",
      "doi": "10.1145/274644.274646"
    },
    {
      "text": "Bier, E., Stone, M., Pier, K., Buxton, W., DeRose, T., \"Toolglass and Magic Lenses: The See- Through Interface,\" SIGGRAPH 93, 1993, 73-80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Buxton, W., \"Touch, Gesture, and Marking,\" in Readings in Human-Computer Interaction: Toward the Year 2000, R. Baecker, et al., Editors. 1995, Morgan Kaufmann Publishers. p. 469-482. ",
      "doi": "10.5555/212925.212968"
    },
    {
      "text": "Buxton, W., Hill, R., Rowley, P., \"Issues and Techniques in Touch-Sensitive Tablet Input,\" Computer Graphics, 19 (3): p. 215-224, 1985.  ",
      "doi": "10.1145/325165.325239"
    },
    {
      "text": "Card, S., Mackinlay, J., Robertson, G., \"The Design Space of input Devices,\" CHr90 Conf. on Human Factors in Computing Systems, 117-124.  ",
      "doi": "10.1145/97243.97263"
    },
    {
      "text": "Chemtronics, CircuitWorks Conductive Pen, : http ://www.chemtronics.corn/.",
      "doi": ""
    },
    {
      "text": "Harrison, B., Fishkin, K., Gujar, A., Mochon, C., Want, R., \"Squeeze Me, Hold Me, Tilt Me! An Exploration of Manipulative User Interfaces,\" CHI'98, 17-24.  ",
      "doi": "10.1145/274644.274647"
    },
    {
      "text": "Harrison &amp; Vicente, \"An Experimental Evaluation of Transparent Menu Usage,\" CHI'96, 391-398.  ",
      "doi": "10.1145/238386.238583"
    },
    {
      "text": "Herot, C., Weinzapfel, G., \"One-Point Touch Input of Vector Information from Computer Displays,\" Computer Graphics, 12 (3): p. 210-216, 1978.  ",
      "doi": "10.1145/965139.807392"
    },
    {
      "text": "Hinckley, K., Czerwinski, M., Sinclair, M., \"Interaction and Modeling Techniques for Desktop Two-Handed input,\" UIST'98, 49-58.  ",
      "doi": "10.1145/288392.288572"
    },
    {
      "text": "Infusion Systems, \"Reach\" electromagnetic field sensor\" http:llwww.infusionsystems.com/.",
      "doi": ""
    },
    {
      "text": "ITU Research, TouchCube: www.ituresearch.com.",
      "doi": ""
    },
    {
      "text": "Krueger, M., \"Artificial Reality I}{\". 1991, Reading, MA: Addison-Wesley.",
      "doi": ""
    },
    {
      "text": "Kurtenbach, G., Fitzmaurice, G., Baudel, T., Buxton, B., \"The Design of a GUI Paradigm based on Tablets, Two-hands, and Tran:sparency,\" CHr97, 35-42.  ",
      "doi": "10.1145/258549.258574"
    },
    {
      "text": "Lee, S., Buxton, W., Smith, K., \"A Multi-Touch Three Dimensional Touch-Sensitive Tablet,\" Proc. CHI'85, 1985, 21-25.  ",
      "doi": "10.1145/317456.317461"
    },
    {
      "text": "Loomis, J., Lederman, S., \"Tactual Perception,\" in Handbook of Perception and Human Performance: Vol. H, K. Boff et al., eds. 1986, John Wiley and Sons: New York. Chapter 31.",
      "doi": ""
    },
    {
      "text": "Mapes, D., Moshell, J.M., \"A Two-Handed Interface for Object Manipulation in Virtual Environments,\" Presence, 4 (4): p. 403-416, 1995.",
      "doi": "10.1162/pres.1995.4.4.403"
    },
    {
      "text": "Matsushita, N., Rekimoto, J., \"Holo Wall\" Designing a Finger, Hand, Body, and Object Sensitive Wall,\" UIST'97, 209-210.  ",
      "doi": "10.1145/263407.263549"
    },
    {
      "text": "Media Metrix Inc., HardScan Report, 1998, p. 4.",
      "doi": ""
    },
    {
      "text": "Pickering, J., \"Touch-sensitive screens: the technologies and their application,\" International j. Man-Machine Studies, 25 (3): p. 249-69, 1986.  ",
      "doi": "10.1016/S0020-7373%2886%2980060-8"
    },
    {
      "text": "Rouse, P., \"Touch-sensitive joystick,\" Radio &amp; Electronics World, Feb. 1985, p. 23-26.",
      "doi": ""
    },
    {
      "text": "Ruspini, D., Kolarov, K., Khatib, O., \"q~e Haptic Display of Complex Graphical Environments,\" SIGGRAPH'97,345-352.  ",
      "doi": "10.1145/258734.258878"
    },
    {
      "text": "Sinclair, M., \"The Haptic Lens,\" SIGRRAPH'97 Visual Proceedings, p. 179.  ",
      "doi": "10.1145/259081.259266"
    },
    {
      "text": "Smith, J.R., White, T., Dodge, C., Allport, D., Paradiso, J., Gershenfeld, N., \"Electric Field Sensing for Graphical Interfaces,\" IEEE Computer Graphics and Applications, May, 1998.  ",
      "doi": "10.1109/38.674972"
    },
    {
      "text": "Zhai, S., Smith, B.A., Selker, T., \"Improving Browsing Performance\" A study of four input devices for scrolling and pointing tasks,\" Proc. Interact '97: The 6th IFIP Conf. on HCI, 286-92. ",
      "doi": "10.5555/647403.723823"
    },
    {
      "text": "Zimmerman, T., Smith, J, Paradiso, J., Allport, D., Gershenfeld, N., \"Applying Electric Field Sensing to Human-Computer Interfaces,\" CHI'95,280-287.  ",
      "doi": "10.1145/223904.223940"
    }
  ]
}