{
  "doi": "10.1145/302979.303003",
  "title": "A better mythology for system design",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "88-95",
  "year": 1999,
  "badges": [],
  "abstract": "The past decades have seen huge improvements in computer systems\nbut these have proved difficult to translate into comparable\nimprovements in the usability and social integration of computers.\nWe believe that the problem is a deeply rooted set of assumptions\nabout how computer systems should be designed, and about who should\nbe doing that design.\nHuman organizations are continually evolving to meet changing\ncircumstances of resource and need. In contrast, computers are\nquite rigid, incapable of adaptation on their own. Therefore when\ncomputer systems are incorporated into human organizations, those\norganizations must adapt the computers to changing circumstances.\nThis adaptation is another human activity that technology should\nsupport, but our design philosophies are oddly silent about it.\nThis paper explores the origins of these problems in the norms\ndeveloped for managing human organizations, proposes partial\nsolutions that can be implemented with current systems technology,\nand speculates about the long-term potential for radical\nimprovements in system design.",
  "authors": [
    {
      "name": "Jed Harris",
      "institution": "Pliant Research, 978 Cragmont Ave., Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100117046",
      "orcid": "missing"
    },
    {
      "name": "Austin Henderson",
      "institution": "Pliant Research, PO Box 334, La Honda, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100433710",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexander, C. The Timeless Way of Building, Oxford University Press, New York, 1979.",
      "doi": ""
    },
    {
      "text": "Flowers, S. Software Failure: Management Failure: Amazing Stories and Cautionary Tales, John Wiley &amp; Sons, 1996. ",
      "doi": "10.5555/261187"
    },
    {
      "text": "Bowers, J., Button, G. and Sharrock, W. Workflow from Within and Without: Technology and Cooperative Work on the Print Industry Shopfloor, in Proceedings ECSCW'95, (Stockholm, Sweden), European Foundation for Cooperative Work Technology, 1995 ",
      "doi": "10.5555/1241958.1241962"
    },
    {
      "text": "Button, G. and Sharrock, W. The production of Order and the Order of Production, in Proceedings ECSCW'97, (Lancaster, UK), European Foundation for Cooperative Work Technology, 1997 ",
      "doi": "10.5555/1241980.1241981"
    },
    {
      "text": "Fikes, R.E. and Henderson, D. A. Jr. On Supporting the Use of Procedures in Office Work, in Proceedings of the First Annual National Conference on Artificial Intelligence, American.Association of Artificial Intelligence, Menlo Park, CA, 1990.",
      "doi": ""
    },
    {
      "text": "Suchman, L. Plans and Situated Action: The Problem of Human-Machine Communication, Cambridge University Press, Cambridge, 1987. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Yates, J. Control Through Communication: The Rise of System in American Management, The Johns Hopkins University Press, Baltimore, 1989; pp. xvi-xvii.",
      "doi": ""
    },
    {
      "text": "Yates, J. Op cit. pp. 68, 72.",
      "doi": ""
    },
    {
      "text": "Zimmerman, D. H. and Wieder, D. L. Ethnomethodology and the problem of order: Comment on Denzin. In J. D. Douglas (ed.), Understanding Everyday Life: Toward the Reconstruction of Sociological Knowledge (pp. 285-298) Chicago, Aldine, 1970. Cited in Suchman, L. and Trigg, R. Artificial intelligence as craftwork In Chaiklin, S. and Lave, J. Understanding practice: Perspectives on activity and context Cambridge University Press, 1993.",
      "doi": ""
    }
  ]
}