{
  "doi": "10.1145/302979.303127",
  "title": "Getting more out of programming-by-demonstration",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "442-449",
  "year": 1999,
  "badges": [],
  "abstract": "Programming-by-demonstration (PBD) can be used to create tools\nand methods that eliminate the need to learn difficult computer\nlanguages. Gamut is a PBD tool that nonprogrammers can use to\ncreate a broader range of interactive software, including games,\nsimulations, and educational software, than they can with other PBD\ntools. To do this, Gamut provides advanced interaction techniques\nthat make it easier for a developer to express all aspects of an\napplication. These techniques include a simplified way to\ndemonstrate new examples, called nudges, and a way to highlight\nobjects to show they are important. Also, Gamut includes new\nobjects and metaphors like the deck-of-cards metaphor for\ndemonstrating collections of objects and randomness, guide objects\nfor demonstrating relationships that the system would find too\ndifficult to guess, and temporal ghosts which simplify showing\nrelationships with the recent past. These techniques were tested in\na formal setting with nonprogrammers to evaluate their\neffectiveness.",
  "tags": [
    "inductive learning",
    "user interface software",
    "programming-by-example",
    "programming-by-demonstration",
    "application builders",
    "Gamut",
    "end-user programming"
  ],
  "authors": [
    {
      "name": "Richard G. McDaniel",
      "institution": "HCI Institute, School of Computer Science, Carnegie Mellon University, 5000 Forbes Avenue, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100363649",
      "orcid": "missing"
    },
    {
      "name": "Brad A. Myers",
      "institution": "HCI Institute, School of Computer Science, Carnegie Mellon University, 5000 Forbes Avenue, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100013136/rel-imgonly/brad-myers-120x120.jpg",
      "acmid": "81100013136",
      "orcid": "0000-0002-4769-0219"
    }
  ],
  "references": [
    {
      "text": "Authorware. Authorware Inc. 8400 Normandale Lake Blvd., Suite 430, Minneapolis MN 55437, 612-912-8555, 1991.",
      "doi": ""
    },
    {
      "text": "B. Budge. Pinball Construction Set. Exidy Software.",
      "doi": ""
    },
    {
      "text": "Corel Click &amp; Create. Corel Corporation and Europress Software Ltd. 1996.",
      "doi": ""
    },
    {
      "text": "G.L. Fisher, D. E. Busse, D. A. Wolber. \"Adding Rule-Based Reasoning to a Demonstrational Interface Builder\" Proceedings of UIST'92, pp 89-97.  ",
      "doi": "10.1145/142621.142632"
    },
    {
      "text": "M. Frank. Model-Based User interface Design by Demonstration and by Interview. Ph.D. thesis. Graphics, Visualization &amp; Usability Center, Georgia Institute of Technology, Atlanta, Georgia. ",
      "doi": "10.5555/238513"
    },
    {
      "text": "L. Grimm, D. Caswell, and L. Kirkpatrick. Playroom. Broderbund Software, 500 Redwood Blvd., Novato, CA 94948-6121, 1992.",
      "doi": ""
    },
    {
      "text": "HyperCard. Apple Computer Inc., Cupertino, CA, 1993.",
      "doi": ""
    },
    {
      "text": "Macromedia, Director, 600 Townsend Street, San Francisco, CA 94103, macropr@macromedia.com, http://www.macromedia.com/, 1996.",
      "doi": ""
    },
    {
      "text": "D. Maulsby, I. Witten. \"Inducing Procedures in a Direct- Manipulation Environment.\" Proceedings SIGCHI'89, April, 1989. pp. 57-62.  ",
      "doi": "10.1145/67449.67463"
    },
    {
      "text": "D. Maulsby. Instructible Agents. Ph.D. thesis. Department of Computer Science, Univ. of Calgary, Calgary, Alberta, June 1994. ",
      "doi": "10.5555/239000"
    },
    {
      "text": "R.G. McDaniel, B.A. Myers. \"Building Applications Using Only Demonstration.\" Proceedings oflUl'98, pp 109-116.  ",
      "doi": "10.1145/268389.268409"
    },
    {
      "text": "B. A. Myers et al. \"The Amulet Environment: New Models for Effective User Interface Software Development.\" IEEE Transactions on Software Engineering, Vol. 23, no. 6. June 1997. pp. 347-365.  ",
      "doi": "10.1109/32.601073"
    },
    {
      "text": "B. A. Myers, D. S. Kosbie. \"Reusable Hierarchical Command Objects.\" Human Factors in Computing Systems, Proceedings SIGCHI'96, Denver, CO, April, 1996, pp 260-267.  ",
      "doi": "10.1145/238386.238526"
    },
    {
      "text": "B. A. Myers, R. G. McDanieI, and D. S. Kosbie. \"Marquise: Creating Complete User Interfaces by Demonstration\" Proceedings of lNTERCHI'93: Human Factors i'n Computing Systems, 1993, pp 293-300.  ",
      "doi": "10.1145/169059.169225"
    },
    {
      "text": "J. R. Quinlan. \"Induction of Decision Trees?' Machine Learning, Kluwer Academic Publishers, Boston, Vol. 1, 1986, pp 81- 106.  ",
      "doi": "10.1023/A%3A1022643204877"
    },
    {
      "text": "Reader Rabbit. The Learning Company, 1987.",
      "doi": ""
    },
    {
      "text": "M. Rettig. \"Prototyping for tiny fingers.\" Communications of the ACM 37, 4 (April 1994). pp. 21-27.  ",
      "doi": "10.1145/175276.175288"
    },
    {
      "text": "K. VanLehn. \"Learning One Subprocedure per Lesson.\" Artificial Intelligence, Vol. 31, 1987, pp 1-40.  ",
      "doi": "10.1016/0004-3702%2887%2990080-4"
    },
    {
      "text": "D. Wolber. \"Pavlov: Programming By Stimulus-Response Demonstration.\" Human Factors in Computing Systems, Proceedings SIGCHI'96, Denver, CO, April, 1996, pp 252-259  ",
      "doi": "10.1145/238386.238522"
    }
  ]
}