{
  "doi": "10.1145/302979.303047",
  "title": "The Hotbox: efficient access to a large number of menu-items",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "231-237",
  "year": 1999,
  "badges": [],
  "abstract": "The proliferation of multiple toolbars and UI widgets\naround the perimeter of application windows is an indication that\nthe traditional GUI design of a single menubar is not\nsufficient to support large scale applications with numerous\nfunctions. In this paper we describe a new widget which is an\nenhancement of the traditional menubar which dramatically\nincreases menu-item capacity. This widget, called the Hotbox\ncombines several GUI techniques which are generally used\nindependently: accelerator keys, modal dialogs, pop-up/pull down\nmenus, radial menus, marking menus and menubars. These techniques\nare fitted together to create a single, easy to learn yet fast to\noperate GUI widget which can handle significantly more\nmenu-items than the traditional GUI menubar. We\ndescribe the design rationale of the Hotbox and its effectiveness\nin a large scale commercial application. While the Hotbox was\ndeveloped for a particular application domain, the widget itself\nand the design rationale are potentially useful in other\ndomains.",
  "authors": [
    {
      "name": "Gordon Kurtenbach",
      "institution": "Alias I Wavefront, 210 King Street East, Toronto, Ontario, Canada M5A 1J7",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332510496",
      "orcid": "missing"
    },
    {
      "name": "George W. Fitzmaurice",
      "institution": "Alias I Wavefront, 210 King Street East, Toronto, Ontario, Canada M5A 1J7",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502661254",
      "orcid": "0000-0002-2834-7757"
    },
    {
      "name": "Russell N. Owen",
      "institution": "Alias I Wavefront, 210 King Street East, Toronto, Ontario, Canada M5A 1J7",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332519934",
      "orcid": "missing"
    },
    {
      "name": "Thomas Baudel",
      "institution": "Ilog and Alias I Wavefront, 210 King Street East, Toronto, Ontario, Canada M5A 1J7",
      "img": "/do/10.1145/contrib-81100483880/rel-imgonly/tbaudel.jpg",
      "acmid": "81100483880",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bier, E., A.,Stone, M., C., Fishkin, K., Buxton, W., Baudel, T., (1994) A Taxonomy of See-Through Tools. Proceedings of the ACM CHI'94 Conference on Human Factors in Computing Systems, 358-364.  ",
      "doi": "10.1145/191666.191786"
    },
    {
      "text": "Brooks, P. (1994). Adding Value to Usability Testing. in Usability Inspection Methods, Nielsen, J. &amp; Mack R. (Eds). John Wiley. 255-271. see p. 262. ",
      "doi": "10.5555/189200.189227"
    },
    {
      "text": "Carroll, J., M., &amp; Carrithers, C. (1994) Training Wheels in a User Interface. Communications of ACM, 27, 800-806.  ",
      "doi": "10.1145/358198.358218"
    },
    {
      "text": "Harrison, B. &amp; Vicente, K. (1996) An Experimental Evaluation of Transparent Menu Usage.Proceedings of the ACM CHI'96 Conference on Human Factors in Computing Systems, 391-398. Gould, John (1988). How to Design Usable Systems. in Handbook on Human-Computer Interaction, M. Helander (Editor), North-Holland. Elsevier. 1988. pp. 757-789. Reprinted In Readings in Human Computer- Interaction: Towards The Year 2000. Baecker, R., Gru-  ",
      "doi": "10.1145/238386.238583"
    },
    {
      "text": "din, J. Buxton, W. &amp; Greenberg, S. (Eds), Morgan Kaufmann, 1995.93-121. see p. 113.",
      "doi": ""
    },
    {
      "text": "Jeffries, R. (1994). Usability Problems Reports: Helping Evaluators Communicate Effectively with Developers, in Usability Inspection Methods, Nielsen, J. &amp; Mack R. (Eds). John Wiley. 273-294. see p. 278. ",
      "doi": "10.5555/189200.189228"
    },
    {
      "text": "Kiger, J.L. (1984) The Depth/Breadth Tradeoff in the Design of Menu Driven User Interfaces. International Journal of Man Machine Studies, 20, 210-213.  ",
      "doi": "10.1016/S0020-7373%2884%2980018-8"
    },
    {
      "text": "Kurtenbach, G., Buxton, W. (1993) The limits of expert performance using hierarchical marking menus. Proceedings of CHI '93 Conference on Human Factor in Computing, 482-487.  ",
      "doi": "10.1145/169059.169426"
    },
    {
      "text": "Kurtenbach, G., Fitzmaurice, G., Baudel, T. &amp; Buxton, B. (1997) The Design of a GUI Paradigm based on Tablets, Two-hands, and Transparency. Proceedings of the A CM CHI'97 Conference on Human Factors in Computing Systems, 35-42.  ",
      "doi": "10.1145/258549.258574"
    },
    {
      "text": "Landauer, T.K. &amp; Nachbar, D.W. (1985) Selection from Alphabetic and Numeric Trees Using a Touch Screen: Breadth, Depth and Width. Proceedings of the ACM CHI'85 Conference on Human Factors in Computing Systems, 73-78.  ",
      "doi": "10.1145/317456.317470"
    },
    {
      "text": "Lewis, C. &amp; Rieman, j. (1993). Getting to Know Users and Their Tasks. in Task Centered User Interface Design, a practical introduction. Reprinted In Readings in Human Computer-Interaction: Towards The Year 2000. Baecker, R., Grudin, J. Buxton, W. &amp; Greenberg, S. (Eds), Morgan Kaufmann, 1995. 122- 127. see p. 124, col. 2. ",
      "doi": "10.5555/212925.212936"
    },
    {
      "text": "Mackenzie, I.S., &amp; Buxton, W. (1992) Extending Fitts' Law To Two-dimensional Tasks. Proceedings Of Acm Chi '92 Conference On Human Factors In Computing Systems, 219-226.  ",
      "doi": "10.1145/142750.142794"
    },
    {
      "text": "Sears, A. &amp; Shneiderman, B. (1994) Split menus: Effectively using selection frequency to organize menus. ACM Transactions on Computer-Human Interaction, vol. 1, #1 (March 1994), 27-51. also available online at ftp://ftp.cs.umd.edu/publpaperslpapers12997/ 2997.ps.Z.  ",
      "doi": "10.1145/174630.174632"
    },
    {
      "text": "http://www.aw.sgi.com, Maya product brochure",
      "doi": ""
    }
  ]
}