{
  "doi": "10.1145/302979.303064",
  "title": "Single display groupware: a model for co-present collaboration",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "286-293",
  "year": 1999,
  "badges": [],
  "abstract": "We introduce a model for supporting collaborative work between\npeople that are physically close to each other. We call this model\nSingle Display Groupware (SDG). In this paper, we describe the\nmodel, comparing it to more traditional remote collaboration, We\ndescribe the requirements that SDG places on computer technology,\nand our understanding of the benefits and costs of SDG systems.\nFinally, we describe a prototype SDG system that we built and the\nresults of a usability test we ran with 60 elementary school\nchildren.",
  "authors": [
    {
      "name": "Jason Stewart",
      "institution": "Computer Science Dept., University of New Mexico, Albuquerque, NM",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332529758",
      "orcid": "missing"
    },
    {
      "name": "Benjamin B. Bederson",
      "institution": "Computer Science Dept./UMIACS, Human-Computer Interaction Lab, University of Maryland, College Park, MD",
      "img": "/do/10.1145/contrib-81100083927/rel-imgonly/bederson.jpg",
      "acmid": "81100083927",
      "orcid": "missing"
    },
    {
      "name": "Allison Druin",
      "institution": "Computer Science Dept./UMIACS, Human-Computer Interaction Lab, University of Maryland, College Park, MD",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100365303",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bedcrson, B. B., Hollan, J. D., Druin, A., Stewart, J., Rogers, D., &amp; Profl, D. (1996). Local Tools: An Alternative to Tool Palettes. In Proceedings of User Interface and Software Technology (LIST 96) ACM Press, pp. 169-170.  ",
      "doi": "10.1145/237091.237116"
    },
    {
      "text": "Bederson, B. B., Hollan, L D., Perlin, K., Meyer, L, Bacon, D., &amp; Fumas, G. (1996). Pad++: A Zoomabl~ Graphical Sketchpad for Exploring Alternate Interface Physics. Journal of Visual Languages and Computing, 7, 3-31.",
      "doi": ""
    },
    {
      "text": "Bier, E. A., &amp; Freeman, S. (1991). MM: A User Interface Architecture for Shared Editors on a Single Screen. In Proceedings of User Interface and Software Technology (UIST 91) ACM Press, pp. 79-86.  ",
      "doi": "10.1145/120782.120791"
    },
    {
      "text": "Bricker, L. J. (1998). Collaboratively Controlled Objects in Support of Collaboration. Doctoral dissertation, University of Washington, Seattle, Washington. ",
      "doi": "10.5555/926969"
    },
    {
      "text": "Buxton, W. (1994). The Three Mirrors of Interaction: A Holistic Approach to User Interfaces. L. MacDonald, &amp; J. Vince (eds.), Interacting With Virtual Environments. New York: Wiley.",
      "doi": ""
    },
    {
      "text": "Cockburn, A., &amp; Greenberg, S. (1996). Children's Collaboration Styles in a Newtonian Microworld. In Proceedings of Extended Abstracts of Human Factors in Computing Systems (CHI 96) ACM Press, pp. 181- 182.  ",
      "doi": "10.1145/257089.257247"
    },
    {
      "text": "Druin, A., Stewart, J., ProtL D., Bederson, B. B., &amp; Hollan, J. D. (1997). KidPad: A Design Collaboration Between Children, Technologists, and Educators. In Proceedings of Human Factors in Computing Systems (CH197) ACM Press, pp. 463-470.  ",
      "doi": "10.1145/258549.258866"
    },
    {
      "text": "Greenberg, S., &amp; Boyle, M. (1998). Moving between personal devices and public displays. Tech Report 98/630/21, Department of Computer Science, University of Calgary, Calgary, Canada.",
      "doi": ""
    },
    {
      "text": "Hall, E. (1968). The Hidden Dimension. Anchor.",
      "doi": ""
    },
    {
      "text": "Inkpen, K., Booth, K. S., Klawe, M., &amp; McGrenere, J. (1997). The Effect of Turn-Taking Protocols on Children's Learning in Mouse-Driven Collaborative Environments. In Proceedings of Graphics Interface (G1 97) Canadian Information Processing Society, pp. 138-145. ",
      "doi": "10.5555/266774.266793"
    },
    {
      "text": "Ishii, H., &amp; UUmer, B. (1997). Tangible Bits: Towards Seamless Interfaces Between People, Bits and Atoms. In Proceedings of Human Factors in Computing Systems (CH197) ACM Press, pp. 234-241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Johnson, D. W., &amp; Johnson, R. T. (1991). Learning Together andAlone, 3rd Edition. Prentice Hall.",
      "doi": ""
    },
    {
      "text": "Krueger, M. (1991). Artificial Reality 11. Addison- Wesley.",
      "doi": ""
    },
    {
      "text": "McGrath, J. E., &amp; HoUingshead, A. B. (1994). Groups Interacting With Technology. Sage. ",
      "doi": "10.5555/562223"
    },
    {
      "text": "Myers, B. A., Stiel, H., &amp; Gargiulo, R. (In Press). Collaboration Using Multiple PDAs Connected to a PC. In Proceedings of Computer Supported Collaborative Work (CSCW 98) ACM Press,  ",
      "doi": "10.1145/289444.289503"
    },
    {
      "text": "Pappert, S. (1996). The Connected Family.\" Bridging the Digital Generation Gap. Longstreet Press.",
      "doi": ""
    },
    {
      "text": "Pedersen, E. R., McCall, K., Moran, T. P., &amp; Halasz, F. G. (1993). Tivoli: An Electronic Whiteboard for Informal Workgroup Meetings. In Proceedings of Human Factors m Compul~ng Systems (lnterCH1 93) ACM Press, pp. 391-398.  ",
      "doi": "10.1145/169059.169309"
    },
    {
      "text": "Rekimoto, J. (1998). A Multiple Device Approach for Supporting Whiteboard-Based Interactions. In Proceedings of Human Factors in Computing Systems (CH198) ACM Press, pp. 344-351.  ",
      "doi": "10.1145/274644.274692"
    },
    {
      "text": "Shu, L., &amp; Flowers, W. (1992). Groupware Experiences in Three-Dimensional Computer-Aided Design. in Proceedings of Computer Supported Collaborative Work (CSCW 92) ACM Press, pp. 179- 186.  ",
      "doi": "10.1145/143457.143477"
    },
    {
      "text": "Smith, R. B., O'Shea, T., O'MaUey, C., Scanlon, E., &amp; Taylor, J. (1989). Preliminary Experiments With a Distributed, Multi-Media, Problem Solving Environment. In Proceedings of First European Conference on Computer Supported Cooperative Work Slough, UK: Computer Sciences House, pp. 19-34. ",
      "doi": "10.5555/646218.682020"
    },
    {
      "text": "Stewart, J. (In Press). Single Display Groupware. Doctoral dissertation, University of New Mexico, Albuquerque, NM. ",
      "doi": "10.5555/929103"
    },
    {
      "text": "Stewart, J., Raybourp, E., Bederson, B. B., &amp; Druin, A. (1998). When Two Hands Are Better Than One: Enhancing Collaboration Using Single Display Groupware. In Proceedings of Extended Abstracts of Human Factors in Computing Systems (CH1 98) ACM Press, pp. 28%288.  ",
      "doi": "10.1145/286498.286766"
    }
  ]
}