{
  "doi": "10.1145/302979.302980",
  "title": "An empirical study of how people establish interaction: implications for CSCW session management models",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 1999,
  "badges": [],
  "abstract": "In this paper, we report the results of an empirical study of\nhow people, as part of their daily work activities, go about to\nestablish collaboration. We examine the empirical findings and\nrelate them to existing research on CSCW session management models,\ni.e., the mechanisms in CSCW systems that define the way in which\npeople can join together in collaboration. Existing models leave a\nlot to be desired, in particular because they tend to assume that\nindexical elements of interaction management are substitutable by\nobjective representation of artifacts. Based on the empirical\nfindings, we derive three principles to consider in the design of\nCSCW session management models.",
  "tags": [
    "field study",
    "session management",
    "design implications",
    "ethnography"
  ],
  "authors": [
    {
      "name": "Steinar Kristoffersen",
      "institution": "Norwegian Computing Center, Postboks 114 Blindern, N-0314 Oslo, Norway",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100263573",
      "orcid": "missing"
    },
    {
      "name": "Fredrik Ljungberg",
      "institution": "Viktoria Institute, Box 620, 405 30 Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100361953",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sproull, L. and Kiesler, S. Connections. New ways of working in the networked organization, MIT Press, Cambridge MA, 1993. ",
      "doi": "10.5555/117640"
    },
    {
      "text": "Patterson, J.F., Hill, R.D., Rohall, S.L., Meeks, W.S. Rendezvous: An architecture for synchronous multi-user applications, in Proceedings of CSCW'90 (Los Angeles CA, October 1990), ACM Press, 317-328.  ",
      "doi": "10.1145/99332.99364"
    },
    {
      "text": "Edwards, W.K. Session Management for collaborative applications, in Proceedings of CSCW'94 (Chapel Hill NC, November 1994), ACM Press, 323-330.  ",
      "doi": "10.1145/192844.193038"
    },
    {
      "text": "Isaacs, E., Tang, J., and Morris, T. Piazza: A desktop environment supporting impromptu and planned interactions, in Proceedings of CSCW'96 (Boston MA, November 1996), ACM Press, 315- 324.  ",
      "doi": "10.1145/240080.240316"
    },
    {
      "text": "Roseman, M. and Greenberg, S. TeamRooms: Network places for collaboration, in Proceedings of CSCW'96 (Boston MA, November 1996), ACM Press, 325-333.  ",
      "doi": "10.1145/240080.240319"
    },
    {
      "text": "Nakanishi, H., Yoshida, C., Nishimura, T. Ishida, T. FreeWalk: Supporting causal meetings in a network, in Proceedings of CSCW'96 (Boston MA, November 1996), ACM Press, 308-314.  ",
      "doi": "10.1145/240080.240314"
    },
    {
      "text": "Fish, R.S., Kraut, R.E., and Chalfonte, B.L. The VideoWindow system in informal communications, in Proceedings of CSCW'90 (Los Angeles CA, October 1990), ACM Press, 1- 11.  ",
      "doi": "10.1145/99332.99335"
    },
    {
      "text": "Boden, D. The business of talk. Organizations in action, Polity Press, Cambridge, 1994.",
      "doi": ""
    },
    {
      "text": "Hopper, R. Hold the phone, in Talk and social structure, edited by Boden, D. and Zimmerman, D.H., The University of California Press, Los Angeles CA, 217-231,1991.",
      "doi": ""
    },
    {
      "text": "Button, G. and Sharrock, W. The production of order and the order of production. The possibilities for distributed organisations, work and technology in the print industry, in Proceedilzgs of ECSCW'97 (Lancaster UK, September 1997), Kluwer Academic Publishers, 1-16. ",
      "doi": "10.5555/1241980.1241981"
    },
    {
      "text": "Button, G. and Dourish, P. Technomethodology: Paradoxes and possibilities, in Proceedings of CHI'96 (Vancouver Canada, April 1996), ACM Press.  ",
      "doi": "10.1145/238386.238394"
    },
    {
      "text": "Patton, M.Q. Qualitative Evaluation and Research Methods. Sage, New York, 1990.",
      "doi": ""
    },
    {
      "text": "Garfinkel, H. Studies in ethnomethodolgy, Prentice Hall, Englewood Cliffs, 1967.",
      "doi": ""
    },
    {
      "text": "Kristoffersen, S., Developing collaborative multimedia. The Mediate toolkit, Ph.D. thesis. Computing Department, Lancaster University, UK, 1997.",
      "doi": ""
    },
    {
      "text": "Tang, J.C. and Rua, M. Montage: Providing Teleproximity for Distributed Groups, in Proceedings of CHI'94 (Boston MA, April 24- 28), ACM Press, 37-43.  ",
      "doi": "10.1145/191666.191688"
    },
    {
      "text": "Buxton, B. Scientific director's report: Living in augmented reality, in Ontario telepresence project. Final report, edited by Chattoe, J., Leach, P., and Riesenbach, R. Information Technology Research Centre, Telecommunications Research Institute of Ontario, 19-34, 1995.",
      "doi": ""
    },
    {
      "text": "Bentley, R., Hughes, J. A., Randall, D., Rodden, T., Sawyer, P., Shapiro, D., and Sommerville, I. Ethnographically-informed systems design for air traffic control, In Proceedings CSCW'92 (Toronto Canada, October-November 1992), ACM Press, 123-129.  ",
      "doi": "10.1145/143457.143470"
    },
    {
      "text": "Whittaker, S., Frohlich, D., and Daly-Jones, O. Informal workplace communication: What is it like and how might we support it?, in Proceedings of CHI'94 (Boston MA, April 24-28), ACM Press, 131-137.  ",
      "doi": "10.1145/191666.191726"
    }
  ]
}