{
  "doi": "10.1145/302979.302984",
  "title": "Non-keyboard QWERTY touch typing: a portable input interface for the mobile user",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "32-39",
  "year": 1999,
  "badges": [],
  "abstract": "Using traditional mobile input devices results in decreased\neffectiveness and efficiency. To improve usability issues a\nportable Non-Keyboard QWERTY touch-typing paradigm that supports\nthe mobile touch-typing user is presented and investigated. It\nrequires negligible training time. Pressure sensors strapped to the\nfingertips of gloves detect which finger is depressed. A language\nmodel based on lexical and syntactic knowledge transforms the\ndepressed finger stroke sequence into real words and sentences.\nDifferent mobile input QWERTY paradigms (miniaturised, floating and\nNon-Keyboard) have been compared with full-size QWERTY. Among the\nmobile input paradigms, the Non-Keyboard fared significantly\nbetter, both regarding character error rate and subjective\nratings.",
  "tags": [
    "Wizard-of-Oz",
    "portability",
    "PDA",
    "stylus input",
    "lexical knowledge",
    "mobile user",
    "touch-typing",
    "keyboard",
    "QWERTY",
    "syntactic knowledge",
    "language model",
    "text input"
  ],
  "authors": [
    {
      "name": "Mikael Goldstein",
      "institution": "Ericsson Radio Systems AB, Applications Research ERA/T/K, Torshamnsgatan 23, Kista, SE-164 80 Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100321827",
      "orcid": "missing"
    },
    {
      "name": "Robert Book",
      "institution": "Logica Svenska AB, Applications Research ERA/T/K, Torshamnsgatan 23, Kista, SE-164 80 Stockholm, Sweden and Ericsson Radio Systems AB, Applications Research ERA/T/K, Torshamnsgatan 23, Kista, SE-164 80 Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100076340",
      "orcid": "missing"
    },
    {
      "name": "Gunilla Alsiö",
      "institution": "Ericsson Radio Systems AB, Applications Research ERA/T/K, Torshamnsgatan 23, Kista, SE-164 80 Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100415637",
      "orcid": "missing"
    },
    {
      "name": "Silvia Tessa",
      "institution": "Ericsson Radio Systems AB, Applications Research ERA/T/K, Torshamnsgatan 23, Kista, SE-164 80 Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332531283",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ben'Ary, R. Touch typing in ten lessons, Perigee Books, New York: Berkley Publishing Group, 1989.",
      "doi": ""
    },
    {
      "text": "Beyers, J.C., Bittner, Jr, A. and Hills, S.G. Traditional and raw task load index (TLX) correlations: are paired comparisons necessary? Advances in Industrial Ergonomics and Safety I. London: Taylor and Francis, 1989.",
      "doi": ""
    },
    {
      "text": "Eriksson, K. Approximate Swedish name matchingsurvey and test of different algorithms, Report TRITA- NA-E972, Royal Institute of Technology, NADA, Stockholm, 1997. Available at http://www.nada.kth.se/ theory/projects/swedish.html",
      "doi": ""
    },
    {
      "text": "Fukumoto, M. and Tonomura, Y. \"Body Coupled FingeRing\": Wireless Wearable Keyboard, in Proceedings of CHI'97 (Denver CO, May 1997) ACM Press, 147-154.  ",
      "doi": "10.1145/258549.258636"
    },
    {
      "text": "Goldstein, M., Book, R., Alsi6, G. and Tessa, S. Ubiquitous input for wearable computing: QWERTY keyboard without a board. In Proceedings of the first workshop on Human Computer Interaction for Mobile Devices (ed. Chris Johnson) (GIST Technical Report G98-1, Department of Computing Science, University of Glasgow, Scotland) 21-23 May 1998, 18-25.",
      "doi": ""
    },
    {
      "text": "Hart, S.G. and Staveland, L.E. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research, in P.A. Hancock and N. Meshkati (Eds.) Human Mental Workload, (pp. 139- 137), (Elsevier Science Publishers B.V., 1988), North- Holland.",
      "doi": ""
    },
    {
      "text": "Lewis, J.R., Potosnak, K.M. and Magyar, R.L. Keys and Keyboards, in M. Helander, T.K. Landauer, and P.V. Prabhu (Eds.), Handbook of Human-Computer interaction: (pp. 1285-1315) Second Edition, North- Holland.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S., Soukoreff, R. W. and Zhang, S. (1997), Text entry using soft keyboards, Available at http://www.cis.uoguelph.ca/-mac/BIT3.html",
      "doi": ""
    },
    {
      "text": "Mitton, R., A computer usable dictionary file based on the Oxford Advanced Learner's Dictionary of Current English~ Department of Computer Science, B irkBeck College, University of London. Available at ftp://ota, o x.ac. ul/pu b/ota/dicts/",
      "doi": ""
    },
    {
      "text": "Norman, D.E. Memory andAttention-An Introduction to Human Information Processing, New York: John Wiley &amp; Sons, 1969.",
      "doi": ""
    },
    {
      "text": "Numazaki, S., Morishita, A., Umeki, N., Ishikawa, M. and Doi, M. A Kinetic and 3D Image Input Device, in Proceedings of CHI '98 Summary (Los Angeles, April 1998), ACM Press, 239-241.  ",
      "doi": "10.1145/286498.286723"
    },
    {
      "text": "Pollock, J.J, and Zamora, A. Automatic Spelling Correction in Scientific and Scholary Text, Communications of the AMC, 27, 4 (April 1984), 363.  ",
      "doi": "10.1145/358027.358048"
    },
    {
      "text": "Rosenberg, R. Computing without Mice and Keyboards: Text and Graphic input Devices for Mobile Computing, Doctoral dissertation, (Department of Computer Science, University College, London 1998).",
      "doi": ""
    },
    {
      "text": "Sears, A., Revis, D., S watski, J., Crittenden, R. and Shneiderman, B. Investigating Touchscreen Typing: The Effect of Keyboard Size on TypingSpeed. Behaviour and Information Technology 12, 1 (1993), 17-22.",
      "doi": ""
    },
    {
      "text": "Suereth, R. Developing Natural Language Interfaces- Processing human conversations. New York: McGraw-Hill, 1997. ",
      "doi": "10.5555/541221"
    },
    {
      "text": "Wickens, C.D. Engineering Psychology and Human Performance, Second Edition. New York: Harper- Collins Publishers, 1992.",
      "doi": ""
    }
  ]
}