{
  "doi": "10.1145/302979.303017",
  "title": "Time-compression: systems concerns, usage, and benefits",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "136-143",
  "year": 1999,
  "badges": [],
  "abstract": "With the proliferation of online multimedia content and the\npopularity of multimedia streaming systems, it is increasingly\nuseful to be able to skim and browse multimedia quickly. A key\ntechnique that enables quick browsing of multimedia is\ntime-compression. Prior research has described how speech can be\ntime-compressed (shortened in duration) while preserving the pitch\nof the audio. However, client-server systems providing this\nfunctionality have not been available.\nIn this paper, we first describe the key tradeoffs faced by\ndesigners of streaming multimedia systems deploying\ntime-compression. The implementation tradeoffs primarily impact the\ngranularity of time-compression supported (discrete vs. continuous)\nand the latency (wait-time) experienced by users after adjusting\ndegree of time-compression. We report results of user studies\nshowing impact of these factors on the average- compression-rate\nachieved. We also present data on the usage patterns and benefits\nof time compression. Overall, we show significant time-savings for\nusers and that considerable flexibility is available to the\ndesigners of client-server streaming systems with time\ncompression.",
  "authors": [
    {
      "name": "Nosa Omoigui",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100069610",
      "orcid": "missing"
    },
    {
      "name": "Liwei He",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81451600003",
      "orcid": "missing"
    },
    {
      "name": "Anoop Gupta",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452611908",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Grudin",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100031531/rel-imgonly/jonathan_grudin.jpg",
      "acmid": "81100031531",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth Sanocki",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100086410",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arons, B. \"Techniques, Perception, and Applications of Time- Compressed Speech.\" In Proceedings of 1992 Conference, American Voice I/O Society, Sep. 1992, pp. 169-177.",
      "doi": ""
    },
    {
      "text": "Arons, B. \"SpeechSkimmer: A System for Interactively Skimming Recorded Speech.\" A CM Transactions on Computer Human Interaction, 4, 1, 1997, 3-38.  ",
      "doi": "10.1145/244754.244758"
    },
    {
      "text": "Beasley, D.S. &amp; Maki, J.E. \"Time- and Frequency-Altered Speech.\" In N.J. Lass (Ed.), Contemporary Issues in Experimental Phonetics, 419-458. NY: Academic Press, 1976.",
      "doi": ""
    },
    {
      "text": "Degen, L., Mander, R., &amp; Salomon, G. \"Working with Audio: Integrating Personal Tape recorders and Desktop Computers.\" Proc. CHI '92, ACM, Apr. 1992, pp. 413-418.  ",
      "doi": "10.1145/142750.142877"
    },
    {
      "text": "Fairbanks, G., Everitt, W.L., &amp; Jaeger, R.P. \"Method for Time or Frequency Compression-Expansion of Speech.\" Transactions of the Institute of Radio Engineers, Professional Group on Audio A U-2 (1954): 7-12. Reprinted in G. Fairbanks, Experimental Phonetics: Selected Articles, University of Illinois Press, 1966.",
      "doi": ""
    },
    {
      "text": "Foulke, W. &amp; Sticht, T.G. \"Review of research on the intelligibility and comprehension of accelerated speech.\" Psychological Bulletin, 72: 50-62, 1969.",
      "doi": ""
    },
    {
      "text": "Garvey, W.D. \"The intelligibility of abbreviated speech patterns.\" Quarterly Journal of Speech, 39: 296-306, 1953. Reprinted in J. S. Lim (Ed.) Speech Enhancement, Prentice-Hall, Inc., 1983.",
      "doi": ""
    },
    {
      "text": "Garvey, W.D. \"The intelligibility of speeded speech.\" Journal of Experimental Psychology, 45:102-108, 1953.",
      "doi": ""
    },
    {
      "text": "Gerber, S.E. \"Limits of speech time compression.\" In S. Duker (Ed.), Time-Compressed Speech, 456-465. Scarecrow, 1974.",
      "doi": ""
    },
    {
      "text": "Griffin, D.W. &amp; Lim, J.S. \"Signal estimation from modified short-time fourier transform.\" IEEE Transactions on Acoustics, Speech, and Signal Processing, ASSP-32 (2): 236-243, 1984.",
      "doi": ""
    },
    {
      "text": "Harrigan, K. \"The SPECIAL System: Self-Paced Education with Compressed Interactive Audio Learning,\" Journal of Research on Computing in Education, 27, 3, Spring 1995.",
      "doi": ""
    },
    {
      "text": "Harrigan, K.A. \"Just Noticeable Difference and Effects of Searching of User-Controlled Time-Compressed Digital-Video. Ph.D. Thesis, University of Toronto, 1996.",
      "doi": ""
    },
    {
      "text": "Heiman, G.W., Leo, R.J., Leighbody, G., &amp; Bowler, K. \"Word Intelligibility Decrements and the Comprehension of Time- Compressed Speech.\" Perception and Psychophysics 40, 6 (1986): 407-411.",
      "doi": ""
    },
    {
      "text": "Hejna Jr, D.J. \"Real-Time Time-Scale Modification of Speech via the Synchronized Overlap-Add Algorithm.\" MS thesis, MIT, 1990. Electrical Engineering and Computer Science.",
      "doi": ""
    },
    {
      "text": "Maxemchuk, N. \"An Experimental Speech Storage and Editing Facility.\" Bell System Technical Journal 59, 8 (1980): 1383- 1395.",
      "doi": ""
    },
    {
      "text": "Miller, G.A. &amp; Licklider, J.C.R. '`The intelligibility of interrupted speech.\" Journal of the Acoustic Society of America, 22(2): 167-173, 1950.",
      "doi": ""
    },
    {
      "text": "Neuburg, E.P. \"Simple Pitch-Dependent Algorithm for High Quality Speech Rate Changing.\" Journal of the Acoustic Society of America 63, 2 (1978): 624-625.",
      "doi": ""
    },
    {
      "text": "Orr, D.B. \"A perspective on the perception of time compressed speech.\" In P. M. Kjeldergaard, D. L. Horton, &amp; J. J. Jenkins, (Eds.) Perception of Language, 108-119. Merrill, 1971.",
      "doi": ""
    },
    {
      "text": "Orr, D. B. Friedman, H.L., &amp; Williams, J.C. \"Trainability of listening comprehension of speeded discourse.\" Journal of Educational Psychology, 56: 148-156, 1965.",
      "doi": ""
    },
    {
      "text": "Portnoff, M.R. ''Time-scale modification of speech based on short-time fourier analysis.\" IEEE Transactions on Acoustics, Speech, and Signal Processing, ASSP-29 (3): 374-390, 1981.",
      "doi": ""
    },
    {
      "text": "Quereshi, S.U.H. \"Speech compression by computer.\" In S. Duker (Ed.), Time-Compressed Speech, 618-623. Scarecrow, 1974.",
      "doi": ""
    },
    {
      "text": "Resnick, P. &amp; Virzi, R.A. \"Skip and Scan: Cleaning Up Telephone Interfaces.\" Proc. CHI'92 (May 1992), ACM.  ",
      "doi": "10.1145/142750.142881"
    },
    {
      "text": "Schmandt, C. &amp; Arons, B. \"A Conversational Telephone Messaging System.\" IEEE Transactions on Consumer Electronics CE-30, 3 (1984): xxi-xxiv.",
      "doi": ""
    },
    {
      "text": "Scott, R.J. \"Time Adjustment in Speech Synthesis.\" Journal of the Acoustic Society of America 41, 1 (1967): 60-65.",
      "doi": ""
    },
    {
      "text": "Stanford Online: Masters in Electrical Engineering, 1998. http://scpd.stanford.edu/cee/telecom/onlinedegree.html",
      "doi": ""
    },
    {
      "text": "Stifelman, L. \"The Audio Notebook: Paper and Pen Interaction with Structured Speech\" Ph.D. dissertation, MIT Media Laboratory, 1997. ",
      "doi": "10.5555/926446"
    },
    {
      "text": "Stifelman, L.j., Arons, B., Schmandt, C. &amp; Hulteen, E.A. \"VoiceNotes: A Speech Interface for a Hand-Held Voice Notetaker.\" Proc. INTERCHI'93 (Amsterdam, 1993), ACM.  ",
      "doi": "10.1145/169059.169150"
    },
    {
      "text": "Tarquin, A., Craver, L., &amp; Schroder, D. \"Time-Compression Effects of Video-tapes on Students,\" Journal of Professional Issues in Engineering, Vol. 110, No. 1, January 1984.",
      "doi": ""
    },
    {
      "text": "Voor, J.B. &amp; Miller, J.M. \"The effect of practice upon the comprehension of time-compressed speech.\" Speech Monographs, 32: 452-455, 1965.",
      "doi": ""
    }
  ]
}