{
  "doi": "10.1145/302979.303067",
  "title": "Video helps remote work: speakers who need to negotiate common ground benefit from seeing each other",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "302-309",
  "year": 1999,
  "badges": [],
  "abstract": "More and more organizations are forming teams that are not\nco-located. These teams communicate via email, fax, telephone and\naudio conferences, and sometimes video. The question often arises\nwhether the cost of video is worth it. Previous research has shown\nthat video makes people more satisfied with the work, but it doesnt\nhelp the quality of the work itself. There is one exception;\nnegotiation tasks are measurably better with video. In this study,\nwe show that the same effect holds for a more subtle form of\nnegotiation, when people have to negotiate meaning in a\nconversation. We compared the performance and communication of\npeople explaining a map route to each other. Half the pairs have\nvideo and audio connections, half only audio. Half of the pairs\nwere native speakers of English; the other half were non-native\nspeakers, those presumably who have to negotiate meaning more. The\nresults showed that non-native speaker pairs did benefit from the\nvideo; native speakers did not. Detailed analysis of the\nconversational strategies showed that with video, the non-native\nspeaker pairs spent proportionately more effort negotiating common\nground.",
  "authors": [
    {
      "name": "Elizabeth S. Veinott",
      "institution": "The Collaboratory for Research on Electronic work (CREW), University of Michigan, Ann Arbor, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81310499626",
      "orcid": "missing"
    },
    {
      "name": "Judith Olson",
      "institution": "The Collaboratory for Research on Electronic work (CREW), University of Michigan, Ann Arbor, MI",
      "img": "/do/10.1145/contrib-81350567367/rel-imgonly/81350567367.jpg",
      "acmid": "81350567367",
      "orcid": "missing"
    },
    {
      "name": "Gary M. Olson",
      "institution": "The Collaboratory for Research on Electronic work (CREW), University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81100178543/rel-imgonly/81100178543.jpg",
      "acmid": "81100178543",
      "orcid": "missing"
    },
    {
      "name": "Xiaolan Fu",
      "institution": "Institute of Psychology, Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338488628",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, A. H., Bader, M., Bard, E., Boyle, E., Doherty, G., Garrod, S., Issard, S., Kwotko, J., McAllister, J., Miller, J., Sotillo, C., &amp; Thompson, H. (1991). The HCRC MAP Task corpus. La~guage and Speech, 34, 351-360.",
      "doi": ""
    },
    {
      "text": "Bekker, M. M., Olson, J., &amp; Olson, G. M. (1995). Analysis of gestures in face-to-face design team provides guidance for how to use groupware in design. Proceedings of the Symposium on Designing Interactive Systems, DIS'95, 157-166.  ",
      "doi": "10.1145/225434.225452"
    },
    {
      "text": "Boyle, E., Anderson, A. &amp; Newlands, A. (1994). The effects of visibility on dialogue perforraance in a cooperative problem solving task, Language and Speech, 37,1, 1-20.",
      "doi": ""
    },
    {
      "text": "Brown, G., Anderson, A. H., Yule, G., &amp; Shilcock, R. (1984). Teaching talk. Cambridge, England: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Chapanis, A. (1975). Interactive, human communication. Scientific American, 232, 36-42.",
      "doi": ""
    },
    {
      "text": "Chapanis, A. Ochsman, R.B., Parrish, R. N.&amp; Weeks, G. D. (1972). Studies in interactive communication: The effects of four communication mocles on the behavior of teams during a co-operative problem solving. Human Factors, 14, 487-509.",
      "doi": ""
    },
    {
      "text": "Clark, H. H. (1996). Using language. (pp. 92-125) Cambridge England: Cambridge Universi12t Press.",
      "doi": ""
    },
    {
      "text": "Clark, H. H. &amp; Wilks-Gibbs, D. (1986) Referring as a collaborative process. Cognition, 22, 1-39.",
      "doi": "10.1016/0010-0277%2886%29"
    },
    {
      "text": "Doherty-Sneedon, G., Anderson, A., O'Malley, C., Langton, S., Garrod, S., &amp; Bruce, V. (1997). Face-to- Face and video mediated communication: A comparison of dialogue structure and task performance, Journal of Experimental Psychology: Applied, 3, 2, 105-123.",
      "doi": ""
    },
    {
      "text": "Edigo, C. (1990). Teleconferencing as a technology to support co-operative work: Its possibilities and limitations. In J. Gallegher, R. E. Kraut, &amp; C. Edigo (Eds.) Intellectual teamwork: Social and technological foundations of cooperative work (pp. 351-371). Hillsdale, N.J.: L. Erlbaum Associates. ",
      "doi": ""
    },
    {
      "text": "Farmer, S. M. &amp; Hyatt, C. W. (1994). Effects of task language demand and task complexity on computermediated work groups, Small Group Research, 25, 3, 331-336.",
      "doi": ""
    },
    {
      "text": "Finn, K., Sellen, A., &amp; Wilbur, S. (1997). Videomediated communication. Hillsdale NJ: Lawrence Erlbaum Associates. ",
      "doi": "10.5555/548502"
    },
    {
      "text": "Green &amp; Williges, R. C. (1975). Evaluation of alternative media used with a groupware editor in a simulated telecommunication environment. Human Factors, 37(3), 283-289.",
      "doi": ""
    },
    {
      "text": "O'Connaill, B., Whittker, S. &amp; Wilbur, S. (1993). Conversations over video conferences\" An evaluation of video mediated interaction. Human-Computer Interaction, 8, 389-428.",
      "doi": "10.1207/s15327051hci0804_4"
    },
    {
      "text": "Olson, G. M. &amp; Olson, J. S. (199 i). User Centered design of collaboration technology. Journal of Organizational Computing, 1( 1 ), 61-84.",
      "doi": ""
    },
    {
      "text": "Olson, G. M., Olson, J.S., Carter, M. &amp; Storrosten, M. (1992). Small group design meetings: An analysis of collaboration. Human Computer Interaction, 7, 347- 374.",
      "doi": "10.1207/s15327051hci0704_1"
    },
    {
      "text": "Olson, J., Olson, G. &amp; Meader, D. (1995). What mix of video and audio is useful for remote real-time work. In Proceedings of Computer and Human Interaction'95, (Denver, CO, May 1995), ACM Press, 362-368.  ",
      "doi": "10.1145/223904.223951"
    },
    {
      "text": "Reisberg, D., McLean, J. &amp; Goldfield, A. (1987). Easy to hear but hard to understand: A lip-reading advantage with intact auditory stimuli. In R. Campbell &amp; B. Dodd (Eds.) Hearing by Eye: The psychology of lip-reading. Hillsdale, N. J.: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Short, j., Williams, E., &amp; Christie, B. (1976) The social psychology of telecommunications. London: Wiley.",
      "doi": ""
    },
    {
      "text": "Varonis, E. M. and S. M. Gass (I 985) \"Nonnative/Non-native Conversations: A Model for Negotiation of Meaning\", Applied Linguistics 6(1): 71-90.",
      "doi": ""
    },
    {
      "text": "Veinott, E. S., Olson, J. S., Olson, G. M. &amp; Fu, X. (1997). Video Matters! When communication is stressed video helps. In Extended Abstracts of Computer and Human Interaction '97, (Atlanta, GA, April 1997), ACM Press, 315-316.  ",
      "doi": "10.1145/1120212.1120411"
    }
  ]
}