{
  "doi": "10.1145/302979.303098",
  "title": "Designing multimedia for learning: narrative guidance and narrative construction",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "310-317",
  "year": 1999,
  "badges": [],
  "abstract": "Narrative is fundamental to the ways we make sense of texts of\nall kinds because it provides structure and coherence, but it is\ndifficult to see how this works in the context of multimedia\ninteractive learning environments (MILES). We tested our hypotheses\nabout the form and function of narrative in MILES by developing\nthree versions of material on CD-ROM which had different narrative\nstructures and analysed the impact of the different versions on\nlearner behaviour. We present a theoretical framework in which we\nexplain the concepts of narrative guidance and narrative\nconstruction and their application to the design of MILES.",
  "authors": [
    {
      "name": "Lydia Plowman",
      "institution": "Scottish Council for Research in Education, 15 St. John Street, Edinburgh EH8 8JR UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100564207",
      "orcid": "missing"
    },
    {
      "name": "Rosemary Luckin",
      "institution": "School of Cognitive & Computing Sciences, University of Sussex, Brighton BN1 9PH UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452612610",
      "orcid": "missing"
    },
    {
      "name": "Diana Laurillard",
      "institution": "Open University, Milton Keynes, MK7 6AA, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100499850",
      "orcid": "missing"
    },
    {
      "name": "Matthew Stratfold",
      "institution": "Open University, Milton Keynes, MK7 6AA, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100088848",
      "orcid": "missing"
    },
    {
      "name": "Josie Taylor",
      "institution": "Open University, Milton Keynes, MK7 6AA, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100520548",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bolter, J.D. (1991). Writing Space: the Computer, Hypertext and the History of Writing. LEA, Hillsdale, NJ. ",
      "doi": "10.5555/129912"
    },
    {
      "text": "Bower, G. H., &amp; Morrow, D. G. (1990). Mental models in narrative comprehension. Science, 247(4938), 44-48.",
      "doi": ""
    },
    {
      "text": "Bruner, J. (1996). The Culture of Education. Harvard University Press, Cambridge/vIA.",
      "doi": ""
    },
    {
      "text": "Chafe, WL (ed.) (1990). The Pear Stories: Cognitive, Cultural and Linguistic Aspects of Narrative Production. Ablex, Norwood NJ.",
      "doi": ""
    },
    {
      "text": "Clanton, C., F. iannella &amp; E. Young (1992). Film craft in user interface design. Tutorial Notes, CHI'92, Monterey, Ca. May 3-7, 1992.",
      "doi": ""
    },
    {
      "text": "Engel, S. (1995). The Stories Children Tell: Making Sense of the Narratives of Childhood. New York: WH Freeman.",
      "doi": ""
    },
    {
      "text": "Heath, S. (1983). Ways with Words: Language, Life and Work in Communities and Classrooms. CUP, Cambridge.",
      "doi": ""
    },
    {
      "text": "Iser, Wolfgang (1989). Prospecting. From Reader Response to Literary Anthropology. John Hopkins University Press, Baltimore.",
      "doi": ""
    },
    {
      "text": "Landow, G. (1992). Hypertext: the Convergence of Contemporary Critical Theory and Technology. Johns Hopkins University Press, Baltimore. ",
      "doi": "10.5555/129913"
    },
    {
      "text": "Laurel, B. (1993). Computers as Theatre. Addison- Wesley, Reading, Mass. ",
      "doi": "10.5555/103681"
    },
    {
      "text": "Laurillard, D. (1998). Multimedia and the learner's experience of narrative. Computers &amp; Education 31 pp.229-242.*  ",
      "doi": "10.1016/S0360-1315%2898%2900041-4"
    },
    {
      "text": "Laurillard, D., L. Baric, P. Chambers, G. Easting, A. Kirkwood, L. Plowman, P. Russell &amp; J. Taylor (1994). Teaching and Learning with Interactive Media. National Council for Educational Technology: Coventry. ISBN 1 85379 302 7.*",
      "doi": ""
    },
    {
      "text": "Luckin, R:, L. Plowman, L. Gjedde, D. Laurillard, M. Stratfold &amp; J. Taylor (1998). An evaluator's toolkit for tracking interactivity and learning. In M. Oliver, ed. Innovation in the Evaluation of Learning Technologies, pp.42-64. University of North London, London.*",
      "doi": ""
    },
    {
      "text": "Luckin, R., L. Plowman, D. Laurillard, M. Stratfold, J. Taylor (1998). Scaffolding learners' constructions of narrative. In A. Bruckrnan et al. (eds.) Proceedings of Third International Conference on the Learning Sciences (ICLS-98), pp. 181-187. Georgia Tech, Atlanta, GA.*",
      "doi": ""
    },
    {
      "text": "McKendree, Jean &amp; John Mateer (1991). Film techniques applied to the design and use of interfaces. In Proceedings of the IEEE Twenty-Fourth Annual Hawaii International Conference on System Sciences, (pp.32-41). IEEE, NY.",
      "doi": ""
    },
    {
      "text": "Mercer, N. (1995). The Guided Construction of Knowledge. Multilingual Matters, Clevedon.",
      "doi": ""
    },
    {
      "text": "McNeil, L. (1996). Homo inventans: the evolution of narrativity. Language and Communication, 16(4), pp.331-360.",
      "doi": ""
    },
    {
      "text": "Millard, E. (1997). Differently Literate: Boys, Girls and the Schooling of Literacy. Falmer Press, London.",
      "doi": ""
    },
    {
      "text": "Murray, J. (1997). Hamlet on the Holodeck. The Future of Narrative in Cyberspace. Free Press, NY. ",
      "doi": "10.5555/572887"
    },
    {
      "text": "Nelson, K. (1996). Emergence of the storied mind. In Language in Cognitive Development, ed. K. Nelson. CUP, Cambridge.",
      "doi": ""
    },
    {
      "text": "O'Donnell, J. (1998). Avatars of the Word.\" From Papyrus to Cyberspace. Harvard University Press, Cambridge, MA. ",
      "doi": "10.5555/522756"
    },
    {
      "text": "Olson, DR (1990). Thinking about narrative. In Narrative Thought and Narrative Language, eds. Bruce Britton &amp; Anthony Pellegrini, LEA, Hillsdale, Nj.",
      "doi": ""
    },
    {
      "text": "Plowman, L. (1996). What's the story? Narrative and the comprehension of educational interactive media. Proceedings of the 8th European Conference on Cognitive Ergonomics (ECCE8), Granada, Spain, eds. T. Green, J. Cafias, C. Warren, pp. 167-172.*",
      "doi": ""
    },
    {
      "text": "Plowman, L. (1996). Narrative, linearity and interactivity: making sense of interactive multimedia. British Journal of Educational Technology, 27(2) pp.92-105.*",
      "doi": ""
    },
    {
      "text": "Plowman, L. (1994). The 'Primitive Mode of Representation' and the evolution of interactive multimedia: some design issues for group use. Journal of Educational Multimedia and Hypermedia 3 (3/4) pp.275-293.* ",
      "doi": "10.5555/225982.225988"
    },
    {
      "text": "Plowman, L. (1992). An ethnographic approach to analysing navigation and task structure in interactive multimedia. In People and Computers VII, eds. A. Monk et al,, pp. 271-287. CUP, Cambridge.* ",
      "doi": "10.5555/164592.164635"
    },
    {
      "text": "Steiner, G. (1996). 'The Uncommon Reader'. In No Passion Spent, Essays 1978-1996. Faber &amp; Faber, London.",
      "doi": ""
    },
    {
      "text": "Thomdyke, P. (1977). Cognitive structures in comprehension and memory of narrative discourse. Cognitive Psychology, 9, pp.77-110.",
      "doi": ""
    }
  ]
}