{
  "doi": "10.1145/302979.302981",
  "title": "Chat circles",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "9-16",
  "year": 1999,
  "badges": [],
  "abstract": "Although current online chat environments provide new\nopportunities for communication, they are quite constrained in\ntheir ability to convey many important pieces of social\ninformation, ranging from the number of participants in a\nconversation to the subtle nuances of expression that enrich face\nto face speech. In this paper we present Chat Circles, an abstract\ngraphical interface for synchronous conversa-tion. Here, presence\nand activity are made manifest by changes in color and form,\nproximity-based filtering intuitively breaks large groups into\nconversational clusters, and the archives of a conversation are\nmade visible through an integrated history interface. Our goal in\nthis work is to create a richer environment for online\ndiscussions.",
  "authors": [
    {
      "name": "Fernanda B. Viégas",
      "institution": "MIT Media Lab, 20 Ames Street, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100539968",
      "orcid": "0000-0002-4951-4008"
    },
    {
      "name": "Judith S. Donath",
      "institution": "MIT Media Lab, 20 Ames Street, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100223099",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arnheim, Rudolf. Visual Thinking. CA: University of California Press, 1969.",
      "doi": ""
    },
    {
      "text": "Arons, Barry. A Review of The Cocktail Party Effect. Journal of the American Voice I/0 Society, Vol. 12, July 1992.",
      "doi": ""
    },
    {
      "text": "Donath, Judith; Karahalios, Karfie; and Viegas, Fernanda. Visualizing Conversations. In Proceedings of the 32nd Hawaii International Conference on Systems, 1998. ",
      "doi": "10.5555/874069.875994"
    },
    {
      "text": "David Kudander, Tim Skelly and David Salesin. Comic Chat. In Proceedings of the SIGGRAPH. 1996.  ",
      "doi": "10.1145/237170.237260"
    },
    {
      "text": "Reid, Elizabeth. Electropolis: Communication and Community on Intemet Relay Chat. Thesis, Dept. of History, University of Melbourne, 1991.",
      "doi": ""
    },
    {
      "text": "Rosenberger, Tara M., and Smith, Brian K. Fugue: A Conversational Interface that Supports Turn-Taking Coordination. In Proceedings of the 32nd Hawaii International Conference on Systems, 1998.",
      "doi": ""
    },
    {
      "text": "Saville-Troike, Muriel. The Ethnography of Communication. 2nd Edition. New York, NY:Basil Blackwell, 1982.",
      "doi": ""
    },
    {
      "text": "Suler, John. The Psychology of Avatars and Graphical Space in Multimedia Chat Communities. 1996. http:// www l.rider.edu/--Suler/psycyber/psyav.html",
      "doi": ""
    },
    {
      "text": "Turkle, Sherry. Life on the Screen: Identity in the Age of the Internet. New York, NY: Simon &amp; Schuster, 1995. ",
      "doi": "10.5555/526517"
    },
    {
      "text": "Whyte, William H. City: Rediscovering the Center. NY: Doubleday, 1988.",
      "doi": ""
    },
    {
      "text": "Zebrowitz, Leslie A. Reading Faces\" Windows to the Soul? Boulder, CO: Westview Press, 1997.",
      "doi": ""
    },
    {
      "text": "http://www.thepalace.com/",
      "doi": ""
    },
    {
      "text": "Zakon, Robert H'obbes. Hobbes' lnternet Timeline v3.3. http://info.isoc.org/guest/zakon/Intemelt/History/ HIT.html",
      "doi": ""
    }
  ]
}