{
  "doi": "10.1145/302979.303060",
  "title": "Footprints: history-rich tools for information foraging",
  "published": "1999-05-01",
  "proctitle": "CHI '99: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "270-277",
  "year": 1999,
  "badges": [],
  "abstract": "Inspired by Hill and Hollans original work [7], we have been\ndeveloping a theory of interaction history and building tools to\napply this theory to navigation in a complex information space. We\nhave built a series of tools - map, paths, annota- tions and\nsignposts - based on a physical-world navigation metaphor. These\ntools have been in use for over a year. Our user study involved a\ncontrolled browse task and showed that users were able to get the\nsame amount of work done with significantly less effort.",
  "tags": [
    "interaction history",
    "information foraging",
    "Web browsing",
    "information navigation"
  ],
  "authors": [
    {
      "name": "Alan Wexelblat",
      "institution": "MIT Media Lab, 20 Ames St., Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100474095",
      "orcid": "missing"
    },
    {
      "name": "Pattie Maes",
      "institution": "MIT Media Lab, 20 Ames St., Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100086306",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brand, Stuart. How Buildings Learn: What happens after they're built, Penguin Books, 1994.]]",
      "doi": ""
    },
    {
      "text": "Bush, Vannevar. \"As We May Think,\" Atlantic Monthly, July 1945.]]",
      "doi": ""
    },
    {
      "text": "Chalmers, Matthew, K. Rodden &amp; D. Brodbeck. \"The Order of Things: Activity-Centred information Access\" Proceedings of the 7th International World Wide Web Conference (WWW7), 1998.]] ",
      "doi": "10.5555/297805.297861"
    },
    {
      "text": "Dahlback, Nils (ed.) Exploring Navigation: Towards a Framework for Design and Evaluation of Navigation in Electronic Spaces, Swedish Institute of Computer Science TR98:01, 1998.]]",
      "doi": ""
    },
    {
      "text": "Dieberger, Andreas. \"Supporting Social Navigation on the World-Wide Web,\" International Journal of Human- Computer Studies, Vol. 46, 1997.]]  ",
      "doi": "10.1006/ijhc.1996.0111"
    },
    {
      "text": "Furuta et al. Hypertext Paths and the World-Wide Web: Experiences with Walden's Paths, Hypertext'97 Proceedings, ACM Press, 1997.]]  ",
      "doi": "10.1145/267437.267455"
    },
    {
      "text": "Hill, Hollan, Wroblewski &amp; McCandles. \"Edit Wear and Read Wear,\" Proceedings of CH1'92 Conference on Human Factors in Computing Systems, ACM Press, 1992.]]  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Hill, Will &amp; Jim Hollan. \"History-Enriched Digital Objects,\" Proceedings of Computers, Freedom,~ and Privacy (CFP'93), available from http://www.cpsr.org/dox/ conferences/cfp93/hill-hollan.html]]",
      "doi": ""
    },
    {
      "text": "Hill, Stead, Rosenstein &amp; Furnas. \"Recommending and Evaluating Choices in a Virtual Community of Use,\" Proceedings of CHI'95 Conference on Human Factors in Computing Systems, ACM Press, 1995.]]  ",
      "doi": "10.1145/223904.223929"
    },
    {
      "text": "Hill, Will &amp; Loren Terveen. \"Using Frequency-of-Mention in Public Conversations for Social Filtering,\" Proceedings of CSCW'96 Conference on Computer- Supported Cooperative Work, ACM Press, 1996.]]  ",
      "doi": "10.1145/240080.240229"
    },
    {
      "text": "Hutchins, Edwin. Cognition in the Wild, MIT Press, 1995.]]",
      "doi": ""
    },
    {
      "text": "Joachims, Freitag &amp; Mitchell. \"WebWatcher: A Tour Guide for the World Wide Web,\" Proceedings of IJCAI97, 1997.]]",
      "doi": ""
    },
    {
      "text": "Lamping, Rao &amp; Pirolli. \"A Focus+Context Technique Based on Hyperbolic Geometry for Visualizing Large Hierarchies,\" Proceedings of CHI'95 Conference on Human Factors in Computing Systems, ACM Press, 1995]]  ",
      "doi": "10.1145/223904.223956"
    },
    {
      "text": "Lynch, Kevin. What Time is this Place? MIT Press, 1972.]]",
      "doi": ""
    },
    {
      "text": "Norman, Don. The Psychology of Everyday Things, Basic Books, 1988.]]",
      "doi": ""
    },
    {
      "text": "Orr, Julian. Talking About Machines: An Ethnography of a Modern Job, Cornell University Press, 1996.]]",
      "doi": ""
    },
    {
      "text": "Pirolli, Peter &amp; Stuart Card. \"Information Foraging in Information Access Environments,\" Proceedings of ACM CHI'95 Conference on Human Factors in Computing Systems, ACM Press, 1995.]]  ",
      "doi": "10.1145/223904.223911"
    },
    {
      "text": "Pirolli, Peter. \"Computational Models of Information Scent-Following in a Very Large Browsable Text Collection,\" Proceedings of ACM CHI 97 Conference on Human Factors in Computing Systems, ACM Press, 1997.]]  ",
      "doi": "10.1145/258549.258558"
    },
    {
      "text": "Suchman, Lucy A. Plans and Situated Actions, Cambridge University Press, 1987.]]",
      "doi": "10.5555/38407"
    },
    {
      "text": "Wexelblat, Alan. \"Communities through Time: Using History for Social Navigation,\" in Community Computing and Support Systems, Toru Ishida (ed.), Lecture Notes in Computer Science, Volume 1519, Springer Verlag, 1998.]] ",
      "doi": "10.5555/646698.701386"
    },
    {
      "text": "Wexelblat, Alan. Footprints: Interaction History for Digital Objects, Ph.D. Thesis, MIT Program in Media Arts &amp; Sciences, 1999.]] ",
      "doi": "10.5555/930312"
    },
    {
      "text": "Wexelblat, Alan. \"History-Based Tools for Navigation,\" Proceedings of the 32nd Hawaii International Conference on Systems Sciences (HICSS-32), IEEE Computer Society Press, 1999.]] ",
      "doi": "10.5555/874069.876013"
    },
    {
      "text": "Wexelblat, Alan &amp; Pattie Maes. \"Visualizing Histories for Web Browsing,\" RIAO'97: Computer-Assisted Information Retrieval on the lnternet, Montreal, 1997.]]",
      "doi": ""
    },
    {
      "text": "Zellweger, Polle. \"Scripted Documents: A Hypermedia Path Mechanism,\" Hypertext'89 Proceedings, ACM Press, 1989.]]  ",
      "doi": "10.1145/74224.74225"
    }
  ]
}